[
    {
        "content": "<p>One specific item we would like to discuss are libraries:<br>\nit is clear that Isabelle/HOL has an extensive standard library, while Coq's is small, and Lean is somewhat in between.<br>\nFor this reason, we opted for allowing people to pull in other libraries with the rationale that a) things can always be copied in anyway and b) that knowing your libraries is part of the game.<br>\nHowever, this is also tricky because it is not really possible 'to just pull in' any library in Coq afaik.</p>",
        "id": 202539686,
        "sender_full_name": "Simon Wimmer",
        "timestamp": 1593589483
    },
    {
        "content": "<p>Yeah, libraries are a tough problem. I don't think there's a good solution there. It's always a gamble.</p>\n<p>I would however say that a) is only half true because copying in stuff is not so easy: You can only submit one thy file, so you have to copy everything  and its dependencies into your theory file and deal with whatever fallout that causes <em>and</em> stay below the time limit. Plus, you might have to write glue code between the definitions from the problem file and that library, so that in the end, it's easier to just do everything from scratch.</p>\n<p>b) on the other hand is a good argument, but it may lead to perceived unfairness because then some problems might become much easier in a system that has a library for the task than in another that does not. Of course, that is still the case even if you only allow the most basic standard library, but it becomes more of an issue the bigger the library is.</p>\n<p>Personally, I feel that everything in the Isabelle distribution should be okay to use, but the AFP probably shouldn't. But with e.g. HOL-Analysis, importing it would probably immediately break the time limit because it takes about 3 minutes to build even on a really beefy machine, so for problems for which that could be useful, you should ideally load that as an image in your checker. In any case, the theories in HOL-Library can be imported individually and would sometimes come in really useful.</p>\n<p>I don't know what exactly the situation is like in the Lean and Coq world, so I can't comment on that.</p>",
        "id": 202542739,
        "sender_full_name": "Manuel Eberl",
        "timestamp": 1593591993
    },
    {
        "content": "<p>For Isabelle we already prebuild sessions, although we do not make that transparent to the contestants.</p>",
        "id": 202542915,
        "sender_full_name": "maximilian p.l. haslbeck",
        "timestamp": 1593592139
    },
    {
        "content": "<p>By the way, it would be nice to have some more clear information about what you are allowed to include. I was under the impression that I can't include anything that isn't from the HOL session.</p>",
        "id": 202543018,
        "sender_full_name": "Manuel Eberl",
        "timestamp": 1593592211
    },
    {
        "content": "<p>Yeah I agree that it should also be stated more precisely. We simply forgot to mention it this time <span aria-label=\"grinning\" class=\"emoji emoji-1f600\" role=\"img\" title=\"grinning\">:grinning:</span><br>\nAthough, we should probably never provide a pre-built HOL-Analysis image.</p>",
        "id": 202543524,
        "sender_full_name": "Simon Wimmer",
        "timestamp": 1593592593
    },
    {
        "content": "<p>All of Lean and its external mathematical library are also pre-build.</p>",
        "id": 202543566,
        "sender_full_name": "Kevin Kappelmann",
        "timestamp": 1593592643
    }
]