[
    {
        "content": "<p>Hey! I became really interested in the question 'how weak can be your formal theory X, so that you can prove a theorem Y in it?'. As a part of it, I am examining very very weak arithmetics and now, I would like to formalize a few theorems in Robinson arithmetic - it only has axioms for addition, multiplication, &lt;= , =, 0, Successor(x) + classical first-order logic, but no induction schema at all. I am willing to implement in Isabelle/Pure something like Isabelle/Q or Isabelle/PA, so that when you write something in such an axiomatized theory, you will be sure that you didn't go outside of Q (or PA). I have just found a very cool recent work of Larry Paulson, system for FOL in Isabelle: <a href=\"https://isabelle.in.tum.de/dist/library/FOL/FOL/outline.pdf\">https://isabelle.in.tum.de/dist/library/FOL/FOL/outline.pdf</a> Are you aware of some existing systems for formal verification of proofs in weak arithmetics like Robinson or weaker? Or Peano (it's not so weak)?</p>",
        "id": 509483083,
        "sender_full_name": "Paweł Balawender",
        "timestamp": 1743521164
    },
    {
        "content": "<p>Hm, I found something cool, but I have to examine it more: <a href=\"https://www.isa-afp.org/entries/Robinson_Arithmetic.html\">https://www.isa-afp.org/entries/Robinson_Arithmetic.html</a> Let me know if you're aware of any more work on these arithmetics!</p>",
        "id": 509489360,
        "sender_full_name": "Paweł Balawender",
        "timestamp": 1743522678
    },
    {
        "content": "<p>In case it may be still of interest, as part of a project to formalize and metalogically analyze a logic we're calling grounded deduction and an associated system of \"grounded arithmetic\", we've also formalized most of Skolem's primitive recursive arithmetic (PRA) and significant parts of Peano arithmetic (PA) in a common formal language framework atop Isabelle/HOL.  It's not released yet, but we're considering making it available publicly sometime soon, and in the meantime are happy to share access privately if there's interest.</p>",
        "id": 532920722,
        "sender_full_name": "Bryan Ford",
        "timestamp": 1754401681
    }
]