[
    {
        "content": "<p>To Whom It May Concern,</p>\n<p>I am a mathematician and programmer, who moved to Germany several years ago.</p>\n<p>For many years i studied studied foundations of mathematics and proof assistants (HOL4, Coq, Isabelle, Metamath).<br>\nCurrently I am writing a book about foundations of mathematics. (~90pages now)</p>\n<p>My activities/achievements related to foundations of mathematics:<br>\n1) formulated super-small presentation of foundations of mathematics via Morse-Kelley class theory, for implementing in my proof assistant.<br>\n2) As a  hobby, I have implemented my LCF proof assistant with tactics, etc. (1st order logic, classtheory Morse-Kelley).<br>\nCurrently, playing Isabelle's metatheory, for formally proving soundness of higher-order statements of Isabelle, including those about the first order logic.<br>\n3) invented some really nice class-theoretic notions and proved theorems about them. (unpublished, but <strong>very reliable</strong>, some constructions and theorems are formally verified in The Coq Proof Assistant)<br>\n4) invented new semantics for certain extension of the 1st order logic, natural &amp; useful: it has nice properties for working with \"greek-letter-operators\", and nicely treats different flavors of choice. Proved all necessary lemmas and theorems for its soundness. (unpublished, but <strong>very reliable</strong>)<br>\n5) have an idea of a new \"natural\" semantics for a metatheory of Isabelle. (just experimenting: It seems to be a bit exotic, but ok.)</p>\n<p><strong>My goal is to work in TUM(or in other legal entity in Germany) on any project related to <em>Isabelle</em> or to foundations of mathematics and/or verification in general.</strong></p>\n<p>I'd like and I have ability either to participate in existing Isabelle's project, or to do solo projects, and I can propose severak directions of work.<br>\nI am very open to new ideas/advises. Let's talk about it! </p>\n<p>Kind regards,<br>\nGeorgy Dunaev.</p>",
        "id": 450255123,
        "sender_full_name": "Georgy Dunaev",
        "timestamp": 1720551142
    }
]