[
    {
        "content": "<p>Hi! I noticed that <code>Method.parse</code> returns a <code>Method.text</code> object rather than a <code>method</code> -- the latter is only obtained upon calling <code>evaluate: text -&gt; Proof.context -&gt; method</code>. What is the reason for this indirection?</p>",
        "id": 319997495,
        "sender_full_name": "Hanno Becker",
        "timestamp": 1673118544
    },
    {
        "content": "<p>Seems to me that <code>Method.text</code> is an AST and <code>Method.method</code> is the actual method. And getting from the AST to the method requires a context.</p>",
        "id": 319998956,
        "sender_full_name": "Manuel Eberl",
        "timestamp": 1673119547
    },
    {
        "content": "<p>Hi Manuel! It makes sense that going from the AST to the actual method is context dependent, but it doesn't explain the prominence of the AST-type <code>text</code> throughout the code base. Why not parse into a <code>method</code> directly (and ask for a <code>Proof.context</code> argument to do that)?</p>",
        "id": 328858036,
        "sender_full_name": "Hanno Becker",
        "timestamp": 1676838330
    },
    {
        "content": "<p>I cannot say for sure, but my guess would be that maybe the parsing might happen at a point when no context is available yet, e.g. because you want to be able to parse a theory even without having a context.</p>",
        "id": 329167582,
        "sender_full_name": "Manuel Eberl",
        "timestamp": 1676979650
    },
    {
        "content": "<p>The context will, after all, only be available after processing the entire theory and all its dependencies, which might take minutes or even hours. But I really don't know, I didn't look at it in detail and I never really did any programming in that area of the Isabelle code base.</p>",
        "id": 329167789,
        "sender_full_name": "Manuel Eberl",
        "timestamp": 1676979714
    },
    {
        "content": "<p>For a definite answer to those questions, it is best to ask on the mailing list. These things are typically decisions made by Makarius, and he refuses to use Zulip.</p>",
        "id": 329167877,
        "sender_full_name": "Manuel Eberl",
        "timestamp": 1676979736
    },
    {
        "content": "<p>Thank you <span class=\"user-mention\" data-user-id=\"232736\">@Manuel Eberl</span> !</p>",
        "id": 339275633,
        "sender_full_name": "Hanno Becker",
        "timestamp": 1677831050
    },
    {
        "content": "<p>Late note on this one: The lazy evaluation of method texts appears useful to allow updates to e.g. named theorem lists used in the method, after the definition of the method. If the method text was interpreted at definition time, it would be bound to the state of the named theorem list at that point, which is not what you want.</p>\n<p>On the flipside, it probably also means that if you reference another method in the definition which is then re-defined elsewhere, the meaning of your method text changes as well.</p>",
        "id": 341622159,
        "sender_full_name": "Hanno Becker",
        "timestamp": 1678770460
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"570503\">Hanno Becker</span> <a href=\"#narrow/stream/211483-Isabelle.2FML/topic/Method.2Etext.20vs.2E.20Method.2Emethod/near/341622159\">said</a>:</p>\n<blockquote>\n<p>On the flipside, it probably also means that if you reference another method in the definition which is then re-defined elsewhere, the meaning of your method text changes as well.</p>\n</blockquote>\n<p>That’s not necessarily the case with laziness. If some sort of closure is formed, then redefining internally used methods does not change the meaning of your calling method. That said, I don’t know whether Eisbach really forms closures; it might very well be that it doesn’t. However, is it really possible to redefine methods (as opposed to define methods of the same name in a different namespace)?</p>",
        "id": 341691805,
        "sender_full_name": "Wolfgang Jeltsch",
        "timestamp": 1678793762
    }
]