[
    {
        "content": "<p>Is there a way to state <code>continuous (at x within X) c</code> with the library <code>Abstract_topology</code>? I can't find any part of it that deals with filters</p>",
        "id": 244263025,
        "sender_full_name": "Nicolò Cavalleri",
        "timestamp": 1624964249
    },
    {
        "content": "<p>Similarly I can't find how you express the concept of second countable in this library. I was expecting to find it in the file <code>Lindelof_spaces</code> but apparently the theorem that says that a second countable space is Lindelof is not there! (Weird: I would say it is an important theorem in the theory of second countable spaces!)</p>",
        "id": 244468430,
        "sender_full_name": "Nicolò Cavalleri",
        "timestamp": 1625077854
    },
    {
        "content": "<p>In case someone here knows someone else who does not see this forum often but who could know the answer to these questions I would be extremely grateful if I could have their email, as I am kind of stuck until I find out these answers (writing topology API that is already in HOL is very time consuming and counter productive!)</p>",
        "id": 244468903,
        "sender_full_name": "Nicolò Cavalleri",
        "timestamp": 1625078051
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"370356\">@Nicolò Cavalleri</span> (at...within...) belongs to the type class world, where continuous is defined WRT a filter and a limit (see continuous_def). The Abstract_Topology predicate continuous_map is defined analogously to the theorem continuous_openin_preimage_eq, so in a less general form. One could presumably define filters in this theory</p>",
        "id": 244574005,
        "sender_full_name": "Lawrence Paulson",
        "timestamp": 1625149338
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"228790\">@Lawrence Paulson</span> thanks for the anser. I was indeed wondering if there was a definition and some related theory somewhere that is not in the files <code>Abstract_topology(_2)</code>(maybe in the Afp?) as I would need to work with it and it would take me a long time to write it from scratch! Are you sure there is no such theory anywhere? In case not do you know someone else who might know?</p>",
        "id": 244587681,
        "sender_full_name": "Nicolò Cavalleri",
        "timestamp": 1625154468
    }
]