[
    {
        "content": "<p>Hi,<br>\nI'm preparing a result for AFP submission which needs one lemma (with four other lemmas as dependencies) from another fairly hefty AFP session. Including the entire other session in ROOT significantly increases initial load time. Would it be acceptable to avoid that by copy-pasting the required lemmas (with acknowledgement, of course) into my session? More generally, does having an excessively heavy session build slow the AFP review process?</p>",
        "id": 466824446,
        "sender_full_name": "Eric Ren",
        "timestamp": 1725254418
    },
    {
        "content": "<p>if the lemma is not deeply into the \"hefty\" session, you may consider not putting it as ROOT and just loading the relevant theory as necessary</p>",
        "id": 466863821,
        "sender_full_name": "Yong Kiam",
        "timestamp": 1725263881
    },
    {
        "content": "<p>If it's a small lemma that you need to re-use in an otherwise unrelated session, chances are the lemma belongs somewhere else.</p>",
        "id": 466864739,
        "sender_full_name": "Fabian Huch",
        "timestamp": 1725264079
    },
    {
        "content": "<p>In that case I would copy the lemma, make note in the submission form saying that you'll move the lemmas afterwards (or request that being done should they go in the Isabelle distribution), and after your entry is accepted change things in  the devel verison.</p>",
        "id": 466865236,
        "sender_full_name": "Fabian Huch",
        "timestamp": 1725264170
    },
    {
        "content": "<p>I tried loading the theory by itself like Yong suggested, but that took over an hour. I also don't think the lemma quite fits anywhere else. Would it be especially bad practice to copy the lemma purely to reduce load time?</p>",
        "id": 468041316,
        "sender_full_name": "Eric Ren",
        "timestamp": 1725590968
    },
    {
        "content": "<p>maybe you can say which lemma this is...? if it is taking 1 hour to load, then perhaps it does make sense to have it as a dependency?</p>",
        "id": 468041804,
        "sender_full_name": "Yong Kiam",
        "timestamp": 1725591105
    },
    {
        "content": "<p>It's \"corollary lattice_of_as_mat_mult\" from Modular_arithmetic_and_HNF_algorithms.HNF_Mod_Det_Soundness</p>",
        "id": 468043802,
        "sender_full_name": "Eric Ren",
        "timestamp": 1725591772
    },
    {
        "content": "<p>oh yeah... those lemmas should be in <code>vec_module</code> --- in fact... I think I needed to do something similar for one of my recent entries</p>\n<p>I think going for <span class=\"user-mention\" data-user-id=\"348400\">@Fabian Huch</span> 's approach sounds fair enough to me</p>\n<p>edit: <a href=\"#narrow/stream/238552-Beginner-Questions/topic/Generalizing.20some.20lemmas.20about.20vector.20spaces.20to.20modules/near/399890532\">https://isabelle.zulipchat.com/#narrow/stream/238552-Beginner-Questions/topic/Generalizing.20some.20lemmas.20about.20vector.20spaces.20to.20modules/near/399890532</a> &lt;-- I didn't get an answer, so I ended up just copy-pasting two lemmas ...</p>",
        "id": 468044673,
        "sender_full_name": "Yong Kiam",
        "timestamp": 1725592064
    }
]