[
    {
        "content": "<p>I built HOL-Analysis with <code>isabelle build HOL-Analysis</code>, but after that, when I build my own session depending on HOL-Analysis, it builds HOL-Analysis again. Why?</p>\n<p>In the first place, why should we, end users, build these libraries?</p>",
        "id": 525091436,
        "sender_full_name": "chem snu",
        "timestamp": 1750446337
    },
    {
        "content": "<p>You can specify the base session in Isabelle (either through jEdit or with -l when starting it)</p>",
        "id": 525092952,
        "sender_full_name": "Mathias Fleury",
        "timestamp": 1750447175
    },
    {
        "content": "<p>in the theory panel, the dropbox</p>",
        "id": 525092971,
        "sender_full_name": "Mathias Fleury",
        "timestamp": 1750447188
    },
    {
        "content": "<p>When I started jedit with <code>-l \"HOL-Analysis\"</code> option, jedit started to build HOL-Analysis and it took about 15 minutes. If I close jedit and open it again with the same option, then it starts without rebuilding HOL-Analysis. Fine.</p>\n<p>After that, If I open jedit without <code>-l</code> option and set the base session to HOL-Analysis in the theory panel, it builds HOL-Analysis again...</p>\n<p>I don't know what is going on...</p>",
        "id": 525097862,
        "sender_full_name": "chem snu",
        "timestamp": 1750449931
    },
    {
        "content": "<p>It will do it only once</p>",
        "id": 525098128,
        "sender_full_name": "Mathias Fleury",
        "timestamp": 1750450131
    },
    {
        "content": "<p>Maybe I'm asking a stupid question, but what I want to understand is,</p>\n<p>Why sometimes isabelle doesn't reuse the heap which was obtained in previous build process?</p>\n<p>When I opened jedit with <code>-l \"HOL-Analysis\"</code> option, we already obtained the heap.<br>\nBut, as I already said, it rebuilds HOL-Analysis if I use theory panel to set the base session to HOL-Analysis. Why is this necessary?</p>\n<p>I'm sorry if this is dumb question.</p>",
        "id": 525099244,
        "sender_full_name": "chem snu",
        "timestamp": 1750450882
    },
    {
        "content": "<p>I am not sure. I actually use a different version: I create ROOT files and use <code>-R</code> to focus on the session. It is a bit more work (as you have to update the ROOT file when importing new sessions), but it is way nicer and you can start isabelle in any folder you want</p>",
        "id": 525099549,
        "sender_full_name": "Mathias Fleury",
        "timestamp": 1750451078
    }
]