[
    {
        "content": "<p>Paulson writes in Isabelle a Generic Theorem Prover that</p>\n<p>\"A term t can be certified under a signature to ensure that every type in t is declared in the signature and every constant in t is declared as a constant of the same type in the signature. ...\"</p>\n<p>Am I right to state that a certified term is like a closure in programming language theory, having all the free variables declared besides the term?</p>",
        "id": 207257397,
        "sender_full_name": "Gergely Buday",
        "timestamp": 1597756444
    },
    {
        "content": "<p>No I don't think free variables enter into it. You can make cterms with undeclared free variables. The important thing is that each cterm is well-typed with respect to a specific underlying theory</p>",
        "id": 207259907,
        "sender_full_name": "Manuel Eberl",
        "timestamp": 1597757877
    },
    {
        "content": "<p>and it \"knows\" which theory that is</p>",
        "id": 207259962,
        "sender_full_name": "Manuel Eberl",
        "timestamp": 1597757886
    },
    {
        "content": "<p>so all the constants that appear in the term are actual constants in the theory, and their types are consistent with the types with which they were declared</p>",
        "id": 207260021,
        "sender_full_name": "Manuel Eberl",
        "timestamp": 1597757925
    },
    {
        "content": "<p>You can do pretty crazy things with free variables; you can even make a term that has two occurrences of an undeclared free variable <code>x</code> in it, once with type <code>bool</code> and once with type <code>nat</code>. These are considered different variables by the kernel, if I recall correctly. But there is no inconsistency, and the higher up levels of Isabelle usually prevent you from doing such things in order to prevent confusion.</p>\n<div class=\"codehilite\"><pre><span></span><code><span class=\"kt\">ML_val</span> <span class=\"err\">‹</span>\n  <span class=\"n\">HOLogic.mk_prod</span> <span class=\"o\">(</span><span class=\"err\">@</span><span class=\"ow\">{</span><span class=\"kt\">term</span> <span class=\"s\">&quot;x :: nat&quot;</span><span class=\"ow\">}</span><span class=\"o\">,</span> <span class=\"err\">@</span><span class=\"ow\">{</span><span class=\"kt\">term</span> <span class=\"s\">&quot;x :: bool&quot;</span><span class=\"ow\">}</span><span class=\"o\">)</span>\n  <span class=\"o\">|</span><span class=\"err\">&gt;</span> <span class=\"n\">Thm.cterm_of</span> <span class=\"err\">@</span><span class=\"ow\">{</span><span class=\"k\">context</span><span class=\"ow\">}</span>\n<span class=\"err\">›</span>\n</code></pre></div>",
        "id": 207260332,
        "sender_full_name": "Manuel Eberl",
        "timestamp": 1597758070
    },
    {
        "content": "<p>On a practical level, I think of <code>term</code> as ‘pre-terms’. They are the thing that you usually manipulate in ML, but they might (in principle) be ‘broken’ (i.e. there might be type errors in them if you're not careful). When you want to actually make a theorem involving them, you have to turn them into a <code>cterm</code>. Conversely, when you get a <code>cterm</code> somewhere, the first step is usually to just turn it into a regular <code>term</code>. The only exception is when performance matters; then you will try to avoid having to recertify terms, because it's expensive.</p>",
        "id": 207260532,
        "sender_full_name": "Manuel Eberl",
        "timestamp": 1597758192
    },
    {
        "content": "<p>Then it is a type-checked term against a theory, I see, thanks.</p>",
        "id": 207267714,
        "sender_full_name": "Gergely Buday",
        "timestamp": 1597761721
    }
]