[
    {
        "content": "<p>I have an algebraic theory where Vampire proved a non-trivial equation by metis and a few lemmas.</p>\n<p>I would be interested in a calculational proof that bridges the gap but in spite of setting Sledgehammer to create an Isar proof, it says only <code>by metis</code>.</p>\n<p>Is there any tool or manual method that would help me finding a step-by-step proof of the theorem?</p>",
        "id": 385875553,
        "sender_full_name": "Gergely Buday",
        "timestamp": 1692353101
    },
    {
        "content": "<p>I would describe the isar proof search by sledgehammer as an experimental tool. It only succeeds in some cases. I think there is no automated way to convert a metis proof into a more human-readable one. I would suggest that you look at the theorems that metis uses and think about how they are used in your proof. Often enough, you can turn a proof by metis into a proof by auto by instantiating the theorems that metis uses in the appropiate way and passing the theorems as intro, elim, dest, simp parameters.</p>",
        "id": 385877245,
        "sender_full_name": "Lukas Stevens",
        "timestamp": 1692353658
    },
    {
        "content": "<p>Even if that does not finish the proof, the resulting proof state might give you an idea about the nature of the subgoals that you need to prove.</p>",
        "id": 385877437,
        "sender_full_name": "Lukas Stevens",
        "timestamp": 1692353705
    },
    {
        "content": "<blockquote>\n<p>Often enough, you can turn a proof by metis into a proof by auto by instantiating the theorems that metis uses in the appropiate way and passing the theorems as intro, elim, dest, simp parameters.</p>\n</blockquote>\n<p>And often you can even drop many or all of those rules, because many such rules have been already registered to be taken into account automatically, which basic provers like <code>auto</code> do, as opposed to <code>metis</code> and <code>smt</code>, which only seem to consider a fixed set of basic logical rules.</p>",
        "id": 385889588,
        "sender_full_name": "Wolfgang Jeltsch",
        "timestamp": 1692357378
    },
    {
        "content": "<p>You are not the first to ask for such a tool and it is somewhere in the sledgehammer todo list, but nothing has happened so far</p>",
        "id": 385969980,
        "sender_full_name": "Mathias Fleury",
        "timestamp": 1692384443
    }
]