[
    {
        "content": "<p>Two presumably stupid questions</p>\n<p>(1) I can't  figure out how to import HOL-Algebra in my own theory. </p>\n<p>(2) While trying to understand how quotients might be defined in structures like groups, so that one could prove the first isomorphism theorem, for instance (or do things with affine planes, as in my recent question), I thought I'd look at the HOL-Algebra theory itself. But on page 159 of <a href=\"https://www.cl.cam.ac.uk/research/hvg/Isabelle/dist/library/HOL/HOL-Algebra/document.pdf\">https://www.cl.cam.ac.uk/research/hvg/Isabelle/dist/library/HOL/HOL-Algebra/document.pdf</a><br>\nthe term <code>G mod H</code> appears for the first time, and I cannot figure out where it came from. Can anyone explain? </p>\n<p>(3) Is there a way that I could learn to answer question 2 myself? This chat is great, but it'd be even better if I could learn ways not to rely on it.</p>",
        "id": 498748736,
        "sender_full_name": "John  Hughes",
        "timestamp": 1739190732
    },
    {
        "content": "<p>(1) To import HOL-Algebra, import theory \"HOL-Algebra.Algebra\" at the top of your file. To load quickly, also load heap image HOL-Algebra when starting up Isabelle.<br>\n(2) To figure out where things come from, I load up Isabelle and control-click the term in question. In this particular case, Mod is defined in HOL/Algebra/Coset.thy</p>",
        "id": 498757523,
        "sender_full_name": "Christian Pardillo Laursen",
        "timestamp": 1739193157
    },
    {
        "content": "<p>Thanks. I suppose that if I could have loaded HOL-Algebra.Algebra, I could have clicked on the term -- I already knew how to do that. </p>\n<p>I <em>did</em> try to import <code>HOL-Algebra</code>, thinking that I was reading a document describing a theory of that name, but got <br>\n<a href=\"/user_uploads/14278/4CM-NjbCfFZ8cvbuUDrnRAM2/image.png\">image.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/14278/4CM-NjbCfFZ8cvbuUDrnRAM2/image.png\" title=\"image.png\"><img data-original-content-type=\"image/png\" data-original-dimensions=\"420x37\" src=\"/user_uploads/thumbnail/14278/4CM-NjbCfFZ8cvbuUDrnRAM2/image.png/840x560.webp\"></a></div><p>I'm not sure where the \"DRAFT\" came from, and I still don't know why importing that theory didn't work (although given how long HOL-Algebra.Algebra took to load, I can see that it might have taken a very long time!) I guess the lesson here is that I should have typed</p>\n<div class=\"codehilite\" data-code-language=\"Isabelle\"><pre><span></span><code><span class=\"n\">import</span><span class=\"w\"> </span><span class=\"n\">Alge</span>\n</code></pre></div>\n<p>and paused until options showed up, and then used \"tab\" to select one, which would have had the quotation marks (which I left out earlier when trying it for myself) automatically included. </p>\n<p>I'm including all this not as. a question, but so that some future person might find it helpful.</p>",
        "id": 498788541,
        "sender_full_name": "John  Hughes",
        "timestamp": 1739200655
    },
    {
        "content": "<p>So HOL-Algebra is the name of the session, but you can only import theories. The toplevel theory of HOL-Algebra is called Algebra - this is just standard naming practice for the standard libraries.</p>",
        "id": 498790252,
        "sender_full_name": "Christian Pardillo Laursen",
        "timestamp": 1739201030
    },
    {
        "content": "<p>The loading time is why i suggested the heap image - if you load it, by running isabelle jedit -l HOL-Algebra, you'll only have to build once and it'll load instantly after that</p>",
        "id": 498790564,
        "sender_full_name": "Christian Pardillo Laursen",
        "timestamp": 1739201096
    }
]