[
    {
        "content": "<p>I am a bit confused about the HOL standard library organization as for algebraic structures: why is there a file \"Groups.thy\" and a file \"Algebra.Group.thy\"? Which of the two is the official? Also, why in the file \"Groups.thy\" algebraic structures are defined both as locales and as classes? What is the relation between them and which of the two is usually used?</p>",
        "id": 239016346,
        "sender_full_name": "Nicolò Cavalleri",
        "timestamp": 1621209561
    },
    {
        "content": "<p><code>HOL-Algebra</code> (the stuff residing in the <code>Algebra</code> folder) is mostly intended for abstract algebra. It allows you to talk about things like subgroups. Also, it is historically older than locales and type classes (if I recall correctly) and its approach with operations records is a bit old-fashioned these days. People are still using it for abstract algebra formalisations occasionally, but people have been trying different approaches with some success lately (tagging <span class=\"user-mention\" data-user-id=\"228778\">@Anthony Bordg</span> ).</p>\n<p>The stuff from <code>HOL.Groups</code> has a more pragmatic flavour: it uses typeclasses to furnish types with a canonical group/ring/field/etc. structure, types such as <code>nat</code>, <code>int</code>, <code>real</code>, <code>complex</code>, <code>'a poly</code> where you look at the type and immediately have a canonical algebraic structure on the entire type in mind.</p>\n<p>Type classes are much nicer to use than the <code>HOL-Algebra</code> stuff, but they give you less flexibility. Once you say ‘<code>int</code> is a ring with these operations’, you can never change what the operations are ever again to look at a different ring structure on <code>int</code>, and you also can't look at a subset of <code>int</code> either. It has to be on the entire type universe. That also means that you cannot talk about e.g. subgroups or quotients (in most cases).</p>\n<p>The reason why a <code>group</code> locale also exists is probably mainly because there are type classes for <em>additive</em> groups and for <em>multiplicative</em> ones and you want to avoid having to prove all the basic properties twice. Converting a locale to a type class is easy, so it makes sense to do as much as you can in a locale context first and then convert it to a type class in the end. In fact, this approach is somewhat similar to what <span class=\"user-mention\" data-user-id=\"228778\">@Anthony Bordg</span> has been doing, except that I think his structures still have an explicit carrier set whereas the <code>group</code> locale does not. That makes things a lot easier, but again, you lose some flexibility (in particular subgroups).</p>",
        "id": 239049954,
        "sender_full_name": "Manuel Eberl",
        "timestamp": 1621239490
    },
    {
        "content": "<p>Thank you very much for such a complete answer</p>",
        "id": 239080180,
        "sender_full_name": "Nicolò Cavalleri",
        "timestamp": 1621254996
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"232736\">Manuel Eberl</span> <a href=\"#narrow/stream/238552-Beginner-Questions/topic/HOL.20library.20organization/near/239049954\">said</a>:</p>\n<blockquote>\n<p>Converting a locale to a type class is easy, so it makes sense to do as much as you can in a locale context first and then convert it to a type class in the end.</p>\n</blockquote>\n<p>This is not what has been done in the file Groups though, right? I mean it seems that there classes are built with a hierarchy from former classes and not on their corresponding locales</p>",
        "id": 239080787,
        "sender_full_name": "Nicolò Cavalleri",
        "timestamp": 1621255240
    },
    {
        "content": "<p>Moreover I can't really find a type class for multiplicative groups, although I can find the locale and the type class for additive groups... What is it called?</p>",
        "id": 239081011,
        "sender_full_name": "Nicolò Cavalleri",
        "timestamp": 1621255332
    },
    {
        "content": "<p>Can't one just develop a theory of subgroups for groups defined with type classes as other groups with a monomorphism into the given group?</p>",
        "id": 239081382,
        "sender_full_name": "Nicolò Cavalleri",
        "timestamp": 1621255479
    },
    {
        "content": "<p>Also why can't one just use carriers with type classes (with <code>fixes</code>) just as one does with locales?</p>",
        "id": 239081551,
        "sender_full_name": "Nicolò Cavalleri",
        "timestamp": 1621255551
    },
    {
        "content": "<p>And finally, if I understand correctly, the same approach was not used in the file Rings and in the file Fields, meaning that Rings and Fields have only been defined as type classes but not as locales. Why? My ultimate goal is to work with fields, and I am a bit lost as for what should I import</p>",
        "id": 239082801,
        "sender_full_name": "Nicolò Cavalleri",
        "timestamp": 1621256063
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"370356\">Nicolò Cavalleri</span> <a href=\"#narrow/stream/238552-Beginner-Questions/topic/HOL.20library.20organization/near/239081011\">said</a>:</p>\n<blockquote>\n<p>Moreover I can't really find a type class for multiplicative groups, although I can find the locale and the type class for additive groups... What is it called?</p>\n</blockquote>\n<p>Bad example; I meant multiplicative monoids. There are no multiplicative groups because you always have 0 in the type and you can't have a multiplicative group when there's a 0.</p>",
        "id": 239083008,
        "sender_full_name": "Manuel Eberl",
        "timestamp": 1621256152
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"370356\">Nicolò Cavalleri</span> <a href=\"#narrow/stream/238552-Beginner-Questions/topic/HOL.20library.20organization/near/239082801\">said</a>:</p>\n<blockquote>\n<p>And finally, if I understand correctly, the same approach was not used in the file Rings and in the file Fields, meaning that Rings and Fields have only been defined as type classes but not as locales. Why? My ultimate goal is to work with fields, and I am a bit lost as for what should I import</p>\n</blockquote>\n<p>Probably because it doesn't pay off for the purpose for the standard library. The definitions in the standard library are not so much to do reasoning about algebraic structures, but rather just to set things up in such a way that you can use specific simple algebraic structures (like the field of real numbers etc.)</p>\n<p>It depends on what you want to do with fields exactly. Anything fancy will probably require the kind of flexibility offered by <code>HOL-Algebra</code>. Although I must warn you that <code>HOL-Algebra</code> is very annoying to use. In my opinion, the basic algebra library is not in a great state in Isabelle at the moment. Maybe talk to <span class=\"user-mention\" data-user-id=\"228778\">@Anthony Bordg</span> and see what his opinion is on that.</p>",
        "id": 239083429,
        "sender_full_name": "Manuel Eberl",
        "timestamp": 1621256308
    }
]