[
    {
        "content": "<p>Kevin Kappelmann recently answered a question of mine and tossed in \"and I added proper intro and elim rules for your parallel definitions\". (He also seems to have added an \"iff\" rule without comment, and I have no idea what that is.) </p>\n<p>The form of that statement suggests to me that the cool kids know that they should add intro and elim rules in certain places in a proof document, but looking through P&amp;P, and the tutorial, and the cookbook, and several other places, I can't seem to find anything that says when you should do so, or what constitutes a good intro or elim rule (or an iff rule, for that matter). I suspect that those who are steeped in the culture \"just know\". As an outsider, I'm frustrated. </p>\n<p>So: is there a place I can read about suggested general rules for assembling a collection of lemmas/definitions/theorems, things like \"whenever you make a definition, you should immediately prove two theorems, one for intro and one for elim, like this...\" </p>\n<p>I'm similarly puzzled about where to include [simp], and a reference for that would be a big help, but I'll give an explicit example in a later question to avoid confounding issues. </p>\n<p>(Of course, as an alternative to a reference, I'd be happy if someone can give a quick explanation here, but I don't want to ask that anyone rewrite a textbook on my behalf.)</p>",
        "id": 436371864,
        "sender_full_name": "John  Hughes",
        "timestamp": 1714521095
    },
    {
        "content": "<p>[simp] is for the simplifier to pick up automatically (that is in the prog-prove)</p>",
        "id": 436453234,
        "sender_full_name": "Mathias Fleury",
        "timestamp": 1714541440
    },
    {
        "content": "<p>intro / dest: <a href=\"https://isabelle.in.tum.de/doc/tutorial.pdf\">https://isabelle.in.tum.de/doc/tutorial.pdf</a>, chapter 5 the rules of the game</p>",
        "id": 436453355,
        "sender_full_name": "Mathias Fleury",
        "timestamp": 1714541565
    },
    {
        "content": "<p>iff is a theorem that other tools can pick up (like blast). No assumptions and only useful if the tool can do something with the result</p>",
        "id": 436453456,
        "sender_full_name": "Mathias Fleury",
        "timestamp": 1714541658
    },
    {
        "content": "<p>Intro / dest rules are usually described for the inductive predicates where they are important for automation</p>",
        "id": 436453481,
        "sender_full_name": "Mathias Fleury",
        "timestamp": 1714541690
    },
    {
        "content": "<p>I found this: <a href=\"https://isabelle.systems/conventions/theorem_attributes.html\">https://isabelle.systems/conventions/theorem_attributes.html</a> (and that page seems useful in general)</p>",
        "id": 436453490,
        "sender_full_name": "Yong Kiam",
        "timestamp": 1714541701
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"233198\">Mathias Fleury</span> <a href=\"#narrow/stream/238552-Beginner-Questions/topic/Intro.20and.20elimination.20rules/near/436453355\">said</a>:</p>\n<blockquote>\n<p>intro / dest: <a href=\"https://isabelle.in.tum.de/doc/tutorial.pdf\">https://isabelle.in.tum.de/doc/tutorial.pdf</a>, chapter 5 the rules of the game</p>\n</blockquote>\n<p>(I suggest reading that chapter at some point of learning Isabelle)</p>",
        "id": 436453602,
        "sender_full_name": "Mathias Fleury",
        "timestamp": 1714541773
    }
]