[
    {
        "content": "<p>Hi,</p>\n<p>this is a beginners question regarding the Isabelle 2023 IDE.<br>\nIt's about operation only. I'm quite familiar with other provers.</p>\n<p>No matter which of the examples from the docs I copy to the<br>\neditor, I get nothing but nice coloration. Supposedly it should<br>\nrespond unasked. Whether the docs tell half the truth or the<br>\nexamples are mere snippets remains unclear.</p>\n<p>Since the IDE is not exactly self-explanatory, a simple step by<br>\nstep example would be much appreciated.</p>\n<p>Thanks for your help.</p>\n<p>Kind regards<br>\nMichael</p>",
        "id": 432991345,
        "sender_full_name": "Michael Moeller",
        "timestamp": 1712960991
    },
    {
        "content": "<p>You probably don't have proof state enabled in your output window. Therefore, you only see diagnostic messages in the output, which can be empty depending on the command. You can either check \"Proof State\" in the output panel or look at the dedicated proof state output panel on the right instead.</p>",
        "id": 432991767,
        "sender_full_name": "Lukas Stevens",
        "timestamp": 1712961264
    },
    {
        "content": "<p>At the least that's my guess because you said that syntax highlighting is working.</p>",
        "id": 432991835,
        "sender_full_name": "Lukas Stevens",
        "timestamp": 1712961315
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"233155\">@Lukas Stevens</span> <br>\nThanks. This works. In addition I just realized copy and paste from the docs may work<br>\nor not, depending on the PDF in question. If not, input must be edited manually.</p>\n<p>Things only work after restarting the IDE. Is this really mandatory or is there a button<br>\nwhich clears everything I've done so far?</p>",
        "id": 432998176,
        "sender_full_name": "Michael Moeller",
        "timestamp": 1712965931
    },
    {
        "content": "<p>I am not sure what you mean. If you copy code from somewhere else and want it probably set in UTF-8 you can save your file and then refresh (F5 should work). Other than that, deleting the text in the buffer is the same clearing.</p>",
        "id": 433147108,
        "sender_full_name": "Lukas Stevens",
        "timestamp": 1713112255
    },
    {
        "content": "<p>This charset thing is really annoying. Especially if you can't tell sytax errors from others yet.<br>\nAnyway, if I understand right this means if 20 files have been loaded and I turn to another unrelated<br>\nproblem I have to remove anything file by file manually? I'm asking this because working with<br>\nsoftware having some kind of 'top-level -like' behaviour often shows the strangest results by<br>\nre-loading, adding or deleting things.</p>",
        "id": 433161737,
        "sender_full_name": "Michael Moeller",
        "timestamp": 1713125698
    },
    {
        "content": "<p>I think that I don't really understand what you are trying to do. You need to be more specific in what you are doing, what you expect to happen and what actually happens. Furthermore, it is not necessary to reload the file. You only need to do that to display the UTF-8 correctly.</p>",
        "id": 433258084,
        "sender_full_name": "Lukas Stevens",
        "timestamp": 1713178502
    },
    {
        "content": "<p>I know that I have in passed accidentally deactivated the \"continuous checking\" (in the theories panel) which is reactivated when restarting Isabelle/jEdit</p>",
        "id": 433269858,
        "sender_full_name": "Mathias Fleury",
        "timestamp": 1713181996
    },
    {
        "content": "<p>But you should put an example here of what you are copy-pasting that is not working…</p>",
        "id": 433269956,
        "sender_full_name": "Mathias Fleury",
        "timestamp": 1713182030
    },
    {
        "content": "<p>I see. I'm talking about two different things. Please forget<br>\nabout UTF-8 problems. At all times PDF files contained special<br>\ncharacters like \", &lt; and &gt; which get invalid by means of copy<br>\nand paste. It's neither new nor specific to Isabelle.</p>\n<p>An example regarding the other question would be the following:<br>\nLoad some files from the documentation box (upper left). Then<br>\nclick 'New' and pick an example from sledgehammer.pdf, say<br>\n\"First Steps\" from page 5. Copy and paste it to Isabelle.</p>\n<p>You may delete the other files in advance or afterwards or<br>\ncheck/uncheck whichever box you like. Unless you restart<br>\nIsabelle and get \"First Steps\" again, it triggers nothing. It<br>\ndoesn't even get colorized.</p>\n<p>That's why I asked whether to restart is the only way to get<br>\nrid of anything done so far.</p>",
        "id": 433313887,
        "sender_full_name": "Michael Moeller",
        "timestamp": 1713193107
    },
    {
        "content": "<p>Copying from PDFs may or may not work as you have noted. If you're creating a new theory file, you'll have to save the file with appropriate file ending first, this has nothing to do with copying.</p>",
        "id": 433315792,
        "sender_full_name": "Fabian Huch",
        "timestamp": 1713193526
    },
    {
        "content": "<p>Thank you. This works.</p>",
        "id": 433388091,
        "sender_full_name": "Michael Moeller",
        "timestamp": 1713215618
    }
]