[
    {
        "content": "<p>Hi all,  I have a relatively large proof goal that is easily proved (\"blast\", \"metis\", \"meson\", \"fast\" all solve it).  However, when running Sledgehammer, the attached warnings were generated.</p>\n<p><a href=\"/user_uploads/14278/dCqr-SRVd-E782td-TY489Sb/Screenshot-2023-11-03-at-7.46.08-AM.png\">Screenshot-2023-11-03-at-7.46.08-AM.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/14278/dCqr-SRVd-E782td-TY489Sb/Screenshot-2023-11-03-at-7.46.08-AM.png\" title=\"Screenshot-2023-11-03-at-7.46.08-AM.png\"><img src=\"/user_uploads/14278/dCqr-SRVd-E782td-TY489Sb/Screenshot-2023-11-03-at-7.46.08-AM.png\"></a></div><p>This warning disappears as soon as I input a proof.  This is in the context of a larger development and I have not attempted to generate a minimal example; I expect part of the problem is that the subgoal in question is quite large (it contains many abbreviations which, when expanded, generate large terms).  However, I am unsure what would be causing the \"bad name binding\" warning and whether there is anything I should fix.  Any thoughts on what might be underlying this are appreciated!</p>",
        "id": 400134590,
        "sender_full_name": "Katherine Kosaian",
        "timestamp": 1699018394
    },
    {
        "content": "<p>Dear <span class=\"user-mention\" data-user-id=\"664245\">@Katherine Kosaian</span> ,</p>\n<p>I apologize, but I don't have a direct answer to your question. However, after examining the screenshot you provided, I wonder if you're trying to suppress the <code>Tracing paused</code> message.</p>\n<p>I've previously been bothered by such messages and found a way to suppress them. You might find this link useful:<br>\n<a href=\"https://github.com/data61/PSL#hints\">https://github.com/data61/PSL#hints</a></p>\n<p>Regarding your specific issue, I'm not entirely well-versed in this area. Still, it seems the warning might originate from Line 190 of <code>src/Pure/General/binding.ML</code>. Perhaps you could review how names like <code>#l_lift2</code> are generated and adjust the naming scheme to ensure compatibility with <code>Symbol_Pos.is_identifier</code>?</p>\n<p>Best regards,<br>\nYutaka</p>",
        "id": 400431959,
        "sender_full_name": "Yutaka Nagashima",
        "timestamp": 1699228629
    },
    {
        "content": "<p>Thank you so much, these are helpful pointers!!</p>",
        "id": 402781295,
        "sender_full_name": "Katherine Kosaian",
        "timestamp": 1700255840
    }
]