[
    {
        "content": "<p>Hey, I'm a beginner to both Isabelle and mathematics in general. I didn't find any formulation of the Riemann integral in the AFP, notably, Laurence Paulson avoided them when proved Young's Inequality. <br>\nI'm wondering why aren't Riemann integrals formalized?<br>\nIn particular, I wanted to try to formalize and prove basic properties of the Choquet integral, which uses the Riemann integral in its definition (according to wikipedia). I assume I could use Lebesgue integrals instead, but then I would have to define it to exclude functions that aren't riemann integrable.</p>",
        "id": 496650162,
        "sender_full_name": "Dylan Crooks",
        "timestamp": 1738187831
    },
    {
        "content": "<p>The reason for this, I imagine, is practicality. HOL-Analysis defines the non-negative lebesgue integral, but the full lebesgue integral is defined in terms of the Bochner integral since they are equal on all lebesgue-integrable functions. Similarly, the Riemann integral is equal to the Lebesgue integral on all riemann-integrable functions, and so for the standard library it didn't make sense to have both available when one is simply more general.</p>\n<p>So indeed, if you can use the Lebesgue integral do so, since all lebesgue integrable functions are riemann integrable.</p>",
        "id": 496876961,
        "sender_full_name": "Christian Pardillo Laursen",
        "timestamp": 1738274587
    },
    {
        "content": "<p>Looking at the wikipedia page for the choquet integral I see no reason why you wouldn't be able to formalise it with the lebesgue integral over the lebesgue measure.</p>",
        "id": 496878402,
        "sender_full_name": "Christian Pardillo Laursen",
        "timestamp": 1738275236
    },
    {
        "content": "<p>In my understanding, Isabelle/HOL formalizes the Henstock–Kurzweil integral, which is a generalization of the Riemann integral.</p>",
        "id": 497120633,
        "sender_full_name": "Yosuke Ito",
        "timestamp": 1738376966
    },
    {
        "content": "<p>Henstock–Kurzweil and Lebesgue/Bochner are both in HOL-Analysis and there are theorems that relate the two to one another as well.</p>",
        "id": 497263097,
        "sender_full_name": "Manuel Eberl",
        "timestamp": 1738506776
    },
    {
        "content": "<p>And yes, both are a generalisation of Riemann. I for one have never found myself in a situation where I needed Riemann. But it's probably not too hard to define using the formalisation of HK as an inspiration.</p>",
        "id": 497263219,
        "sender_full_name": "Manuel Eberl",
        "timestamp": 1738506880
    }
]