[
    {
        "content": "<p>I'm taking a course on Isabelle and I'm having trouble with sledgehammer. Sledgehammer is having difficulty finding proofs when other people in my class are having no problems. I'm unfolding definitions and proving lemmas and still running into problems. I'm using windows 11 and have 8gb of RAM.</p>",
        "id": 467980105,
        "sender_full_name": "Jason Veenendaal",
        "timestamp": 1725568870
    },
    {
        "content": "<p>I’ve ran sledgehammer multiple times on the same statement with different results.</p>",
        "id": 468020377,
        "sender_full_name": "Craig Alan Feinstein",
        "timestamp": 1725585161
    },
    {
        "content": "<ol>\n<li>Sledgehammer is not deterministic at various levels: fact selection [the default depends on what you learned before and variable names can change what SMT solver do], run-time of the solver [the more programs run, the slower the solver get], replaying on the Isabelle side [Isabelle issue]</li>\n</ol>",
        "id": 468064935,
        "sender_full_name": "Mathias Fleury",
        "timestamp": 1725598311
    },
    {
        "content": "<ol start=\"2\">\n<li>8GB is not a lot when you run Isabelle and some solvers (if some memory is offloaded to disk… big problem)</li>\n</ol>",
        "id": 468065048,
        "sender_full_name": "Mathias Fleury",
        "timestamp": 1725598379
    },
    {
        "content": "<p>I would limit the number of run solvers to 2 or 3 (for 3: cvc, z3 or vampire, e; for 2: cvc and e)</p>",
        "id": 468065329,
        "sender_full_name": "Mathias Fleury",
        "timestamp": 1725598444
    },
    {
        "content": "<p>In the sledgehammer panel, next to the run sledgehammer button, there is a string list you can edit to change the used solvers</p>",
        "id": 468065464,
        "sender_full_name": "Mathias Fleury",
        "timestamp": 1725598473
    },
    {
        "content": "<p>I've tried changing the number of solvers and I still am having trouble. I've also tried to limit the number of slices as well but I'm not sure if that should help or not.</p>",
        "id": 468193395,
        "sender_full_name": "Jason Veenendaal",
        "timestamp": 1725630325
    }
]