[
    {
        "content": "<p><a href=\"/user_uploads/14278/WoAMk9KoDKaXJWHLonAsFrmy/image.png\">image.png</a><br>\nI try to prove the correctness of above lemma, and using matix as tool before, now i was thinking whether it is more convinent to use polomial staff to prove it?</p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/14278/WoAMk9KoDKaXJWHLonAsFrmy/image.png\" title=\"image.png\"><img src=\"/user_uploads/14278/WoAMk9KoDKaXJWHLonAsFrmy/image.png\"></a></div>",
        "id": 439185931,
        "sender_full_name": "Hongjian Jiang",
        "timestamp": 1715938255
    },
    {
        "content": "<p>Without context on what the equations is supposed to mean, it is very hard to answer</p>",
        "id": 439336313,
        "sender_full_name": "Mathias Fleury",
        "timestamp": 1716019066
    },
    {
        "content": "<p>there are two questions you should ask yourself:</p>\n<ol>\n<li>would the new way still follow the proof on paper or do you need to come up with a new proof?</li>\n<li>if it still follows the proof on paper, is there a technical reason that one representation would be better than the other?</li>\n<li>if there is no technical reason, then there is a question on usability which you usually test by converting a few of the easier lemmas</li>\n<li>the grass is always greener somewhere else</li>\n</ol>",
        "id": 439336528,
        "sender_full_name": "Mathias Fleury",
        "timestamp": 1716019227
    },
    {
        "content": "<p>To give an example, image that you have a list of the objects where you use nth to map an index to one object. And you want to replace it by a function from <code>nat =&gt; object</code>:</p>\n<ol>\n<li>this is only a technical difference, the proof would not change</li>\n<li>it is easier as you do have to care about extending the list to add an object. But there is no natural domain (maximum index) anymore</li>\n<li>The usability will improve a bit as you do not have to care about <code>i &lt; length xs</code> anymore. And after porting some lemmas, you would probably realize auto is rather nicely automated for lists. So it is not that much better actually.</li>\n</ol>",
        "id": 439336774,
        "sender_full_name": "Mathias Fleury",
        "timestamp": 1716019476
    },
    {
        "content": "<p>Thanks, Fleury. As your suggest, I go on use former way.</p>",
        "id": 441078166,
        "sender_full_name": "Hongjian Jiang",
        "timestamp": 1716914874
    },
    {
        "content": "<p>(deleted)</p>",
        "id": 441078342,
        "sender_full_name": "Hongjian Jiang",
        "timestamp": 1716914937
    },
    {
        "content": "<p>(deleted)</p>",
        "id": 441078741,
        "sender_full_name": "Hongjian Jiang",
        "timestamp": 1716915102
    }
]