[
    {
        "content": "<p><a href=\"/user_uploads/14278/SBqthDwUmtvkRihkb1waqYfQ/image.png\">image.png</a><br>\nHi, i am very new to isabelle. I write a theory \"MyAdd.thy\". it work well until line 27. no error messages. I am confused where it go wrong.</p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/14278/SBqthDwUmtvkRihkb1waqYfQ/image.png\" title=\"image.png\"><img src=\"/user_uploads/14278/SBqthDwUmtvkRihkb1waqYfQ/image.png\"></a></div>",
        "id": 410433595,
        "sender_full_name": "JFu",
        "timestamp": 1703857171
    },
    {
        "content": "<p>Maybe don’t post screenshots but rather actual code as text, so that others can load it into their IDEs and experiment with it.</p>",
        "id": 410449211,
        "sender_full_name": "Wolfgang Jeltsch",
        "timestamp": 1703866986
    },
    {
        "content": "<p>It looks like that line is simply processing without ever completing. That typically means that the automation is going haywire one way or another. In your case the simplifier is looping, i.e. the <code>simp</code> rules you added (plus the ones that are declared as <code>simp</code> rules by default) are creating an infinite rewrite loop.</p>\n<p>The simplifier does not really have any mechanisms to detect such infinite rewrite cycles except for some very simple obvious cases, both because of performance reasons and because the problem is, in general, undecidable. It takes some experience to figure out what a good <code>simp</code> rule looks like and what direction is the best one (remember: <code>simp</code> rules get applied left-to-right only). So as a beginner, it is perhaps a good idea not to be a bit conservative about declaring <code>simp</code> rules and rather add them locally as needed (<code>simp add: foo</code>, <code>auto simp: foo</code>, etc). And if you ever have a rewrite loop like this, try removing <code>simp</code> rules one by one until there is no infinite loop anymore to understand what causes it.</p>\n<p>In your case, the defining equations of your <code>add</code> function are theorems called <code>add.simps</code>, and the second of these states <code>add (Suc m) n = Suc (add m n)</code>. Moreover, the <code>.simps</code> rules generated by the function package are declared as <code>simp</code> rules by default. Your <code>add_1</code> rule is the exact opposite of that equation, so it is not surprising that you get a cycle.</p>\n<p>There are a few rules of thumb in figuring out what is and what isn't a good <code>simp</code> rule. The rule should be as simple and general as possible, the right-hand side should ideally be \"simpler\" in some sense than the left-hand side (although it is not always obvious what that means) and it should not cause infinite loops in combination with existing simp rules.</p>\n<p>Also, relevant for your use case, it is generally a good idea to move datatype constructors as far outside as possible. That is, you should have theorems that relate your <code>add</code> function to the constructors of your <code>nat</code> datatype, and they should be oriented in such a way that the constructors are moved as far outside as possible. For example: <code>add (Suc m) n = Suc (add m n)</code>, <code>add m (Suc n) = add m (Suc n)</code>, <code>add 0 n = n</code>, <code>add m 0 = m</code>. Half of these are defining equations of <code>add</code> anyway, so they are for free, but the other two you have to prove yourself. If you don't have one of these rules, the simplifier is likely to get \"stuck\" in some proofs.</p>",
        "id": 410531496,
        "sender_full_name": "Manuel Eberl",
        "timestamp": 1703930917
    }
]