[
    {
        "content": "<p>Heinrich Heine University Düsseldorf is seeking two full-time postdocs within the project <em>ADAM: Anticipating the Digital Age of Mathematics</em>, which is funded by the public foundation <a href=\"https://stiftung-hochschullehre.de/\">Stiftung Innovation in der Hochschullehre</a>. The core aim of the project is to develop, test and publish online resources that provide an introduction to formalized mathematics using the lean proof assistant. Suitable candidates will have a PhD in mathematics or a related area, experience in formalized mathematics and strong programming skills, and display a keen willingness to engage and collaborate with students and staff across a range of subjects including mathematics, computer sciences and linguistics.</p>\n<p>The positions are currently available for two years starting from October 2022. They are payed on the E13 scale and come with very limited regular teaching duties.</p>\n<p>Düsseldorf is the capital of Nordrhein-Westfalen, the most populous German state, with a very cosmopolitan atmosphere and diverse neighbourhoods. It has an international airport and excellent direct rail connections to Amsterdam, Brussels, Paris and Berlin.</p>\n<p>Interested candidates are encouraged to contact Prof. Marcus Zibrowius (&lt;<a href=\"mailto:marcus.zibrowius@hhu.de\">marcus.zibrowius@hhu.de</a>&gt;) or Prof. Immanuel Halupczok (&lt;<a href=\"mailto:immanuel.halupczok@hhu.de\">immanuel.halupczok@hhu.de</a>&gt;) for more information. Full applications should be sent to &lt;<a href=\"mailto:marcus.zibrowius@hhu.de\">marcus.zibrowius@hhu.de</a>&gt; and include a cover letter, CV and a contact for a potential letter of reference. There is no formal application deadline, but all applications received by 10 July 2022 are guaranteed to be considered.</p>",
        "id": 287540256,
        "sender_full_name": "Marcus Zibrowius",
        "timestamp": 1656313950
    },
    {
        "content": "<p>Did you mean to say ‘10 July 2023’?</p>",
        "id": 304420641,
        "sender_full_name": "Manuel Eberl",
        "timestamp": 1666000416
    }
]