[
    {
        "content": "<h1>Call for Contributions: Fifth International Workshop on Automated (Co)inductive Theorem Proving</h1>\n<p>Dear Isabelle users,</p>\n<p>(Please accept our apologies if you receive this call through multiple channels. We aim to ensure that all potentially interested parties are informed, but sometimes this leads to overlaps.)</p>\n<p>We are delighted to announce the Fifth International Workshop on Automated (Co)inductive Theorem Proving, an event dedicated to the latest developments in inductive and coinductive methods for verification. This workshop is a significant gathering for researchers and practitioners in the field, providing an invaluable opportunity to explore current challenges and innovations in computational verification.</p>\n<h2>Key Themes:</h2>\n<ul>\n<li>Advances in inductive reasoning for recursive structures and loop-containing programs.</li>\n<li>Developments in coinductive methods and their growing relevance in verification and industrial applications.</li>\n<li>Cross-disciplinary collaboration to foster innovation in computational verification methods, including SMT, HOL, FOL, etc.</li>\n</ul>\n<h2>Featured Speakers Announcement:</h2>\n<p>We are thrilled to announce that this year's workshop will feature four distinguished invited speakers: </p>\n<ul>\n<li><a href=\"http://voronkov.com\">Prof. Andrei Voronkov</a> from the University of Manchester and <a href=\"https://logic-cs.at/phd/students/petra-hozzova/\">Ms. Petra Hozzová</a> from the Vienna University of Technology</li>\n<li><a href=\"https://traytel.bitbucket.io\">Prof. Dmitriy Traytel</a> from the University of Copenhagen</li>\n<li><a href=\"https://dmg.tuwien.ac.at/hetzl/\">Dr. Stefan Hetzl</a> from the Vienna University of Technology</li>\n</ul>\n<h2>Call for Abstracts:</h2>\n<p>We invite you to submit an extended abstract showcasing your latest research, findings, or ongoing studies in the field of automated (co)inductive theorem proving. This is a fantastic platform to share your work with a diverse and expert audience, engage in intellectual exchange, and contribute to the advancement of the field. We welcome studies and findings published within the last five years.</p>\n<h3>Submission Guidelines:</h3>\n<p>abstracts are to be sent to <a href=\"mailto:wait.in.france@gmail.com\">wait.in.france@gmail.com</a></p>\n<h3>Length:</h3>\n<p>1-2 pages excluding references.</p>\n<h3>Recommended Format:</h3>\n<p><a href=\"https://easychair.org/publications/easychair.zip\">easychair.cls</a></p>\n<h3>Important Dates:</h3>\n<ul>\n<li>Abstract Submission Deadline: 15 May.</li>\n<li>Notification of Acceptance: 1 June.</li>\n</ul>\n<h3>Workshop Format:</h3>\n<p>The workshop will feature in-depth tutorials, talks by leading experts, and a panel discussion for interactive dialogue. It is an ideal setting for networking, collaboration, and gaining new insights into the challenges and opportunities in automated theorem<br>\nproving.</p>\n<h3>Remote Participation:</h3>\n<p>While on-site attendance is encouraged to fully benefit from the interactive nature of the workshop, provisions for remote participation will be available for wider accessibility.</p>\n<h3>Dissemination and Special Issue:</h3>\n<p>Selected abstracts and presentation slides will be published on the workshop website. There's also a plan for a special journal issue based on the workshop's theme, subject to participant interest.</p>\n<h2>Join Us!</h2>\n<p>Be a part of this stimulating event to discuss, learn, and contribute to the future of automated (co)inductive theorem proving. Don’t miss this opportunity to engage with a vibrant community and shape the future of verification techniques. We look forward to your submissions and participation!</p>\n<p>For more information, please contact the organizers, Yutaka Nagashima and Sorin Stratulat at <a href=\"mailto:wait.in.france@gmail.com\">wait.in.france@gmail.com</a>.</p>",
        "id": 436787916,
        "sender_full_name": "Yutaka Nagashima",
        "timestamp": 1714689625
    }
]