[
    {
        "content": "<p>Hi, dear users of Isabelle,</p>\n<p>It is exciting to announce an unofficial REPL server for Isabelle.</p>\n<p>This tool addresses a need in the machine learning community, where people have faced challenges connecting Isabelle with ML systems. Some of my colleagues in machine learning have expressed that this integration difficulty has led them to choose other proof assistants like Lean. This REPL server aims to bridge this gap as a first step. Additionally, I am also planning an abstraction layer to simplify the complexity that exposures to AI agents (join the discussion from <a href=\"https://github.com/xqyww123/Isa-Proof-Shell\">GitHub</a> or <a href=\"#narrow/channel/202967-New-Members-.26-Projects/topic/A.20proof.20shell.20designed.20for.20machine.20learning\">Zulip thread</a>).</p>\n<p>Repository URL: <a href=\"https://github.com/xqyww123/Isa-REPL\">https://github.com/xqyww123/Isa-REPL</a></p>\n<p><strong>Features</strong></p>\n<ul>\n<li>Python client</li>\n<li>Tracing the proof state and the output panel for step-by-step evaluation.<br>\n    - Plugin: collecting data from Isabelle's internal representations by hot plugins written in Isabelle/ML.</li>\n<li>Socket based remote communication</li>\n<li>Socket based concurrency</li>\n<li>State rollback</li>\n</ul>\n<p>About the implementation, I use the <code>Toplevel.state</code> interface in a dedicated thread separate from Isabelle workers (<code>Task_Queue.task</code>). This disables the concurrency between commands within a single file, allowing the REPL to sequentially evaluate every command and capture its complete output as expected. However, I dunno if it could cause any unforeseen problems. Let me know if it is bad!</p>\n<p>The REPL server runs in the batch mode of <code>isabelle build</code>, in a tricky way preventing the build process from terminating and transforming it into a server. While functional, the ideal solution perhaps should be implementing the server as an Isabelle tool integrated into the <code>isabelle</code> command line tool. I welcome expertise and assistance from the community to help develop this integration.</p>",
        "id": 481930630,
        "sender_full_name": "Qiyuan Xu",
        "timestamp": 1731412982
    }
]