[
    {
        "content": "<p>This is my first time posting here so please excuse me if this is out of place.<br>\nThis site was mentioned on Andrej Bauer's log <code>Mathematics and Computation</code> in the topic <code>The proposal for a proof assistants StackExchange site</code> (<a href=\"http://math.andrej.com/2021/11/20/proof-assistants-stackexchange-site/\">ref</a>)<br>\nThe proposal is still open to those wanting to commit before the private beta.<br>\nA StackExchange chat room for the ProofAssistants proposal has been setup: <a href=\"https://chat.stackexchange.com/rooms/131732/proofassistants-temp\">https://chat.stackexchange.com/rooms/131732/proofassistants-temp</a><br>\nI did not post this under <code>Announcements</code> but feel free to repost it there if needed.</p>",
        "id": 262675758,
        "sender_full_name": "Eric Taucher",
        "timestamp": 1637827352
    },
    {
        "content": "<p><a href=\"https://area51.meta.stackexchange.com/questions/32670/proof-assistants-private-beta-launch-will-take-place-in-january-2022\">Proof Assistants private beta launch will take place in January 2022</a></p>\n<blockquote>\n<p>Since we want all proposals to have the best chances of thriving as possible, the Community Team has decided to postpone this proposal's launch into private beta to January 2022, in an attempt to minimize the impact of the upcoming end-of-year holidays in the site's chances of success.</p>\n<p>Additionally, the proposal sped through its definition and commitment phases, which we believe hasn't allowed for some discussions that usually take place during those phases — such as deciding on a name and URL for the site — to come to a consensus. As such, we invite those of you who've committed to this proposal to try to have those conversations between now and the first couple of weeks of January 2022. At that time the Community Team will help y'all tie whatever loose ends need to be tied, and prepare the site for launch into private beta.</p>\n</blockquote>",
        "id": 264291902,
        "sender_full_name": "Eric Taucher",
        "timestamp": 1639052121
    },
    {
        "content": "<p>The new StackExchange site for Proof Assistants is up.</p>\n<p><a href=\"https://proofassistants.stackexchange.com/\">https://proofassistants.stackexchange.com/</a></p>",
        "id": 271175375,
        "sender_full_name": "Eric Taucher",
        "timestamp": 1644346871
    },
    {
        "content": "<p>(deleted)</p>",
        "id": 271175405,
        "sender_full_name": "Eric Taucher",
        "timestamp": 1644346886
    }
]