[
    {
        "content": "<p>From: David Miguel Sanan Baena &lt;<a href=\"mailto:cl-isabelle-users@lists.cam.ac.uk\">cl-isabelle-users@lists.cam.ac.uk</a>&gt;<br>\n<strong> Apologies if you receive multiple copies of these open positions </strong></p>\n<p>A postdoctoral position in program semantics and verification is open at the Singapore Institute of Technology (SIT) under the supervision of Prof. David Sanan.</p>\n<p>The project aims to minimize the gap between formal verification and efficient industrial applications. Specifically, we focus on constructing a verification framework for software using deductive reasoning, and on the formalization of smart contract semantics, with special attention to the Solidity language.</p>\n<p>The candidate will work on formalizing programming language semantics, constructing a framework for scalable verification, and building mechanisms for automatic reasoning on Isabelle/HOL.</p>\n<p>Qualifications:</p>\n<ul>\n<li>A Ph.D. in Computer Science, Mathematics, or a closely related discipline.</li>\n<li>Experience in formal methods and formal verification. Experience in Isabelle theorem prover is preferred.</li>\n<li>Familiar with program semantics and program logic, including Hoare Logic and Separation Logic.</li>\n</ul>\n<p>SIT offers highly competitive salaries and is situated in Singapore, a multicultural English-speaking city. Singapore offers high-quality education and healthcare at all levels and very low tax rates.</p>\n<p>The position is available full-time for one and a half years in the first instance, with the possibility of renewal(s).</p>\n<p>Starting date: as soon as possible.</p>\n<p>To apply, send an email with the CV to <a href=\"mailto:david.miguel@singaporetech.edu.sg\">david.miguel@singaporetech.edu.sg</a></p>\n<hr>\n<p>Notice: This e-mail may contain confidential and/or privileged information. If you are not the intended recipient or have received this e-mail in error, please notify the sender immediately and destroy this e-mail. Any unauthorized copying, disclosure or distribution of the material in this e-mail is strictly forbidden.<br>\nSingapore Institute of Technology, Co. Reg. No. 200917667D.</p>",
        "id": 319381854,
        "sender_full_name": "Email Gateway",
        "timestamp": 1672836449
    },
    {
        "content": "<p>From: David Miguel Sanan Baena &lt;<a href=\"mailto:cl-isabelle-users@lists.cam.ac.uk\">cl-isabelle-users@lists.cam.ac.uk</a>&gt;<br>\n<strong> Apologies if you receive multiple copies of these open positions </strong></p>\n<p>A postdoctoral position in program semantics and verification is open at the Singapore Institute of Technology (SIT) under the supervision of Prof. David Sanan.</p>\n<p>The project aims to minimize the gap between formal verification and efficient industrial applications. Specifically, we are focusing on constructing a verification framework for software using deductive reasoning, and on formalizing the semantics of smart contracts, with special attention to the Solidity language.</p>\n<p>The candidate will work on formalizing programming language semantics, constructing a framework for scalable verification, and developing mechanisms for automatic reasoning in Isabelle/HOL.</p>\n<p>Qualifications:</p>\n<ul>\n<li>A Ph.D. in Computer Science, Mathematics, or a closely related discipline.</li>\n<li>Experience in formal methods and formal verification. Experience with the Isabelle theorem prover is preferred.</li>\n<li>Familiarity with program semantics and program logic, including Hoare Logic and Separation Logic.</li>\n</ul>\n<p>The expected salary range is 75k~100k SGD + bonus. SIT is located in Singapore, a multicultural English-speaking city known for its high-quality education and healthcare systems, as well as very low tax rates.</p>\n<p>This full-time position is available for one year initially, with the possibility of renewal(s).</p>\n<p>Starting date: As soon as possible.</p>\n<p>To apply, please send an email with your CV to <a href=\"mailto:david.miguel@singaporetech.edu.sg\">david.miguel@singaporetech.edu.sg</a>.</p>",
        "id": 417230471,
        "sender_full_name": "Email Gateway",
        "timestamp": 1705930676
    }
]