[
    {
        "content": "<p>From: Tobias Nipkow &lt;<a href=\"mailto:nipkow@in.tum.de\">nipkow@in.tum.de</a>&gt;<br>\nIsaNet: Formalization of a Verification Framework for Secure Data Plane Protocols</p>\n<p>Tobias Klenze and Christoph Sprenger</p>\n<p>Today's Internet is built on decades-old networking protocols that lack <br>\nscalability, reliability and security. In response, the networking community has <br>\ndeveloped path-aware Internet architectures that solve these issues while <br>\nsimultaneously empowering end hosts. In these architectures, autonomous systems <br>\nauthorize forwarding paths in accordance with their routing policies, and <br>\nprotect paths using cryptographic authenticators. For each packet, the sending <br>\nend host selects an authorized path and embeds it and its authenticators in the <br>\npacket header. This allows routers to efficiently determine how to forward the <br>\npacket. The central security property of the data plane, i.e., of forwarding, is <br>\nthat packets can only travel along authorized paths. This property, which we <br>\ncall path authorization, protects the routing policies of autonomous systems <br>\nfrom malicious senders. The fundamental role of packet forwarding in the <br>\nInternet's ecosystem and the complexity of the authentication mechanisms <br>\nemployed call for a formal analysis. We develop IsaNet, a parameterized <br>\nverification framework for data plane protocols in Isabelle/HOL. We first <br>\nformulate an abstract model without an attacker for which we prove path <br>\nauthorization. We then refine this model by introducing a Dolev--Yao attacker <br>\nand by protecting authorized paths using (generic) cryptographic validation <br>\nfields. This model is parametrized by the path authorization mechanism and <br>\nassumes five simple verification conditions. We propose novel attacker models <br>\nand different sets of assumptions on the underlying routing protocol. We <br>\nvalidate our framework by instantiating it with nine concrete protocols variants <br>\nand prove that they each satisfy the verification conditions (and hence path <br>\nauthorization). The invariants needed for the security proof are proven in the <br>\nparametrized model instead of the instance models. Our framework thus supports <br>\nlow-effort security proofs for data plane protocols. In contrast to what could <br>\nbe achieved with state-of-the-art automated protocol verifiers, our results hold <br>\nfor arbitrary network topologies and sets of authorized paths.</p>\n<p><a href=\"https://www.isa-afp.org/entries/IsaNet.html\">https://www.isa-afp.org/entries/IsaNet.html</a></p>\n<p>Enjoy!<br>\n<a href=\"/user_uploads/14278/4GJdEYP9e1-LIjTQ9Dzl_wKe/smime.p7s\">smime.p7s</a></p>",
        "id": 287339825,
        "sender_full_name": "Email Gateway",
        "timestamp": 1656081746
    }
]