[
    {
        "content": "<p>From: Timothy Bourke &lt;<a href=\"mailto:Timothy.Bourke@inria.fr\">Timothy.Bourke@inria.fr</a>&gt;<br>\n[ This message is intentionally written in French. It is a call for<br>\npapers for the \"Francophone Days on Functional Languages\" to be held<br>\nat the end of January 2023 in the French Alps. Papers about or using <br>\nIsabelle are most welcome! ]</p>\n<ul>\n<li>Merci de faire circuler : premier appel à communications -<p>JFLA'2023</p>\n<p><a href=\"http://jfla.inria.fr/jfla2023.html\">http://jfla.inria.fr/jfla2023.html</a></p>\n<p>Journées Francophones des Langages Applicatifs</p>\n<p>31 janvier au 3 février 2023</p>\n<p>Praz-sur-Arly (Haute-Savoie)</p>\n</li>\n</ul>\n<p>Les 34-ièmes Journées Francophones des Langages Applicatifs (JFLA) se <br>\ntiendront en Haute-Savoie, à Praz-sur-Arly, au coeur des Alpes, du <br>\nmardi 31 janvier 2023 au vendredi 3 février 2023.</p>\n<p>Les JFLA réunissent concepteurs, utilisateurs et théoriciens ; elles <br>\nont pour ambition de couvrir les domaines des langages applicatifs, de <br>\nla preuve formelle, de la vérification de programmes, et des objets <br>\nmathématiques qui sous-tendent ces outils. Ces domaines doivent être <br>\npris au sens large : nous souhaitons promouvoir les ponts entre les <br>\ndifférentes thématiques.</p>\n<ul>\n<li>\n<p>Langages fonctionnels et applicatifs : sémantique, compilation, <br>\n   optimisation, typage, mesures, extensions par d'autres paradigmes.</p>\n</li>\n<li>\n<p>Assistants de preuve : implémentation, nouvelles tactiques, <br>\n   développements présentant un intérêt technique ou méthodologique.</p>\n</li>\n<li>\n<p>Logique, correspondance de Curry-Howard, réalisabilité, extraction <br>\n   de programmes, modèles.</p>\n</li>\n<li>\n<p>Spécification, prototypage, développements formels d'algorithmes.</p>\n</li>\n<li>\n<p>Vérification de programmes ou de modèles, méthode déductive, <br>\n   interprétation abstraite, raffinement.</p>\n</li>\n<li>\n<p>Utilisation industrielle des langages fonctionnels et applicatifs, <br>\n   ou des méthodes issues des preuves formelles, outils pour le web.</p>\n</li>\n</ul>\n<p>Les articles soumis aux JFLA sont relus par au moins deux personnes <br>\ns'ils sont acceptés, trois personnes s'ils sont rejetés. Les critiques <br>\ndes relecteurs sont toujours bienveillantes et la plupart du temps <br>\nencourageantes et constructives, même en cas de rejet.</p>\n<p>Il n'y a donc pas de raison de ne pas soumettre aux JFLA !</p>\n<ul>\n<li>Dates importantes</li>\n</ul>\n<p>Soumission des résumés           7 octobre 2022<br>\nSoumission des articles         14 octobre 2022<br>\nNotification aux auteurs        25 novembre 2022<br>\nVersion finale                  14 décembre 2022<br>\nClôture des inscriptions         6 janvier 2023</p>\n<ul>\n<li>Soumissions</li>\n</ul>\n<p>Nous acceptons quatre types de soumissions :</p>\n<ul>\n<li>\n<p>Article de recherche de seize pages au plus (hors bibliographie), <br>\n   portant sur des travaux originaux. Nous acceptons des travaux en <br>\n   cours, pour lesquels l'aspect recherche n'est pas entièrement <br>\n   finalisé. Nous encourageons aussi la soumission de \"perles\", ces <br>\n   articles présentant avec élégance un résultat connu sous un angle <br>\n   nouveau.</p>\n</li>\n<li>\n<p>Article court de huit pages au plus (hors bibliographie) pour <br>\n   rechercher de l'aide pour résoudre un problème particulier ou pour <br>\n   reparler d'un papier déjà publié.</p>\n</li>\n<li>\n<p>Proposition de tutoriel d'une page exposant son intérêt et ses <br>\n   objectifs ainsi que l'environnement informatique nécessaire à sa <br>\n   réalisation.</p>\n</li>\n<li>\n<p>Proposition de démonstration d'un outil ou d'un prototype de deux <br>\n   pages décrivant pourquoi ce logiciel est intéressant ainsi que ses <br>\n   spécificités.</p>\n</li>\n</ul>\n<p>Dans tous les cas, la forme de l'article devra être soignée. Les <br>\narticles sélectionnés seront publiés dans les actes de la conférence, <br>\net les auteurs seront invités à faire une présentation lors des <br>\njournées. L'article peut être rédigé en anglais, auquel cas la <br>\nprésentation devra être effectuée en français. Néanmoins, dans le cas <br>\noù il s'agit d'une republication au format court d'un article déjà <br>\npublié, la publication doit être en français et la publication <br>\noriginale en anglais.</p>\n<p>Le style LaTeX Easychair doit être respecté :<br>\n<a href=\"https://easychair.org/publications/for_authors\">https://easychair.org/publications/for_authors</a></p>\n<p>Les soumissions se font sur la page Easychair des JFLA :<br>\n<a href=\"https://easychair.org/conferences/?conf=jfla2023\">https://easychair.org/conferences/?conf=jfla2023</a><br>\n<a href=\"/user_uploads/14278/uI3a5RsuFeGOG9w37bnnRgZ0/signature.asc\">signature.asc</a></p>",
        "id": 298771103,
        "sender_full_name": "Email Gateway",
        "timestamp": 1663162231
    }
]