[
    {
        "content": "<p>From: Marco Campion &lt;<a href=\"mailto:marco.campion@inria.fr\">marco.campion@inria.fr</a>&gt;<br>\n31st Static Analysis Symposium (SAS 2024) : Call for Papers </p>\n<p>The 31st Static Analysis Symposium (SAS 2024) will take place from Sunday , October 20th to October 22nd, 2024 . <br>\nIt will be held in Pasadena, CA, US, co-located with SPLASH 2024. </p>\n<p>[ <a href=\"https://2024.splashcon.org/home/sas-2024\">https://2024.splashcon.org/home/sas-2024</a> | <a href=\"https://2024.splashcon.org/home/sas-2024\">https://2024.splashcon.org/home/sas-2024</a> ] </p>\n<p>Important Dates (All deadlines are AoE (Anywhere on Earth)) </p>\n<ul>\n<li>Paper submission: Sunday , May 5th, 2024 </li>\n<li>Artifact submission: Sunday , May 12th, 2024 </li>\n<li>Author response: Monday , June 17th, 2024 - Wednesday , June 19th, 2024 </li>\n<li>Notification: Sunday , July 7th, 2024 </li>\n<li>Camera ready: Monday , August 5th, 2024 </li>\n</ul>\n<p>Static Analysis is widely recognized as a fundamental tool for program verification, bug detection, compiler optimization, program understanding, and software maintenance. The series of Static Analysis Symposia has served for over 30 years as the primary venue for the presentation of theoretical, practical, and application advances in the area. Topics </p>\n<p>The technical program for SAS 2024 will consist of invited lectures and presentations of refereed papers. Contributions are welcomed on all aspects of program analysis analysis, including, but not limited to: </p>\n<p>* Abstract interpretation <br>\n    * Automated deduction <br>\n    * Data flow analysis <br>\n    * Debugging techniques <br>\n    * Deductive methods <br>\n    * Emerging applications <br>\n    * Model-checking <br>\n    * Data science <br>\n    * Program optimizations and transformations <br>\n    * Program synthesis <br>\n    * Program verification <br>\n    * Machine learning and verification <br>\n    * Security analysis <br>\n    * Tool environments and architectures <br>\n    * Theoretical frameworks <br>\n    * Type checking <br>\n    * Distributed or networked systems </p>\n<p>All paper submissions will be judged on the basis of significance, relevance, correctness, originality, and clarity. </p>\n<p>Submission link: [ <a href=\"https://easychair.org/conferences/?conf=sas24\">https://easychair.org/conferences/?conf=sas24</a> | <a href=\"https://easychair.org/conferences/?conf=sas24\">https://easychair.org/conferences/?conf=sas24</a> ] </p>\n<p>We welcome regular papers as well as papers focusing on any of the following in the NEAT (New questions/areas, Experience, Announcement, Tool) category: </p>\n<p>* Well-motivated discussion of new questions or new areas. <br>\n    * Experience with static analysis tools, Industrial Reports, and Case Studies <br>\n    * Brief announcements of work in progress <br>\n    * Tool papers </p>\n<p>Submissions can address any programming paradigm, including concurrent, constraint, functional, imperative, logic, object-oriented, aspect, multi-core, distributed, and GPU programming. We do not impose a page limit for submitted papers but we encourage brevity as reviewers have a limited time that they can spend on each paper. With the exception of NEAT papers, all papers will follow a lightweight double-blind reviewing process. The identity of the authors for the NEAT papers will be therefore known to the reviewers. </p>\n<p>Papers must be written and presented in English. A submitted paper must describe original work and must not substantially overlap with papers that have been published or that are simultaneously submitted to a journal or a conference with refereed proceedings. </p>\n<p>All submitted papers will be judged on the basis of significance, relevance, correctness, originality, and clarity. The review process will include a rebuttal period where authors have the opportunity to respond to preliminary reviews on the paper. Radhia Cousot Award </p>\n<p>The program committee will select an accepted regular paper for the Radhia Cousot Young Researcher Best Paper Award in memory of Radhia Cousot and her fundamental contributions to static analysis, as well as being one of the main promoters and organizers of the SAS series of conferences. Artifacts </p>\n<p>As in previous years, we encourage authors to submit a virtual machine image containing any artifacts and evaluations presented in the paper. Artifact submission is optional. Artifact evaluation will be concurrent with paper review. For more details, please visit the [ <a href=\"https://2024.splashcon.org/track/sas-2024-artifacts\">https://2024.splashcon.org/track/sas-2024-artifacts</a> | SAS 2024 Artifacts ] page. Submission Details <br>\nLightweight Double-Blind Requirement </p>\n<p>All regular papers will follow a double-blind process, where author names and affiliations are hidden for initial review. Author names will be revealed to a reviewer only after their review has been submitted. To facilitate this process, submitted regular papers must adhere to the following: (1) Author names and affiliations must be omitted and (2) References to the authors’ own related work should be in the third person (e.g., not “We build on our previous work …” but rather “We build on the work of …”). The purpose of this process is to help the reviewers come to an initial judgment about the paper without bias, not to make it impossible for them to discover the authors if they were to try. Nothing should be done in the name of anonymity that weakens the submission, makes the job of reviewing the paper more difficult, or interferes with the process of disseminating new ideas. For example, important background references should not be omitted or anonymized, even if they are written by the same authors and share common ideas, techniques, or infrastructure. Authors should feel free to disseminate their ideas or draft versions of their papers as they normally would. For instance, authors may post drafts of their papers on the web or give talks on their research ideas. NEAT Papers Content </p>\n<p>New problems papers are an opportunity to discuss visions, challenges, experiences, problems, and impactful solutions in the field of static analysis from both a research and applications perspective. Such papers are encouraged to take assertive positions and be forward-looking and aim for lively and insightful discussions that are influential to future research directions in static analysis. NEAT papers will be handled in singe-blind way. User experience &amp; Industrial reports &amp; Case studies papers describe the use of static analysis in industrial settings or in any chosen application domains. Papers in this category do not necessarily need to present original research results but are expected to contain applications of static analysis as well as a comprehensive evaluation in the chosen application domain. Such papers are encouraged to discuss the unique challenges of transferring research ideas to a real-world setting, reflect on any lessons learned from this technology transfer experience, and compare experiences with different analyzers highlighting their strengths and weaknesses. Brief announcements of work in progress papers may describe work in progress. A submission that is not selected for regular presentation may be invited for a brief announcement. Submission Guidelines </p>\n<p>The SAS 2024 proceedings will be published by Springer in their LNCS series. Authors should consult [ <a href=\"https://www.springer.com/gp/computer-science/lncs/conference-proceedings-guidelines\">https://www.springer.com/gp/computer-science/lncs/conference-proceedings-guidelines</a> | Springer’s authors’ guidelines ] and use their proceedings templates, for LaTeX, Overleaf, or Word, for the preparation of their papers. The corresponding author of each accepted paper, acting on behalf of all of the authors of that paper, must complete and sign a Consent-to-Publish form. The corresponding author signing the copyright form should match the corresponding author marked on the paper. Once the files have been sent to Springer, changes relating to the authorship of the papers cannot be made. Organizing Committee </p>\n<p>Chair : Roberto Giacobazzi, University of Arizona <br>\nCo-Chair : Alessandra Gorla, IMDEA Software Institute <br>\nArtifact Evaluation Chair : Marco Campion, INRIA &amp; École Normale Supérieure | Université PSL Program Committee </p>\n<p>Matthew Amy, Simon Fraser University <br>\nSteven Arzt, Fraunhofer SIT <br>\nPaolo Baldan, University of Padova <br>\nSébastien Bardin, CEA LIST, University Paris-Saclay <br>\nRoberto Bruni, University of Pisa <br>\nLiqian Chen, National University of Defense Technology <br>\nDavid Delmas, Airbus <br>\nElizabeth Dinella, University of Pennsylvania <br>\nAntonio Filieri, AWS and Imperial College London <br>\nKihong Heo, KAIST <br>\nAnastasia Isychev, Vienna University of Technology (TU Wien) <br>\nFranjo Ivancic, Google <br>\nFrancesco Logozzo, Facebook <br>\nAna Milanova, Rensselaer Polytechnic Institute <br>\nJosé Morales, IMDEA Software Institute <br>\nKedar Namjoshi, Nokia Bell Labs <br>\nJorge A. Navas, Certora <br>\nOded Padon, VMware Research <br>\nMichele Pasqua, University of Verona <br>\nXavier Rival, Inria <br>\nFrancesca Scozzari, University of Chieti-Pescara <br>\nGagandeep Singh, University of Illinois at Urbana-Champaign <br>\nIlina Stoilkovska, Amazon <br>\nAditya V. Thakur, University of California at Davis <br>\nArnaud Venet, Facebook <br>\nEnea Zaffanella, University of Parma <br>\nQirun Zhang, Georgia Institute of Technology</p>",
        "id": 434031456,
        "sender_full_name": "Email Gateway",
        "timestamp": 1713442037
    }
]