[
    {
        "content": "<p>From: Peter Gammie &lt;<a href=\"mailto:peteg42@gmail.com\">peteg42@gmail.com</a>&gt;<br>\nHi,</p>\n<p>I’m a bit surprised that the cartouches don’t seem to know about facts arising from the <code>subgoal</code> construct. Here’s an example:</p>\n<p>lemma \"mono id\"<br>\napply (rule monoI)<br>\nsubgoal for x y<br>\nusing arg_cong[OF ‹x ≤ y›]</p>\n<p>Using a recent (unmentionable on this mailing list) version of Isabelle, I get:</p>\n<p>Failed to retrieve literal fact⌂:<br>\nx ≤ y</p>\n<p>The motivation for this is that a tool I’m using wants to have such facts passed in explicitly, i.e. it wants</p>\n<p>apply (method ‹x ≤ y›)</p>\n<p>I think this is the right UI for it; like <code>subst</code> it is a precise and low-level method, and so shouldn’t pick up arbitrary hypotheses from the goal or other contexts.</p>\n<p>Can we change the behavior of <code>subgoal</code> or log this behavior somewhere?</p>\n<p>cheers,<br>\npeter</p>",
        "id": 213088181,
        "sender_full_name": "Email Gateway",
        "timestamp": 1602538049
    },
    {
        "content": "<p>From: Andreas Lochbihler &lt;<a href=\"mailto:mail@andreas-lochbihler.de\">mail@andreas-lochbihler.de</a>&gt;<br>\nHi Peter,</p>\n<p><code>subgoal for x y</code> only brings the universal quantifiers into the context, but it leaves <br>\nthe premises in the goal state. Therefore, they're not available as facts to be referenced <br>\nfrom Isar. However, if you use <code>subgoal premises prems for x y</code> then all premises of the <br>\ngoal state are assumed and you can retrieve them with cartouches. Accordingly, they <br>\ndisappear from the goal state. If you still need them for your method calls to be there, <br>\nyou can re-insert them with <code>using prems</code> as usual.</p>\n<p>Best,<br>\nAndreas</p>",
        "id": 213113752,
        "sender_full_name": "Email Gateway",
        "timestamp": 1602567315
    },
    {
        "content": "<p>From: Peter Gammie &lt;<a href=\"mailto:peteg42@gmail.com\">peteg42@gmail.com</a>&gt;<br>\nThanks Andreas. I see now that it’s well documented in Sec 7.2 of the Isar reference manual. Sorry for the noise.</p>\n<p>cheers,<br>\npeter</p>",
        "id": 213673427,
        "sender_full_name": "Email Gateway",
        "timestamp": 1602973188
    }
]