[
    {
        "content": "<p>From: Ian Hayes &lt;<a href=\"mailto:Ian.Hayes@uq.edu.au\">Ian.Hayes@uq.edu.au</a>&gt;<br>\nWe are trying to use/adapt the HOL/Hoare_Parallel theories, in <br>\nparticular, RG_Syntax.<br>\nIn those theories the state of a program is represented by a record.<br>\nA common requirement is for a relation that says that only the x field <br>\nof the state changes<br>\ni.e. all other fields remain the same.<br>\nIf one only has two fields x and y, one can just explicitly say, y after <br>\n= y before,<br>\nbut if there are many fields this become tedious.<br>\nMoreover we would like it to be generic and given an arbitrary record <br>\ntype that has a field x<br>\nsays that all fields other than x should be unchanged.<br>\nOr more generally, given a set of field names X, all fields other than <br>\nthose in X do not change.</p>\n<p>Can anyone give us pointers as to how to approach this?<br>\nFor example, do records have any way of getting the names of the fields <br>\nof a record?<br>\nOr the set of their accessor functions?</p>\n<p>Thanks in advance<br>\nIan</p>",
        "id": 425831410,
        "sender_full_name": "Email Gateway",
        "timestamp": 1710127844
    },
    {
        "content": "<p>From: Thomas Sewell &lt;<a href=\"mailto:tals4@cam.ac.uk\">tals4@cam.ac.uk</a>&gt;<br>\nHi Ian.</p>\n<p>This issue has been seen before. I once considered defining some special syntax for equality modulo some fields, and decided it wasn't quite worth it. Here are some options to consider.</p>\n<p>You could phrase your property about r1 and r2 as \"∃ x2. r2 = r1⦇ x := x2 ⦈\" (ASCII \"? x2. r2 = r1(| x := x2 |)\" in case something is wrong with unicode).</p>\n<p>That existential form should work well if it ever ends up in your assumptions. Then r2 will be rewritten into an explicit update of r1 throughout your goal, and the equalities for other fields will be proven automatically.</p>\n<p>To prove this goal, or any other kind of record equality, as a conclusion, you might want to make use of the \".equality\" theorem created by the record package, e.g. if your state record is called \"state\", have a look at \"state.equality\".</p>\n<p>For each field \"x\" of the record, the package creates an accessor constant (just called \"x\") and an updator called \"x_update\". If you want to try to define something generic for a list of field updates, you might want to try to define some combinator across the update functions.</p>\n<p>You can't enumerate all of the fields/accessors of a record as an Isabelle object, since they don't necessarily have the same type. You can fetch them all as syntax in ML code, if you want. Have a look at the interface in src/HOL/Tools/record.ML​ . I'm not sure how helpful that is, though.</p>\n<p>I hope at least one of those suggestions is useful.</p>\n<p>More broadly, I think that it's a bug that the record package defines an accessor constant with the same name as the field. We don't really want a collection of constants with names like \"x\" living in the global context and conflicting with variable names. I think that there should be a single constant defined with a name like \"x_field\", and both the accessor and updator syntax should derive from that. There are some other advantages to having a single field constant, for instance, various proofs about field updates want to use field access to pick the obvious witness value, but in the current setup this requires code or user input to relate \"x_update\" to \"x\".</p>\n<p>Good luck with it,<br>\n    Thomas.</p>",
        "id": 425861629,
        "sender_full_name": "Email Gateway",
        "timestamp": 1710147112
    },
    {
        "content": "<p>From: Alex Shkotin &lt;<a href=\"mailto:alex.shkotin@gmail.com\">alex.shkotin@gmail.com</a>&gt;<br>\nHi Ian</p>\n<p>Just in addition: consider using any kind of macro processing to simplify a<br>\ntedious work.</p>\n<p>Alex</p>\n<p>пн, 11 мар. 2024 г. в 06:30, Ian Hayes &lt;<a href=\"mailto:Ian.Hayes@uq.edu.au\">Ian.Hayes@uq.edu.au</a>&gt;:</p>",
        "id": 425866929,
        "sender_full_name": "Email Gateway",
        "timestamp": 1710148772
    }
]