[
    {
        "content": "<p>From: Haniel Barbosa &lt;<a href=\"mailto:hbarbosa@dcc.ufmg.br\">hbarbosa@dcc.ufmg.br</a>&gt;<br>\n[Apologies for multiple copies]</p>\n<hr>\n<p>SECOND CALL FOR PAPERS</p>\n<p>CADE-29: 29th international Conference on Automated Deduction</p>\n<p>Sapienza University of Rome<br>\n                 Rome, Italy, 1-5 July 2023</p>\n<p><a href=\"https://easyconferences.eu/cade2023\">https://easyconferences.eu/cade2023</a></p>\n<hr>\n<p>-- Overview --</p>\n<p>CADE is the major international forum for presenting research on all aspects of<br>\nautomated deduction. High-quality submissions on the general topic of automated<br>\ndeduction, including logical foundations, theory and principles, applications in<br>\nand beyond computer science and mathematics, and implementations of automated<br>\nreasoning systems are solicited. CADE-29 aims to present research that reflects<br>\nthe broad range of interesting and relevant topics in automated deduction.</p>\n<p>CADE-29 is in cooperation with ACM SIGLOG.</p>\n<p>-- Venue --</p>\n<p>CADE-29 and affiliated satellite events will take place in Rome, Italy and will<br>\nbe co-located with FSCD 2023.</p>\n<p>-- Publication --</p>\n<p>CADE-29 proceedings will be published in Springer's Lecture Notes in Artificial<br>\nIntelligence series in Gold Open Access mode at a CADE special rate of €200.00<br>\nper paper. Funding will be available for authors of accepted papers who cannot<br>\ncover the €200 fee.</p>\n<p>-- Special Issue --</p>\n<p>The authors of a selection of the best CADE-29 papers will be invited to submit<br>\nan extended version of their paper after the conference, to be published in a<br>\nspecial issue of the Journal of Automated Reasoning.</p>\n<p>-- Submission Guidelines --</p>\n<p>Submissions can be made in two categories:</p>\n<ul>\n<li>\n<p><strong>Regular papers</strong>. Up to 15 pages in LNCS style, excluding references. Proofs<br>\n    of theoretical results that do not fit in the page limit may be provided in<br>\n    an appendix.</p>\n</li>\n<li>\n<p><strong>Short papers</strong>. This includes system descriptions, user experiences, case<br>\n    studies and domain models. Up to 10 pages in LNCS style, excluding<br>\n    references.</p>\n</li>\n</ul>\n<p>Reviewers may consider material provided in appendices, but submissions must be<br>\nself-contained within the page limit. Submissions must be unpublished and not<br>\nsubmitted for publication elsewhere. They will be judged on relevance,<br>\noriginality, significance, correctness, and readability. If software or data is<br>\nrelevant to a paper, a link that provides access to the software/data must be<br>\nprovided to enable reproduction of results.</p>\n<p>The review process will include a feedback/rebuttal period where authors will<br>\nhave the option to respond to reviewer comments. The PC chairs may solicit<br>\nfurther reviews after the rebuttal period. Selected accepted papers will be<br>\nconsidered by Program Committee for the CADE Best Paper Award.</p>\n<p>Papers must be submitted to <a href=\"https://easychair.org/conferences/?conf=cade29\">https://easychair.org/conferences/?conf=cade29</a></p>\n<p>All submission must be formatted in the LNCS style and must include the ORCID id<br>\nof at least the corresponding author, and preferably of all authors.</p>\n<p>-- Important Dates --</p>\n<p>Abstract deadline:      February 27, 2023<br>\nSubmission deadline:    March 6, 2023<br>\nRebuttal phase:         April 18-20, 2023<br>\nNotification:           May 3, 2023<br>\nFinal version:          May 24, 2023<br>\nMain Conference:        July 1-4, 2023<br>\nSatellite events:       July 4-5, 2023</p>\n<p>-- Program Committee Chairs --<br>\nBrigitte Pientka, MacGill University<br>\nCesare Tinelli, The University of Iowa</p>\n<p>-- Policies--<br>\nCADE implements the ACM policy against harassment.</p>\n<p>-- Contacts --<br>\nAll questions about CADE-29 paper submissions should be emailed to the PC Chairs (cade29 at <a href=\"http://easychair.org\">easychair.org</a>).</p>",
        "id": 329450453,
        "sender_full_name": "Email Gateway",
        "timestamp": 1677078212
    }
]