[
    {
        "content": "<p>From: Andrei Popescu &lt;<a href=\"mailto:andrei.h.popescu@gmail.com\">andrei.h.popescu@gmail.com</a>&gt;<br>\n<em>Hybrid event: Alan Turing at 110 - and at Oxford!</em><br>\nThis hybrid talk celebrates the 110th anniversary of Alan Turing and also<br>\nexplores recent research on his connections with Oxford.<br>\nFurther information and free registration (online and at the BCS London<br>\noffice):<br>\n<a href=\"https://www.bcs.org/events-calendar/2022/june/hybrid-event-alan-turing-at-110-and-at-oxford/\">https://www.bcs.org/events-calendar/2022/june/hybrid-event-alan-turing-at-110-and-at-oxford/</a></p>\n<p>Speaker</p>\n<p>Jonathan Bowen, London South Bank University<br>\nAgenda</p>\n<p>17:15 - Physical and online networking for attendees<br>\n18:00 - Talk<br>\n19:00 - Questions<br>\n19:15-20:30 - Networking<br>\nSynopsis</p>\n<p>Alan Turing's centenary was widely celebrated in 2012. It is now 110 years<br>\nsince Turing's birth. This talk explores some developments with respect to<br>\nTuring, especially in the last decade. In particular, it presents some<br>\nrecent research on Turing's connections with Oxford, the speaker's home<br>\ncity.</p>\n<p>Turing is well-known for his work at Cambridge, Bletchley Park, and<br>\nManchester, but there has been little evidence of his visiting Oxford.<br>\nTuring arguably wrote the first formal methods paper on program proving and<br>\nmuch later Oxford has been a major research hub for formal methods,<br>\ninitially through the leadership of Christopher Strachey, a colleague of<br>\nTuring at Manchester, and the founder of the Programming Research Group at<br>\nOxford.<br>\nAbout the speaker</p>\n<p>Jonathan Bowen, FBCS FRSA, is an Emeritus Professor at London South Bank<br>\nUniversity, where he was Professor of Computing from 2000, and Chairman of<br>\nMuseophile Limited in Oxford (founded in 2002).</p>\n<p>His main research interest has been in formal methods, especially the Z<br>\nnotation, but with wider computer science interests in software engineering<br>\nand the history of computing.</p>\n<p>He has held previous positions at Imperial College London, the Programming<br>\nResearch Group at the Oxford University Computing Laboratory, and the<br>\nUniversity of Reading. Starting in 2002, he has been Chair of the BCS-FACS<br>\nSpecialist Group. He co-organized a centenary celebration for Alan Turing<br>\nat Oxford in 2012 and his books include \"The Turing Guide\" (Oxford<br>\nUniversity Press, 2017). He is a Life Fellow of the BCS and the Royal<br>\nSociety of Arts.</p>\n<p>Jonathan Bowen's personal page &lt;<a href=\"https://sites.google.com/site/jpbowen/\">https://sites.google.com/site/jpbowen/</a>&gt;</p>\n<p>Article: \"Alan Turing and Oxford<br>\n&lt;<a href=\"https://www.computerconservationsociety.org/resurrection/res97.htm#e\">https://www.computerconservationsociety.org/resurrection/res97.htm#e</a>&gt;\".<br>\nResurrection: The Journal of the Computing Conservation Society, No. 97,<br>\npp. 11-18, Spring 2022.</p>",
        "id": 280817663,
        "sender_full_name": "Email Gateway",
        "timestamp": 1651444383
    }
]