[
    {
        "content": "<p>From: Mark Batty &lt;<a href=\"mailto:mbatty@cantab.net\">mbatty@cantab.net</a>&gt;<br>\nApply in either of these places:<br>\n<a href=\"https://www.jobs.ac.uk/job/DBV331/research-associate-cems-236-23\">https://www.jobs.ac.uk/job/DBV331/research-associate-cems-236-23</a><br>\n<a href=\"https://jobs.kent.ac.uk/Vacancy.aspx?ref=CEMS-236-23\">https://jobs.kent.ac.uk/Vacancy.aspx?ref=CEMS-236-23</a></p>\n<p>Salary: £36,386 to £40,931<br>\nContract Type: Fixed Term - 36 months<br>\nDeadline: 4th September</p>\n<p>The School of Computing at Kent in the UK wishes to appoint a qualified and<br>\nhighly motivated researcher to work as a Research Associate. This 36 month<br>\npost is funded by two grants led by Professor Mark Batty (<br>\n<a href=\"mailto:m.j.batty@kent.ac.uk\">m.j.batty@kent.ac.uk</a>): Transparent pointer safety: Rust to Lua to OS<br>\nComponents from Innovate UK and Safe and secure COncurrent programming for<br>\nadVancEd aRchiTectures (COVERT) from the EPSRC. This project is in<br>\npartnership with Sheffield and Surrey.</p>\n<p>Applicants should have a strong mathematical background and knowledge of<br>\nhow to reason about systems. This must be evidenced by high-quality<br>\nresearch publications or artifacts in programming languages, formal<br>\nverification, distributed systems, security, or computer architecture.<br>\nExperience in hand proof, mechanised theorem proving tools (i.e.<br>\nIsabelle/HOL, Coq, or similar) or familiarity with model checkers and SMT<br>\nsolvers is highly desirable.</p>\n<p>As Research Associate you will:</p>\n<ol>\n<li>\n<p>develop formal models for the expression of the behaviours of advanced<br>\narchitectures,</p>\n</li>\n<li>\n<p>develop reasoning techniques (proof, mechanical proof, model checking,<br>\nautomated tools) for proving properties about these systems, and</p>\n</li>\n<li>\n<p>apply these techniques to establish system properties including memory<br>\nsafety, security properties and functional correctness.</p>\n</li>\n</ol>\n<p>To be successful in this role you will:</p>\n<ol>\n<li>\n<p>have or be about to complete a PhD in a relevant discipline, or<br>\nequivalent professional experience,</p>\n</li>\n<li>\n<p>have a track record of peer-reviewed publications at scientific<br>\nworkshops, competitions, conferences or journals, and</p>\n</li>\n<li>\n<p>have excellent mathematical skills relevant to analysing computer-system<br>\nbehaviour.</p>\n</li>\n</ol>\n<p>The university of Kent is walking distance from the charming historic city<br>\nof Canterbury, it has a high speed connection to London, and travel to<br>\nEurope is convenient by rail or car.</p>",
        "id": 386394223,
        "sender_full_name": "Email Gateway",
        "timestamp": 1692625376
    }
]