[
    {
        "content": "<p>From: Ian Hayes &lt;<a href=\"mailto:Ian.Hayes@uq.edu.au\">Ian.Hayes@uq.edu.au</a>&gt;<br>\nWe have a set of theory files that load into the JEdit version of <br>\nIsabelle/HOL with no problem but when we try to do the command line <br>\nbuild of the files, it fails with a \"Failed to meet type constraint\" error.</p>\n<p>To further confuse the issue it fails under the Windows version of <br>\nIsabelle/HOL but is fine under the Linux version running under WSL.</p>\n<p>To even further confuse the issue it fails on a very old MacBook* <br>\n(HighSierra) but is fine under a new MacBook M1 Pro (Ventura) and a <br>\nIntel iMac (Ventura).</p>\n<p>Is this a bug in Isabelle/HOL or is there really a problem with our <br>\ntheory files?</p>\n<p>Does anyone have an idea of why the behaviour is inconsistent between <br>\nJEdit and command line build?</p>\n<p>Thanks in advance<br>\nIan Hayes</p>\n<ul>\n<li>So old that we cannot upgrade the OS.</li>\n</ul>",
        "id": 358891970,
        "sender_full_name": "Email Gateway",
        "timestamp": 1684298180
    },
    {
        "content": "<p>From: Manuel Eberl &lt;<a href=\"mailto:manuel@pruvisto.org\">manuel@pruvisto.org</a>&gt;<br>\nHello,</p>\n<p>others on this list (e.g. Makarius, presumably) will probably be more <br>\nqualified to comment on your problem as such. But I'm happy to take a <br>\nfew stabs in the dark.</p>\n<p>Firstly, I'd just like to point out that it would probably be <br>\ntremendously helpful to anyone investigating this if you could provide a <br>\nminimum (non-)working example.</p>\n<p>And, just to clarify what exactly you are experiencing: What you are <br>\nsaying is that building it in Isabelle/JEdit works *always and <br>\neverywhere*, whereas building it with \"isabelle build\" <em>consistently</em> <br>\nfails on Windows and an old Macbook but <em>consistently</em> works on Linux, <br>\nWSL, and a new MacBook?</p>\n<p>In any case: what architecture are you using? x86_64_32, x86_64, ARM? <br>\nThe \"new Macbook vs old Macbook\" sounds like it could be an x86 vs ARM <br>\nissue (although that does not explain the Windows vs. Linux/WSL issue). <br>\nHave you tried switching to a different architecture? Have you tried <br>\nswitching \"isabelle build\" to single-threaded? Have you tried isolating <br>\nthe problematic segment of the relevant theory file and building that alone?</p>\n<p>Okay, so here are some thoughts/theories:</p>\n<ol>\n<li>I recall that I personally had reproducibility issues with Isabelle <br>\ntwo times. The first time it was a Poly/ML bug (a race condition in the <br>\nML runtime) that only manifested on Linux and only on some of the <br>\ncomputers I tested it on and only with hyperthreading enabled and even <br>\nthen only sometimes. The second time it was a student who had <br>\noverclocked his system a bit too eagerly (everything worked fine, <br>\nincluding all normal stability tests, but Isabelle was too much for his <br>\npoor CPU).</li>\n</ol>\n<p>But in both cases what I got was a crash and not a \"type error\", and it <br>\nseems unlikely that an issue like this would cause something oddly <br>\nspecific like that. I doubt that a hardware defect is the cause in your <br>\ncase, but a threading issue is at least somewhat plausible.</p>\n<ol start=\"2\">\n<li>\n<p>Your problem also reminds me of some reproducibility issues Peter <br>\nLammich had a few years ago with interactive build vs batch build that <br>\nboiled down to some multithreading issues. As I recall, some tactics <br>\nbehaved differently with and without parallelism enabled, which caused <br>\nsome schematic variables to be instantiated in different orders, thus <br>\nleading to a different result. I'm not sure if your issue could <br>\nsomething similar.</p>\n</li>\n<li>\n<p>I heard of that there are some \"non-official\" packaged versions of <br>\nIsabelle in various package managers which replace Isabelle's bundled <br>\nversions of various libraries and components with packaged versions <br>\n(presumably to save disc space/make the download smaller). That can of <br>\ncourse cause all kinds of issues and is therefore heavily discouraged. <br>\nBut since you mentioned Windows being affected, I doubt that this is <br>\nwhat is going on (I think this typically is more of a Linux/Mac thing).</p>\n</li>\n<li>\n<p>This is a real long shot but I'm mentioning it anyway just to be <br>\nsure: I have seen all kinds of bizarre problems on Windows being caused <br>\nby third-party antivirus software like Kaspersky, McAfee, etc. Not <br>\nIsabelle-related and usually more in the sense of something crashing <br>\nrather than a \"semantic\" error like yours, but still – it might be worth <br>\na shot to try and disable any antivirus software you might have (Windows <br>\nDefender should be fine). Wouldn't explain the Mac issue though.</p>\n</li>\n</ol>\n<p>Cheers,</p>\n<p>Manuel</p>",
        "id": 358921223,
        "sender_full_name": "Email Gateway",
        "timestamp": 1684312184
    },
    {
        "content": "<p>From: Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt;<br>\n(I am presently busy with other things, but will come back to this thread later.)</p>\n<p>Just a quick comment: Old Apple hardware works nicely and smoothly with Linux <br>\n--- sometimes Ubuntu Mate is easier to install than regular Ubuntu, with all <br>\nhardware drivers working immediately. I've recently refurbished several old <br>\nmachines. Policies by Apple regarding macOS can be safely ignored.</p>\n<p>In any case, you do need min. 8 GB RAM for Isabelle applications, better 16 GB.</p>\n<p>Makarius</p>",
        "id": 358958879,
        "sender_full_name": "Email Gateway",
        "timestamp": 1684323082
    },
    {
        "content": "<p>From: Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt;<br>\njEdit is just a Java-based text editor --- you mean Isabelle/PIDE with the <br>\nIsabelle/jEdit front-end: That is a very complex interactive computer-game for <br>\ndevelopment of theories and proofs.</p>\n<p>Many fine points differ in the interactive game vs. a batch-build via <br>\n\"isabelle build\". The latter counts as authentic, the former only as an <br>\napproximation.</p>\n<p>Both use shared-memory multiprocessing by default: In very rare corner cases <br>\nthat can cause problems that don't show up with \"isabelle build threads=1\"</p>\n<p>Makarius</p>",
        "id": 359052404,
        "sender_full_name": "Email Gateway",
        "timestamp": 1684347721
    }
]