[
    {
        "content": "<p>From: Tobias Nipkow &lt;<a href=\"mailto:nipkow@in.tum.de\">nipkow@in.tum.de</a>&gt;<br>\nUniversal Pairs for Diophantine Equations</p>\n<p>Marco David, Théo André, Mathis Bouverot-Dupuis, Eva Brenner, Loïc Chevalier, <br>\nAnna Danilkin, Charlotte Dorneich, Kevin Lee , Xavier Pigé, Timothé Ringeard, <br>\nQuentin Vermande, Paul Wang, Annie Yao, Zhengkun Ye and Jonas Bayer</p>\n<p>We formalize a universal construction of Diophantine equations with bounded <br>\ncomplexity. This is a formalization of our own work in number theory.<br>\nHilbert's Tenth Problem was answered negatively by Yuri Matiyasevich, who showed <br>\nthat there is no general algorithm to decide whether an arbitrary Diophantine <br>\nequation has a solution. However, the problem remains open when generalized to <br>\nthe field of rational numbers, or contrarily, when restricted to Diophantine <br>\nequations with bounded complexity, characterized by the number of variables<br>\nv and the degree d. If every Diophantine set can be represented within the <br>\nbounds (v,d), we say that this pair is universal, and it follows that the <br>\ncorresponding class of equations is undecidable. In a separate mathematics <br>\narticle, we have determined the first non-trivial universal pair for the case of <br>\ninteger unknowns.</p>\n<p>This AFP entry contributes the main construction required to establish said <br>\nuniversal pair. In doing so, we markedly extend previous work on multivariate <br>\npolynomials, and develop classical theory on Diophantine equations. <br>\nAdditionally, our work includes metaprogramming infrastructure designed to <br>\nefficiently handle complex definitions of multivariate polynomials. Our <br>\nmathematical draft has been formalized while the mathematical research was <br>\nongoing, and benefitted largely from the help of the theorem prover.</p>\n<p><a href=\"https://www.isa-afp.org/entries/Diophantine_Universal_Pairs.html\">https://www.isa-afp.org/entries/Diophantine_Universal_Pairs.html</a></p>\n<p>Wow! At the very least I think it wins the prize for the largest number of <br>\nauthors of any AFP entry ;-)</p>\n<p>Tobias</p>\n<p><a href=\"/user_uploads/14278/q1WvD9UZy7Oc_y6UqCAF9c7s/smime.p7s\">smime.p7s</a></p>",
        "id": 531675932,
        "sender_full_name": "Email Gateway",
        "timestamp": 1753814167
    }
]