[
    {
        "content": "<p>From: Alexander Pretschner &lt;<a href=\"mailto:alexander.pretschner@tum.de\">alexander.pretschner@tum.de</a>&gt;<br>\nCALL FOR PARTICIPATION</p>\n<p>MARKTOBERDORF INTERNATIONAL SUMMER SCHOOL ON ENGINEERING SECURE AND<br>\nDEPENDABLE SOFTWARE SYSTEMS</p>\n<p>August 6th - August 17th, 2024, Herrsching am Ammersee, Germany</p>\n<p>&lt;<a href=\"http://marktoberdorf.fortiss.org\">http://marktoberdorf.fortiss.org</a>&gt; <a href=\"http://marktoberdorf.fortiss.org\">http://marktoberdorf.fortiss.org</a> </p>\n<p>Organized by fortiss,  &lt;<a href=\"https://www.fortiss.org/en/\">https://www.fortiss.org/en/</a>&gt;<br>\n<a href=\"https://www.fortiss.org/en/\">https://www.fortiss.org/en/</a> </p>\n<p>*** APPLY ONLINE ON OR BEFORE MAY 5th:<br>\n&lt;<a href=\"https://sites.google.com/view/marktoberdorf2024/participation\">https://sites.google.com/view/marktoberdorf2024/participation</a>&gt;<br>\n<a href=\"https://sites.google.com/view/marktoberdorf2024/participation\">https://sites.google.com/view/marktoberdorf2024/participation</a> ***</p>\n<p>*** Lectures, see  &lt;<a href=\"https://sites.google.com/view/marktoberdorf2024/talks\">https://sites.google.com/view/marktoberdorf2024/talks</a>&gt;<br>\n<a href=\"https://sites.google.com/view/marktoberdorf2024/talks\">https://sites.google.com/view/marktoberdorf2024/talks</a> ***</p>\n<p>Cristian Cadar, Imperial College London: Introduction to Dynamic Symbolic<br>\nExecution and KLEE</p>\n<p>Marsha Chechik, University of Toronto: Elicitation and Formal Reasoning<br>\nabout Normative Requirements</p>\n<p>Sumit Gulwani, Microsoft, Redmond: AI-assisted Programming: Applications,<br>\nExperiences, and Neuro-symbolic techniques</p>\n<p>Xiaowei Huang, Liverpool University: tba</p>\n<p>Laura Kovacs, TU Wien: First-Order Theorem Proving</p>\n<p>Rustan Leino, Amazon Web Services: Induction in deductive reasoning</p>\n<p>Anders Möller, Aarhus University: Static Program Analysis</p>\n<p>Peter Müller, ETH Zurich: Ownership in Program Verification - From<br>\nSeparation Logic to Rust and Back</p>\n<p>Frank Piessens, KU Leuven: Software security across abstraction layers</p>\n<p>Alexander Pretschner, TU München and fortiss: Scenario-Based Tests for<br>\nCyber-Physical Systems</p>\n<p>Zach Tatlock, University of Washington: tba</p>\n<p>Cesare Tinelli, University of Iowa: Modeling and analyzing reactive systems<br>\nwith logic-based symbolic model checkers</p>\n<p><strong>* Objective </strong>*</p>\n<p>Almost all modern technical systems rely crucially on software.<br>\nCommunication, transportation, financial services, healthcare, power supply,<br>\nmilitary defense, and many other aspects of modern societies require<br>\nsoftware systems that are both safe and secure. Safe software behaves<br>\naccording to its specification and, in particular, avoids hazards for the<br>\nenvironment it is used in. Secure software ensures the confidentiality,<br>\nintegrity, and availability of data, even when a system is attacked by an<br>\nadversary. Both safety and security violations potentially cause<br>\nconsiderable economic, political, and physical damage. So, improving our<br>\nunderstanding of safety and security and, thereby, enhancing our ability to<br>\nconstruct safe and secure systems is a vital challenge for our society.</p>\n<p>The lectures in this summer school give an overview of the state of the art<br>\nin the construction and analysis of safe and secure systems. Starting from<br>\nthe logical and semantic foundations that enable reasoning about classical<br>\nsoftware systems, they extend to the development and verification of<br>\ncyber-physical systems, which tightly combine computational and physical<br>\ncomponents, and have become pervasive in aerospace, automotive, industry<br>\nautomation, and consumer appliances. Safety and security have traditionally<br>\nbeen considered separate; however, several lectures in this summer school<br>\nwill emphasize their commonalities and present analysis and construction<br>\ntechniques that apply to both.</p>\n<p><strong>* Marktoberdorf Summer School </strong>*</p>\n<p>As a follow-up to the famous 1968 software engineering conference in<br>\nGarmisch-Partenkirchen, Professor F.L. Bauer from the Technical University<br>\nof Munich co-organized the first Marktoberdorf Summer School in 1970. We are<br>\nhappy to announce the 42nd edition of the most prestigious summer school on<br>\nsoftware engineering in 2024.</p>\n<p><a href=\"/user_uploads/14278/HKak_uVPjszQUALIs191sCC8/smime.p7s\">smime.p7s</a></p>",
        "id": 431546675,
        "sender_full_name": "Email Gateway",
        "timestamp": 1712329597
    }
]