[
    {
        "content": "<p>From: Steve Schneider &lt;<a href=\"mailto:cl-isabelle-users@lists.cam.ac.uk\">cl-isabelle-users@lists.cam.ac.uk</a>&gt;<br>\nSenior Lecturer in Cyber Security<br>\nSalary  57,422 to 68,529 GBP</p>\n<p><a href=\"https://jobs.surrey.ac.uk/vacancy.aspx?ref=009325\">https://jobs.surrey.ac.uk/vacancy.aspx?ref=009325</a></p>\n<p>Lecturer in Cyber Security</p>\n<p>Salary 46,735 to 55,755 GBP</p>\n<p><a href=\"https://jobs.surrey.ac.uk/vacancy.aspx?ref=009425\">https://jobs.surrey.ac.uk/vacancy.aspx?ref=009425</a></p>\n<p>Closing Date:   Wednesday 12 March 2025</p>\n<p>The School of Computer Science and Electronic Engineering at the University of Surrey, UK is seeking to recruit a full-time Senior Lecturer and a full-time Lecturer in Cyber Security to expand our team of dynamic and highly skilled security researchers. It is part of a strategic investment in cyber security.</p>\n<p>The Surrey Centre for Cyber Security (SCCS), within the School, has an international reputation in cyber security and resilience, with research excellence in applied and post-quantum cryptography, security verification and analysis, security and privacy, distributed systems, and networked systems. SCCS is recognised by the National Cyber Security Centre as an Academic Centre of Excellence for Cyber Security Research and Education. Surrey was recognised as Cyber University of the Year 2023 at the National Cyber Awards.</p>\n<p>Informal inquiries can be directed to the Director of the Computer Science Research Centre, Professor Steve Schneider at s.schneider@surrey.ac.uk&lt;mailto:<a href=\"mailto:s.schneider@surrey.ac.uk\">s.schneider@surrey.ac.uk</a>&gt;.</p>\n<p>The full adverts, and application portal, are available at the links above.</p>\n<p>Our staff and students come from all over the world and we are proud of our friendly and inclusive culture. The University and the Department specifically are committed to building a culturally diverse organisation. Applications are strongly encouraged from female and minority candidates.</p>",
        "id": 499907873,
        "sender_full_name": "Email Gateway",
        "timestamp": 1739620308
    }
]