[
    {
        "content": "<p>From: Alexander Steen &lt;<a href=\"mailto:alexander.steen@uni-greifswald.de\">alexander.steen@uni-greifswald.de</a>&gt;<br>\nThe Jury of the Dov Gabbay Prize for Logic and Foundations is pleased to <br>\nannnounce that the 2023 Dov Gabbay Prize is awarded jointly to</p>\n<ul>\n<li>Dale Miller and Mirek Truszczynski *</li>\n</ul>\n<p>for their long-standing important contributions to the practice and <br>\ntheory of logic programming, theorem proving and related important <br>\nstrands in Computational Logic.</p>\n<p>Dale Miller (Inria-Saclay and LIX/Ecole Polytechnique, France) has done <br>\npioneering and agenda-setting research bringing together and advancing <br>\nlogical proof theory and computational logic in the areas of <br>\nhigher-order logic programming and higher-order theorem proving. His <br>\nresearch spans the full range from innovative foundational theory to the <br>\ndesign and implementation of state-of-the-art working systems.</p>\n<p>Mirek Truszczynski (University of Kentucky, USA) has done pioneering and <br>\nagenda-setting research in logic programming, non-monotonic reasoning, <br>\nanswer-set programming, and preference in computational choice, where <br>\nhis seminal contributions are widely recognized. His research has <br>\nsuccesfully run the gamut from mathematical foundations to industrial <br>\napplications.</p>\n<p>The Dov Gabbay Prize was instituted in 2022 by the Initiative for Logic <br>\nand Foundations on the occasion of Dov Gabbay's 77th birthday. Its <br>\nintent is to recognize outstanding inspirational contributions in logic <br>\nand foundations across the interdisciplinary range of activities in <br>\nGabbay’s work over the years.</p>\n<p>In response to a first call, the Jury has received a wide and diverse <br>\nrange of strong nominations of high-profile excellent candidates, which <br>\nresulted in extensive discussions. It was decided to focus in this first <br>\nround on research in Computational Logic that reflects primary interests <br>\nof Dov Gabbay.</p>\n<p>With the awards to follow in the years to come, the profile of the <br>\nGabbay Prize will be built up further: in particular, Philosophical <br>\nLogic and Mathematical Logic will be in focus in succeeding years. <br>\nFurther information on these and other matters regarding the Prize will <br>\nbe found in the next calls for proposals.</p>\n<p>Johan van Benthem, Christoph Benzmueller, Agata Ciabattoni, Laura <br>\nGiordano, Hannes Leitgeb, Philip Welch (chair)</p>\n<p>Further details on <a href=\"https://iloaf.org/dgp.html\">https://iloaf.org/dgp.html</a></p>",
        "id": 374493142,
        "sender_full_name": "Email Gateway",
        "timestamp": 1689140170
    }
]