[
    {
        "content": "<p>From: Burkhart Wolff &lt;<a href=\"mailto:cl-isabelle-users@lists.cam.ac.uk\">cl-isabelle-users@lists.cam.ac.uk</a>&gt;<br>\nDear all,</p>\n<p>We have funding for a Phd project situated at the University-Paris-Saclay,<br>\nassociated to the “Laboratory of Formal Methods” and the Institute for <br>\nTechnological Research, the IRT SystemX.<br>\n[The environment is fairly international, so this call explicitly addresses also<br>\n to non-french speaking candidats.]</p>\n<p>Title: Verifying Driving Strategies of Autonomous Cars</p>\n<p>Short Description: Modelling and Analysing Autonomous Vehicles (AV) <br>\nas a special case of Cyber-Physical Systems (CPS) is a challenge for <br>\nFormal Methods and therefore a field of active research. At present, <br>\nvalidations of safety properties of AVs were typically established by <br>\nsimulations. The objective of this thesis is to go beyond this approach <br>\nand to extend and improve an existing framework based on formal proof. <br>\nThe framework allows for the design and validation of AVs with (more) <br>\ncomplex dynamics, road topologies and partial occlusion of scene <br>\nperception. Formal proofs of safety properties in Isabelle/HOL are <br>\nexpected to considerably simplify the engineering cycle (reduction <br>\nof effort and costs), and to provide measurable and achievable safety <br>\ncriteria, together with a method for optimizing test plans.</p>\n<p>Further detailed information can be found here:<br>\nThis offer is further detailed here: <br>\n<a href=\"https://adum.fr/download.pl?tk=PyEJzvew7H224x1CFK9NkuYegmaKR21lCo9nT66NDcq8qnwsGdmVrud2WfD4xb5G\">https://adum.fr/download.pl?tk=PyEJzvew7H224x1CFK9NkuYegmaKR21lCo9nT66NDcq8qnwsGdmVrud2WfD4xb5G</a> </p>\n<p>Applicants should send a copy of their master diploma and a letter of motivation to<br>\n<a href=\"mailto:burkhart.wolff@universite-paris-saclay.fr\">burkhart.wolff@universite-paris-saclay.fr</a> &lt;mailto:<a href=\"mailto:burkhart.wolff@universite-paris-saclay.fr\">burkhart.wolff@universite-paris-saclay.fr</a>&gt;&gt; and <a href=\"mailto:paolo.crisafulli@irt-systemx.fr\">paolo.crisafulli@irt-systemx.fr</a> &lt;mailto:<a href=\"mailto:paolo.crisafulli@irt-systemx.fr\">paolo.crisafulli@irt-systemx.fr</a>&gt;:</p>",
        "id": 390933870,
        "sender_full_name": "Email Gateway",
        "timestamp": 1694699073
    }
]