[
    {
        "content": "<p>From: Paula Herber &lt;<a href=\"mailto:paula.herber@uni-muenster.de\">paula.herber@uni-muenster.de</a>&gt;</p>\n<hr>\n<p>VerifyThisVerification Competition 2024</p>\n<p>ANNOUNCEMENT AND CALL FOR PROBLEMS</p>\n<p>Competition to be held at ETAPS 2024</p>\n<p><a href=\"http://verifythis.ethz.ch\">http://verifythis.ethz.ch</a> &lt;<a href=\"http://verifythis.ethz.ch\">http://verifythis.ethz.ch</a>&gt;</p>\n<hr>\n<p>Get involved, even if you cannot participate in the competition: provide <br>\na challenge!</p>\n<p>IMPORTANT DATES</p>\n<p>Problems submission deadline: 15 December 2023</p>\n<p>Competition: 6 and 7 April 2024</p>\n<p>ABOUT THE COMPETITION</p>\n<p>VerifyThis2024 will take place as part of the European Joint Conferences <br>\non Theory and Practice of Software (ETAPS 2024) on 6 and 7 April 2019.</p>\n<p>It is the 12th event in the VerifyThis competition series.</p>\n<p>Information on previous events and participants can be found at <br>\n<a href=\"http://verifythis.ethz.ch\">http://verifythis.ethz.ch</a> &lt;<a href=\"http://verifythis.ethz.ch\">http://verifythis.ethz.ch</a>&gt;</p>\n<p>The aims of the competition are:</p>\n<ul>\n<li>\n<p>to bring together those interested in formal verification, and to <br>\nprovide an engaging, hands-on, and fun opportunity for discussion.</p>\n</li>\n<li>\n<p>to evaluate the usability of program verification techniques and tools.</p>\n</li>\n</ul>\n<p>The competition will offer a number of challenges presented in natural <br>\nlanguage. Participants have to formalize the requirements, implement a <br>\nsolution, and formally verify the implementation for adherence to the <br>\nspecification.</p>\n<p>There are no restrictions on the programming language and verification <br>\ntechnology used. Solutions will be judged for correctness, completeness <br>\nand elegance.</p>\n<p>CALL FOR PROBLEMS</p>\n<p>To be able to offer a broad and diverse set of verification challenges, <br>\nwe are collecting submissions of ideas for verification challenges and <br>\nproblems. We welcome both problems of academic interest as well as <br>\nchallenges based on themes that are relevant in industry.</p>\n<p>The competition proceeds in three rounds. In each round, participants <br>\nare given 60 - 120 minutes to implement and prove specified properties <br>\nof a given algorithm and/or data structure. They are free to use any <br>\nverification tools they choose. Challenges are typically concerned with <br>\nproving functional properties of the code in question (at least some <br>\npart of a challenge involves expressing and proving properties specific <br>\nto the algorithm/data structure in question). It is common for problems <br>\nto have multiple parts, e.g. to prove some basic properties first, <br>\nperhaps for a simplified case, and to progress to more-advanced goals.</p>\n<p>We are looking for problem submissions. If you have recently encountered <br>\nan interesting challenge in your work where formal techniques could be <br>\napplied, please don't hesitate to submit it. Typical challenges have <br>\nclear input-​output specifications and often incorporate one or more of <br>\nthe following: heap allocation, concurrency, arithmetic reasoning. A <br>\nchallenge usually describes a problem using natural language together <br>\nwith some pseudocode, and then provides a list of properties or <br>\n\"verification tasks\" of varied levels of difficulty. Contributors are <br>\nencouraged to look at the Archive of previous problems.</p>\n<p>An award will be given for any submission used in the competition. To <br>\navoid spoiling the competition for others, we ask that you keep the <br>\nsubject of your submission private. However, note that problem authors <br>\n<em>are</em> allowed to participate in the competition!</p>\n<p>Submissions should be sent by email to <a href=\"mailto:alex.summers@ubc.ca\">alex.summers@ubc.ca</a> and <br>\n<a href=\"mailto:paula.herber@uni-muenster.de\">paula.herber@uni-muenster.de</a>. The submission deadline is *December 15, <br>\n2023<em>. We look forward to receiving your ideas!</em></p>\n<p>*Submission Criteria:</p>\n<p>* A brief yet precise problem description, specifically identifying<br>\n    verification sub-​tasks.</p>\n<p>* A solution to the challenge is strongly encouraged, otherwise please<br>\n    provide a sketch of correctness.</p>\n<p>* The description document can use any reasonable format, including<br>\n    plain text or PDF.</p>\n<p>ORGANIZERS</p>\n<ul>\n<li>\n<p>Paula Herber, University of Münster, Germany</p>\n</li>\n<li>\n<p>Alexander J. Summers, University of British Columbia, Canada</p>\n</li>\n</ul>\n<p>STEERING COMMITTEE</p>\n<ul>\n<li>\n<p>Marieke Huisman, University of Twente, the Netherlands</p>\n</li>\n<li>\n<p>Rosemary Monahan, Maynooth University Maynooth, Ireland</p>\n</li>\n<li>\n<p>Peter Müller, ETH Zurich, Switzerland</p>\n</li>\n<li>\n<p>Mattias Ulbrich, Karlsruhe Institute of Technology, Germany</p>\n</li>\n</ul>\n<p>-- <br>\nProf. Dr. Paula Herber<br>\nEmbedded Systems Group<br>\nUniversity of Münster<br>\nComputer Science Department, FB 10<br>\nEinsteinstr. 62, D-48149 Münster, Germany<br>\nTel: +49 251 8332421<br>\n<a href=\"mailto:paula.herber@uni-muenster.de\">paula.herber@uni-muenster.de</a></p>\n<p>-- <br>\nProf. Dr. Paula Herber<br>\nEmbedded Systems Group<br>\nUniversity of Münster<br>\nComputer Science Department, FB 10<br>\nEinsteinstr. 62, D-48149 Münster, Germany<br>\nTel: +49 251 8332421<br>\n<a href=\"mailto:paula.herber@uni-muenster.de\">paula.herber@uni-muenster.de</a></p>",
        "id": 401178984,
        "sender_full_name": "Email Gateway",
        "timestamp": 1699543502
    }
]