[
    {
        "content": "<p>From: Aaron Tomb &lt;<a href=\"mailto:aarontomb@gmail.com\">aarontomb@gmail.com</a>&gt;<br>\n==========================================================<br>\nCALL FOR PAPERS<br>\nFTfJP 2023</p>\n<p>25th Workshop on Formal Techniques for Java-like Programs<br>\nJuly 18th, 2023, Seattle, WA, USA</p>\n<p><a href=\"https://2023.ecoop.org/track/ftfjp-2023\">https://2023.ecoop.org/track/ftfjp-2023</a><br>\n===========================================================</p>\n<p>=== Important Dates ===</p>\n<ul>\n<li>Paper submission: May 22nd, 2023 (AoE)</li>\n<li>Author notification: June 23rd, 2023 (AoE)</li>\n<li>Workshop date: July 18th, 2023 (co-located with ECOOP 2023)</li>\n</ul>\n<p>Deadlines expire at 23:59 anywhere on earth on the dates displayed above.<br>\nSubmission site: <a href=\"https://easychair.org/conferences/?conf=ftfjp2023\">https://easychair.org/conferences/?conf=ftfjp2023</a></p>\n<p>=== Objectives and Scope ===</p>\n<p>Formal techniques can help analyse programs, precisely describe program<br>\nbehaviour, and verify program properties. Modern programming languages<br>\nare interesting targets for formal techniques due to their ubiquity and<br>\nwide user base, stable and well-defined interfaces and platforms, and<br>\npowerful (but also complex) libraries. New languages and applications in<br>\nthis space are continually arising, resulting in new programming<br>\nlanguages (PL) research challenges.</p>\n<p>Work on formal techniques and tools and on the formal underpinnings of<br>\nprogramming languages themselves naturally complement each other. FTfJP<br>\nis an established workshop which has run annually since 1999 alongside<br>\nECOOP, with the goal of bringing together people working in both fields.</p>\n<p>The workshop has a broad PL theme. The most important criterion is that<br>\nsubmissions will generate interesting discussions within this community.<br>\nThe term “Java-like” is somewhat historic and should be interpreted<br>\nbroadly: FTfJP solicits and welcomes submissions relating to programming<br>\nlanguages in general, beyond Java, including submissions related to C#,<br>\nScala, and similar languages, and submissions on more general topics<br>\nthat may be relevant to such languages.</p>\n<p>Example topics of interest include:</p>\n<ul>\n<li>Language design and semantics</li>\n<li>Type systems</li>\n<li>Concurrency and new application domains</li>\n<li>Specification and verification of program properties</li>\n<li>Program analysis (static or dynamic)</li>\n<li>Program synthesis</li>\n<li>Security</li>\n<li>Pearls (programs or proofs)</li>\n</ul>\n<p>FTfJP welcomes submissions on technical contributions, case studies,<br>\nexperience reports, challenge proposals, and position papers.</p>\n<p>Webpages for previous workshops in this series are available at:<br>\n<a href=\"https://ftfjp.github.io/\">https://ftfjp.github.io/</a></p>\n<p>=== Paper Categories ===</p>\n<p>Contributions are sought in two categories:</p>\n<ul>\n<li>\n<p>Full Papers (6 pages, excluding references) present a technical<br>\n   contribution, case study, or detailed experience report. We welcome<br>\n   both complete and incomplete technical results; ongoing work is<br>\n   particularly welcome, provided it is substantial enough to stimulate<br>\n   interesting discussions.</p>\n</li>\n<li>\n<p>Short Papers (2 pages, excluding references) should advocate a<br>\n   promising research direction, or otherwise present a position likely<br>\n   to stimulate discussion at the workshop. We encourage, e.g.,<br>\n   established researchers to set out a personal vision, and beginning<br>\n   researchers to present a planned path to a Ph.D.</p>\n</li>\n</ul>\n<p>Both types of contributions will benefit from feedback received at the<br>\nworkshop. Submissions will be peer reviewed, and will be evaluated based<br>\non their clarity and their potential to generate interesting<br>\ndiscussions. Reviewing will be single blind, there is no need to<br>\nanonymize submissions.</p>\n<p>The format of the workshop encourages interaction. FTfJP is a forum in<br>\nwhich a wide range of people share their expertise, from experienced<br>\nresearchers to beginning PhD students.</p>\n<p>=== Submission Guidelines ===</p>\n<p>All submissions and reviews will be managed within EasyChair.<br>\nSubmissions should be made via</p>\n<p><a href=\"https://easychair.org/conferences/?conf=ftfjp2023\">https://easychair.org/conferences/?conf=ftfjp2023</a></p>\n<p>There is no need to indicate the paper category (long/short).</p>\n<p>Submissions should be in acmart/sigplan style, 10pt font. Formatting<br>\nrequirements are detailed on the SIGPLAN Author Information page<br>\n(<a href=\"https://www.sigplan.org/Resources/Author\">https://www.sigplan.org/Resources/Author</a>).</p>\n<p>We plan that, as in previous years, accepted papers will be published in<br>\nthe ACM Digital Library, though authors will be able to opt out of this<br>\npublication, if desired. At least one author of an accepted paper must<br>\nregister to the conference by the early registration date and attend the<br>\nworkshop to present the work and participate in the discussions.</p>\n<p>Selected papers will also be considered for extended versions to be<br>\nsubmitted to the Journal of Object Technology (JOT).</p>",
        "id": 354650072,
        "sender_full_name": "Email Gateway",
        "timestamp": 1682849598
    }
]