[
    {
        "content": "<p>From: \"Rozier, Kristin-Yvonne [AER E]\" &lt;<a href=\"mailto:kyrozier@iastate.edu\">kyrozier@iastate.edu</a>&gt;<br>\n(apologies for multiple copies)</p>\n<p>======================================================================<br>\n  2023 Formal Methods in Computer-Aided Design (FMCAD): Student Forum<br>\n                   October 23-27, Ames, Iowa, USA</p>\n<p>Call for Student Contributions!</p>\n<p>======================================================================</p>\n<p>Please consider submitting or encouraging your students to submit to<br>\nthis year's FMCAD student forum. More information can be found here:</p>\n<p><a href=\"https://fmcad.org/FMCAD23/student_forum/\">https://fmcad.org/FMCAD23/student_forum/</a></p>\n<p>Student Forum<br>\nContinuing the tradition of the previous years, FMCAD 2023 is hosting<br>\na Student Forum that provides a platform for students at any career<br>\nstage (undergraduate or graduate) to introduce their research to the<br>\nwider Formal Methods community, and solicit feedback.</p>\n<p>Main Activities<br>\nEach student will give a short presentation and present their poster<br>\nin the poster session.</p>\n<p>Submissions for the event must be short reports describing research<br>\nideas or ongoing work that the student is currently pursuing and must<br>\nbe within the scope of FMCAD. Work, part of which has been previously<br>\npublished, will be considered; the novel aspect to be addressed in<br>\nfuture work must be clearly described in such cases. All submissions<br>\nwill be reviewed by the Student Forum's program committee.</p>\n<p>Important Dates<br>\nStudent forum submission: July 12, 2023<br>\nStudent forum notification: Aug 10, 2023<br>\nThese deadlines are 11:59 pm AoE (Anywhere on Earth)</p>\n<p>Format<br>\nThe event will consist of short presentations by the student authors<br>\nof each accepted submission and of a poster that will be on display<br>\nthroughout the duration of the conference. All participants of the<br>\nconference are encouraged to attend the talks and approach the<br>\nstudents during the poster presentation. Instructions for the<br>\npreparation of the talks and poster sessions will be announced on<br>\nnotification of acceptance.</p>\n<p>Visibility<br>\nAccepted submissions will be listed, with title and author name, in<br>\nthe event description in the conference proceedings. The authors will<br>\nalso have the option to upload their slide deck/poster/presentation to<br>\nthe FMCAD website. The report itself will not appear in the FMCAD<br>\nproceedings. Thus, the presentation at the forum should not interfere<br>\nwith potential future submissions of this research (to FMCAD or<br>\nelsewhere).</p>\n<p>Travel Awards<br>\nMost of the applicants will receive travel reimbursement after the<br>\nconference (the amount of support will be announced later). The first<br>\nauthor of each contribution will be given priority over other authors.<br>\nPlease make sure you hold on to all receipts for reimbursement.<br>\nFurther instructions on how to apply for travel grants will be on the<br>\nwebsite.</p>\n<hr>\n<hr>\n<p>__<br>\n            /\\                       \\ \\_____<br>\n           /  \\                   ###[==_____&gt;<br>\n          /    \\                     /_/      __<br>\n         /  __  \\                             \\ \\_____<br>\n         | (  ) |                          ###[==_____&gt;<br>\n        /| /\\/\\ |\\                            /_/<br>\n       / | |  | | \\<br>\n      /  |=|==|=|  \\       Kristin Yvonne Rozier, Ph.D.<br>\n    /    | |  | |    \\     Associate Professor, Iowa State Univ<br>\n   / USA | ~||~ |NASA \\    Departments of Aerospace Engineering,<br>\n  |______|  ~~  |______|     Computer Science, Mathematics, and<br>\n         (__||__)            Electrical and Computer Engineering<br>\n         /_\\  /_\\<br>\n         !!!  !!!          <a href=\"http://laboratory.temporallogic.org\">laboratory.temporallogic.org</a></p>",
        "id": 371814721,
        "sender_full_name": "Email Gateway",
        "timestamp": 1688333643
    }
]