[
    {
        "content": "<p>From: Gerwin Klein &lt;<a href=\"mailto:kleing@unsw.edu.au\">kleing@unsw.edu.au</a>&gt;<br>\nThe fork of the AFP development version for the upcoming Isabelle2022 release is approaching.</p>\n<p>If you have any changes to the development version of the AFP that you would like to see in afp-2022, please add them before the end of 2 Oct (anywhere on Earth).</p>\n<p>Changes after that will stay in the development version and become visible in the Isabelle release after that.</p>\n<p>If you need more time or have important changes after that date, please let me know by email.</p>\n<p>Cheers,<br>\nGerwin</p>",
        "id": 301796617,
        "sender_full_name": "Email Gateway",
        "timestamp": 1664619016
    },
    {
        "content": "<p>From: Dominique Unruh &lt;<a href=\"mailto:cl-isabelle-users@lists.cam.ac.uk\">cl-isabelle-users@lists.cam.ac.uk</a>&gt;<br>\nDear Gershwin,</p>\n<p>I am currently going through a cleanup pass of the <br>\nComplex_Bounded_Operator library. While the partially cleaned version is <br>\ncurrently in a good shape, it would be great if I could finish the <br>\ncleanup and include the resulting version in AFP 2022.</p>\n<p>Would it be possible to provide it, say, two days later? (To the best of <br>\nmy knowledge, the only dependency is the Registers session which I also <br>\nown, so any potential problems there I will fix myself.)</p>\n<p>Best wishes,<br>\nDominique.</p>",
        "id": 302015848,
        "sender_full_name": "Email Gateway",
        "timestamp": 1664784148
    },
    {
        "content": "<p>From: Gerwin Klein &lt;<a href=\"mailto:kleing@unsw.edu.au\">kleing@unsw.edu.au</a>&gt;<br>\nHi Dominique,</p>\n<p>that should be no problem, but instead of pushing directly to afp-devel, please email me the diff (e.g. the output of <code>hg export</code>) so I can add it to afp-2022 directly and merge into devel from there. </p>\n<p>Cheers,<br>\nGerwin</p>",
        "id": 302024075,
        "sender_full_name": "Email Gateway",
        "timestamp": 1664787814
    }
]