[
    {
        "content": "<p>From: Santiago Escobar &lt;<a href=\"mailto:sescobar@upv.es\">sescobar@upv.es</a>&gt;<br>\n<strong> Apologies for multiple postings </strong></p>\n<p>=========================<br>\nPPDP 2023 Call for Participation<br>\n=========================</p>\n<p>25th International Symposium on<br>\nPrinciples and Practice of Declarative Programming</p>\n<p>22-23 October 2023, Cascais, Lisbon, Portugal</p>\n<p><a href=\"https://ppdp2023.webs.upv.es\">https://ppdp2023.webs.upv.es</a><br>\nPart of SPLASH 2023 and co-located with LOPSTR 2023 </p>\n<p>===================================<br>\nNews</p>\n<ul>\n<li>Program is available.</li>\n<li>Registration is open (Early bird September 22nd)</li>\n<li>Invited speakers announced.</li>\n<li>The list of accepted papers is available.</li>\n</ul>\n<p>===================================</p>\n<p>About PPDP</p>\n<hr>\n<p>The PPDP symposium brings together researchers from the declarative programming communities, including those working in the functional, logic, answer-set, and constraint handling programming paradigms. The goal is to stimulate research in the use of logical formalisms and methods for analyzing, performing, specifying, and reasoning about computations, including mechanisms for concurrency, security, static analysis, and verification.</p>\n<p>Invited Speakers</p>\n<hr>\n<p>Delia Kesner, Université Paris Cité (IRIF), France <br>\nEmbedding Quantitative Properties of Call-by-Name and Call-by-Value in a Unified Framework. </p>\n<p>Maribel Fernández, King's College London, UK (joint with LOPSTR and sponsored by ALP) <br>\nUnification modulo equational theories in languages with binding operators. </p>\n<p>10-Year Most Influential Paper</p>\n<hr>\n<p>Andrew Kennedy, Nick Benton, Jonas B. Jensen, and Pierre-Evariste Dagand<br>\nCoq: the world's best macro assembler?</p>\n<p>Accepted papers</p>\n<hr>\n<ul>\n<li>Steffen van Bakel, Nicolas Wu and Emma Tye. A Calculus of Delayed Reductions.</li>\n<li>Franco Barbanera, Mariangiola Dezani-Ciancaglini, Lorenzo Gheri and Nobuko Yoshida. Multicompatibility for Multiparty-Session Composition.</li>\n<li>Joseph Paulus, Daniele Nantes-Sobrinho and Jorge A. Pérez. Termination in Concurrency, Revisited.</li>\n<li>Kazuki Ikemori, Youyou Cong and Hidehiko Masuhara. Typed Equivalence of Labeled Effect Handlers and Labeled Delimited Control Operators.</li>\n<li>Xiangyu Guo, James Smith and Ajay Bansal. stablekanren: Integrating Stable Model Semantics with miniKanren.</li>\n<li>Gautier Raimondi, Frédéric Besson and Thomas Jensen. Type-directed Program Transformation for Constant-Time Enforcement.</li>\n<li>Eduardo Geraldo, João Costa Seco and Thomas Hildebrandt. Data-Dependent Confidentiality in DCR Graphs.</li>\n<li>Wilmer Ricciotti. Comprehending queries over finite maps.</li>\n<li>Luiz de Sá, Bernardo Toninho and Frank Pfenning. Intuitionistic Metric Temporal Logic.</li>\n<li>Zachary J. Sullivan, Paul Downen and Zena M. Ariola. Closure Conversion in Little Pieces.</li>\n<li>Pieter Koopman and Mart Lubbers. Strongly-Typed Multi-View Stack-Based Computations.</li>\n<li>Hannes Saffrich and Peter Thiemann. Polymorphic Typestate for Session Types.</li>\n<li>Silvio Capobianco and Tarmo Uustalu. Additive Cellular Automata Graded-Monadically.</li>\n</ul>\n<p>Program Committee</p>\n<hr>\n<p>Salvador Abreu, NOVA LINCS / University of Evora, Portugal<br>\nBeniamino Accattoli, Inria &amp; LIX, École Polytechnique, France<br>\nMaria Paola Bonacina, Università degli Studi di Verona, Italy<br>\nMário Florido, Universidade do Porto, Portugal<br>\nSilvia Ghilezan, University of Novi Sad and SANU, Serbia<br>\nMichael Hanus, University of Kiel, Germany<br>\nEkaterina Komendantskaya, Heriot-Watt University, UK<br>\nUgo de'Liguoro, Università di Torino, Italy<br>\nAlberto Lluch Lafuente, Technical University of Denmark, Denmark<br>\nGeorg Moser, University of Innsbruck, Austria<br>\nDaniele Nantes-Sobrinho, University of Brasília, Brazil<br>\nVivek Nigam, Huawei Technologies Düsseldorf GmbH, Germany<br>\nKazuhiro Ogata, Japan Advanced Institute of Science and Technology (JAIST), Japan<br>\nCarlos Olarte, LIPN, Université Sorbonne Paris Nord, France<br>\nGiselle Reis, Carnegie Mellon University, Qatar<br>\nAdrián Riesco, Universidad Complutense de Madrid, Spain<br>\nJulia Sapiña, Universitat Politècnica de València, Spain</p>\n<hr>\n<p>Program committee chair: Santiago Escobar, Universitat Politecnica de Valencia, Spain<br>\nSteering committee chair: James Cheney, Edinburgh University, UK</p>\n<hr>",
        "id": 391662575,
        "sender_full_name": "Email Gateway",
        "timestamp": 1695031167
    }
]