[
    {
        "content": "<p>From: <a href=\"mailto:serge.autexier@dfki.de\">serge.autexier@dfki.de</a></p>\n<hr>\n<p>Call for Workshop and Tutorial Proposals</p>\n<p>17th Conference on Intelligent Computer Mathematics<br>\n                 - CICM 2024 -<br>\n                   August 5 - 9, 2024<br>\n                    Montréal, Québec, Canada<br>\n<a href=\"https://www.cicm-conference.org/2024\">https://www.cicm-conference.org/2024</a></p>\n<hr>\n<p>More  and  more  mathematical  information is  digitally  processed,  generated,<br>\ncommunicated,  stored  and  curated.  CICM brings  together  the  many  separate<br>\ncommunities  that  have  developed   theoretical  and  practical  solutions  for<br>\nmathematical applications such as  computation, deduction, knowledge management,<br>\nand user interfaces. It offers a  venue for discussing problems and solutions in<br>\neach of these areas and their integration.</p>\n<p>CICM covers</p>\n<ul>\n<li>\n<p>all  aspects of  mathematics  such as  formalization, computation,  deduction,<br>\n  mathematical databases, and mathematical documents,</p>\n</li>\n<li>\n<p>all kinds of  tool support such as theorem provers,  computer algebra systems,<br>\n  knowledge management tools, and user interfaces</p>\n</li>\n<li>\n<p>the whole  spectrum from theoretical  foundations to practical tools  and from<br>\n  challenge problems to case studies.</p>\n</li>\n</ul>\n<p>Workshops typically feature presentations of  ongoing research that is not ready<br>\nyet for formal publication, and tutorials present extended demos of a particular<br>\nsoftware.</p>\n<p>However, the CICM organizers strongly  encourage a broad interpretation of these<br>\nconcepts and  welcome proposals  for any  kind of event  that benefits  the CICM<br>\ncommunity.</p>\n<p>A proposal should include the following information:</p>\n<ul>\n<li>title of the event</li>\n<li>names and affiliations of the organizers</li>\n<li>brief description of the event (e.g., 1-2 paragraphs)</li>\n<li>proposed workshop duration (typically half a day up to two days)</li>\n<li>style (in person-only, hybrid)</li>\n<li>previous instances of the event (if any)</li>\n<li>preferred or excluded dates within the CICM dates (if any)</li>\n<li>if the format of  the event relies on contributed talks, a  brief outline of a<br>\n  \"backup  plan\" in  case of  low submission  rates to  allow for  more reliable<br>\n  scheduling/planning efforts by the organizers.</li>\n</ul>\n<p>Important Dates<br>\n===============</p>\n<p>Proposal submission:    February 29, 2024<br>\nNotication:                      March 15, 2024<br>\nConference:                    August 5-9, 2024</p>\n<p>Earlier submissions are  encouraged and will receive notifications  on a rolling<br>\nbasis.</p>\n<p>All proposals should be submitted via email to <a href=\"mailto:dennis.mueller@fau.de\">dennis.mueller@fau.de</a>.</p>\n<p>More details on the conference are available at</p>\n<p><a href=\"https://www.cicm-conference.org/2024\">https://www.cicm-conference.org/2024</a></p>",
        "id": 413193063,
        "sender_full_name": "Email Gateway",
        "timestamp": 1705422560
    }
]