[
    {
        "content": "<p>From: Violet Ka I Pun &lt;<a href=\"mailto:violetpun@gmail.com\">violetpun@gmail.com</a>&gt;<br>\n[apologies for cross-postings]</p>\n<p>==================================================</p>\n<p>Call for Papers<br>\nFM 2023: 25th International Symposium on Formal Methods</p>\n<p>Lübeck, Germany, March 6-10, 2023<br>\n<a href=\"https://fm2023.isp.uni-luebeck.de/\">https://fm2023.isp.uni-luebeck.de/</a> &lt;<a href=\"https://fm2023.isp.uni-luebeck.de/\">https://fm2023.isp.uni-luebeck.de/</a>&gt;</p>\n<p>==================================================</p>\n<p>FM 2023 is the 25th international symposium in a series organised by<br>\nFormal Methods Europe (FME), an independent association whose aim is to<br>\nstimulate the use of, and research on, formal methods for software<br>\ndevelopment. The FM symposia have been successful in bringing together<br>\nresearchers and industrial users around a programme of original papers<br>\non research and industrial experience, workshops, tutorials, reports on<br>\ntools, projects, and ongoing doctoral research. FM 2023 will be both an<br>\noccasion to celebrate and a platform for enthusiastic researchers and<br>\npractitioners from a diversity of backgrounds to exchange their ideas<br>\nand share their experiences.</p>\n<p>=Important Dates=</p>\n<p>Abstract submission:     September 4, 2022, 23:59 AoE (firm)<br>\nFull paper submission:   September 11, 2022, 23:59 AoE (firm)<br>\nNotification:            November 15, 2022<br>\nArtefact submission:     November 20, 2022, 23:59 AoE (firm)<br>\nCamera ready:            December 11, 2022, 23:59 AoE (firm)<br>\nConference:              March 6-10, 2023</p>\n<p>=Topics of Interest=</p>\n<p>FM 2023 will highlight the development and application of formal methods<br>\nin a wide range of domains including trustworthy AI, software,<br>\ncomputer-based systems, systems-of-systems, cyber-physical systems,<br>\nsecurity, human-computer interaction, manufacturing, sustainability,<br>\nenergy, transport, smart cities, healthcare and biology. We particularly<br>\nwelcome papers on techniques, tools and experiences in interdisciplinary<br>\nsettings. We also welcome papers on experiences of applying formal methods <br>\nin industrial settings, and on the design and validation of formal method <br>\ntools.</p>\n<p>The topics of interest for FM 2023 include, but are not limited to:</p>\n<p>Interdisciplinary formal methods: Techniques, tools and experiences<br>\ndemonstrating the use of formal methods in interdisciplinary settings.<br>\nFormal methods in practice: Industrial applications of formal methods,<br>\nexperience with formal methods in industry, tool usage reports,<br>\nexperiments with challenge problems. The authors are encouraged to<br>\nexplain how formal methods overcame problems, led to improved designs,<br>\nor provided new insights.</p>\n<p>Tools for formal methods: Advances in automated verification, model<br>\nchecking, and testing with formal methods, tools integration,<br>\nenvironments for formal methods, and experimental validation of tools.<br>\nThe authors are encouraged to demonstrate empirically that the new tool<br>\nor environment advances the state of the art.</p>\n<p>Formal methods in software and systems engineering: Development<br>\nprocesses with formal methods, usage guidelines for formal methods, and<br>\nmethod integration. The authors are encouraged to evaluate process<br>\ninnovations with respect to qualitative or quantitative improvements.<br>\nEmpirical studies and evaluations are also solicited.</p>\n<p>Theoretical foundations of formal methods: All aspects of theory related<br>\nto specification, verification, refinement, and static and dynamic<br>\nanalysis. The authors are encouraged to explain how their results<br>\ncontribute to the solution of practical problems with formal methods or<br>\ntools.</p>\n<p>We explicitly welcome submissions to the special FM 2023 session on <br>\n\"Formal methods meets AI\", which is focused on formal and rigorous <br>\nmodelling and analysis techniques to ensuring safety, robustness etc. <br>\n(trustworthiness) of AI-based systems.</p>\n<p>=Submission Guidelines=</p>\n<p>Papers should be original work, not published or submitted elsewhere, in<br>\nSpringer LNCS format, written in English, submitted through EasyChair:</p>\n<p><a href=\"https://easychair.org/conferences/?conf=fm2023\">https://easychair.org/conferences/?conf=fm2023</a> &lt;<a href=\"https://easychair.org/conferences/?conf=fm2023\">https://easychair.org/conferences/?conf=fm2023</a>&gt;</p>\n<p>Each paper will be evaluated by at least three PC members. Authors of <br>\npapers reporting experimental work are strongly encouraged to make their <br>\nexperimental results available for use by the reviewers. Case study papers <br>\nshould describe significant case studies, and the complete development <br>\nshould be made available at the time of review. The usual criteria for <br>\nnovelty, reproducibility, correctness and the ability for others to build <br>\nupon the described work apply. Tool papers and tool demonstration papers <br>\nshould explain enhancements made compared to previously published work. <br>\nA tool demonstration paper need not present the theory behind the tool, <br>\nbut can focus on the tool’s features, how it is used, its evaluation, and<br>\nexamples and screenshots illustrating the tool’s use. Authors of tool<br>\nand tool demonstration papers should make their tool available for use<br>\nby the reviewers and are highly encouraged to participate in the artefact<br>\nevaluation once their paper is accepted.</p>\n<p>We solicit various categories of papers:</p>\n<p>Regular Papers (max 15 pages)<br>\nLong tool papers (max 15 pages)<br>\nCase study papers (max 15 pages)<br>\nShort papers (max 6 pages), including tool demonstration papers.</p>\n<p>Short papers present novel ideas (e.g., without an extensive experimental <br>\nevaluation) or results that can well be presented in 6 pages. Short papers <br>\nwill be given short presentation slots at the conference.</p>\n<p>All page limits do <em>not</em> include references and appendices.</p>\n<p>For all papers, an appendix can provide additional material such as<br>\ndetails on proofs or experiments. The appendix is not part of the page<br>\ncount and is not guaranteed to be read or taken into account by the<br>\nreviewers. Thus, it should not contain information necessary for the<br>\nunderstanding and the evaluation of the presented work. Papers will be<br>\naccepted or rejected in the category in which they were submitted and<br>\nwill not be moved between categories.</p>\n<p>At least one author of an accepted paper is expected to present the<br>\npaper at the conference as a registered participant.</p>\n<p>=Double Blind Review Process=</p>\n<p>FM 2023 will employ a double-blind review process except for (a) long <br>\ntool papers and (b) short tool demonstration papers. Other short papers <br>\nwill be subject to a double-blind policy.</p>\n<p>The papers submitted must not reveal the authors’ identities in any way:<br>\n(a) Authors should leave out author names and affiliations from the body <br>\nof their submission.<br>\n(b) Authors should ensure that any citation to related work by themselves <br>\nis written in third person, that is, “the prior work of XYZ” as opposed <br>\nto “our prior work”.<br>\n(c) Authors should not include URLs to author-revealing sites (tools, <br>\ndatasets).<br>\n(e) You are encouraged to submit a link to a Web site or repository <br>\ncontaining supplementary material (raw data, datasets, experiments, etc.), <br>\nas long as it is blinded. The visit of such sites should not be needed <br>\nto conduct the review. The PC will not necessarily consider it in the <br>\npaper review process. For more information, please read </p>\n<p>How to disclose data for double-blind review and make it archived open data upon acceptance &lt;<a href=\"https://ineed.coffee/post/how-to-disclose-data-for-double-blind-review-and-make-it-archived-open-data-upon-acceptance\">https://ineed.coffee/post/how-to-disclose-data-for-double-blind-review-and-make-it-archived-open-data-upon-acceptance</a>&gt;. </p>\n<p>As an alternative to having an external link, the submission form provides <br>\nan option to attach a replication package.<br>\n(f) Authors should anonymize author-revealing company names but instead <br>\nprovide general characteristics of the organizations involved needed to <br>\nunderstand the context of the paper.<br>\n(g) Authors should ensure that paper acknowledgements do not reveal the <br>\norigin of their work.</p>\n<p>The double-blind process is “heavy”, i.e., the paper anonymity will be <br>\nmaintained during the reviewers’ discussion period. Authors with further <br>\nquestions on double-blind reviewing are encouraged to contact the PC <br>\nchairs by email. Papers that do not comply with the double-blind review <br>\nprocess will be desk-rejected.</p>\n<p>To prevent double submissions, the chairs might compare the submissions <br>\nwith related conferences that have overlapping review periods. The double <br>\nsubmission restriction applies only to refereed journals and conferences, <br>\nnot to unrefereed forums (e.g. <a href=\"http://arXiv.org\">arXiv.org</a> &lt;<a href=\"http://arxiv.org/\">http://arxiv.org/</a>&gt;). To check for plagiarism issues, <br>\nthe chairs might use external plagiarism detection software.</p>\n<p>To facilitate double-blind reviewing, we advise the authors to postpone <br>\npublishing their submitted work on arXiv or similar sites until after the <br>\nnotification of acceptance. However, if the authors have already published <br>\na version of their paper to arXiv or similar sites, we request authors to <br>\nuse a different title for their submission, so that author names are not <br>\ninadvertently disclosed, e.g., via a notification on Google Scholar.</p>\n<p>=Best Paper Award=</p>\n<p>At the conference, the PC Chairs will present an award to the authors of<br>\nthe submission selected as the FM 2023 Best Paper.</p>\n<p>=Publication=</p>\n<p>Accepted papers will be published in the Symposium Proceedings to appear<br>\nin Springer’s Lecture Notes in Computer Science. Extended versions of selected <br>\npapers will be invited for publication in a special issue of a journal.</p>\n<p>=General Chair=</p>\n<p>Martin Leucker, University of Lübeck, Germany</p>\n<p>=Program Committee Chairs=</p>\n<p>Marsha Chechik, University of Toronto, CA<br>\nJoost-Pieter Katoen, RWTH Aachen University, DE<br>\n                   &amp; University of Twente, NL</p>\n<p>=Program Committee=</p>\n<p>Dalal Alrajeh, Imperial College, UK<br>\nLuis Soares Barbosa, University of Minho, PT<br>\nEzio Bartocci, TU Vienna, AT<br>\nNikolaj Bjørner, Microsoft, US<br>\nSandrine Blazy, University of Rennes, FR<br>\nBorzoo Bonakdarpour, Michigan State University, US <br>\nPablo Castro, University of Rio Cuarto, AR<br>\nAna Cavalcanti, University of York, UK<br>\nMilan Česka, Brno University of Technology, CZ<br>\nNancy Day, University of Waterloo, CA<br>\nBenrd Fischer, Stellenbosch University, ZA<br>\nArie Gurfinkel, University of Waterloo, CA<br>\nReiner Hähnle, TU Darmstadt, DE<br>\nIchiro Hasuo, National Institute of Informatics, JP<br>\nKeijo Heljanko, University of Helsinki, FI<br>\nHolger<br>\n[message truncated]</p>",
        "id": 283318472,
        "sender_full_name": "Email Gateway",
        "timestamp": 1653312489
    }
]