[
    {
        "content": "<p>From: Carsten Fuhs &lt;<a href=\"mailto:carsten@dcs.bbk.ac.uk\">carsten@dcs.bbk.ac.uk</a>&gt;</p>\n<hr>\n<p>Second Call for Workshop Proposals<br>\nFSCD 2021<br>\n<a href=\"https://fscd2021.dc.uba.ar\">https://fscd2021.dc.uba.ar</a><br>\nBuenos Aires, Argentina<br>\nMain Conference: 19-22 July 2021<br>\nWorkshops: 17-18 and 23-24 July 2021</p>\n<hr>\n<p>FSCD 2021 will be the sixth edition of the International Conference<br>\non Formal Structures for Computation and Deduction. Due to the<br>\nCovid 19 pandemic situation, the 2021 edition of FSCD and its<br>\nsatellite workshops will be held online.</p>\n<p>We invite proposals for workshops, tutorials or other satellite<br>\nevents, on any topic related to formal structures in computation,<br>\ndeduction and automated reasoning, from theoretical foundations to<br>\ntools and applications.</p>\n<p>Satellite events will take place online on the 17-18 and 23-24 July,<br>\nbefore and after the main conference (19-22 July). It is expected<br>\nthat satellite events would run for 1 or 2 days, and be open to<br>\nparticipants of parallel events.</p>\n<p>PROPOSALS</p>\n<hr>\n<p>Proposals must be limited to three pages and should be submitted via<br>\nEasyChair</p>\n<p><a href=\"https://easychair.org/conferences/?conf=fscd2021\">https://easychair.org/conferences/?conf=fscd2021</a> (Workshops track)</p>\n<p>Each proposal should consist of the following two parts.</p>\n<p>1) A description part including:</p>\n<ul>\n<li>\n<p>a short scientific justification of the proposed topic,<br>\n   Its significance, and the particular benefits of the workshop to<br>\n   the community, as well as a list of previous or related workshops<br>\n   (if relevant);</p>\n</li>\n<li>\n<p>a brief description (up to 120 words) of the event for the website<br>\n   and publicity material.<br>\n2) An organisational part including:</p>\n</li>\n<li>\n<p>contact information for the workshop organisers;</p>\n</li>\n<li>\n<p>name of the organiser in the role of FSCD Workshops Scheduling<br>\n   Committee member (*);</p>\n</li>\n<li>\n<p>estimate of the number of workshop participants;</p>\n</li>\n<li>\n<p>proposed format and agenda (e.g. paper presentations, tutorials,<br>\n   demo sessions, etc.)</p>\n</li>\n<li>\n<p>potential invited speakers;</p>\n</li>\n<li>procedures for selecting papers and participants;</li>\n<li>\n<p>tentative schedule for paper submission and notification of<br>\n   acceptance;</p>\n</li>\n<li>\n<p>plans for dissemination, if any (e.g. a journal special issue);</p>\n</li>\n<li>duration (which may vary from one day to two days);</li>\n<li>preferred period (pre, or post main conference);</li>\n<li>any other special requirements.</li>\n</ul>\n<p>(*) The FSCD Workshops Scheduling Committee will include one of the<br>\norganisers of each accepted workshop and have the role to concoct a<br>\nscientifically coherent program of all workshops mitigating<br>\nsuperpositions of connected talks. This organisational effort will<br>\nrequire that each workshop finalise their selection of talks and<br>\ninvited speakers within a common pertinent deadline to be defined<br>\nso that possible overlaps can be minimised. Please, consider this<br>\nwhen preparing the tentative schedule of your workshop proposal.</p>\n<p>The Organising Committee of FSCD will determine the final list of<br>\naccepted workshops based on the recommendations from the Workshop<br>\nChairs and availability of space and facilities.</p>\n<p>The organisers of satellite events are expected to create and<br>\nmaintain a website for the event; handle paper selection, reviewing<br>\nand acceptance; draw up a tentative programme of talks; advertise<br>\ntheir event though specialist mailing lists; prepare the informal<br>\npre-proceedings (if applicable) in a timely fashion; and arrange any<br>\npost-proceedings. Some amount of financial support may be offered to<br>\nworkshops, depending on the number of participants.</p>\n<p>The FSCD Organising Committee will handle promotion of the event on<br>\nthe main conference website; integration of the event's programme<br>\ninto the overall timetable; registration of participants; arrangement<br>\nof an appropriate virtual meeting room and technical support will be<br>\nprovided by the FSCD organising committee.</p>\n<p>IMPORTANT DATES</p>\n<hr>\n<p>Submission of workshop proposals: 6 December, 2020<br>\nNotification of success of proposals: 20 December, 2020</p>\n<hr>\n<p>Best regards,<br>\nCarlos Lopez Pombo, Mauricio Ayala-Rincon<br>\nFSCD 2021 Workshop Chairs</p>",
        "id": 218419847,
        "sender_full_name": "Email Gateway",
        "timestamp": 1606828579
    }
]