[
    {
        "content": "<p>From: Peter Sewell &lt;<a href=\"mailto:Peter.Sewell@cl.cam.ac.uk\">Peter.Sewell@cl.cam.ac.uk</a>&gt;<br>\nPostdoc and research engineer positions in Semantics and Verification for<br>\nSecure Systems Software</p>\n<p>Advert: <a href=\"http://www.jobs.cam.ac.uk/job/28012/\">http://www.jobs.cam.ac.uk/job/28012/</a><br>\nClosing date: 13 January 2021</p>\n<p>Are you interested in developing and applying semantics and verification<br>\ntechniques to radically improve the foundations and security of mainstream<br>\ncomputer systems? We are looking for postdoctoral researchers and research<br>\nassistants to do exactly that, in a wide range of topics.</p>\n<p>In recent years, working with Arm, IBM, RISC-V International, the CHERI<br>\nteam, the C and C++ standards committees, and others, we have shown how one<br>\ncan develop and use authoritative semantics for full-scale architecture and<br>\nlanguage definitions, including instruction-set architectures of ARMv8-A,<br>\nRISC-V, and CHERI in our Sail metalanguage (<br>\n<a href=\"https://www.cl.cam.ac.uk/~pes20/sail/\">https://www.cl.cam.ac.uk/~pes20/sail/</a>), our Cerberus C semantics (<br>\n<a href=\"https://www.cl.cam.ac.uk/~pes20/cerberus/\">https://www.cl.cam.ac.uk/~pes20/cerberus/</a>), and relaxed-memory concurrency<br>\nmodels at the architecture and C/C++ language levels. These use a<br>\ncombination of semantic definitions made executable as test oracles, test<br>\ngeneration, symbolic execution, and mechanised proof; they have resolved<br>\nmany questions about what these fundamental abstractions are or should be;<br>\nand they can enable both lightweight formal engineering and full<br>\nverification of key parts of real systems.</p>\n<p>We now aim to build above this in two related projects, for CHERI and Arm<br>\nsystem software.</p>\n<p>(1) CHERI verification. CHERI (<br>\n<a href=\"https://www.cl.cam.ac.uk/techreports/UCAM-CL-TR-941.pdf\">https://www.cl.cam.ac.uk/techreports/UCAM-CL-TR-941.pdf</a>,<br>\n<a href=\"https://www.cl.cam.ac.uk/research/security/ctsrd/cheri/\">https://www.cl.cam.ac.uk/research/security/ctsrd/cheri/</a>) extends<br>\nconventional hardware Instruction-Set Architectures (ISAs) with new<br>\narchitectural features, using capabilities, to enable fine-grained memory<br>\nprotection and highly scalable software compartmentalization. The CHERI<br>\nproject is led by Robert Watson, Simon Moore, and Peter Sewell at the<br>\nUniversity of Cambridge and Peter Neumann at SRI International. CHERI<br>\nallows historically memory-unsafe programming languages such as C and C++<br>\nto be adapted to protect against many currently widely exploited security<br>\nvulnerabilities, and enables the fine-grained decomposition of<br>\noperating-system (OS) and application code, to limit the effects of<br>\nsecurity vulnerabilities. CHERI is a hardware/software/semantics co-design<br>\nproject, bringing together computer architecture, systems software,<br>\nsecurity, and semantics.</p>\n<p>In October 2019, Arm announced Morello (<br>\n<a href=\"https://www.cl.cam.ac.uk/research/security/ctsrd/cheri/cheri-morello.html\">https://www.cl.cam.ac.uk/research/security/ctsrd/cheri/cheri-morello.html</a>),<br>\nan experimental CHERI-extended, multicore, superscalar ARMv8-A processor,<br>\nSystem-on-Chip (SoC), and prototype board. Morello is a part of the UKRI<br>\n£187M Digital Security by Design Challenge (DSbD), supported by the UK<br>\nIndustrial Strategy Challenge Fund, including a commitment of over £50M by<br>\nArm. Morello will support industrial-scale evaluation of CHERI, with a view<br>\nto mass-market adoption - which would transform the security landscape.</p>\n<p>We have previously developed rigorous engineering methods (<br>\n<a href=\"https://www.cl.cam.ac.uk/research/security/ctsrd/cheri/cheri-formal.html\">https://www.cl.cam.ac.uk/research/security/ctsrd/cheri/cheri-formal.html</a>)<br>\nto precisely define the CHERI ISA, for CHERI-MIPS and CHERI-RISC-V<br>\nvariants, and to prove (in Isabelle) that they satisfy key intended<br>\nsecurity properties (<a href=\"https://www.cl.cam.ac.uk/users/pes20/cheri-formal.pdf\">https://www.cl.cam.ac.uk/users/pes20/cheri-formal.pdf</a>).<br>\nWe are now collaborating with Arm and researchers at the University of<br>\nEdinburgh to do the same for the full Morello CHERI ARMv8 ISA, building on<br>\nour Sail ARMv8-A ISA semantics, and to study the semantics and security of<br>\nhigher-level languages and system software above CHERI, building also on<br>\nour Cerberus C semantics (<a href=\"https://www.cl.cam.ac.uk/~pes20/cerberus/\">https://www.cl.cam.ac.uk/~pes20/cerberus/</a>).<br>\nMorello and this verification aim to improve the security of all Arm mobile<br>\ndevice software.</p>\n<p>(2) Arm system software verification. This ongoing project, in<br>\ncollaboration with Google and with researchers at MPI-SWS, Radboud, SNU,<br>\nand Aarhus, aims to establish correctness and security properties of key<br>\nhypervisor system software above the ARMv8-A ISA semantics mentioned above,<br>\nintegrated with the ARMv8-A concurrency architecture (including both the<br>\nprevious \"user-mode\" models and the system concurrency semantics, being<br>\ndeveloped in collaboration with Arm) (<br>\n<a href=\"https://www.cl.cam.ac.uk/~pes20/armv8-mca/\">https://www.cl.cam.ac.uk/~pes20/armv8-mca/</a>). The Cambridge work is led by<br>\nPeter Sewell, Neel Krishnaswami, and Robert Watson. Here too, there is the<br>\nprospect of the resulting system being very widely deployed.</p>\n<p>We are looking for postdocs and research assistants to contribute to all<br>\naspects of both projects. You should have a strong background in semantics<br>\nand verification, the motivation and flexibility to develop practical ways<br>\nto use them at scale for real systems, and experience in one or more of:</p>\n<ul>\n<li>interactive theorem proving, in Coq and/or Isabelle (we use both)</li>\n<li>program logics (especially separation logics and Iris)</li>\n<li>relaxed-memory concurrency</li>\n<li>low-level system software</li>\n<li>programming language semantics and type systems</li>\n<li>program analysis</li>\n<li>model checking</li>\n<li>computer security</li>\n<li>functional programming</li>\n</ul>\n<p>We are also seeking candidates with a research engineering focus, to assist<br>\nin the development of robust and widely usable tools based on the above.<br>\nFor this, you should have experience in functional programming, especially<br>\nOCaml.</p>\n<p>For more details of our recent work, see (<a href=\"https://www.cl.cam.ac.uk/~pes20/\">https://www.cl.cam.ac.uk/~pes20/</a>),<br>\nand especially the REMS (<a href=\"https://www.cl.cam.ac.uk/~pes20/rems/index.html\">https://www.cl.cam.ac.uk/~pes20/rems/index.html</a>)<br>\nand CHERI (<a href=\"https://www.cl.cam.ac.uk/research/security/ctsrd/cheri/\">https://www.cl.cam.ac.uk/research/security/ctsrd/cheri/</a>)<br>\nprojects, which are both lively and effective collaborations.</p>\n<p>The positions are available to start as soon as possible. For candidates<br>\nwith substantial relevant expertise, we may be able to appoint at the<br>\nSenior Research Associate level.</p>\n<p>Research Assistant (without PhD): £26,715-£30,942, Research Associate (with<br>\nPhD): £32,816-£40,322, or Senior Research Associate: £41,526-£52,559.<br>\nAppointment to Senior Research Associate will be considered for exceptional<br>\ncandidates.</p>\n<p>Fixed-term: The funds for these posts are available for 2 years in the<br>\nfirst instance.</p>\n<p>Further details may be obtained from Prof. Peter Sewell, email<br>\n<a href=\"mailto:Peter.Sewell@cl.cam.ac.uk\">Peter.Sewell@cl.cam.ac.uk</a></p>\n<p>You will need to upload a full curriculum vitae (CV) and a covering letter<br>\noutlining your interests, potential contributions to the project, and<br>\nrelevant past experience; both in pdf format. You should also include the<br>\ncontact details for 2 referees who will be able to promptly provide letters<br>\nif requested. If you upload any additional documents which haven't been<br>\nrequested we will not be able to consider these as part of your application.</p>\n<p>Due to the current circumstances, there may be a possibility for remote<br>\nworking in the first instance. Please contact the HR Manager to discuss the<br>\nfiner details.</p>\n<p>Please quote reference NR25056 on your application and in any<br>\ncorrespondence about this vacancy.</p>\n<p>Apply online: <a href=\"http://hrsystems.admin.cam.ac.uk/recruit-ui/apply/NR25056\">http://hrsystems.admin.cam.ac.uk/recruit-ui/apply/NR25056</a></p>\n<p>The University actively supports equality, diversity and inclusion and<br>\nencourages applications from all sections of society.</p>\n<p>The University has a responsibility to ensure that all employees are<br>\neligible to live and work in the UK.</p>",
        "id": 219375429,
        "sender_full_name": "Email Gateway",
        "timestamp": 1607537613
    }
]