[
    {
        "content": "<p>From: \"Nadel, Alexander\" &lt;<a href=\"mailto:alexander.nadel@intel.com\">alexander.nadel@intel.com</a>&gt;<br>\n(apologies for multiple copies)</p>\n<p>========================================================================<br>\n2023 Formal Methods in Computer-Aided Design (FMCAD): Call for Papers<br>\n========================================================================</p>\n<p>GENERAL INFORMATION</p>\n<hr>\n<p>Conference website: <a href=\"https://fmcad.org/FMCAD23/\">https://fmcad.org/FMCAD23/</a><br>\nConference location: Ames, Iowa, USA<br>\nPart of the FMCAD 2023 program: FMCAD Student Forum</p>\n<p>IMPORTANT DATES</p>\n<hr>\n<p>Abstract Submission: May 08<br>\nPaper Submission: May 15<br>\nAuthor Response Period: June 22-25<br>\nAuthor Notification: July 1<br>\nCamera-Ready Version: August 14<br>\nEarly registration deadline: September 28<br>\nConference dates: October 23-27</p>\n<p>All deadlines are 11:59 pm AoE (Anywhere on Earth)</p>\n<p>FMCAD Tutorial Day: Oct. 23, 2023<br>\nRegular Program: Oct. 24-27, 2023</p>\n<p>CONFERENCE SCOPE AND PUBLICATION</p>\n<hr>\n<p>FMCAD 2023 is the twenty-third in a series of conferences on the theory<br>\nand applications of formal methods in hardware and system<br>\nverification. FMCAD provides a leading forum to researchers in academia<br>\nand industry for presenting and discussing groundbreaking methods,<br>\ntechnologies, theoretical results, and tools for reasoning formally about<br>\ncomputing systems. FMCAD covers formal aspects of computer-aided system<br>\ndesign including verification, specification, synthesis, and testing.</p>\n<p>FMCAD employs a rigorous peer-review process. Accepted papers are<br>\npublished by TU Wien Academic Press under a Creative Commons license (the<br>\nauthors retain the copyright) and distributed through the IEEE XPlore<br>\ndigital library. There are no publication fees. At least one of the<br>\nauthors is required to register for the conference and present the<br>\naccepted paper.</p>\n<p>TOPICS OF INTEREST</p>\n<hr>\n<p>FMCAD welcomes submission of papers reporting original research on<br>\nadvances in all aspects of formal methods and their applications to<br>\ncomputer- aided design. Topics of interest include (but are not limited<br>\nto):</p>\n<ul>\n<li>\n<p>Model checking, theorem proving, equivalence checking, abstraction and<br>\nreduction, compositional methods, decision procedures at the bit- and<br>\nword-level, probabilistic methods, combinations of deductive methods and<br>\ndecision procedures.</p>\n</li>\n<li>\n<p>Synthesis and compilation for computer system descriptions, modeling,<br>\nspecification, and implementation languages, formal semantics of<br>\nlanguages and their subsets, model-based design, design derivation and<br>\ntransformation, correct-by-construction methods.</p>\n</li>\n<li>\n<p>Application of formal and semi-formal methods to functional and<br>\nnon-functional specification and validation of hardware and software,<br>\nincluding timing and power modeling, verification of computing systems<br>\non all levels of abstraction, system-level design and verification for<br>\nembedded systems, cyber-physical systems, automotive systems and other<br>\nsafety-critical systems, hardware-software co-design and verification,<br>\nand transaction-level verification.</p>\n</li>\n<li>\n<p>Experience with the application of formal and semi-formal methods to<br>\nindustrial-scale designs; tools that represent formal verification<br>\nenablement, new features, or a substantial improvement in the automation<br>\nof formal methods.</p>\n</li>\n<li>\n<p>Application of formal methods to verifying safety, connectivity and<br>\nsecurity properties of networks, distributed systems, smart contracts,<br>\nblock chains, and IoT devices.</p>\n</li>\n</ul>\n<p>SUBMISSIONS</p>\n<hr>\n<p>Submissions must be made electronically in PDF format via CMT:</p>\n<p><a href=\"https://cmt3.research.microsoft.com/fmcad2023/\">https://cmt3.research.microsoft.com/fmcad2023/</a></p>\n<p>Two categories of papers are invited: Regular papers, and Tool &amp; Case<br>\nStudy papers. Regular papers are expected to offer novel foundational<br>\nideas, theoretical results, or algorithmic improvements to existing<br>\nmethods, along with experimental impact validation where applicable. Tool<br>\n&amp; Case Study papers are expected to report on the design, implementation<br>\nor use of verification (or related) technology in a practically relevant<br>\ncontext (which need not be industrial), and its impact on design<br>\nprocesses.</p>\n<p>Both Regular and Tool &amp; Case study papers must use the IEEE Transactions<br>\nformat on letter-size paper with a 10-point font size. Papers in both<br>\ncategories can be either 8 pages (long) or 4 pages (short) in length not<br>\nincluding references. Short papers that describe emerging results,<br>\npractical experiences, or original ideas that can be described succinctly<br>\nare encouraged. Authors will be required to select an appropriate paper<br>\ncategory at abstract submission time. Submissions may contain an optional<br>\nappendix, which will not appear in the final version of the paper. The<br>\nreviewers should be able to assess the quality and the relevance of the<br>\nresults in the paper without reading the appendix.</p>\n<p>Submissions in both categories must contain original research that has not<br>\nbeen previously published, nor is concurrently submitted for<br>\npublication. Any partial overlap with published or concurrently submitted<br>\npapers must be clearly indicated. If experimental results are reported,<br>\nauthors are strongly encouraged to provide the reviewers access to their<br>\ndata at submission time, so that results can be independently<br>\nverified. The review process is single blind.</p>\n<p>Authors of accepted contributions will be required to sign the FMCAD<br>\ncopyright transfer form found here: <a href=\"https://fmcad.or.at/pdf/copyright.pdf\">https://fmcad.or.at/pdf/copyright.pdf</a>.</p>\n<p>STUDENT FORUM</p>\n<hr>\n<p>Continuing the tradition of the previous years, FMCAD 2023 is hosting a<br>\nStudent Forum that provides a platform for graduate students at any career<br>\nstage to introduce their research to the wider Formal Methods community,<br>\nand solicit feedback.</p>\n<p>Submissions for the event must be short reports describing research ideas<br>\nor ongoing work that the student is currently pursuing, and must be within<br>\nthe scope of FMCAD. Work, part of which has been previously published,<br>\nwill be considered; the novel aspect to be addressed in future work must<br>\nbe clearly described in such cases. All submissions will be reviewed by a<br>\nselect group of FMCAD program committee members.</p>\n<p>FMCAD 2023 COMMITTEES</p>\n<hr>\n<p>PROGRAM CHAIRS:</p>\n<p>Alexander Nadel, Intel Corporation and Technion, Israel<br>\nKristin Y. Rozier, Iowa State University, IA, USA</p>\n<p>PROGRAM COMMITTEE:</p>\n<p>Alessandro Abate, Oxford<br>\nGuy Amir, Hebrew University<br>\nClark Barrett, Stanford University<br>\nPer Bjesse, Synopsys Inc.<br>\nRoderick Bloem Graz, University of Technology<br>\nIvana Cerna, Masaryk University<br>\nSupratik Chakraborty, IIT Bombay<br>\nSylvain Conchon, Universite Paris-Sud<br>\nRayna Dimitrova, CISPA Helmholtz Center for Information Security<br>\nRohit Dureja, IBM<br>\nGrigory Fedyukovich, Florida State University<br>\nMathias Fleury, University of Freiburg<br>\nAmit Goel, Amazon<br>\nAlberto Griggio, FBK<br>\nArie Gurfinkel, University of Waterloo<br>\nLiana Hadarean, Amazon Web Services<br>\nZiyad Hanna, Cadence Design Systems<br>\nWilliam Harrison, Two Six Technologies<br>\nBo-Yuan Huang, Intel<br>\nAlan Jovic, University of Zagreb<br>\nDaniela Kaufmann, TU Wien<br>\nTim King, Google<br>\nRebekah Leslie-Hurd, Cerebras<br>\nAndreas Lööw, Imperial College London<br>\nKuldeep Meel, National University of Singapore<br>\nBaoluo Meng, GE Research<br>\nNaoko Okubo, Japan Aerospace Exploration Agency (JAXA)<br>\nAndrew Reynolds, University of Iowa<br>\nPhilipp Ruemmer, University of Regensburg<br>\nCristoph Scholl, University of Freiburg<br>\nRoberto Sebastiani, University of Trento<br>\nCai Shaowei, Chinese Academy of Sciences<br>\nNatasha Sharygina, Università della Svizzera Italiana (USI Lugano)<br>\nChristoph Sticksel, The Mathworks<br>\nChristoph Torens, DLR<br>\nNestan Tsikaridze, Stanford University<br>\nYakir Vizel, Technion<br>\nGeorg Weissenbacher, Vienna University of Technology<br>\nMichael Whalen, Amazon Web Services, Inc.<br>\nShufang Zhu, Oxford</p>\n<p>STUDENT FORUM CHAIRS:</p>\n<p>Mikoláš Janota, Czech Institute of Informatics, Robotics and Cybernetics (CIIRC), Czech Republic<br>\nNina Narodytska, Samsung Research America, CA, USA</p>\n<p>SPONSORSHIP AND WEB CHAIR:</p>\n<p>Yoni Zohar, Bar Ilan University, Israel</p>\n<p>PUBLICATION CHAIR:</p>\n<p>Georg Weissenbacher, TU Wien</p>\n<p>FMCAD STEERING COMMITTEE:</p>\n<p>Clark Barrett, Stanford University, CA, USA<br>\nArmin Biere, University of Freiburg, Germany<br>\nRuzica Piskac, Yale University, CT, USA<br>\nAnna Slobodova, Intel Corporation, TX, USA<br>\nGeorg Weissenbacher, TU Vienna, Austria</p>\n<hr>\n<p>Intel Israel (74) Limited</p>\n<p>This e-mail and any attachments may contain confidential material for<br>\nthe sole use of the intended recipient(s). Any review or distribution<br>\nby others is strictly prohibited. If you are not the intended<br>\nrecipient, please contact the sender and delete all copies.</p>",
        "id": 339779029,
        "sender_full_name": "Email Gateway",
        "timestamp": 1678080228
    }
]