[
    {
        "content": "<p>From: Tobias Nipkow &lt;<a href=\"mailto:nipkow@in.tum.de\">nipkow@in.tum.de</a>&gt;<br>\nMaking Arbitrary Relational Calculus Queries Safe-Range<br>\nMartin Raszyk and Dmitriy Traytel</p>\n<p>The relational calculus (RC), i.e., first-order logic with equality but without <br>\nfunction symbols, is a concise, declarative database query language. In contrast <br>\nto relational algebra or SQL, which are the traditional query languages of <br>\nchoice in the database community, RC queries can evaluate to an infinite <br>\nrelation. Moreover, even in cases where the evaluation result of an RC query <br>\nwould be finite it is not clear how to efficiently compute it. Safe-range RC is <br>\nan interesting syntactic subclass of RC, because all safe-range queries evaluate <br>\nto a finite result and it is well-known how to evaluate such queries by <br>\ntranslating them to relational algebra. We formalize and prove correct our <br>\nrecent translation of an arbitrary RC query into a pair of safe-range queries. <br>\nAssuming an infinite domain, the two queries have the following meaning: The <br>\nfirst is closed and characterizes the original query's relative safety, i.e., <br>\nwhether given a fixed database (interpretation of atomic predicates with finite <br>\nrelations), the original query evaluates to a finite relation. The second <br>\nsafe-range query is equivalent to the original query, if the latter is <br>\nrelatively safe. The formalization uses the Refinement Framework to go from the <br>\nnon-deterministic algorithm described in the paper to a deterministic, <br>\nexecutable query translation. Our executable query translation is a first step <br>\ntowards a verified tool that efficiently evaluates arbitrary RC queries. This <br>\nvery problem is also solved by the AFP entry Eval_FO with a theoretically <br>\nincomparable but practically worse time complexity. (The latter is demonstrated <br>\nby our empirical evaluation.)</p>\n<p><a href=\"https://www.isa-afp.org/entries/Safe_Range_RC.html\">https://www.isa-afp.org/entries/Safe_Range_RC.html</a></p>\n<p>Enjoy!<br>\n<a href=\"/user_uploads/14278/yqUJht9ihbQnBcFo8sUFEqgi/smime.p7s\">smime.p7s</a></p>",
        "id": 301392089,
        "sender_full_name": "Email Gateway",
        "timestamp": 1664440433
    }
]