[
    {
        "content": "<p>From: \"Thiemann, René\" &lt;<a href=\"mailto:Rene.Thiemann@uibk.ac.at\">Rene.Thiemann@uibk.ac.at</a>&gt;<br>\nDear all,</p>\n<p>I’m happy to announce a new AFP entry.</p>\n<p>A Naive Prover for First-Order Logic<br>\n  by Asta Halkjær From</p>\n<p>The AFP entry Abstract Completeness by Blanchette, Popescu and Traytel<br>\nformalizes the core of Beth/Hintikka-style completeness proofs for first-order<br>\nlogic and can be used to formalize executable sequent calculus provers. In the<br>\nJournal of Automated Reasoning, the authors instantiate the framework with a<br>\nsequent calculus for first-order logic and prove its completeness. Their use of<br>\nan infinite set of proof rules indexed by formulas yields very direct arguments.<br>\nA fair stream of these rules controls the prover, making its definition<br>\nremarkably simple. The AFP entry, however, only contains a toy example for<br>\npropositional logic. The AFP entry A Sequent Calculus Prover for First-Order<br>\nLogic with Functions by From and Jacobsen also uses the framework, but uses a<br>\nfinite set of generic rules resulting in a more sophisticated prover with more<br>\ncomplicated proofs.</p>\n<p>This entry contains an executable sequent calculus prover for first-order logic<br>\nwith functions in the style presented by Blanchette et al. The prover can be<br>\nexported to Haskell and this entry includes formalized proofs of its soundness<br>\nand completeness. The proofs are simpler than those for the prover by From and<br>\nJacobsen but the performance of the prover is significantly worse.</p>\n<p>The included theory Fair-Stream first proves that the sequence of natural<br>\nnumbers 0, 0, 1, 0, 1, 2, etc. is fair. It then proves that mapping any<br>\nsurjective function across the sequence preserves fairness. This method of<br>\nobtaining a fair stream of rules is similar to the one given by Blanchette et<br>\nal. The concrete functions from natural numbers to terms, formulas and rules are<br>\ndefined using the Nat-Bijection theory in the HOL-Library.</p>\n<p><a href=\"https://www.isa-afp.org/entries/FOL_Seq_Calc3.html\">https://www.isa-afp.org/entries/FOL_Seq_Calc3.html</a></p>\n<p>Enjoy,<br>\nRené</p>",
        "id": 276996383,
        "sender_full_name": "Email Gateway",
        "timestamp": 1648556423
    }
]