[
    {
        "content": "<p>From: sorin stratulat &lt;<a href=\"mailto:sorin.stratulat@univ-lorraine.fr\">sorin.stratulat@univ-lorraine.fr</a>&gt;<br>\nPlease accept our apologies if you receive this call through multiple<br>\nchannels. We aim to ensure that all potentially interested parties are<br>\ninformed, but sometimes this leads to overlaps.</p>\n<p>————</p>\n<p>We are delighted to announce the Fifth International Workshop on Automated<br>\n(Co)inductive Theorem Proving, an event dedicated to the latest<br>\ndevelopments in inductive and coinductive methods for verification. This<br>\nworkshop is a significant gathering for researchers and practitioners in<br>\nthe field, providing an invaluable opportunity to explore current<br>\nchallenges and innovations in computational verification.</p>\n<p><em>Key Themes:</em></p>\n<p>- Advances in inductive reasoning for recursive structures and<br>\n   loop-containing programs.</p>\n<p>- Developments in coinductive methods and their growing relevance in<br>\n   verification and industrial applications.</p>\n<p>- Cross-disciplinary collaboration to foster innovation in computational<br>\n   verification methods, including SMT, HOL, FOL, etc.</p>\n<p><em>Featured Speakers Announcement:</em> We are thrilled to announce that this<br>\nyear’s workshop will feature four distinguished invited speakers:</p>\n<p>- Prof. Andrei Voronkov &lt;<a href=\"http://voronkov.com/\">http://voronkov.com/</a>&gt; from the University of<br>\n   Manchester and Ms. Petra Hozzová<br>\n   &lt;<a href=\"https://logic-cs.at/phd/students/petra-hozzova/\">https://logic-cs.at/phd/students/petra-hozzova/</a>&gt; from the Vienna<br>\n   University of Technology</p>\n<p>- Prof. Dmitriy Traytel &lt;<a href=\"https://traytel.bitbucket.io/\">https://traytel.bitbucket.io/</a>&gt; from the<br>\n   University of Copenhagen</p>\n<p>- Dr. Stefan Hetzl &lt;<a href=\"https://dmg.tuwien.ac.at/hetzl/\">https://dmg.tuwien.ac.at/hetzl/</a>&gt; from the Vienna<br>\n   University of Technology</p>\n<p><em>Call for Abstracts:</em> We invite you to submit an extended abstract<br>\nshowcasing your latest research, findings, or ongoing studies in the field<br>\nof automated (co)inductive theorem proving. This is a fantastic platform to<br>\nshare your work with a diverse and expert audience, engage in intellectual<br>\nexchange, and contribute to the advancement of the field. We welcome<br>\nstudies and findings published within the last five years.</p>\n<p><em>Submission Guidelines:</em> abstracts are to be sent to<br>\n<a href=\"mailto:wait.in.france@gmail.com\">wait.in.france@gmail.com</a></p>\n<p><em>Length:</em> 1-2 pages excluding references.</p>\n<p><em>Recommended Format</em>: easychair.cls<br>\n&lt;<a href=\"https://easychair.org/publications/easychair.zip\">https://easychair.org/publications/easychair.zip</a>&gt;</p>\n<p><em>Important Dates:</em></p>\n<p>- Abstract Submission Deadline: 15 May.<br>\n   - Notification of Acceptance: 1 June.</p>\n<p><em>Workshop Format:</em> The workshop will feature in-depth tutorials, talks by<br>\nleading experts, and a panel discussion for interactive dialogue. It is an<br>\nideal setting for networking, collaboration, and gaining new insights into<br>\nthe challenges and opportunities in automated theorem proving.</p>\n<p><em>Remote Participation:</em> While on-site attendance is encouraged to fully<br>\nbenefit from the interactive nature of the workshop, provisions for remote<br>\nparticipation will be available for wider accessibility.</p>\n<p><em>Dissemination and Special Issue:</em> Selected abstracts and presentation<br>\nslides will be published on the workshop website. There’s also a plan for a<br>\nspecial journal issue based on the workshop’s theme, subject to participant<br>\ninterest.</p>\n<p><em>Join Us!</em> Be a part of this stimulating event to discuss, learn, and<br>\ncontribute to the future of automated (co)inductive theorem proving. Don’t<br>\nmiss this opportunity to engage with a vibrant community and shape the<br>\nfuture of verification techniques. We look forward to your submissions and<br>\nparticipation!</p>\n<p>For more information, please contact the organizers, Yutaka Nagashima and<br>\nSorin Stratulat at <a href=\"mailto:wait.in.france@gmail.com\">wait.in.france@gmail.com</a>.</p>",
        "id": 437244353,
        "sender_full_name": "Email Gateway",
        "timestamp": 1714995452
    }
]