[
    {
        "content": "<p>From: \"\\\"Marmsoler, Diego\\\"\" &lt;<a href=\"mailto:cl-isabelle-users@lists.cam.ac.uk\">cl-isabelle-users@lists.cam.ac.uk</a>&gt;<br>\n6th International Workshop on Formal Methods for Blockchains - Second Call for Papers</p>\n<p><a href=\"https://fmbc.gitlab.io/2025\">https://fmbc.gitlab.io/2025</a></p>\n<p>May 04, 2025, Hamilton, ON, Canada</p>\n<p>Co-located with the European joint conferences on theory and practice of software (ETAPS 2025)</p>\n<p><a href=\"https://www.etaps.org/2025/\">https://www.etaps.org/2025/</a></p>\n<hr>\n<hr>\n<p>IMPORTANT DATES</p>\n<hr>\n<p>Abstract submission: February 3rd, 2025<br>\nFull paper submission: February 10th, 2025<br>\nNotification: March 14th, 2025<br>\nCamera-ready: March 31st, 2025<br>\nWorkshop: May 4th, 2025</p>\n<p>Deadlines are Anywhere on Earth:<br>\n<a href=\"https://en.wikipedia.org/wiki/Anywhere_on_Earth\">https://en.wikipedia.org/wiki/Anywhere_on_Earth</a></p>\n<hr>\n<hr>\n<p>TOPICS OF INTEREST</p>\n<hr>\n<p>Blockchain is a novel technology to store data in a decentralized way.<br>\nAlthough the technology was originally invented to enable cryptocurrencies, it quickly found applications in several other domains.</p>\n<p>Blockchains may also provide support for Smart Contracts. Smart Contracts are scripts of an ad-hoc programming language that are<br>\nstored in the blockchain and that run on the network. They can interact with the ledger's data and update its state.<br>\nThese scripts can express the logic of possibly complex contracts between users of the blockchain. Thus, Smart Contracts can facilitate<br>\nthe economic activity of blockchain participants.</p>\n<p>Since blockchains are often used to store financial transactions, bugs may result in huge economic losses and thus it is now of utmost<br>\nimportance to have strong guarantees of the behaviour of blockchain software. These guarantees can be brought by using Formal Methods.<br>\nIndeed, Blockchain software encompasses many topics of computer science where using Formal Methods techniques and tools is relevant:<br>\nconsensus algorithms to ensure the liveness and the security of the data on the chain, programming languages specifically designed to<br>\nwrite smart contracts, cryptographic protocols, such as zero-knowledge proofs, used to ensure privacy, etc.</p>\n<p>This workshop is a forum to identify theoretical and practical approaches of formal methods for Blockchain technology.<br>\nTopics include, but are not limited to:</p>\n<ul>\n<li>Formal models of Blockchain applications or concepts</li>\n<li>Formal methods for consensus protocols</li>\n<li>Formal methods for Blockchain-specific cryptographic primitives or protocols</li>\n<li>Design and implementation of Smart Contract languages</li>\n<li>Verification of Smart Contracts</li>\n<li>Zero-knowledge proof and its applications in a blockchain setting</li>\n</ul>\n<hr>\n<hr>\n<p>SUBMISSION</p>\n<hr>\n<p>Submit original manuscripts (not published or considered elsewhere) with a page limit of 12 pages for full papers and 6 pages for short and tool papers<br>\n(excluding bibliography and short appendix of up to 5 additional pages).</p>\n<p>Alternatively you may also submit an extended abstract of up to 3 pages (including bibliography) summarizing your ongoing work in the area of<br>\nformal methods and blockchain. Authors of selected extended-abstracts are invited to give a short lightning talk. Extended abstracts will not occur in<br>\nthe workshop proceedings.</p>\n<p>Submission link: <a href=\"https://easychair.org/conferences/?conf=fmbc2025\">https://easychair.org/conferences/?conf=fmbc2025</a></p>\n<p>Authors are encouraged to use LaTeX and prepare their submissions according to the instructions and styling guides for OASIcs provided by Dagstuhl.</p>\n<p>Instructions for authors:</p>\n<p><a href=\"https://submission.dagstuhl.de/documentation/authors#oasics\">https://submission.dagstuhl.de/documentation/authors#oasics</a></p>\n<p>At least one author of an accepted paper is expected to present the paper at the workshop as a registered participant.</p>\n<hr>\n<hr>\n<p>PROCEEDINGS</p>\n<hr>\n<p>All submissions will be peer-reviewed by at least three members of the program committee for quality and relevance.<br>\nAccepted regular papers (full, short, and tool papers) will be included in the workshop proceeding, which will be published as a volume of the<br>\nOpenAccess Series in Informatics (OASIcs) by Dagstuhl.</p>\n<hr>\n<hr>\n<p>PROGRAM COMMITTEE</p>\n<hr>\n<p>PC CO-CHAIRS</p>\n<ul>\n<li>Diego Marmsoler (University of Exeter, UK) (D.Marmsoler@exeter.ac.uk&lt;mailto:<a href=\"mailto:D.Marmsoler@exeter.ac.uk\">D.Marmsoler@exeter.ac.uk</a>&gt;)</li>\n<li>Meng Xu (University of Waterloo, Canada) (meng.xu.cs@uwaterloo.ca&lt;mailto:<a href=\"mailto:meng.xu.cs@uwaterloo.ca\">meng.xu.cs@uwaterloo.ca</a>&gt;)</li>\n</ul>\n<p>PC MEMBERS</p>\n<ul>\n<li>Massimo Bartoletti (University of Cagliari)</li>\n<li>Bernhard Beckert (Karlsruhe Institute of Technology)</li>\n<li>Franck Cassez (Movement Labs)</li>\n<li>Denisa Diaconescu (University of Bucharest)</li>\n<li>Maurice Herlihy (Brown University)</li>\n<li>Sebastian Holler (Max Planck Institute for Security and Privacy)</li>\n<li>Enrico Lipparini (University of Genoa)</li>\n<li>Fan Long (University of Toronto)</li>\n<li>Orestis Melkonian (Input Output (IOG))</li>\n<li>Baoluo Meng (GE Aerospace Research)</li>\n<li>Burcu Kulahcioglu Ozkan (Delft University of Technology)</li>\n<li>Gordon Pace (University of Malta)</li>\n<li>Vincent Rahli (University of Birmingham)</li>\n<li>Sophie Rain (TU Wien)</li>\n<li>Augusto Sampaio (Federal university of Pernambuco)</li>\n<li>Derek Sorensen (Certora)</li>\n<li>Bas Spitters (Aarhus University)</li>\n<li>Meng Sun (Peking University)</li>\n<li>Mark Utting (The University of Queensland)</li>\n<li>Adele Veschetti (TU Darmstadt)</li>\n<li>Christoph Weidenbach (Max Planck Institute for Informatics)</li>\n<li>Teng Zhang (Aptos Labs)</li>\n</ul>",
        "id": 494324061,
        "sender_full_name": "Email Gateway",
        "timestamp": 1737108229
    }
]