[
    {
        "content": "<p>From: \"Thiemann, René\" &lt;<a href=\"mailto:Rene.Thiemann@uibk.ac.at\">Rene.Thiemann@uibk.ac.at</a>&gt;<br>\nThe CHSH inequality: Tsirelson's upper-bound and other results<br>\n  by Mnacho Echenim, Mehdi Mhalla, and Coraline Mori</p>\n<p>The CHSH inequality, named after Clauser, Horne, Shimony and Holt, was used by<br>\nAlain Aspect to prove experimentally that Einstein's hypothesis stating that<br>\nquantum mechanics could be defined using local hidden variables was incorrect.<br>\nThe CHSH inequality is based on a setting in which an experiment consisting of<br>\ntwo separate parties performing joint measurements is run several times, and a<br>\nscore is derived from these runs. If the local hidden variable hypothesis had<br>\nbeen correct, this score would have been bounded by 2, but a suitable choice of<br>\nobservables in a quantum setting permits to violate this inequality when<br>\nmeasuring the Bell state; this is the result that Aspect obtained<br>\nexperimentally. Tsirelson answered the question of how large this violation<br>\ncould be by proving that in the quantum setting, the highest score that can be<br>\nobtained when running this experiment is 2 * sqrt(2). Along with elementary<br>\nresults on density matrices which represent quantum states in the finite<br>\ndimensional setting, we formalize Tsirelson's result and summarize the main<br>\nresults on the CHSH score:</p>\n<ol>\n<li>\n<p>Under the local hidden variable hypothesis, this score admits 2 as an<br>\n   upper-bound.</p>\n</li>\n<li>\n<p>When the density matrix under consideration is separable, the upper-bound<br>\n   cannot be violated.</p>\n</li>\n<li>\n<p>When one of the parties in the experiment performs measures using commuting<br>\n   observables, this upper-bound remains valid.</p>\n</li>\n<li>\n<p>Otherwise, the upper-bound of this score is 2 * sqrt(2), regardless of the<br>\n   observables that are used and the quantum state that is measured, and</p>\n</li>\n<li>\n<p>This upper-bound is reached for a suitable choice of observables when<br>\n   measuring the Bell state.</p>\n</li>\n</ol>\n<p>Enjoy!</p>",
        "id": 358940172,
        "sender_full_name": "Email Gateway",
        "timestamp": 1684317711
    }
]