[
    {
        "content": "<p>From: Joe Wells &lt;<a href=\"mailto:cl-isabelle-users@lists.cam.ac.uk\">cl-isabelle-users@lists.cam.ac.uk</a>&gt;<br>\ndear experts in writing academic papers connected to isabelle,</p>\n<p>a reviewer of a paper using somewhat isabelle-inspired syntax complained<br>\nabout too much “type theory slang” that “makes it very hard for someone<br>\nnot deeply in that world”.  (i think this reviewer has likely not been<br>\nasked to review papers on homotopy type theory.)</p>\n<p>we promised this reviewer that we would make various changes and they<br>\ngraciously raised their -2 reject to a 0 neutral and our paper was<br>\naccepted on the strength of the other reviews.</p>\n<p>one of the changes we promised was that we would attempt to include<br>\nbetter explanations of higher-order abstract syntax.</p>\n<p>are there any papers that explain this aspect of isabelle in a way that<br>\nyou find particularly good?  we would like to see how they do it.  can<br>\nyou recommend good examples?  ideally short papers, as we only have 16<br>\npages lncs format.</p>\n<p>thanks for any advice you can give.</p>\n<p>best wishes,</p>\n<p>joe</p>\n<hr>\n<p>Founded in 1821, Heriot-Watt is a leader in ideas and solutions. With campuses and students across the entire globe we span the world, delivering innovation and educational excellence in business, engineering, design and the physical, social and life sciences. This email is generated from the Heriot-Watt University Group, which includes:</p>\n<p>1.  Heriot-Watt University, a Scottish charity registered under number SC000278<br>\n  2.  Heriot- Watt Services Limited (Oriam), Scotland's national performance centre for sport. Heriot-Watt Services Limited is a private limited company registered is Scotland with registered number SC271030 and registered office at Research &amp; Enterprise Services Heriot-Watt University, Riccarton, Edinburgh, EH14 4AS.</p>\n<p>The contents (including any attachments) are confidential. If you are not the intended recipient of this e-mail, any disclosure, copying, distribution or use of its contents is strictly prohibited, and you should please notify the sender immediately and then delete it (including any attachments) from your system.</p>",
        "id": 290282289,
        "sender_full_name": "Email Gateway",
        "timestamp": 1658343612
    },
    {
        "content": "<p>From: Manuel Eberl &lt;<a href=\"mailto:manuel@pruvisto.org\">manuel@pruvisto.org</a>&gt;<br>\nHello,</p>\n<p>I don't know what your paper is about and what \"type theory slang\" it <br>\ncontains. I don't think anyone needs to know a lot of type theory to <br>\nunderstand <em>applications</em> of Isabelle; papers <em>about</em> Isabelle itself <br>\nmay be another matter (albeit still fairly simple compared to, as you <br>\nrightly said, something like Homotopy Type Theory). But then one would <br>\nbe justified in saying that the reader of such a paper can be expected <br>\nto know a bit about types.</p>\n<p>Well, it's hard to say without knowing the context of that remark. But I <br>\nfor one have never gotten such complaints even in non-theorem-proving <br>\nvenues like ISSAC. Perhaps you just had bad luck with your reviewer?</p>\n<p>Anyway, regarding your question: could you explain what you mean by <br>\n\"higher-order abstract syntax\" in the context of Isabelle? Are you <br>\ntalking about the way terms are represented in Isabelle internally?</p>\n<p>Manuel</p>",
        "id": 290284302,
        "sender_full_name": "Email Gateway",
        "timestamp": 1658344425
    },
    {
        "content": "<p>From: Yakoub Nemouchi &lt;<a href=\"mailto:y.nemouchi@gmail.com\">y.nemouchi@gmail.com</a>&gt;<br>\nEither you run into the wrong reviewer or you submitted to the wrong<br>\nconference, but I am not going to debate about that.</p>\n<p>Please feel free to check Isabelle papers published in ITP.</p>\n<p>I ran into similar situations when I publish in certain  communities that<br>\nare supposed to be Formal Methods communities, however they have a hard<br>\ntime to understand what Isabelle actually is.</p>\n<p>They think that the executable document model that Isabelle offers, and its<br>\nextenstion to a proof document for higher order logic (Isabelle/HOL), is<br>\njust a kind of source code and should not appear in the paper.</p>\n<p>I hope one day they understand what ISAR is, and that Isabelle offers a<br>\nuniversal notation for logic when implemented on a machine, and it follows<br>\nmike gordon book introduction to HOL to some extent.</p>\n<p>But I will not spend my time convincing “formal methods” communities to<br>\nunderstand that.</p>\n<p>What I usually try to do is to translate what I  have to a text book like<br>\nnotations,eg., relational notations and a like.</p>\n<p>Best wishes,</p>\n<p>Yakoub.</p>",
        "id": 290285650,
        "sender_full_name": "Email Gateway",
        "timestamp": 1658345011
    },
    {
        "content": "<p>From: Tobias Nipkow &lt;<a href=\"mailto:nipkow@in.tum.de\">nipkow@in.tum.de</a>&gt;<br>\nThe use of higher-order abstract syntax, i.e. lambda terms, to express variable <br>\nbinding operators is absolutely standard and Isabelle is just one of many <br>\nsystems that employ this technique. Essentially, the idea goes back to Church: <br>\nin his 1932 paper on lambda calculus he introduces constants for existential and <br>\nuniversal quantifiers that take functions as arguments. The idea was (first?) <br>\nimplemented in Automath. The name probably goes back to Frank Pfenning's highly <br>\ninfluential eponymous paper.</p>\n<p>I am sure you are well aware of all of this. The idea of higher-order abstract <br>\nsyntax is really quite basic, once you understand lambda calculus, and I don't <br>\nsee that you need a lot of space to explain it. Most certainly there is nothing <br>\nspecial about Isabelle in this respect - except that Larry was one of the first <br>\npeople to implement higher order unification as a means for automating <br>\ndeductions involving lamda the terms.</p>\n<p>Tobias<br>\n<a href=\"/user_uploads/14278/j0mT99Iyr8__a2NCRn3I-Ynn/smime.p7s\">smime.p7s</a></p>",
        "id": 290287871,
        "sender_full_name": "Email Gateway",
        "timestamp": 1658345928
    },
    {
        "content": "<p>From: Joe Wells &lt;<a href=\"mailto:cl-isabelle-users@lists.cam.ac.uk\">cl-isabelle-users@lists.cam.ac.uk</a>&gt;<br>\nyes, exactly.</p>\n<p>i am wondering if there is a standard chunk of text (2 or 3 sentences, <br>\nperhaps a displayed formula or 2) that can be given (with some <br>\nvariation) to help mathematicians read this stuff.</p>\n<p>of course, i can write such explanations, but i was wondering if there <br>\nwere two or three papers that people thought did an especially good job <br>\nof it.</p>\n<p>thanks for any examples any of you can point me toward.</p>\n<p>best wishes</p>\n<p>joe</p>",
        "id": 290289276,
        "sender_full_name": "Email Gateway",
        "timestamp": 1658346579
    },
    {
        "content": "<p>From: \"John F. Hughes\" &lt;<a href=\"mailto:jfh@cs.brown.edu\">jfh@cs.brown.edu</a>&gt;<br>\nLet me echo Manuel's remark: \"[ways to] help mathematicians read *this<br>\nstuff*\" would be much easier to provide if you'd tell us explicitly, by at<br>\nleast 2 or 3 examples, exactly what \"this stuff\" is. Go ahead and paste in<br>\na paragraph of the paper you wrote! Please!</p>",
        "id": 290290251,
        "sender_full_name": "Email Gateway",
        "timestamp": 1658347076
    }
]