[
    {
        "content": "<p>From: <a href=\"mailto:itp2021-workshops@easyconferences.eu\">itp2021-workshops@easyconferences.eu</a></p>\n<hr>\n<p>ITP2021: Interactive Theorem Proving, 12th International Conference <br>\n2021, June 29-July 1, Rome, Italy <br>\n<a href=\"http://easyconferences.eu/itp2021/\">http://easyconferences.eu/itp2021/</a> [1]  </p>\n<hr>\n<p>CALL FOR WORKSHOPS </p>\n<p>The ITP conference series is concerned with all topics related to <br>\ninteractive theorem proving, ranging from theoretical foundations to <br>\nimplementation aspects and applications in system verification, <br>\nsecurity, and formalization of mathematics. The 12th ITP conference, <br>\nITP 2021, will be held in Rome between 29 June and 1 July. <br>\nIt will be co-located with LICS and ICTCS conferences. </p>\n<p>ITP will carefully monitor the development of the COVID-19 pandemic, <br>\nand take guidance from the health authorities to determine whether <br>\nITP21 will be held physically, virtually, or in a hybrid manner. </p>\n<p>Researchers and practitioners are invited to submit proposals for <br>\nco-located workshops on topics relating to interactive theorem <br>\nproving. Workshops can target the ITP community in general, focus on a <br>\nparticular ITP system, or highlight more specific issues or recent <br>\ndevelopments. Proposals for in-depth tutorials or tool introductions <br>\nare also welcome. </p>\n<p>Co-located events will take place on 28 June and 2 July and <br>\nwill be held on the same premises as the main conference. In case of  <br>\nneeds, we are ready to discuss and try to accommodate requests for  <br>\ntwo-day workshops. Conference facilities are offered free of charge to  <br>\none of the organizers and one of the invited speakers. Workshop-only  <br>\nattendees will enjoy a significantly reduced registration fee. </p>\n<p>Detailed organizational matters such as paper submission and review <br>\nprocess, or publication of proceedings, are up to the organizers of <br>\nindividual workshops. All accepted workshops will be expected to have <br>\ntheir program ready by 4 June, 2021. </p>\n<p>Proposals for workshops should contain at least the following pieces <br>\nof information: </p>\n<p>* name and contact details of the main organizer(s)<br>\n    * (if applicable:) names of additional organizers</p>\n<p>* title and organizational style of the workshop (tutorial, public<br>\nworkshop, project workshop, etc.)   * preferred length of the workshop<br>\n(half day or full day)<br>\n    * estimated number of attendees<br>\n    * short (up to one page) description of the topic</p>\n<p>* (if applicable:) pointers to previous editions of the workshop, or<br>\nto similar events   * (if applicable:) special needs for an online event</p>\n<p>Proposals should be submitted by email to  <br>\n<a href=\"mailto:itp2021-workshops@easyconferences.eu\">itp2021-workshops@easyconferences.eu</a>, <br>\nno later than 11 January, 2021. <br>\nSelected workshops will be notified by 15 January, 2021. </p>\n<p>Links:</p>\n<hr>\n<p>[1] <a href=\"http://easyconferences.eu/itp2021/\">http://easyconferences.eu/itp2021/</a></p>",
        "id": 218814559,
        "sender_full_name": "Email Gateway",
        "timestamp": 1607077094
    }
]