[
    {
        "content": "<p>From: Daniel Kirchner &lt;<a href=\"mailto:daniel@ekpyron.org\">daniel@ekpyron.org</a>&gt;<br>\nHi,</p>\n<p>Sorry, if this has come up before, but I'm wondering about the<br>\nfollowing:</p>\n<p>consts test :: ‹'a ⇒ 'b ⇒ 'c›<br>\n    notation test (infixl ‹→› 8)<br>\n    syntax test :: ‹any ⇒ any ⇒ any› (infixl ‹↦› 8)</p>\n<p>term ‹x → y›<br>\n    term ‹x ↦ y›</p>\n<p>Apparently the arrow in the first term that was introduced using<br>\n\"notation\", PIDE markup is generated associating the arrow with the<br>\nconstant declaration of \"test\", i.e. the arrow is clickable in<br>\nIsabelle/jedit and links to the declaration of the constant \"test\".<br>\nHowever, the arrow in the second term, introduced by \"syntax\" does not<br>\nseem to produce similar markup information, e.g. it is not clickable in<br>\nIsabelle/jedit.<br>\nLooking at the PIDE markup information itself, I see both arrows<br>\nmarked as \"delimiter\", but indeed only the former additionally getting an<br>\nentity reference to the constant definition.</p>\n<p>I understand that \"notation\" and \"syntax\" work quite differently (and<br>\n\"syntax\" does not even necessarily refer to anything with a specific<br>\ndeclaration position), but I'm still wondering:</p>\n<ul>\n<li>\n<p>Is there currently any way to associate \"syntax\" with position markup<br>\n  similarly to what \"notation\" does that I'm missing, possibly involving<br>\n  Isabelle/ML?</p>\n</li>\n<li>\n<p>If not, are there any plans for making this possible at least<br>\n  \"manually\" or even for automatically generating such markup, where<br>\n  applicable? Automatically might be tricky, e.g. I'd want to specify<br>\n  that a purely syntactic constant \"_test\" refers to some specific<br>\n  declaration as well, etc. - but \"manually\" even using ML would also<br>\n  help. And even only referring to the position of the \"syntax\" command<br>\n  itself might be better than having no associated position at all.</p>\n</li>\n<li>\n<p>If not, I'd be eager to understand the issues involved and why this is<br>\n  inherently more difficult for \"syntax\".</p>\n</li>\n</ul>\n<p>Best wishes,<br>\nDaniel Kirchner</p>",
        "id": 257199009,
        "sender_full_name": "Email Gateway",
        "timestamp": 1634043940
    }
]