[
    {
        "content": "<p>From: \"Thiemann, René\" &lt;<a href=\"mailto:Rene.Thiemann@uibk.ac.at\">Rene.Thiemann@uibk.ac.at</a>&gt;<br>\nDear all,</p>\n<p>there are two further AFP entries from the Cambridge team, this time by Chelsea.</p>\n<p>Hypergraphs<br>\n  by Chelsea Edmonds</p>\n<p>This entry is a simple extension of the Combinatorial design theory library,<br>\nwhich presents new and existing concepts using hypergraph language. Both designs<br>\nand hypergraphs are types of incidence set systems and hence have the same<br>\nunderlying foundation. However, they are often used in different contexts, and<br>\nsome definitions are unique. This library uses locales to rewrite equivalent<br>\ndefinitions and build a basic hypergraph hierarchy with direct links to<br>\nequivalent design theory concepts to avoid repetition, further demonstrating the<br>\npower of the \"locale-centric\" approach. The library includes all standard<br>\ndefinitions (order, degree etc.), as well as some extensions on hypergraph<br>\ndecompositions and spanning subhypergraphs.</p>\n<p><a href=\"https://www.isa-afp.org/entries/Hypergraph_Basics.html\">https://www.isa-afp.org/entries/Hypergraph_Basics.html</a></p>\n<p>General Probabilistic Techniques for Combinatorics and the Lovasz Local Lemma<br>\n  by Chelsea Edmonds</p>\n<p>This entry aims to formalise several useful general techniques for using the<br>\nprobabilistic method for combinatorial structures (or discrete spaces more<br>\ngenerally). In particular, it focuses on bounding tools for combinatorics, such<br>\nas the union and complete independence bounds, and the first formalisation of<br>\nthe pivotal Lovász local lemma. The formalisation focuses on the general lemma,<br>\nhowever also proves several useful variations, including the more well-known<br>\nsymmetric version. Both the original formalisation and several of the variations<br>\nused dependency graphs, which were formalised using Noschinski's general<br>\ndirected graph library. Additionally, the entry provides several useful<br>\nexistence lemmas, required at the end of most probabilistic proofs on<br>\ncombinatorial structures. Finally, the entry includes several significant<br>\nextensions to the existing probability libraries, particularly for conditional<br>\nprobability (such as Bayes theorem) and independent events. The formalisation is<br>\nprimarily based on Alon and Spencer's textbook \"The Probabilistic Method\", as<br>\nwell as Zhao's course notes on the subject.</p>\n<p><a href=\"https://www.isa-afp.org/entries/Lovasz_Local.html\">https://www.isa-afp.org/entries/Lovasz_Local.html</a></p>\n<p>Enjoy,<br>\nRené</p>",
        "id": 392494881,
        "sender_full_name": "Email Gateway",
        "timestamp": 1695380829
    }
]