[
    {
        "content": "<p>From: \"Donaldson, Alastair F\" &lt;<a href=\"mailto:alastair.donaldson@imperial.ac.uk\">alastair.donaldson@imperial.ac.uk</a>&gt;<br>\nDear all</p>\n<p>Please help spread the word about POPL 2024, which is now open for registration! Details below.</p>\n<p>Best wishes</p>\n<p>Ally Donaldson and John Wickerson<br>\nPOPL 2024 Publicity Chairs</p>\n<p>POPL 2024 - Call for Participation</p>\n<p><strong> Early registration deadline: 14 December 2023 </strong></p>\n<p>Come and join us for POPL 2024, in January, in the heart of London!</p>\n<p>Register here: <a href=\"https://popl24.sigplan.org/attending/registration\">https://popl24.sigplan.org/attending/registration</a></p>\n<p>Location: Institution of Engineering and Technology (IET), Savoy Place, London, WC2R 0BL</p>\n<p>Dates:</p>\n<ul>\n<li>Main conference: Wed 17 - Fri 19 January</li>\n<li>Workshops, tutorials, co-located events: Sun 14, Mon 15, Tue 16 and Sat 20 January</li>\n</ul>\n<p>Invited speakers</p>\n<ul>\n<li>Azadeh Farzan, University of Toronto</li>\n<li>Nate Foster, Cornell University</li>\n</ul>\n<p>Accepted papers: <a href=\"https://popl24.sigplan.org/track/POPL-2024-popl-research-papers\">https://popl24.sigplan.org/track/POPL-2024-popl-research-papers</a></p>\n<p>Full details of the conference and co-located events: <a href=\"https://popl24.sigplan.org/\">https://popl24.sigplan.org/</a></p>\n<p>Sponsors: POPL is supported by generous sponsorship from:</p>\n<ul>\n<li>Jane Street</li>\n<li>Amazon</li>\n<li>ahrefs</li>\n<li>JetBrains</li>\n<li>Input</li>\n<li>Certora</li>\n<li>Google</li>\n<li>Epic</li>\n</ul>\n<p>The 51st ACM SIGPLAN Symposium on Principles of Programming Languages (POPL 2024) will take place in January in the heart of London, at the Institution of Engineering and Technology (IET). As well as presentations of the highest quality research papers on Programming Languages, the POPL 2024 technical programme will feature keynote talks from Azadeh Farzan and Nate Foster, and will be complemented by more than 25 co-located workshops, tutorials and other events!</p>\n<p>As well as the main POPL24 reception on Wed 17 January, the conference will feature a DEI4Everyone cocktail reception on Thu 18 January, which is free thanks to generous support from Jane Street. The reception will feature short talks from DEI representatives reflecting on their experiences around DEI issues. The event is open to everyone and our goal is to foster DEI discussions, all while drinking fabulous cocktails! This will also be an opportunity for people to form groups to go to dinner and get to know each other afterwards. Please sign up - see the registration link above for details.</p>\n<p>The Strand Palace conference hotel has a close relationship with IET. It has e.g. cosy single rooms with single beds which provides a good cheap option right in the heart of central London. In addition, if you don’t get your towels cleaned, you get £7 to spend e.g. in the bar after dinner!</p>\n<p>It's going to be an amazing conference - don't miss it - sign up now! <a href=\"https://popl24.sigplan.org/attending/registration\">https://popl24.sigplan.org/attending/registration</a></p>",
        "id": 401779720,
        "sender_full_name": "Email Gateway",
        "timestamp": 1699887151
    }
]