[
    {
        "content": "<p>From: Hanno &lt;<a href=\"mailto:hannobecker@posteo.de\">hannobecker@posteo.de</a>&gt;<br>\nHi,</p>\n<p>In the context of a very large development, I am using some custom <code>notation</code> and noticed that in a specific instance, removing the notation via <code>no_notation</code> and then immediately adding it back again — with the same syntax and priorities — leads to a very significant (&gt;10x) slowdown of Isabelle, even in files that do not use the notation. </p>\n<p>I was so far under the impression that <code>no_notation</code> and <code>notation</code> are inverse to each other when given the same arguments.</p>\n<p>Can someone help me understand, and hopefully circumvent, the observed performance degradation? </p>\n<p>My real goal is of course not do disable and immediately re-enable the same notation, but to disable and replace it by something else — which however leads to the same performance drop.</p>\n<p>Thank you for your time and help,<br>\nHanno</p>",
        "id": 340123770,
        "sender_full_name": "Email Gateway",
        "timestamp": 1678199464
    },
    {
        "content": "<p>From: Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt;<br>\nMathematically they are normally inverse, but physically many side-conditions <br>\napply.</p>\n<p>Do you have a concrete example, where the performance drop can be observed?</p>\n<p>Or even better, to you have an abstract example, where the problem can be <br>\nreproduced in isolation?</p>\n<p>(If this is a bigger piece of source text, don't post it here, but provide a <br>\nsuitable link for download.)</p>\n<p>Makarius</p>",
        "id": 340146337,
        "sender_full_name": "Email Gateway",
        "timestamp": 1678204567
    },
    {
        "content": "<p>From: Manuel Eberl &lt;<a href=\"mailto:manuel@pruvisto.org\">manuel@pruvisto.org</a>&gt;<br>\nI would just like to interject that there was that performance problem <br>\nwith the p-adic number entry in the AFP by Aaron Crighton, where <br>\nentering and exiting locale contexts was exceptionally slow (in the <br>\norder of magnitude of minutes).</p>\n<p>I don't understand the underlying mechanisms here enough to really say <br>\nanything substantial, but I do wonder if this might be related.</p>\n<p>Cheers,</p>\n<p>Manuel</p>",
        "id": 340147316,
        "sender_full_name": "Email Gateway",
        "timestamp": 1678204791
    }
]