[
    {
        "content": "<p><strong>From:</strong> Gerwin Klein &lt;<a href=\"mailto:cl-isabelle-users@lists.cam.ac.uk\">cl-isabelle-users@lists.cam.ac.uk</a>&gt;</p>\n<p>Following the Isabelle release, the AFP is now available for Isabelle2025-1 from <a href=\"https://isa-afp.org\">https://isa-afp.org</a></p>\n<p>There are now more than 5 million lines of Isabelle proof in 944 entries by 576 authors.</p>\n<p>Five new entries have become available from the home page that were previously only available in the development version:</p>\n<ul>\n<li>\n<p>Dedekind Sums<br>\n  by Manuel Eberl, Anthony Bordg, Lawrence C. Paulson and Wenda Li<br>\n<a href=\"https://www.isa-afp.org/entries/Dedekind_Sums.html\">https://www.isa-afp.org/entries/Dedekind_Sums.html</a></p>\n</li>\n<li>\n<p>Complex Lattices, Elliptic Functions, and the Modular Group<br>\n  by Manuel Eberl, Anthony Bordg, Wenda Li  and Lawrence C. Paulson<br>\n<a href=\"https://www.isa-afp.org/entries/Elliptic_Functions.html\">https://www.isa-afp.org/entries/Elliptic_Functions.html</a></p>\n</li>\n<li>\n<p>The Partition Function and the Pentagonal Number Theorem<br>\n  by Manuel Eberl<br>\n<a href=\"https://www.isa-afp.org/entries/Pentagonal_Number_Theorem.html\">https://www.isa-afp.org/entries/Pentagonal_Number_Theorem.html</a></p>\n</li>\n<li>\n<p>Typed Ordered Resolution<br>\n  by Adnan Mohammed Ahmed and Balazs Toth<br>\n<a href=\"https://www.isa-afp.org/entries/Typed_Ordered_Resolution.html\">https://www.isa-afp.org/entries/Typed_Ordered_Resolution.html</a><br>\n  Ordered Resolution is a proof calculus for reasoning about first-order<br>\n  logic that is implemented in many automatic theorem provers. It works<br>\n  by saturating the given set of clauses and is refutationally complete,<br>\n  meaning that if the set is inconsistent, the saturation will contain a<br>\n  contradiction. In this formalization, we restructured the completeness<br>\n  proof to cleanly separate the ground (i.e., variable-free) and<br>\n  nonground aspects. We also added a type system to the calculus. We<br>\n  relied on the library for first-order clauses and on the saturation<br>\n  framework.</p>\n</li>\n<li>\n<p>Zippy - Generic White-Box Proof Search with Zippers<br>\n  by Kevin Kappelmann<br>\n<a href=\"https://www.isa-afp.org/entries/Zippy.html\">https://www.isa-afp.org/entries/Zippy.html</a></p>\n<p>This entry contains Zippy, a framework for tree-based searches. Zippy<br>\nis largely independent of concrete search tree representations, search<br>\nalgorithms, states and effects. It is designed to create analysable<br>\nand navigable searches that are open to customisation and extensions<br>\nby users. An accompanying arXiv preprint is available here.</p>\n<p>This entry also provides a concrete instantiation of the framework in<br>\nthe form of a general purpose white-box prover, called zip. The prover<br>\nperforms a proof tree search with customisable expansion actions and<br>\nsearch strategies, including A, breadth-first, depth-first, and<br>\nbest-first search. By default, it integrates the classical reasoner,<br>\nsimplifier, the blast and metis prover, and supports resolution with<br>\nhigher-order and proof-producing unification, conditional substitutions,<br>\ncase splitting, and induction, among other things. Users are free to<br>\nextend the prover with additional expansion actions and search<br>\nstrategies. We demonstrate the capabilities of zip in an examples theory.</p>\n<p>In most cases, zip can be used as a drop-in replacement for<br>\nIsabelle's classical methods, including auto, fastforce, force, fast, etc.<br>\nWe demonstrate this with a benchmark containing 2267 method calls from<br>\nIsabelle's standard library, where zip achieves a success rate of<br>\n99.82% (2263/2267).</p>\n<p>The Zippy framework is founded on concepts from functional programming<br>\ntheory, particularly zippers, arrows, monads, lenses, and coroutines.<br>\nThis entry contains a library of mentioned concepts for Isabelle/ML.</p>\n</li>\n</ul>\n<p>Enjoy!<br>\nGerwin</p>\n<p>This email and any files transmitted with it may contain confidential information. If you believe you have received this email or any of its contents in error, please notify me immediately by return email and destroy this email. Do not use, disseminate, forward, print or copy any contents of an email received in error.</p>",
        "id": 564792877,
        "sender_full_name": "Email Gateway",
        "timestamp": 1766192164
    }
]