[
    {
        "content": "<p>From: Lawrence Paulson &lt;<a href=\"mailto:lp15@cam.ac.uk\">lp15@cam.ac.uk</a>&gt;<br>\nHaving lost the use of the workstation in my office, I’m wondering about getting a really powerful laptop for working at home. Does anybody have experience with the 16‑inch MacBook Pro? Any advice on the choice between i7 (6 core) and i9 (8 core) processors? The latter cost more but the single-core processor speed is actually less.</p>\n<p>Larry</p>",
        "id": 207767609,
        "sender_full_name": "Email Gateway",
        "timestamp": 1598180412
    },
    {
        "content": "<p>From: Alessandro Coglio &lt;<a href=\"mailto:coglio@kestrel.edu\">coglio@kestrel.edu</a>&gt;<br>\n[Sharing this with the mailing list, as suggested by Larry, and with some added text about RAM.]</p>\n<p>I’ve had that laptop since December and I’m happy with it. The current model may be even slightly better than that first model.</p>\n<p>I got the maximum configuration, which was expensive, but worth it in my opinion. (However, if you don’t need 8 TB of disk but can do with 4 TB, you can save quite a bit).</p>\n<p>I don’t have figures to compare 6-core vs. 8-core, but I went for the 8-core because higher parallelism seems generally more useful than higher single-core speed, particularly for Isabelle’s parallel processing in the IDE (which may be a major use case of yours).</p>\n<p>I definitely recommend the max 64 GiB memory. I tend to keep a lot of apps open, including IDEs, and memory fills up quickly for me. Unfortunately I haven’t had a chance to use Isabelle much lately, but perhaps others on this mailing list have figures about the memory used by large Isabelle projects — macOS’s Activity Monitor shows that (as everybody probably already knows).</p>\n<p>Graphics is good too. At the desk, I use both the laptop screen at its full resolution (aside: you need an app to use full resolution, if you want to pack a lot of information on the screen and can see well the small font/features) and a 4k monitor. The laptop can drive even more than that (the tech specs should specify that). I use macOS virtual desktops a lot, and the swiping/switching is quick and responsive; it gets perhaps just slightly slower when I start having 20 or more such virtual desktops, but still very usable.</p>\n<p>The keyboard is a lot better than the previous kind. I had to change two MacBooks in the past few years due to malfunctioning keys.</p>\n<p>This may or may not be of interest, but the built-in speakers sound quite good for their size, even better than the predecessors.</p>\n<p>And the device is remarkably thin and portable, especially considering its capabilities.</p>",
        "id": 207787785,
        "sender_full_name": "Email Gateway",
        "timestamp": 1598211151
    }
]