[
    {
        "content": "<p>From: Lawrence Paulson &lt;<a href=\"mailto:lp15@cam.ac.uk\">lp15@cam.ac.uk</a>&gt;<br>\nHaving done quite a few proofs involving locales recently, I’ve noticed an issue with locale interpretation that is logically superficial but can make a big difference in proofs. It is that the argument lists of locales can grow drastically, and if users try to control this growth by “bundling up” adjacent, related arguments, they will be punished when the time comes to instantiate the locale. Example (thanks to Chelsea Edmonds):</p>\n<p>interpretation add_point_in_sys: incidence_system \"points (add_point p)\" \"blocks (add_point p)”<br>\n  sorry</p>\n<p>interpretation del_point_sys: incidence_system \"points (delete_point p)\" \"blocks (delete_point p)”<br>\n  sorry</p>\n<p>Here we want the locale “incidence_system” to have virtually one argument, the pair of “points” and “blocks”, but the interpretation command requires the full argument list to be written out. It would be nice to be able to do something like this:</p>\n<p>abbreviation “incidence_system’ X == incidence_system (points X) (blocks X)”</p>\n<p>interpretation add_point_in_sys: \"incidence_system’ (add_point p)”<br>\ninterpretation del_point_in_sys: \"incidence_system’ (del_point p)”</p>\n<p>Any thoughts on this?</p>\n<p>Larry</p>",
        "id": 233804744,
        "sender_full_name": "Email Gateway",
        "timestamp": 1617967438
    },
    {
        "content": "<p>From: Clemens Ballarin &lt;<a href=\"mailto:ballarin@in.tum.de\">ballarin@in.tum.de</a>&gt;<br>\nHi Larry,</p>\n<p>There is indeed functionality missing in locales: there are no means of <br>\ndeclaring and reusing morphisms in interpretations, so each parameter <br>\nneeds to be dealt with manually in every interpretation. This creates <br>\nthe desire of \"bundling up\" parameters, which I believe is not a good <br>\nthing as it reduces flexibility. As you say, this is not a logical but a <br>\nsignificant practical limitation.</p>\n<p>I haven't understood what the parameters of the \"unbundled\" locale <br>\n\"incidence_system\" would have looked like. For unbundling them you would <br>\nhave to have fixed sets of point and block parameters.</p>\n<p>This approach would require an abbreviation per locale, so it's probably <br>\nnot as effective as dealing with morphisms directly.</p>\n<p>Clemens</p>",
        "id": 234032115,
        "sender_full_name": "Email Gateway",
        "timestamp": 1618134787
    },
    {
        "content": "<p>From: Lawrence Paulson &lt;<a href=\"mailto:lp15@cam.ac.uk\">lp15@cam.ac.uk</a>&gt;<br>\nHi Clemens, perhaps you’ve seen this recent AFP entry: </p>\n<p><a href=\"https://www.isa-afp.org/entries/Grothendieck_Schemes.html\">https://www.isa-afp.org/entries/Grothendieck_Schemes.html</a></p>\n<p>It was inspired by your own work and builds upon it. In fact, we have other (very different) work in the pipeline also following your locale-based approach, which seems to be extremely general.</p>\n<p>The suggestion in my email was intended as a minimal, lightweight solution to the issue. A more principled solution would be great provided it doesn’t introduce implementation or foundational issues.</p>\n<p>Best.</p>\n<p>Larry</p>",
        "id": 234060468,
        "sender_full_name": "Email Gateway",
        "timestamp": 1618160508
    }
]