[
    {
        "content": "<p>From: Peter Lammich &lt;<a href=\"mailto:lammich@in.tum.de\">lammich@in.tum.de</a>&gt;<br>\nWe are looking for a PhD candidate for a 4-year project on Formal Methods for<br>\nEmbedded Systems, as part of SAVES (ScAlable Verification of industrial<br>\nEmbedded control Systems), a collaboration with the University of Münster (WWU<br>\nMünster). You will be working on the SAVES project, carried out in<br>\ncollaboration with prof. dr. Paula Herber (University of Twente / WWU<br>\nMünster).</p>\n<p>The overall goal of SAVES is to investigate methods and tools to establish<br>\ncorrectness of embedded systems. With trends such as Industry 4.0, the<br>\ninternet of things, and autonomous driving, the complexity of embedded systems<br>\nis steadily increasing. A prerequisite to ensure the correct functioning of<br>\nindustrial embedded systems under all circumstances is a clear understanding<br>\nof the models and languages that are used in the development process. Formal<br>\nmethods provide a basis to make the development process systematic, well-<br>\ndefined, and automated. However, for many industrially relevant languages and<br>\nmodels, the semantics are only informally defined. Together with the limited<br>\nscalability of formal design and verification techniques, this makes the<br>\nformal verification of industrial embedded control systems a difficult<br>\nchallenge, which can not be solved satisfactory with currently available<br>\nmethods and tools. At the same time, we see that in the area of deductive<br>\nprogram verification, powerful techniques and tools have been developed to<br>\nreason about software with unbounded parameters, for example the VerCors tool<br>\nsuite. In this project, we will extend these techniques with concepts to cope<br>\nwith heterogeneity, concurrency, and real-time to make them suitable for<br>\nindustrial embedded systems.</p>\n<p>The PhD candidate hired at the University of Twente will be supervised by<br>\nMarieke Huisman and Paula Herber and will work on extensions of the methods<br>\nand tools developed in the FMT group for embedded systems, in close<br>\ncollaboration with the Embedded Systems group in Münster.</p>\n<p>For further information about the group,  see<br>\n<a href=\"https://www.utwente.nl/en/eemcs/fmt/\">https://www.utwente.nl/en/eemcs/fmt/</a>. For further information about the<br>\nproject, see <a href=\"https://www.utwente.nl/en/eemcs/fmt/research/projects/saves/\">\nhttps://www.utwente.nl/en/eemcs/fmt/research/projects/saves/</a>.</p>\n<p>YOUR PROFILE</p>\n<p>* You have a MSc degree in Computer Science (or equivalent);<br>\n  * You have a thorough theoretical background and a demonstrable interest in embedded or cyber-physical systems, and ideally some prior experience with embedded systems design, formal methods, and/or interactive theorem provers;<br>\n  * You are an enthusiastic student, skilled in exact and abstract thinking;<br>\n  * You are proficient in English on an academic level.</p>\n<p>OUR OFFER</p>\n<p>The terms of employment are in accordance with the Dutch Collective Labour<br>\nAgreement for Universities (CAO) and include:</p>\n<p>* A fulltime PhD position for four years, with a qualifier in the first year;<br>\n  * Full status as an employee at the UT, including pension and health care benefits;<br>\n  * The salary will range from € 2.395 (1st year) to € 3.061,- (4th year) per month, plus a holiday allowance of 8% and a year-end bonus of 8.3%;<br>\n  * A solid pension scheme;<br>\n  * Excellent facilities for professional and personal development;<br>\n  * A green and lively campus, with lots of sports facilities and other activities.</p>\n<p>INFORMATION AND APPLICATION</p>\n<p>Are you interested in this position? Please send your application via<br>\n<a href=\"https://www.utwente.nl/en/organisation/careers/!/2021-425/phd-position-on-\">https://www.utwente.nl/en/organisation/careers/!/2021-425/phd-position-on-</a><br>\nembedded-systems- before 5th of July and include:</p>\n<p>* A cover letter (explaining your specific interest and qualifications);<br>\n  * A detailed Curriculum Vitae;<br>\n  * A list of all courses + marks and a short description of your MSc thesis;<br>\n  * References (contact information) of two scientific staff members.</p>\n<p>The deadline of application is July 5, 2021 or until the position is filled.<br>\nStarting date of the position is as soon as possible, or to be discussed.</p>\n<p>For further information, you can contact <a href=\"http://Prof.dr.ir\">Prof.dr.ir</a>. Paula Herber:<br>\n<a href=\"https://www.uni-muenster.de/EmbSys/team/herber/\">https://www.uni-muenster.de/EmbSys/team/herber/</a> or Prof.dr. Marieke Huisman:<br>\n&lt;<a href=\"https://wwwhome.ewi.utwente.nl/~marieke/\">https://wwwhome.ewi.utwente.nl/~marieke/</a>&gt;</p>\n<p>DEPARTMENT</p>\n<p>In the Formal Methods and Tools (FMT) research group, formal techniques and<br>\ntools are developed and used as a means to support the development of<br>\nsoftware. Our central goal is to increase the reliability of the software that<br>\nwe rely on, as individuals and as society. We primarily target complex<br>\nconcurrent ICT systems, embedded in a technological context or in a<br>\ndistributed environment.</p>\n<p>The FMT group is part of the Faculty of Electrical Engineering, Mathematics<br>\nand Computer Science (EEMCS) at the University of Twente. The FMT group also<br>\nparticipates in the Digital Systems Institute (DSI).</p>\n<p>Our institute was ranked first at the most recent research national<br>\nassessment.</p>\n<p>ORGANIZATION</p>\n<p>The faculty of Electrical Engineering, Mathematics and Computer Science<br>\n(EEMCS) uses mathematics, electronics and computer technology to contribute to<br>\nthe development of Information and Communication Technology (ICT). With ICT<br>\npresent in almost every device and product we use nowadays, we embrace our<br>\nrole as contributors to a broad range of societal activities and as pioneers<br>\nof tomorrow's digital society. As part of a people-first tech university that<br>\naims to shape society, individuals and connections, our faculty works together<br>\nintensively with industrial partners and researchers in the Netherlands and<br>\nabroad, and conducts extensive research for external commissioning parties and<br>\nfunders. Our research has a high profile both in the Netherlands and<br>\ninternationally. It has been accommodated in three multidisciplinary UT<br>\nresearch institutes: Mesa+ Institute, TechMed Centre and Digital Society<br>\nInstitute.</p>\n<p>As an employer, the EEMCS Faculty offers jobs that matter. We equip you as a<br>\nstaff member to shape new opportunities both for yourself and for our society.<br>\nWith our Faculty, you will be part of a leading tech university that is<br>\nchanging our world for the better. We offer an open, inclusive and<br>\nentrepreneurial climate, in which we encourage you to make healthy choices,<br>\nfor example, with our flexible, customizable conditions.</p>\n<p>UNIVERSITY OF TWENTE (UT)</p>\n<p>University of Twente (UT) has entered the new decade with an ambitious, new<br>\nvision, mission and strategy. As ‘the ultimate people-first university of<br>\ntechnology' we are rapidly expanding on our High Tech Human Touch philosophy<br>\nand the unique role it affords us in society. Everything we do is aimed at<br>\nmaximum impact on people, society and connections through the sustainable<br>\nutilisation of science and technology. We want to contribute to the<br>\ndevelopment of a fair, digital and sustainable society through our open,<br>\ninclusive and entrepreneurial attitude. This attitude permeates everything we<br>\ndo and is present in every one of UT's departments and faculties. Building on<br>\nour rich legacy in merging technical and social sciences, we focus on five<br>\ndistinguishing research domains: Improving healthcare by personalised<br>\ntechnologies; Creating intelligent manufacturing systems; Shaping our world<br>\nwith smart materials; Engineering our digital society; and Engineering for a<br>\nresilient world.</p>\n<p>As an employer, University of Twente offers jobs that matter. We equip you as<br>\na staff member to shape new opportunities both for yourself and for our<br>\nsociety. With us, you will be part of a leading tech university that is<br>\nchanging our world for the better. We offer an open, inclusive and<br>\nentrepreneurial climate, in which we encourage you to make healthy choices,<br>\nfor example, with our flexible, customisable conditions.</p>",
        "id": 242856544,
        "sender_full_name": "Email Gateway",
        "timestamp": 1623836644
    }
]