[
    {
        "content": "<p>From: Temur Kutsia &lt;<a href=\"mailto:kutsia@risc.jku.at\">kutsia@risc.jku.at</a>&gt;<br>\nDue to requests, the submission deadline for the special issue of the<br>\nAnnals of Mathematics and Artificial Intelligence (AMAI) on Theoretical<br>\nand Practical Aspects of Unification has been extended to</p>\n<p>January 31st, 2021.</p>\n<hr>\n<p>Call for submissions</p>\n<p>Annals of Mathematics and Artificial Intelligence<br>\nSpecial Issue on Theoretical and Practical Aspects of Unification</p>\n<hr>\n<p>SCOPE</p>\n<hr>\n<p>In 2020, Annals of Mathematics and Artificial Intelligence (AMAI)<br>\ncelebrates its 30th anniversary. Over the years, the journal has<br>\npromoted better understanding of the application of quantitative,<br>\ncombinatorial, logical, algebraic and algorithmic methods to artificial<br>\nintelligence areas as diverse as decision support, automated deduction,<br>\nreasoning, knowledge-based systems, machine learning, computer vision,<br>\nrobotics and planning. AMAI special issues are intended to be<br>\ncollections of original research papers reflecting the intersection of<br>\nmathematics and a focussed discipline demonstrating how each has<br>\ncontributed greatly to the other. A further goal of the journal is to<br>\nclose the gaps between the fields even further. Papers should report on<br>\ncurrent research in the appropriate areas, as well as more retrospective<br>\npapers in which progress has been ongoing over a period of time.</p>\n<p>The purpose of this special issue of AMAI is to promote research on<br>\ntheoretical and practical aspects of unification. Unification is<br>\nconcerned with the problem of making two terms equal, finding solutions<br>\nfor equations or making formulas equivalent. It is a fundamental process<br>\nused in a number of fields of computer science, including automated<br>\nreasoning, term rewriting, logic programming, natural language<br>\nprocessing, program analysis, types, etc. The special issue is related<br>\nto the topics of the 34th International Workshop on Unification - UNIF<br>\n2020. Participants of the workshop, as well as other authors are invited<br>\nto submit contributions.</p>\n<p>EXAMPLES OF TOPICS</p>\n<hr>\n<p>This special issue focuses on advanced results on the topics of<br>\nunification in a broad sense, which include, but are not limited to, the<br>\nfollowing:</p>\n<p>- Unification algorithms, calculi and implementations<br>\n  - Equational unification and unification modulo theories<br>\n  - Unification in modal, fuzzy, temporal and description logics<br>\n  - Anti-unification/generalization<br>\n  - Semi-unification<br>\n  - Narrowing<br>\n  - Matching problems<br>\n  - Unification in special theories<br>\n  - Higher-order unification<br>\n  - Combination problems<br>\n  - Constraint solving<br>\n  - Disunification<br>\n  - Complexity issues<br>\n  - Type checking and reconstruction<br>\n  - Admissibility of inference rules<br>\n  - Formalization of unification<br>\n  - Tools<br>\n  - Applications</p>\n<p>SUBMISSION</p>\n<hr>\n<p>This special issue welcomes original high-quality contributions that<br>\nhave been neither published in nor simultaneously submitted to any<br>\njournals or refereed conferences. Submissions will be peer-reviewed<br>\nusing the standard refereeing procedure of the Annals of Mathematics and<br>\nArtificial Intelligence.</p>\n<p>Submitted papers must be in English, prepared in LaTeX according to the<br>\nguidelines of the journal:<br>\n<a href=\"https://www.springer.com/journal/10472/submission-guidelines\">https://www.springer.com/journal/10472/submission-guidelines</a>.</p>\n<p>PDF versions of papers should be uploaded at the submission page</p>\n<p><a href=\"https://www.editorialmanager.com/amai\">https://www.editorialmanager.com/amai</a></p>\n<p>by January 31, 2021.</p>\n<p>Please choose S704 - Unification - UNIF 2020 when you will be selecting<br>\nthe article type.</p>\n<p>GUEST EDITORS</p>\n<hr>\n<p>Temur Kutsia (RISC, Johannes Kepler University Linz, Austria)<br>\nAndrew M. Marshall (University of Mary Washington, USA)</p>\n<p>FURTHER INFORMATION</p>\n<hr>\n<p>Temur Kutsia &lt;<a href=\"mailto:kutsia@risc.jku.at\">kutsia@risc.jku.at</a>&gt;<br>\nAndrew M. Marshall &lt;<a href=\"mailto:amarsha2@umw.edu\">amarsha2@umw.edu</a>&gt;</p>",
        "id": 219825862,
        "sender_full_name": "Email Gateway",
        "timestamp": 1607943688
    }
]