[
    {
        "content": "<p>From: Dmitriy Traytel &lt;<a href=\"mailto:cl-isabelle-users@lists.cam.ac.uk\">cl-isabelle-users@lists.cam.ac.uk</a>&gt;<br>\nDear all,</p>\n<p>Anders Schlichtkrull, René Rydhof Hansen, and Flemming Nielson have formalized the semantics and a number of static analysis techniques for stratified Datalog. An unrelated language fact: in Danish “datalog\" means \"computer scientist” and this terminology was coined by Peter Naur. Now I wonder what a stratified computer scientist would be...</p>\n<p>Stratified Datalog and Program Analysis</p>\n<p>In this entry we formalize stratified Datalog, the first such formalization in Isabelle to the best of our knowledge. Next we formally establish the existence of least solutions for any stratified Datalog program, essential for reasoning about negations in clauses. Lastly we illustrate the usefulness of our Datalog formalization by further formalizing the general Bit-Vector Framework and formalize and prove correct five analyses in this framework namely liveness, reaching definitions, available expressions, very busy expressions and reachability. Many of our definitions follow Nielson and Nielson’s textbook. The formalization is described in our SAC 2024 paper.</p>\n<p><a href=\"https://www.isa-afp.org/entries/Stratified_Datalog.html\">https://www.isa-afp.org/entries/Stratified_Datalog.html</a></p>\n<p>Enjoy!</p>",
        "id": 539166890,
        "sender_full_name": "Email Gateway",
        "timestamp": 1757713591
    },
    {
        "content": "<p>From: Alex Shkotin &lt;<a href=\"mailto:alex.shkotin@gmail.com\">alex.shkotin@gmail.com</a>&gt;<br>\nDear Dmitriy,</p>\n<p>Definition may be like this \"Computer scientist is stratified iff she works<br>\nsimultaneously in two or more projects in different sciences or<br>\ntechnologies.\"<br>\nNB: If sciences or technologies are the same he is just busy.</p>\n<p>Enjoyed!</p>\n<p>Alex</p>\n<p>сб, 13 сент. 2025 г. в 00:46, Dmitriy Traytel &lt;<br>\n<a href=\"mailto:cl-isabelle-users@lists.cam.ac.uk\">cl-isabelle-users@lists.cam.ac.uk</a>&gt;:</p>\n<blockquote>\n<p>Dear all,</p>\n<p><em>Anders Schlichtkrull</em>, <em>René Rydhof Hansen</em>, and <em>Flemming Nielson</em> have<br>\nformalized the semantics and a number of static analysis techniques for<br>\nstratified Datalog. An unrelated language fact: in Danish “datalog\" means<br>\n\"computer scientist” and this terminology was coined by Peter Naur. Now I<br>\nwonder what a stratified computer scientist would be...</p>\n<p><em>Stratified Datalog and Program Analysis</em></p>\n<p>In this entry we formalize stratified Datalog, the first such<br>\nformalization in Isabelle to the best of our knowledge. Next we formally<br>\nestablish the existence of least solutions for any stratified Datalog<br>\nprogram, essential for reasoning about negations in clauses. Lastly we<br>\nillustrate the usefulness of our Datalog formalization by further<br>\nformalizing the general Bit-Vector Framework and formalize and prove<br>\ncorrect five analyses in this framework namely liveness, reaching<br>\ndefinitions, available expressions, very busy expressions and reachability.<br>\nMany of our definitions follow Nielson and Nielson’s textbook. The<br>\nformalization is described in our SAC 2024 paper.</p>\n<p><a href=\"https://www.isa-afp.org/entries/Stratified_Datalog.html\">https://www.isa-afp.org/entries/Stratified_Datalog.html</a></p>\n<p>Enjoy!<br>\n</p>\n</blockquote>",
        "id": 539245917,
        "sender_full_name": "Email Gateway",
        "timestamp": 1757750195
    }
]