[
    {
        "content": "<p>From: Lawrence Paulson &lt;<a href=\"mailto:lp15@cam.ac.uk\">lp15@cam.ac.uk</a>&gt;<br>\nLots of us are Mac users and will be wondering whether the latest products (notably the Mac Studio) are worth it. Poly/ML now has native Apple support, but hard benchmarks would be best, compared against the latest Intel offerings.</p>\n<p>The other big M1 win is battery life, only relevant to laptops.</p>\n<p>Larry</p>",
        "id": 276454427,
        "sender_full_name": "Email Gateway",
        "timestamp": 1648116921
    },
    {
        "content": "<p>From: Fabian Huch &lt;<a href=\"mailto:huch@in.tum.de\">huch@in.tum.de</a>&gt;<br>\nWe do have hard benchmark results [1].</p>\n<p>The M1 Pro/M1 Max (which are the same CPU-wise) are a lot faster than <br>\nolder Intel generations, and are the best option on laptops (even if you <br>\nextrapolate for the fastest Intel/AMD laptop CPUs), but can not compete <br>\nagainst the 12th gen Intel cores on desktop: M1 Pro with native arm <br>\nbackend takes 2:17, i7-12700K only 1:47.</p>\n<p>Intels i9-12900KS should be the fastest desktop CPU currently available.</p>\n<p>The M1 Ultra is just two M1 Max glued together, and Isabelle won't <br>\nprofit at all from the additional cores (at least for single sessions <br>\nwhich perform typical symbolic operations like HOL-Analysis).</p>\n<p>Fabian</p>\n<p>[1]: <br>\n<a href=\"https://docs.google.com/spreadsheets/d/12GhEwSNSopowDBq5gSem3u39fliiIcoTIZHMnX4RE3A\">https://docs.google.com/spreadsheets/d/12GhEwSNSopowDBq5gSem3u39fliiIcoTIZHMnX4RE3A</a></p>",
        "id": 276456317,
        "sender_full_name": "Email Gateway",
        "timestamp": 1648117983
    },
    {
        "content": "<p>From: Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt;<br>\nNote that any changes of underlying libraries requires to rebuild other <br>\nsessions: multiple independent CPUs can help here a lot, but just 2 CPUs with <br>\n8 cores each is not so much. Better are 20 CPUs with 8 cores each, or maybe a <br>\nlarger cluster.</p>\n<p>This important model of Isabelle development with profound changes at the <br>\nbottom (e.g. Pure, HOL, HOL-Analysis) has seen some decline in recent years. <br>\nAs a consequence, the ambitions for proper reforms have been diminished.</p>\n<p>My current plan is to revive it with the help of distributed parallel builds, <br>\ninstead of doing it on a single hot (and expensive) machine.</p>\n<p>The classic target is &lt; 10min for all sessions of the Isabelle distribution, <br>\nand &lt; 45min for all of AFP (excluding only \"very_slow\").</p>\n<p>Makarius</p>",
        "id": 276524008,
        "sender_full_name": "Email Gateway",
        "timestamp": 1648148041
    },
    {
        "content": "<p>From: Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt;<br>\nMac Studio looks like an expensive version of the Mac Mini M1, or a cheap <br>\nversion of Mac Pro.</p>\n<p>Not bad as a very fancy desktop machine, but quite some money spent for parts <br>\nthat have no meaning to Isabelle: GPUs and Neural Engine.</p>\n<p>The 1-CPU version with 64GB RAM + 1 TB SSD costs 2900,- EUR.</p>\n<p>The 2-CPU version with 128GB RAM + 1 TB SSD costs 5500,- EUR.</p>\n<p>Makarius</p>",
        "id": 276524510,
        "sender_full_name": "Email Gateway",
        "timestamp": 1648148276
    }
]