[
    {
        "content": "<p>From: \"\\\"Zhang, Cynthia X. (GSFC-710.0)[BOOZ ALLEN HAMILTON]\\\"\" &lt;<a href=\"mailto:cl-isabelle-users@lists.cam.ac.uk\">cl-isabelle-users@lists.cam.ac.uk</a>&gt;<br>\nHello, my name is Cynthia Zhang and I am a Supply Chain Risk Management Analyst at NASA. NASA is currently conducting a supply chain assessment of Isabelle. As stated in Sections 208 and 514 of the Consolidated Appropriations Act, 2022, Public Law 117-103, enacted March 15, 2022, a required step of our process is to verify the Country of Origin (CoO) information for the product (i.e., the country where the products were developed, manufactured, and assembled.)<br>\nAs Isabelle is open source, we understand that this inquiry is not directly applicable, as contributions may be made from individuals from around the world. In this case, NASA is interested in confirming the following information:</p>\n<p>1.  Is there an organization which sponsors/publishes the project, or a primary developer who audits the code for potential vulnerabilities, errors, or malicious code? Y/N<br>\n  2.  Does Isabelle have an overseeing organization or individual along these lines? Y/N</p>\n<p>1.  If so, please provide the name of the organization and country they are established in.<br>\nIf the information above is unknown or cannot be provided, we request that you provide the country or list of countries where the majority of contributions originate from to satisfy Sections 208 and 514 of the Consolidated Appropriations Act, 2022, Public Law 117-103, enacted March 15, 2022.</p>\n<p>Thank you,<br>\nCynthia</p>",
        "id": 298031531,
        "sender_full_name": "Email Gateway",
        "timestamp": 1662748370
    },
    {
        "content": "<p>From: Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt;<br>\nHello Cynthia,</p>\n<p>as the long-term release manager of the Isabelle prover platform, I might be <br>\nin the slightly awkward position to say a few words about Isabelle as <br>\n\"organisation sui generis\". Some other people might add to that later on.</p>\n<p>First of all, here is the missing link the Public Law 117-103 mentioned above: <br>\n<a href=\"https://www.congress.gov/117/bills/hr2471/BILLS-117hr2471enr.pdf\">https://www.congress.gov/117/bills/hr2471/BILLS-117hr2471enr.pdf</a> with its <br>\nsections 208 and 514:</p>\n<p>\"\"\"<br>\nSEC. 208. None of the funds made available under this title<br>\nshall be obligated or expended for any new or enhanced information<br>\ntechnology program having total estimated development costs in<br>\nexcess of $100,000,000, unless the Deputy Attorney General and<br>\nthe investment review board certify to the Committees on Appro-<br>\npriations of the House of Representatives and the Senate that<br>\nthe information technology program has appropriate program<br>\nmanagement controls and contractor oversight mechanisms in place,<br>\nand that the program is compatible with the enterprise architecture<br>\nof the Department of Justice.<br>\n\"\"\"</p>\n<p>(I don't think that 208 is relevant here.)</p>\n<p>\"\"\"<br>\nSEC. 514. (a) None of the funds appropriated or otherwise<br>\nmade available under this Act may be used by the Departments<br>\nof Commerce and Justice, the National Aeronautics and Space<br>\nAdministration, or the National Science Foundation to acquire a<br>\nhigh-impact or moderate-impact information system, as defined for<br>\nsecurity categorization in the National Institute of Standards and<br>\nTechnology’s (NIST) Federal Information Processing Standard<br>\nPublication 199, ‘‘Standards for Security Categorization of Federal<br>\nInformation and Information Systems’’ unless the agency has—<br>\n(1) reviewed the supply chain risk for the information<br>\nsystems against criteria developed by NIST and the Federal<br>\nBureau of Investigation (FBI) to inform acquisition decisions<br>\nfor high-impact and moderate-impact information systems<br>\nwithin the Federal Government;<br>\n(2) reviewed the supply chain risk from the presumptive<br>\nawardee against available and relevant threat information pro-<br>\nvided by the FBI and other appropriate agencies; and<br>\n(3) in consultation with the FBI or other appropriate Fed-<br>\neral entity, conducted an assessment of any risk of cyber-<br>\nespionage or sabotage associated with the acquisition of such<br>\nsystem, including any risk associated with such system being<br>\nproduced, manufactured, or assembled by one or more entities<br>\nidentified by the United States Government as posing a cyber<br>\nthreat, including but not limited to, those that may be owned,<br>\ndirected, or subsidized by the People’s Republic of China, the<br>\nIslamic Republic of Iran, the Democratic People’s Republic of<br>\nKorea, or the Russian Federation.<br>\n(b) None of the funds appropriated or otherwise made available<br>\nunder this Act may be used to acquire a high-impact or moderate-<br>\nimpact information system reviewed and assessed under subsection<br>\n(a) unless the head of the assessing entity described in subsection<br>\n(a) has—(1) developed, in consultation with NIST, the FBI, and<br>\nsupply chain risk management experts, a mitigation strategy<br>\nfor any identified risks;<br>\n(2) determined, in consultation with NIST and the FBI,<br>\nthat the acquisition of such system is in the national interest<br>\nof the United States; and<br>\n(3) reported that determination to the Committees on<br>\nAppropriations of the House of Representatives and the Senate<br>\nand the agency Inspector General.<br>\n\"\"\"</p>\n<p>That is a lot of legal text, but the main message seems to be that products <br>\nfrom certain \"rogue countries\" should be avoided.</p>\n<p>Isabelle is a research product grown out of a long-term collaboration between <br>\nUniv. Cambridge (UK) and TU Munich (Germany). Other contributors are mostly <br>\nfrom countries of western Europe, the former \"Free West\" speaking in terms of <br>\nthe Cold War.</p>\n<p>Culturally, Isabelle is in fact very European in the classic sense, not to say <br>\nvery Bavarian. US users might be confused by that, or might actually like it, <br>\nrecalling a good time at Beer festivals before new waves of Plague and War <br>\nhave reached Europe recently.</p>\n<p>So formally, you could probably just tick off these boring legal questions and <br>\nproceed thinking about a properly founded decision for one prover platform or <br>\nanother.</p>\n<p>For this more interesting concern, I recommend to start with talks by Tom <br>\nHales in the past 5 years, mostly about HOL Light and Lean Prover, but also <br>\nsome other proof assistants. Here is a copy of the slides from Big Proof 2018 <br>\nin Edinburgh, UK: <a href=\"https://www.icms.org.uk/downloads/bigproof/Hales.pdf\">https://www.icms.org.uk/downloads/bigproof/Hales.pdf</a></p>\n<p>Page 16 is particularly interesting, as it shows pictures of buildings to <br>\nrepresent important provers (for formalized mathematics): HOL Light, Mizar, <br>\nCoq, Isabelle, Metamath, Lean (this is version 3, not the quite different <br>\nversion 4).</p>\n<p>I find the imagery due to Hales very fitting, especially for Isabelle: You are <br>\nstanding on a very high edifice, which appears to be an agglomerate of towers <br>\nstacked on top of each other. You only see the transition of one tower of <br>\nconcrete into another tower of glass and steel. Below and above are surely <br>\nfurther towers that are not visible in the picture!</p>\n<p>That illustrates an important Isabelle principle: It is hard to tell where it <br>\nstarts and where it ends, and you always learn something new that you have <br>\nnever seen before. E.g. people often start with Isabelle/HOL (the logic) and <br>\nthe Isabelle/Isar proof language, and think \"now I know it\". Then they learn <br>\nabout Isabelle/ML (the mathematical programming language for symbolic logic), <br>\nand think \"now I really know it\". Then they learn about Isabelle/Scala (the <br>\nphysical system integration language), and think \"now I really do know it\". As <br>\nour culture is pretty much alive and thriving, this process of discovery will <br>\ncontinue for years to come.</p>\n<p>Apart from fancy pictures, here is also a formal record of the build artifacts <br>\nthat contribute to Isabelle2022-RC1 (the current release candidate for the <br>\nfinal release planned for 23-Oct-2022): <br>\n<a href=\"https://isabelle.sketis.net/website-Isabelle2022-RC1/dist/index.html\">https://isabelle.sketis.net/website-Isabelle2022-RC1/dist/index.html</a></p>\n<p>That is only the main Isabelle platform with all its contributing components; <br>\nit can be likened to a \"Linux distribution for formal mathematics\". <br>\nFurthermore, you need to add the \"Archive of Formal Proofs\" for Isabelle <br>\napplications that are \"automagically\" maintained by the people behind Isabelle <br>\nto follow the evolution of Isabelle: <a href=\"https://www.isa-afp.org\">https://www.isa-afp.org</a> (this is not Lean <br>\nwhere every major version of the system causes great trouble to the <br>\napplication space).</p>\n<p>In contrast to the rather bold pictures due Tom Hales, my own presentations <br>\nabout Isabelle used to refer to the more modest story of \"Blind monks <br>\nexamining an elephant\". Here is a nice painting by Hanabusa Itchō: <br>\n<a href=\"https://en.wikipedia.org/wiki/Blind_men_and_an_elephant#/media/File:Blind_monks_examining_an_elephant.jpg\">https://en.wikipedia.org/wiki/Blind_men_and_an_elephant#/media/File:Blind_monks_examining_an_elephant.jpg</a></p>\n<p>So each Isabelle user manages to grasp some aspects of the system (the <br>\n\"beast\"), but nobody has full hold of it. They can still tame the beast, by <br>\nexchanging their own discoveries with other participants. (And then publish <br>\nresults in the Archive of Formal Proofs.)</p>\n<p>In retrospect, I consider this imagery too simplistic for Isabelle as a large <br>\n\"environment\" or \"landscape\". So here is another painting by Hanabusa Itchō: <br>\n<a href=\"http://darumapedia-persons.blogspot.com/2016/12/hanabusa-itcho.html\">http://darumapedia-persons.blogspot.com/2016/12/hanabusa-itcho.html</a> --- it <br>\nshows the holy mountain Fuji-san in the back, with people living (and toiling) <br>\nnear a river in the front.</p>\n<p>Here is another Fuji-san scene by a different artist: <br>\n<a href=\"https://en.wikipedia.org/wiki/Thirty-six_Views_of_Mount_Fuji#/media/File:Great_Wave_off_Kanagawa2.jpg\">https://en.wikipedia.org/wiki/Thirty-six_Views_of_Mount_Fuji#/media/File:Great_Wave_off_Kanagawa2.jpg</a> <br>\n--- it looks terrific, but I guess that some Isabelle/AFP contributors did <br>\nfeel such distress as the people in the boat, when struggling with formal <br>\nproofs in Isabelle :-)</p>\n<p>Apart from art, here is also some science: <br>\n<a href=\"https://dl.acm.org/doi/10.1007/s00165-019-00492-1\">https://dl.acm.org/doi/10.1007/s00165-019-00492-1</a> \"From LCF to Isabelle/HOL\" <br>\npublished in 2019 in a journal by the ACM.</p>\n<p>That is an US American publisher, so it surely won't appear on any black-list <br>\npublished by the US Congress.</p>\n<p>Makarius</p>",
        "id": 298282881,
        "sender_full_name": "Email Gateway",
        "timestamp": 1662924227
    },
    {
        "content": "<p>From: Gerwin Klein &lt;<a href=\"mailto:kleing@unsw.edu.au\">kleing@unsw.edu.au</a>&gt;<br>\nDear Cynthia,</p>\n<p>In addition to what Makarius already posted, I think the following might be relevant: TU Munich is the main host of the Isabelle repository, which means direct contributions to the Isabelle code base can only be made by people with an account at that institution. All other contributions are made via a person that has account access.</p>\n<p>There is no formal process for e.g. vulnerability checking, but the existing very large automated testing infrastructure (which includes the entire Archive of Formal Proofs) as well as the existing developer culture achieve a code quality with respect to vulnerabilities, errors and malicious code that is far above an average open source project with e.g. a pull-request process on GitHub.</p>\n<p>While there is no single individual or organisation that publishes Isabelle (but the collection of developers that Makarius mentioned, with TU Munich, the University of Cambridge, and Makarius himself probably being the largest contributors), given that the repository is hosted at TU Munich, listing TU Munich as the organisation might suffice for administrative purposes.</p>\n<p>Cheers,<br>\nGerwin</p>",
        "id": 298954710,
        "sender_full_name": "Email Gateway",
        "timestamp": 1663243664
    }
]