[
    {
        "content": "<p>From: \"\\\"Blanchette, J.C. (Jasmin Christian)\\\"\" &lt;<a href=\"mailto:cl-isabelle-users@lists.cam.ac.uk\">cl-isabelle-users@lists.cam.ac.uk</a>&gt;<br>\nDear Michael,</p>\n<p>Since Andreas Abel has failed to deliver the goods, we agreed today that it is better to give the dependent type theory part of Chapter 3 to someone else.</p>\n<p>Assia and I propose to give it to Jannis Limperg, a fourth-year PhD student of mine. He's an excellent writer (as can be seen from his CPP 2021 and 2023 papers) and understands DTT well enough to author these parts -- he worked with both Agda and Lean. Fun fact: He did his MSc with Andreas. Since he's more junior, he'd have more time to dedicate to this and his CV would benefit more from this. Also, I know from experience that he has a can-do attitude and will meet the deadline (we're aiming at end of June).</p>\n<p>The plan would be that he adds a section about DTT at the end of your text. But you could discuss together what's the best way to integrate his contributions into your text.</p>\n<p>I tentatively asked Jannis and he would be in, and he would, but of course this is all conditional on your agreement. Do you agree to work with Jannis? Or do you want to talk to him first?</p>\n<p>Have a nice weekend.<br>\nJasmin</p>",
        "id": 321190591,
        "sender_full_name": "Email Gateway",
        "timestamp": 1673624244
    },
    {
        "content": "<p>From: \"\\\"Blanchette, J.C. (Jasmin Christian)\\\"\" &lt;<a href=\"mailto:cl-isabelle-users@lists.cam.ac.uk\">cl-isabelle-users@lists.cam.ac.uk</a>&gt;<br>\nDear mailling list,</p>\n<p>Please ignore my previous email. Somehow my email client auto-completed \"Michael Norrish\" to this mailing list!!</p>\n<p>Terribly sorry again for the spam.</p>\n<p>Best<br>\nJasmin</p>",
        "id": 321191092,
        "sender_full_name": "Email Gateway",
        "timestamp": 1673624374
    },
    {
        "content": "<p>From: Asta Halkjær From &lt;<a href=\"mailto:andro.from@gmail.com\">andro.from@gmail.com</a>&gt;<br>\nPlease don't apologise! As coauthor of that CPP 2023 paper, I think Jannis<br>\ndeserves more public praise.</p>\n<p>Asta</p>",
        "id": 321203276,
        "sender_full_name": "Email Gateway",
        "timestamp": 1673627358
    }
]