[
    {
        "content": "<p>From: \"Eugene W. Stark\" &lt;<a href=\"mailto:isabelle-users@starkeffect.com\">isabelle-users@starkeffect.com</a>&gt;<br>\nI am a bit afraid to ask, but are the datatype definitions in the following theory<br>\nexpected to work?</p>\n<hr>\n<p>theory Barf<br>\nimports Main<br>\nbegin</p>\n<p>locale L =<br>\n  fixes N :: \"'x list\"<br>\n  assumes \"N = []\"<br>\n  begin</p>\n<p>datatype ('a, 'b) foo =<br>\n      Null<br>\n    | MkArr ‹'a ⇒ 'b› ‹'a ⇒ 'b› ‹'a ⇒ 'b›</p>\n<p>end</p>\n<p>locale M<br>\n  begin</p>\n<p>datatype 'a bar =<br>\n      Null<br>\n    | MkArr 'a 'a \"('a, 'a) <a href=\"http://L.foo\">L.foo</a>\"</p>\n<p>end</p>\n<p>end</p>\n<hr>\n<p>When I check this theory, the second datatype definition produces the errors below,<br>\nwhich are pretty much incomprehensible to me.  The presence of the assumption in<br>\nlocale M seems to be an essential ingredient in the failure.</p>\n<p>These (but a little more involved) were the datatype definitions I wanted to write.<br>\nI will work around this issue if necessary, but I figure it would be useful to have an<br>\nidea about why what I wanted to do doesn't fly.</p>\n<p>Thanks!</p>\n<p>- Gene Stark</p>",
        "id": 406166411,
        "sender_full_name": "Email Gateway",
        "timestamp": 1701813597
    },
    {
        "content": "<p>From: Manuel Eberl &lt;<a href=\"mailto:manuel@pruvisto.org\">manuel@pruvisto.org</a>&gt;<br>\nOne of the datatype experts might be able to answer that question better <br>\nthan I can, but honestly I'm baffled that the \"datatype\" command (and <br>\n\"typedef\", too, apparently) works inside a locale context at all. I <br>\ndon't really see what the point of that would be, since you can refer <br>\nneither to variables nor type variables fixed by the locale. So why not <br>\njust declare the datatype outside the locale context?</p>\n<p>My guess would be that \"datatype\" was never meant to work inside a <br>\nlocale context and is therefore quite brittle when used there. But <br>\nthat's just a guess.</p>\n<p>Manuel</p>",
        "id": 406176929,
        "sender_full_name": "Email Gateway",
        "timestamp": 1701818854
    },
    {
        "content": "<p>From: \"Eugene W. Stark\" &lt;<a href=\"mailto:isabelle-users@starkeffect.com\">isabelle-users@starkeffect.com</a>&gt;<br>\nI can well understand what you are saying, though if datatypes were not intended to work within a locale,<br>\nthe system probably should have been constructed to reject such uses at a higher level than having the<br>\nproof tactics fail, generate unhandled ML exceptions, and so on.</p>\n<p>I have been using datatypes within locales basically for modularity reasons.  I like the idea that the<br>\ntype names are localized to the locales to which they belong.  I was surprised when I first tried it and<br>\nit worked, but I just assumed that someone had been busy improving things, so I took advantage of it.</p>",
        "id": 406180954,
        "sender_full_name": "Email Gateway",
        "timestamp": 1701821124
    },
    {
        "content": "<p>From: Wenda Li &lt;<a href=\"mailto:wenda.li@ed.ac.uk\">wenda.li@ed.ac.uk</a>&gt;<br>\nI hope we can have types properly defined inside a locale some day in the future though :-)</p>\n<p>Wenda</p>\n<p>The University of Edinburgh is a charitable body, registered in Scotland, with registration number SC005336. Is e buidheann carthannais a th’ ann an Oilthigh Dhùn Èideann, clàraichte an Alba, àireamh clàraidh SC005336.</p>",
        "id": 406187009,
        "sender_full_name": "Email Gateway",
        "timestamp": 1701823886
    },
    {
        "content": "<p>From: Dmitriy Traytel &lt;<a href=\"mailto:traytel@di.ku.dk\">traytel@di.ku.dk</a>&gt;<br>\nHi Gene, all,</p>\n<p>The support of datatype in locales is somewhat more limited than what you can do on the top-level, in particular when you start mixing datatypes from different locales.</p>\n<p>First, there is the limitation that datatype inherits from typedef: the new type cannot depend on the locally fixed constants and types. Perhaps this is what would be needed for Wenda's “can have types properly defined”, but as of today we don’t have such typedefs (except when using HOL-Types_To_Sets, at a cost of an axiom—the datatype command is not integrated with Types_To_Sets at all).</p>\n<p>Second, after you define you type foo in the locale L, all theorems related to foo are annotated with L’s assumption (see e.g., L.foo.induct outside of the locale). The subsequent datatype command (for bar) cannot handle datatypes with such assumptions, which is why you seeing these tactic failures. (Ideally these low-level errors should be hidden from the user.)</p>\n<p>So the workaround suggested by Manuel to define foo outside of L is one solution. Another would be to interpret L in M: after adding</p>\n<p>interpretation L: L \"[]\" by standard simp</p>\n<p>before datatype ‘a foo in M makes the datatype command succeed.</p>\n<p>Best wishes,<br>\nDmitriy</p>",
        "id": 406477922,
        "sender_full_name": "Email Gateway",
        "timestamp": 1701932734
    }
]