[
    {
        "content": "<p>From: \"Nadel, Alexander\" &lt;<a href=\"mailto:alexander.nadel@intel.com\">alexander.nadel@intel.com</a>&gt;<br>\nCALL FOR PARTICIPATION<br>\n======================================================<br>\n2023 Formal Methods in Computer-Aided Design (FMCAD)<br>\n======================================================</p>\n<p>Ames, Iowa, USA<br>\nOctober 23-27, 2023</p>\n<p><a href=\"https://fmcad.org/FMCAD23/\">https://fmcad.org/FMCAD23/</a></p>\n<p>REGISTRATION</p>\n<hr>\n<p>Early registration deadline is September 28th, 2023.<br>\nFor more information, visit:</p>\n<p><a href=\"https://fmcad.org/FMCAD23/registration/\">https://fmcad.org/FMCAD23/registration/</a></p>\n<p>CONFERENCE SCOPE AND PUBLICATION</p>\n<hr>\n<p>FMCAD 2023 is the twenty-third in a series of conferences on the theory<br>\nand applications of formal methods in hardware and system<br>\nverification. FMCAD provides a leading forum to researchers in academia<br>\nand industry for presenting and discussing groundbreaking methods,<br>\ntechnologies, theoretical results, and tools for reasoning formally<br>\nabout computing systems. FMCAD covers formal aspects of computer-aided<br>\nsystem design including verification, specification, synthesis, and<br>\ntesting.</p>\n<p>FMCAD employs a rigorous peer-review process. Accepted papers are<br>\npublished by TU Wien Academic Press under a Creative Commons license<br>\n(the authors retain the copyright) and distributed through the IEEE<br>\nXPlore digital library. There are no publication fees. At least one of<br>\nthe authors is required to register for the conference and present the<br>\naccepted paper.</p>\n<p>PROGRAM</p>\n<hr>\n<p>The FMCAD program will include 31 regular talks, and will feature 4 tutorials and<br>\n3 invited talks.</p>\n<p>The tutorials:<br>\n• \"Developing an Open-Source, State-of-the-Art Symbolic Model-Checking Framework for<br>\n   the Model-Checking Research Community\" by The NSF:CCRI Project Investigators<br>\n   (Rozier, Shankar, Tinelli, Vardi)<br>\n• \"MiniZinc for Formal Methods\" by Peter J. Stuckey<br>\n• \"Local Search and Its Application in CDCL/CDCL(T) solvers for SAT/SMT\" by Shaowei Cai<br>\n• \"NASA’s core Flight System Framework Overview / Tutorial\" by David Swartwout</p>\n<p>The invited talks:</p>\n<p>• \"Reasoning about quantifiers in SMT: the QSMA algorithm\" by Maria Paola Bonacina<br>\n• \"Distribution Testing: The New Frontier for Formal Methods\" by Kuldeep Meel<br>\n• \"Formal Methods for Trusted AI\" by Bettina Könighofer</p>\n<p>The full program is available at<br>\n<a href=\"https://fmcad.org/FMCAD23/program/\">https://fmcad.org/FMCAD23/program/</a></p>\n<p>VENUE</p>\n<hr>\n<p>FMCAD will take place at Reiman Gardens (<a href=\"https://www.reimangardens.com/\">https://www.reimangardens.com/</a>),<br>\nAmes, IA, USA –  a living garden, always changing, adapting, evolving with the<br>\nseasons and with its annual theme. It’s a natural, sustainable canvas that<br>\nlandscape and horticultural artists constantly reinvent.</p>\n<p>STUDENT FORUM</p>\n<hr>\n<p>Continuing the tradition of the previous years, FMCAD 2023 is hosting a<br>\nStudent Forum that provides a platform for graduate students at any<br>\ncareer stage to introduce their research to the wider Formal Methods<br>\ncommunity, and solicit feedback. This year, the forum will feature 15 talks.</p>\n<p>CO-LOCATED EVENTS</p>\n<hr>\n<p>15th International Conference on Verified Software: Theories,<br>\nTools, and Experiments (VSTTE 2023):<br>\n<a href=\"https://homepage.cs.uiowa.edu/~ajreynol/VSTTE2023/\">https://homepage.cs.uiowa.edu/~ajreynol/VSTTE2023/</a></p>\n<hr>\n<p>Intel Israel (74) Limited</p>\n<p>This e-mail and any attachments may contain confidential material for<br>\nthe sole use of the intended recipient(s). Any review or distribution<br>\nby others is strictly prohibited. If you are not the intended<br>\nrecipient, please contact the sender and delete all copies.</p>",
        "id": 391621655,
        "sender_full_name": "Email Gateway",
        "timestamp": 1695014459
    }
]