[
    {
        "content": "<p>From: Peter Achten &lt;<a href=\"mailto:P.Achten@cs.ru.nl\">P.Achten@cs.ru.nl</a>&gt;<br>\n====== TFP 2022 ======</p>\n<p>23rd Symposium on Trends in Functional Programming<br>\n10-11 February, 2022<br>\nKrakow, Poland<br>\n<a href=\"https://trendsfp.github.io/index.html\">https://trendsfp.github.io/index.html</a></p>\n<p>== Important Dates ==</p>\n<p>Submission deadline for pre-symposium review            Wednesday 1st <br>\nDecember, 2021<br>\nSubmission deadline for draft papers                    Wednesday 12th <br>\nJanuary, 2022<br>\nNotification for pre-symposium submissions              Friday 21st <br>\nJanuary, 2022<br>\nNotification for draft submissions                      Friday 21st <br>\nJanuary, 2022<br>\nSymposium dates                                         Thursday 10th - <br>\nFriday 11th February, 2022<br>\nSubmission deadline for post-symposium reviewing        Wednesday 16th <br>\nMarch, 2022<br>\nNotification for post-symposium submissions             Friday 13rd May, <br>\n2022</p>\n<p>The Symposium on Trends in Functional Programming (TFP) is an<br>\ninternational forum for researchers with interests in all aspects of<br>\nfunctional programming, taking a broad view of current and future<br>\ntrends in the area. It aspires to be a lively environment for<br>\npresenting the latest research results, and other contributions.</p>\n<p>Please be aware that TFP uses two distinct rounds of submissions.</p>\n<p>TFP 2022 will be co-located with two other functional programming<br>\nevents. TFP 2022 will be accompanied by the International Workshop on<br>\nTrends in Functional Programming in Education (TFPIE), which will take<br>\nplace on February 11. Simultaneously with TFP, Lambda Days '22 is a<br>\ntwo day conference where academia meets industry, where research and<br>\npractical application collide.</p>\n<p>== Scope ==</p>\n<p>The symposium recognizes that new trends may arise through various<br>\nroutes. As part of the Symposium's focus on trends we therefore<br>\nidentify the following five article categories. High-quality articles<br>\nare solicited in any of these categories:</p>\n<ul>\n<li>\n<p>Research Articles:<br>\n   Leading-edge, previously unpublished research work</p>\n</li>\n<li>\n<p>Position Articles:<br>\n  On what new trends should or should not be</p>\n</li>\n<li>\n<p>Project Articles:<br>\n   Descriptions of recently started new projects</p>\n</li>\n<li>\n<p>Evaluation Articles:<br>\n   What lessons can be drawn from a finished project</p>\n</li>\n<li>\n<p>Overview Articles:<br>\n   Summarizing work with respect to a trendy subject</p>\n</li>\n</ul>\n<p>Articles must be original and not simultaneously submitted for<br>\npublication to any other forum. They may consider any aspect of<br>\nfunctional programming: theoretical, implementation-oriented, or<br>\nexperience-oriented. Applications of functional programming techniques<br>\nto other languages are also within the scope of the symposium.</p>\n<p>Topics suitable for the symposium include, but are not limited to:</p>\n<ul>\n<li>Functional programming and multicore/manycore computing</li>\n<li>Functional programming in the cloud</li>\n<li>High performance functional computing</li>\n<li>Extra-functional (behavioural) properties of functional programs</li>\n<li>Dependently typed functional programming</li>\n<li>Validation and verification of functional programs</li>\n<li>Debugging and profiling for functional languages</li>\n<li>\n<p>Functional programming in different application areas:<br>\n   security, mobility, telecommunications applications, embedded<br>\n   systems, global computing, grids, etc.</p>\n</li>\n<li>\n<p>Interoperability with imperative programming languages</p>\n</li>\n<li>Novel memory management techniques</li>\n<li>Program analysis and transformation techniques</li>\n<li>Empirical performance studies</li>\n<li>Abstract/virtual machines and compilers for functional languages</li>\n<li>(Embedded) domain specific languages</li>\n<li>New implementation strategies</li>\n<li>Any new emerging trend in the functional programming area</li>\n</ul>\n<p>If you are in doubt on whether your article is within the scope of<br>\nTFP, please contact the TFP 2022 program chairs, Wouter Swierstra and<br>\nNicolas Wu.</p>\n<p>== Best Paper Awards ==</p>\n<p>To reward excellent contributions, TFP awards a prize for the best<br>\npaper accepted for the formal proceedings.</p>\n<p>TFP traditionally pays special attention to research students,<br>\nacknowledging that students are almost by definition part of new<br>\nsubject trends. A student paper is one for which the authors state<br>\nthat the paper is mainly the work of students, the students are listed<br>\nas first authors, and a student would present the paper. A prize for<br>\nthe best student paper is awarded each year.</p>\n<p>In both cases, it is the PC of TFP that awards the prize. In case the<br>\nbest paper happens to be a student paper, that paper will then receive<br>\nboth prizes.</p>\n<p>== Instructions to Author ==</p>\n<p>Papers must be submitted at:</p>\n<p><a href=\"https://easychair.org/conferences/?conf=tfp22\">https://easychair.org/conferences/?conf=tfp22</a></p>\n<p>Authors of papers have the choice of having their contributions<br>\nformally reviewed either before or after the Symposium.</p>\n<p>== Pre-symposium formal review ==</p>\n<p>Papers to be formally reviewed before the symposium should be<br>\nsubmitted before an early deadline and receive their reviews and<br>\nnotification of acceptance for both presentation and publication<br>\nbefore the symposium. A paper that has been rejected in this process<br>\nmay still be accepted for presentation at the symposium, but will not<br>\nbe considered for the post-symposium formal review.</p>\n<p>== Post-symposium formal review ==</p>\n<p>Draft papers will receive minimal reviews and notification of<br>\nacceptance for presentation at the symposium. Authors of draft papers<br>\nwill be invited to submit revised papers based on the feedback received<br>\nat the symposium. A post-symposium refereeing process will then select<br>\na subset of these articles for formal publication.</p>\n<p>== Paper categories ==</p>\n<p>Draft papers and papers submitted for formal review are submitted as<br>\nextended abstracts (4 to 10 pages in length) or full papers (20<br>\npages). The submission must clearly indicate which category it belongs<br>\nto: research, position, project, evaluation, or overview paper. It<br>\nshould also indicate which authors are research students, and whether<br>\nthe main author(s) are students. A draft paper for which all authors<br>\nare students will receive additional feedback by one of the PC members<br>\nshortly after the symposium has taken place.</p>\n<p>== Format ==</p>\n<p>Papers must be written in English, and written using the LNCS<br>\nstyle. For more information about formatting please consult the<br>\nSpringer LNCS web site.</p>\n<p>== Program Committee ==</p>\n<p>Program Co-chairs</p>\n<p>Nicolas Wu - Imperial College London<br>\nWouter Swierstra - Utrecht University</p>\n<p>The remainder of the PC will be announced on the conference website.</p>",
        "id": 255192419,
        "sender_full_name": "Email Gateway",
        "timestamp": 1632824172
    }
]