[
    {
        "content": "<p>From: Małgorzata Biernacka &lt;<a href=\"mailto:mabi@cs.uni.wroc.pl\">mabi@cs.uni.wroc.pl</a>&gt;<br>\n        The 27th International Symposium on Principles<br>\n           and Practice of Declarative Programming</p>\n<p>September 10-11, 2025<br>\nUniversity of Calabria, Rende, Italyhttps://ppdp25.github.io/site/</p>\n<p>Collocated with ICLP 2025.https://iclp25.demacs.unical.it/</p>\n<h1>Important dates</h1>\n<ul>\n<li>Title and abstract registration: 18 May 2025 (AoE)</li>\n<li>Paper submission: 30 May 2025 (AoE)</li>\n<li>Author notification: 7 July 2025</li>\n<li>Final paper version: 21 July 2025</li>\n</ul>\n<h1>Overview</h1>\n<p>The PPDP 2025 symposium brings together researchers from the declarative<br>\nprogramming communities, including those working in the functional, logic,<br>\nanswer-set, and constraint handling programming paradigms. The goal is to<br>\nstimulate research in the use of logical formalisms and methods for analyzing,<br>\nperforming, specifying, and reasoning about computations, including mechanisms<br>\nfor concurrency, security, static analysis, and verification.</p>\n<p>PPDP 25 will be held at University of Calabria, Rende, Italy, as part of ICLP<br>\n2025 (<a href=\"https://iclp25.demacs.unical.it/\">https://iclp25.demacs.unical.it/</a>). At least one of the authors of an<br>\naccepted paper is expected to attend the conference and present the paper.</p>\n<p>Submissions are invited on all topics related to declarative programming, from<br>\nprinciples to practice, from foundations to applications. Topics of interest<br>\ninclude, but are not limited to:</p>\n<ul>\n<li>\n<p>Language Design: domain-specific languages; interoperability; concurrency,<br>\n  parallelism and distribution; modules; functional languages; reactive<br>\n  languages; languages with objects; languages for quantum computing; languages<br>\n  inspired by biological and chemical computation; metaprogramming.</p>\n</li>\n<li>\n<p>Declarative languages in artificial intelligence: logic programming; database<br>\n  languages; knowledge representation languages; probabilistic languages;<br>\n  differentiable languages.</p>\n</li>\n<li>\n<p>Implementations: abstract machines; interpreters; compilation; compile-time<br>\n  and run-time optimization; memory management.</p>\n</li>\n<li>\n<p>Foundations: types; logical frameworks; monads and effects; semantics.</p>\n</li>\n<li>\n<p>Analysis and Transformation: partial evaluation; abstract interpretation;<br>\n  control flow; data flow; information flow; termination analysis; resource<br>\n  analysis; type inference and type checking; verification; validation;<br>\n  debugging; testing.</p>\n</li>\n<li>\n<p>Tools and Applications: programming and proof environments; verification<br>\n  tools; case studies in proof assistants or interactive theorem provers;<br>\n  certification; novel applications of declarative programming inside and<br>\n  outside of CS; declarative programming pearls; practical experience reports<br>\n  and industrial application; education.</p>\n</li>\n</ul>\n<h1>Paper Submission</h1>\n<p>Submissions can be made in three categories:</p>\n<ul>\n<li>Regular Research Papers,</li>\n<li>System Descriptions, and</li>\n<li>Experience Reports.</li>\n</ul>\n<p>Submissions of Research Papers must present original research which is<br>\nunpublished and not submitted elsewhere. They must not exceed 12 pages ACM<br>\nstyle 2-column (including figures, but excluding bibliography). Work that<br>\nalready appeared in unpublished or informally published workshop proceedings<br>\nmay be submitted. Research papers will be judged on originality, significance,<br>\ncorrectness, clarity, and readability.</p>\n<p>Submission of System Descriptions must describe a working system whose<br>\ndescription has not been published or submitted elsewhere. They must not exceed<br>\n10 pages and should contain a link to a working system. System Descriptions<br>\nmust be marked as such at the time of submission and will be judged on<br>\noriginality, significance, usefulness, clarity, and readability.</p>\n<p>Submissions of Experience Reports are meant to help create a body of published,<br>\nrefereed, citable evidence where declarative programming such as functional,<br>\nlogic, answer-set, constraint programming, etc., is used in practice. They must<br>\nnot exceed 5 pages <strong>including references</strong>. Experience Reports must be marked<br>\nas such at the time of submission and need not report original research<br>\nresults. They will be judged on significance, usefulness, clarity, and<br>\nreadability.</p>\n<p>Possible topics for an Experience Report include, but are not limited to:</p>\n<ul>\n<li>\n<p>insights gained from real-world projects using declarative programming</p>\n</li>\n<li>\n<p>comparison of declarative programming with conventional programming in the<br>\n  context of an industrial project or a university curriculum</p>\n</li>\n<li>\n<p>curricular issues encountered when using declarative programming in education</p>\n</li>\n<li>\n<p>real-world constraints that created special challenges for an implementation<br>\n  of a declarative language or for declarative programming in general</p>\n</li>\n<li>\n<p>novel use of declarative programming in the classroom</p>\n</li>\n<li>\n<p>programming pearl that illustrates a nifty new data structure or programming<br>\n  technique.</p>\n</li>\n</ul>\n<p>Supplementary material may be provided via a link to an extended version of the<br>\nsubmission (recommended), or in a clearly marked appendix beyond the above<br>\nmentioned page limits. Reviewers are not required to study extended versions or<br>\nany material beyond the respective page limit. Material beyond the page limit<br>\nwill not be included in the final published version.</p>\n<h1>Submission Guidelines</h1>\n<p>Submissions will be made via EasyChair. The submission webpage for<br>\nPPDP 25 ishttps://easychair.org/conferences/?conf=iclp25 (select PPDP<br>\ntrack).</p>\n<p>For each paper category, you must use the most recent version of the \"Current<br>\nACM Master Template\" which is available at<br>\n(<a href=\"https://www.acm.org/publications/proceedings-template\">https://www.acm.org/publications/proceedings-template</a>). You must use the LaTeX<br>\nsigconf proceedings template as the conference organizers are unable to process<br>\nfinal submissions in other formats.</p>\n<p>Authors should note ACM's statement on author's rights<br>\n(<a href=\"http://authors.acm.org/\">http://authors.acm.org/</a>) which apply to final papers. Submitted papers should<br>\nmeet the requirements of ACM's plagiarism policy<br>\n(<a href=\"http://www.acm.org/publications/policies/plagiarism_policy\">http://www.acm.org/publications/policies/plagiarism_policy</a>).</p>\n<h1>Note About the New ACM Open Access Model</h1>\n<p>ACM has introduced a new open access publishing model for the International<br>\nConference Proceedings Series (ICPS). Authors based at institutions that are<br>\nnot yet part of the ACM Open program and do not qualify for a waiver will be<br>\nrequired to pay an article processing charge (APC) to publish their ICPS<br>\narticle in the ACM Digital Library. To determine whether or not an APC will be<br>\napplicable to your article, please follow the detailed guidance<br>\nhere:<a href=\"https://www.acm.org/publications/icps/author-guidance\">https://www.acm.org/publications/icps/author-guidance</a>.</p>\n<p>Further information may be found on the ACM website, as follows:</p>\n<p>Full details of the new ICPS publishing model:<br>\n<a href=\"https://www.acm.org/publications/icps/faq\">https://www.acm.org/publications/icps/faq</a><br>\nFull details of the ACM Open program:<br>\n<a href=\"https://www.acm.org/publications/openaccess\">https://www.acm.org/publications/openaccess</a></p>\n<p>Please direct all questions about the new model to <a href=\"mailto:icps-info@acm.org\">icps-info@acm.org</a>.</p>\n<h1>Program Chairs</h1>\n<p>Małgorzata Biernacka (Institute of Computer Science, University of<br>\nWrocław, Poland)<br>\nCarlos Olarte (LIPN and University Sorbonne Paris Nord, France).</p>\n<h1>Program Committee</h1>\n<p>Salvador Abreu (University of Évora, Portugal)<br>\nSandra Alves (University of Porto, Portugal)<br>\nRoman Barták (Charles University, Czech Republic)<br>\nAlessandro Bruni (IT-University of Copenhagen, Denmark)<br>\nMoreno Falaschi (University of Siena, Italy)<br>\nFabio Gaducci (University of Pisa, Italy)<br>\nCinzia di Giusto (Université Côte d’Azur, France)<br>\nMichael Hanus (University of Kiel, Germany)<br>\nThomas Hildebrandt (University of Copenhagen, Denmark)<br>\nYukiyoshi Kameyama (University of Tsukuba, Japan).<br>\nDelia Kesner (University Paris Cité, France)<br>\nCosimo Laneve (University of Bologna, Italy)<br>\nAlberto Momigliano (University of Milan, Italy)<br>\nRuben Rubio (Universidad Complutense de Madrid, Spain)<br>\nClaudio Sacerdoti Coen (University of Bologna, Italy)<br>\nFilip Sieczkowski (Heriot-Watt University, UK)<br>\nBernardo Toninho (NOVA FCT and NOVA LINCS, Portugal)<br>\nFrank Valencia (LIX, École Polytechnique de Paris, France)<br>\nGermán Vidal (Universitat Politecnica de Valencia, Spain)</p>",
        "id": 497867533,
        "sender_full_name": "Email Gateway",
        "timestamp": 1738754051
    }
]