[
    {
        "content": "<p>From: Josef Urban &lt;<a href=\"mailto:josef.urban@gmail.com\">josef.urban@gmail.com</a>&gt;<br>\nTABLEAUX 2023 - PRELIMINARY CALL FOR PAPERS</p>\n<p>The 32nd International Conference on Automated Reasoning with Analytic<br>\nTableaux and Related Methods<br>\nPrague, Czech Republic, September 18-21, 2023</p>\n<p>Website: <a href=\"http://tableaux2023.tableaux-ar.org\">http://tableaux2023.tableaux-ar.org</a><br>\nSubmission deadlines: May 9 (abstract), May 14, 2023 (paper)</p>\n<p>GENERAL INFORMATION<br>\nThe 32nd International Conference on Automated Reasoning with Analytic<br>\nTableaux and Related Methods (TABLEAUX 2023) will be hosted by the<br>\nCzech Technical University in Prague, Czech Republic, September 18-21,<br>\n2023.</p>\n<p>TABLEAUX is the main international conference at which research on all<br>\naspects -- theoretical foundations, implementation techniques, systems<br>\ndevelopment and applications -- of tableaux-based reasoning and<br>\nrelated methods is presented. The first TABLEAUX conference was held<br>\nin Lautenbach near Karlsruhe, Germany, in 1992. Since then it has been<br>\norganised on an annual basis (sometimes as a part of IJCAR).</p>\n<p>TABLEAUX 2023 will be co-located with the 14th International Symposium<br>\non Frontiers of Combining Systems (FroCoS 2023). The conferences will<br>\nprovide a rich programme of workshops, tutorials, invited talks, paper<br>\npresentations and system descriptions.</p>\n<p>SCOPE OF CONFERENCE<br>\nTableaux and related proof methods offer convenient and flexible tools<br>\nfor automated reasoning for both classical and non-classical logics.<br>\nAreas of application include verification of software and computer<br>\nsystems, deductive databases, knowledge representation and its<br>\nrequired inference engines, teaching, and system diagnosis.</p>\n<p>Topics of interest include but are not limited to:</p>\n<p>* tableau methods for classical and non-classical logics (including<br>\nfirst-order, higher-order, modal, temporal, description, hybrid,<br>\nintuitionistic, linear, substructural, fuzzy, relevance and<br>\nnon-monotonic logics) and their proof-theoretic foundations;</p>\n<p>* sequent, natural deduction, labelled, nested and deep calculi for<br>\nclassical and non-classical logics, as tools for proof search and<br>\nproof representation;</p>\n<p>* related methods (SMT, model elimination, model checking,<br>\nconnection methods, resolution, BDDs, translation approaches);</p>\n<p>* flexible, easily extendable, light-weight methods for theorem<br>\nproving; novel types of calculi for theorem proving and verification<br>\nin classical and non-classical logics;</p>\n<p>* systems, tools, implementations, empirical evaluations and<br>\napplications (provers, proof assistants, logical frameworks, model<br>\ncheckers, etc.);</p>\n<p>* implementation techniques (data structures, efficient algorithms,<br>\nperformance measurement, extensibility, etc.);</p>\n<p>* combinations with machine learning and other AI methods;<br>\n   * techniques for proof generation and compact (or human-readable)<br>\nproof representation;</p>\n<p>* theoretical and practical aspects of decision procedures;<br>\n   * applications of automated deduction to mathematics, software<br>\ndevelopment, verification, deductive and temporal databases, knowledge<br>\nrepresentation, ontologies, fault diagnosis or teaching.</p>\n<p>We also welcome papers describing applications of tableau procedures<br>\nto real-world examples. Such papers should be tailored to the TABLEAUX<br>\ncommunity and should focus on the role of reasoning and on logical<br>\naspects of the solution.</p>\n<p>AITP-TABLEAUX SPECIAL TRACK<br>\nBesides the main track, TABLEAUX 2023 will host a special track on<br>\nArtificial Intelligence and Theorem Proving (AITP). The special track<br>\ninvites papers combining machine learning and related AI methods with<br>\nstandard TABLEAUX topics (see above). We welcome full versions of the<br>\nextended abstracts presented at the AITP conference<br>\n(<a href=\"http://aitp-conference.org/2023/\">http://aitp-conference.org/2023/</a>).</p>\n<p>WORKSHOPS AND TUTORIALS<br>\nIf you would like to organize a workshop or run a tutorial, please let<br>\nus know before July 14, 2023.</p>\n<p>INVITED SPEAKERS<br>\nTo be announced.</p>\n<p>SUBMISSION GUIDELINES<br>\nSubmissions are invited in the following two categories:<br>\n(A) regular papers reporting original theoretical research or<br>\napplications. Up to 15 pages excluding references;<br>\n(B) short papers such as system descriptions, user experiences, case<br>\nstudies and domain models. Up to 9 pages excluding references.</p>\n<p>Submissions will be reviewed by the Program Committee, possibly with<br>\nthe help of external reviewers, taking into account correctness,<br>\noriginality, readability, relevance, and significance. Any additional<br>\nmaterial (going beyond the page limit) may be included in a clearly<br>\nmarked appendix that will be read at the discretion of the committee<br>\nand must be removed for the camera-ready version.</p>\n<p>Submissions must be unpublished and not submitted for archival<br>\npublication elsewhere. If software or data is relevant to a paper, a<br>\nlink that provides access to the software/data must be provided to<br>\nenable reproduction of the results. Accepted papers in categories (A)<br>\nand (B) will be published in the conference proceedings.</p>\n<p>Papers must be edited in LaTeX using the llncs style and must be<br>\nsubmitted electronically as PDF files via the EasyChair system:<br>\n<a href=\"https://easychair.org/my/conference?conf=tableaux2023\">https://easychair.org/my/conference?conf=tableaux2023</a></p>\n<p>For all accepted papers, at least one author is required to register<br>\nfor the conference and present the paper. A title and a short abstract<br>\nof about 100 words must be submitted before the paper submission<br>\ndeadline. Formatting instructions and the LNCS style files can be<br>\nobtained at:<br>\n<a href=\"http://www.springer.com/br/computer-science/lncs/conference-proceedings-guidelines\">http://www.springer.com/br/computer-science/lncs/conference-proceedings-guidelines</a></p>\n<p>IMPORTANT DATES<br>\nSubmission of title and abstract: May 9, 2023<br>\nPaper submission deadline: May 14, 2023<br>\nNotification of acceptance: July 9, 2023<br>\nFinal version: July 23, 2023<br>\nConference date: September 18-21, 2023</p>\n<p>CONFERENCE FORMAT AND COVID-19<br>\nTABLEAUX 2023 and FroCoS 2023 are planned as in-person conferences.<br>\nHowever, virtual participation might be a possibility in exceptional<br>\nsituations.</p>\n<p>PUBLICATION<br>\nThe conference proceedings will be published in the Springer series<br>\nLecture Notes in Artificial Intelligence (LNAI/LNCS) as Gold Open<br>\nAccess under a CC-BY-4.0-license. The open access costs will be<br>\ncovered from sponsorships and from the registration fees of all<br>\nparticipants.</p>\n<p>BEST PAPER AWARDS<br>\nThe program committee will select</p>\n<ul>\n<li>the TABLEAUX 2023 Best Paper; and,</li>\n<li>the TABLEAUX 2023 Best Paper by a Junior Researcher.</li>\n</ul>\n<p>Researchers will be considered \"junior\" if either they are students or<br>\ntheir PhD degree date is less than two years from the first day of the<br>\nmeeting. The two awards will be presented at the conference.</p>\n<p>TRAVEL GRANTS FOR STUDENTS<br>\nSome funding may be available to support students participating at<br>\nTABLEAUX 2023. More details will be given on the conference website in<br>\ndue time.</p>\n<p>PROGRAM COMMITTEE<br>\nTo be announced.</p>\n<p>PC CHAIRS<br>\nRevantha Ramanayake (University of Groningen, The Netherlands)<br>\nJosef Urban (Czech Technical University in Prague, Czech Republic)</p>\n<p>LOCAL ORGANIZERS<br>\nKarel Chvalovsky (Czech Technical University in Prague, Czech Republic)<br>\nJan Jakubuv (Czech Technical University in Prague, Czech Republic)<br>\nMartin Suda (Czech Technical University in Prague, Czech Republic)<br>\nJosef Urban (Czech Technical University in Prague, Czech Republic)</p>",
        "id": 327464173,
        "sender_full_name": "Email Gateway",
        "timestamp": 1676262265
    }
]