[
    {
        "content": "<p>From: Alexander Steen &lt;<a href=\"mailto:alx.steen@gmail.com\">alx.steen@gmail.com</a>&gt;<br>\n2nd CALL FOR CONTRIBUTIONS<br>\nKI 2023 – DOCTORAL CONSORTIUM<br>\nBerlin, September 26, 2023<br>\n<a href=\"https://ki2023.gi.de/doctoral-consortium\">https://ki2023.gi.de/doctoral-consortium</a></p>\n<p>KI2023 takes place in Berlin, Germany, September 26–29, 2023. It is the <br>\n46th edition of the German conference on Artificial Intelligence <br>\n(abbreviated KI for \"Künstliche Intelligenz\") organized in cooperation <br>\nwith the Fachbereich Künstliche Intelligenz der Gesellschaft für <br>\nInformatik (GI-SIG AI). KI is one of the major European AI conferences <br>\nand traditionally brings together academic and industrial researchers <br>\nfrom all areas of AI, providing an ideal place for exchanging news and <br>\nresearch results on theory and applications. The technical program of <br>\nKI2023 comprises paper presentations as well as tutorials and workshops.</p>\n<p>DOCTORAL CONCORTIUM FORMAT<br>\nThere will be a PhD workshop with keynote and oral presentations during <br>\nthe KI conference, providing an opportunity for obtaining feedback on <br>\nPhD projects. Doctoral students may also participate in a mentoring <br>\nprogram that will connect students with experienced researchers in their <br>\nfield. The organizers will try to schedule personal meetings between <br>\nmentors and students. Students can indicate their interest in this <br>\nprogram when submitting their contribution, or directly by contacting <br>\nthe organizers. The schedule of the meetings will be announced ahead of <br>\nthe event. The organizers plan to publish extended abstracts as <br>\nproceedings of the PhD workshop, probably with the GI-DL (GI Digital <br>\nLibrary).</p>\n<p>Additionally, there will be the opportunity to participate in the main <br>\nconference poster session where the participants will have the chance to <br>\npresent their research to a larger audience.</p>\n<p>APPLICATION<br>\nTo apply for the KI2023 doctoral consortium, please submit the following <br>\ndocuments (in a single pdf file) to the EasyChair submission system <br>\n&lt;<a href=\"https://easychair.org/conferences/?conf=ki2023\">https://easychair.org/conferences/?conf=ki2023</a>&gt; (Track Doctoral <br>\nConsortium) until July 10, 2023.</p>\n<p>An abstract of your thesis, formatted according to the GI-LNI <br>\nguidelines, preferably in LaTeX <br>\n&lt;<a href=\"https://gi.de/service/publikationen/lni\">https://gi.de/service/publikationen/lni</a>&gt;, that describes the problem <br>\nbeing addressed, the motivation for addressing the problem, related <br>\nwork, the proposed approach, and planned or already executed evaluation. <br>\nTarget length of the abstract is 4–10 pages, including references.</p>\n<p>A short CV that covers background (name, university, supervisors), <br>\neducation (degree sought, year/status in a degree, previous degrees), <br>\nemployment, and experience in research (publications, presentations, <br>\nconferences attended) of max. 2 pages.</p>\n<p>Please indicate in your application if you want to participate in the <br>\nmentoring program.</p>\n<p>The extended abstract could be structured in the following way:<br>\n   * Introduction<br>\n   * Motivation<br>\n   * Research Question<br>\n   * Related Work<br>\n   * Approach<br>\n   * (Planned) Evaluation</p>\n<p>Abstract submissions should be in English and must have a single author <br>\nwho is pursuing the proposed PhD.</p>\n<p>IMPORTANT DATES<br>\nSubmission Deadline: July 10, 2023<br>\nDoctoral Consortium: September 26, 2023 (tentative)</p>\n<p>CONTACT<br>\nShould you have any questions regarding the doctoral consortium at <br>\nKI2023, please do not hesitate to contact Prof. Dr. Frieder Stolzenburg <br>\n(<a href=\"mailto:fstolzenburg@hs-harz.de\">fstolzenburg@hs-harz.de</a>)</p>",
        "id": 364084433,
        "sender_full_name": "Email Gateway",
        "timestamp": 1686076394
    }
]