[
    {
        "content": "<p>From: Peter Hoefner &lt;<a href=\"mailto:cl-isabelle-users@lists.cam.ac.uk\">cl-isabelle-users@lists.cam.ac.uk</a>&gt;<br>\nANU Logic Summer School</p>\n<p>December 2 – 13, 2024</p>\n<p>Australian National University<br>\nCanberra, Ngunnawal and Ngambri Country, Australia<br>\n<a href=\"https://comp.anu.edu.au/lss/\">https://comp.anu.edu.au/lss/</a></p>\n<p>OVERVIEW</p>\n<p>The ANU Logic Summer School is an annual event that offers a two week long programme of lectures on modern logic, the foundational discipline of the information sciences. Topics include not only the science of reasoning but also computability theory, type theory and other tools for understanding processes, declarative programming, automatic proof generation, program verification and much more. The school is primarily geared at late undergraduate and masters students, but is open to all, including postgraduate and PhD students, postdocs, and participants from industry.</p>\n<p>PROGRAMME</p>\n<p>The school features four introductory courses in the first week, and a series of five lectures covering more advanced topics in the second week. The courses are given by a mix of local, domestic and international speakers.</p>\n<p>Week 1:<br>\nJohn Slaney (ANU): Foundations of Metalogic<br>\nMichael Norrish (ANU): Computability and Incompleteness<br>\nFabian Muehlboeck (ANU): Formalizing and Reasoning About Programming Languages<br>\nRanald Clouston (ANU): Propositions and Types, Proofs and Programs</p>\n<p>Week 2:<br>\nIris van der Giessen (U. of Amsterdam): Interpolation through the Lens of Proof Theory<br>\nMark Reynolds (U. of Western Australia): Verification via Temporal Logic: an Introduction<br>\nTomasz Kowalski (La Trobe U. / Jagiellonian U.): Qualitative Calculi via Relation Algebras<br>\nSophie Pinchinat (U. of Rennes): Automatic Structures and their Logical theory<br>\nThomas Sewell (U. of New South Wales): Applying Logic in Software and Inefficient Computation</p>\n<p>SOCIAL EVENTS</p>\n<p>The summer school hosts a welcome reception on Sunday December 1, a social dinner on Thursday December 5, and organises an excursion to Canberra’s surrounds on Saturday December 7.</p>\n<p>ACCOMMODATION</p>\n<p>We do not organise accommodation for participants. The Canberra Accommodation Centre (https://www.canberra-accommodation.com.au&lt;<a href=\"https://www.canberra-accommodation.com.au/\">https://www.canberra-accommodation.com.au/</a>&gt;) is reasonably priced and in walking distance from the ANU campus.</p>\n<p>REGISTRATION</p>\n<p>The registration fee for students is A$160 and includes the social events. Details on how to register, and fees for other categories of participants, are on the school’s website: <a href=\"https://comp.anu.edu.au/lss/registration/\">https://comp.anu.edu.au/lss/registration/</a>.</p>\n<p>GRANTS</p>\n<p>The Organising Committee of the ANU Logic Summer School is pleased to announce a limited number of grants that might cover, in part, the registration fee, accommodation costs, travel expenses. The deadline for applications is 15th October 2024. For more details on conditions and application, please consult: <a href=\"https://comp.anu.edu.au/lss/grants/\">https://comp.anu.edu.au/lss/grants/</a>.</p>\n<p>ORGANISATION</p>\n<p>The logic summer school is organised by Peter Hoefner, Dirk Pattinson, Pramo Samarasinghe and Ian Shillito. Please direct all enquiries to lss.comp.cecs@anu.edu.au&lt;mailto:<a href=\"mailto:lss.comp.cecs@anu.edu.au\">lss.comp.cecs@anu.edu.au</a>&gt;.</p>",
        "id": 474714465,
        "sender_full_name": "Email Gateway",
        "timestamp": 1728008998
    }
]