[
    {
        "content": "<p>From: Mihails Milehins &lt;<a href=\"mailto:mihailsmilehins@gmail.com\">mihailsmilehins@gmail.com</a>&gt;<br>\nDear All,</p>\n<p>I would like to make several remarks about the entries CZH_* on the AFP:</p>\n<ol>\n<li>\n<p>I may have mentioned to several members of the community that I have an<br>\nintention to continue improving these entries and provide further material.<br>\nHowever, it is likely that this will not be possible. I have not been able<br>\nto find the time and/or the computational resources to continue this work<br>\nthus far, and I doubt that this will change in the foreseeable future.<br>\nMoreover, I noticed that HOTG started taking shape once again and there is<br>\nfurther relevant automation that became available recently [1]. From my<br>\nperspective, TG is a more natural setting for formalization of category<br>\ntheory than ZFC. Furthermore, from my experience, the automation provided<br>\nin [1] could be \"game changing\" in the context of the formalization of<br>\nmathematics in set-theoretic foundations at large (be it ZFC or TG). This<br>\nmakes it less appealing to continue the development of my own formalization<br>\n(without, at least, a significant overhaul based on [1]). Naturally, I will<br>\ntry to do my best to maintain the content that has already been published<br>\non the AFP.</p>\n</li>\n<li>\n<p>While I have accrued some further material beyond what is currently in<br>\nthe AFP (Freyd's General Adjoint Functor Theorem and its applications in<br>\nalgebra, quotient categories, further material on dagger categories), I do<br>\nnot believe that I have enough material for a conference paper on this<br>\ntopic. However, if anyone from the community could agree to provide an<br>\nendorsement for a relevant subject area on Arxiv, I would like to upload a<br>\nshort note about these entries. The reasons for this are two-fold:</p>\n</li>\n</ol>\n<p>2.1. While the scope of the formalization is quite narrow, I believe that<br>\nthis may have been the first substantial formalization (in a proof<br>\nassistant) of category theory with the categories defined on the stages of<br>\nthe von Neumann hierarchy, rather than the Grothendieck's universes.</p>\n<p>2.2. The formalization largely rests on the homegrown automation<br>\n(Conditional_Simplification), which has advantages (and some disadvantages)<br>\nover the traditional classical methods (auto/force) that combine classical<br>\nreasoning and rewriting. Again, I believe that this may be the first use<br>\ncase (at least in the context of Isabelle) for this type of algorithm, and<br>\n(efficiency matters aside) I found it exceptionally convenient in a<br>\nset-theoretic setting (or any setting with theorems that contain a large<br>\nnumber of non-trivial premises).</p>\n<p>Of course, I would be happy to be proven wrong about either/both of the<br>\nclaims above.</p>\n<p>[1] K. Kappelmann, “Transport via Partial Galois Connections<br>\nand Equivalences,” in APLAS 2023: Programming Languages and Systems,<br>\nTaipei, Taiwan, C.-K. Hur, Ed., in Lecture Notes in Computer Science.<br>\nSingapore: Springer Nature, 2023, pp. 225–245. doi:<br>\n10.1007/978-981-99-8311-7_11.</p>\n<p>Kind Regards,<br>\nMihails Milehins<br>\n(he/him/his)</p>",
        "id": 410769548,
        "sender_full_name": "Email Gateway",
        "timestamp": 1704153286
    }
]