[
    {
        "content": "<p>From: Andrew Tolmach &lt;<a href=\"mailto:tolmach@pdx.edu\">tolmach@pdx.edu</a>&gt;<br>\nCandidates in the areas of programming languages or formal methods are enthusiastically encouraged to apply for the following position:</p>\n<p>POSITION ANNOUNCEMENT</p>\n<p>Assistant Professor of Computer Science</p>\n<p>The Department of Computer Science at Portland State University invites applications for several Assistant Professor positions. Exceptional candidates will also be considered for appointment at the rank of Associate Professor. </p>\n<p>Candidates in all areas of Computer Science will be considered, with a preference for applicants who will enhance or complement our existing areas of research expertise and/or whose work is aligned with the strategic visions of the department or the Maseeh College. The expected start date for these positions is September 2021, but earlier or later dates can be negotiated.</p>\n<p>Please see <a href=\"https://www.pdx.edu/computer-science/open-faculty-position\">https://www.pdx.edu/computer-science/open-faculty-position</a> &lt;<a href=\"https://www.pdx.edu/computer-science/open-faculty-position\">https://www.pdx.edu/computer-science/open-faculty-position</a>&gt; for further information on applying.</p>",
        "id": 214561118,
        "sender_full_name": "Email Gateway",
        "timestamp": 1603711132
    },
    {
        "content": "<p>From: Andrew Tolmach &lt;<a href=\"mailto:tolmach@pdx.edu\">tolmach@pdx.edu</a>&gt;<br>\nCandidates in the areas of programming languages or formal methods are<br>\nenthusiastically encouraged to apply for the following positions:</p>\n<p>POSITION ANNOUNCEMENT<br>\nAssistant Professor of Computer Science<br>\nPortland State University</p>\n<p>The Department of Computer Science at Portland State University<br>\ninvites applications for four tenure-track Assistant Professor<br>\npositions.  In addition to several other fields, we are particularly<br>\ninterested in candidates with backgrounds in programming languages<br>\nand/or formal methods. The expected start date is September 2022,<br>\nbut earlier or later dates can be negotiated. Review of applications<br>\nhas begun and will continue until the positions are filled. For more details,<br>\nplease visit <a href=\"https://www.pdx.edu/computer-science/open-faculty-positions\">https://www.pdx.edu/computer-science/open-faculty-positions</a> .</p>",
        "id": 264126611,
        "sender_full_name": "Email Gateway",
        "timestamp": 1638953428
    }
]