[
    {
        "content": "<p>From: Florian Frohn &lt;<a href=\"mailto:florian.frohn@cs.rwth-aachen.de\">florian.frohn@cs.rwth-aachen.de</a>&gt;<br>\n12th Workshop on Horn Clauses for Verification and Synthesis (HCVS)<br>\n<strong>Deadline Extension</strong><br>\n22 July 2025, Zagreb, Croatia<br>\nCo-located with CAV 2025</p>\n<p><a href=\"https://www.sci.unich.it/hcvs25/\">https://www.sci.unich.it/hcvs25/</a></p>\n<hr>\n<ul>\n<li>Important Dates *</li>\n</ul>\n<p>Paper submission deadline <strong>extended</strong>: 30 May 2025<br>\nPaper notification: mid June 2025<br>\nWorkshop: 22 July 2025</p>\n<ul>\n<li>Scope *</li>\n</ul>\n<p>Many Program Verification and Synthesis problems of interest can be <br>\nmodeled directly using Horn clauses and many recent advances in the CLP <br>\nand CAV communities have centered around efficiently solving problems <br>\npresented as Horn clauses.</p>\n<p>This series of workshops aims to bring together researchers working in <br>\nthe communities of Constraint/Logic Programming (e.g., ICLP and CP), <br>\nProgram Verification (e.g., CAV, TACAS, and VMCAI), and Automated <br>\nDeduction (e.g., CADE, IJCAR), on the topic of Horn clause based <br>\nanalysis, verification, and synthesis.</p>\n<p>Horn clauses for verification and synthesis have been advocated by these <br>\ncommunities in different times and from different perspectives and HCVS <br>\nis organized to stimulate interaction and a fruitful exchange and <br>\nintegration of experiences.</p>\n<p>Topics of interest include, but are not limited to the use of Horn <br>\nclauses, constraints, and related formalisms in the following areas:</p>\n<ul>\n<li>\n<p>Analysis and verification of programs and systems of various kinds <br>\n(e.g., imperative, object-oriented, functional, logic, higher-order, <br>\nconcurrent, transition systems, petri-nets, smart contracts)</p>\n</li>\n<li>\n<p>Program synthesis</p>\n</li>\n<li>Program testing</li>\n<li>Program transformation</li>\n<li>Constraint solving</li>\n<li>Type systems</li>\n<li>Machine learning and automated reasoning</li>\n<li>CHC encoding of analysis and verification problems</li>\n<li>Resource analysis</li>\n<li>Case studies and tools</li>\n<li>\n<p>Challenging problems</p>\n</li>\n<li>\n<p>Submission Guidelines *</p>\n</li>\n</ul>\n<p>We solicit regular papers describing theory and implementation of <br>\nHorn-clause based analysis and tool descriptions. We also solicit <br>\nextended abstracts describing work-in-progress, as well as presentations <br>\ncovering previously published results, extended abstracts of doctoral <br>\ntheses, and overviews of research projects that are of interest to the <br>\nworkshop. At least one author of each accepted paper will be required to <br>\nattend the workshop to present the contribution.</p>\n<p>Submission has to be done in one of the following formats:</p>\n<ul>\n<li>\n<p>Extended abstracts (up to 3 pages in EPTCS format), which describe <br>\nwork in progress or aim to initiate discussions.</p>\n</li>\n<li>\n<p>Presentation-only papers, i.e., papers already submitted or presented <br>\nat a conference or another workshop. Such papers can be submitted in any <br>\nformat, and will not be included in the workshop post-proceedings.</p>\n</li>\n<li>\n<p>Regular papers (up to 12 pages plus bibliography in EPTCS <br>\n(<a href=\"http://www.eptcs.org/\">http://www.eptcs.org/</a>) format), which should present previously <br>\nunpublished work (completed or in progress), including descriptions of <br>\nresearch, tools, and applications.</p>\n</li>\n<li>\n<p>Tool papers (up to 4 pages in EPTCS format), including the papers <br>\nwritten by the CHC-COMP participants, which can outline the theoretical <br>\nframework, the architecture, the usage, and experiments of the tool.</p>\n</li>\n</ul>\n<p>All submitted papers will be refereed by the program committee and will <br>\nbe selected for inclusion in accordance with the referee reports. If <br>\nenough regular papers are accepted, both regular papers and extended <br>\nabstracts will be published electronically. The publication of a paper <br>\nis not intended to preclude later publication. Full versions of extended <br>\nabstracts, or substantial revisions, may later be published elsewhere.</p>\n<p>Papers must be submitted through the EasyChair system using the web <br>\npage: <a href=\"https://easychair.org/conferences/?conf=hcvs2025\">https://easychair.org/conferences/?conf=hcvs2025</a></p>\n<ul>\n<li>Committees *</li>\n</ul>\n<p>Program Chairs:</p>\n<p>Emanuele De Angelis, IASI-CNR, Rome, Italy<br>\nFlorian Frohn, RWTH Aachen University, Aachen, Germany</p>\n<p>Program Committee:</p>\n<p>Nikolaj Bjørner, Microsoft, USA<br>\nMartin Blicha, University of Lugano, Switzerland<br>\nKonstantin Britikov, University of Lugano, Switzerland<br>\nCatherine Dubois, ENSIIE-Samovar, France<br>\nGidon Ernst, Ludwig Maximilian University of Munich, Germany<br>\nZafer Esen, Uppsala University, Sweden<br>\nGrigory Fedyukovich, Florida State University, USA<br>\nCarsten Fuhs, Birkbeck, University of London, UK<br>\nHossein Hojjat, Tehran Institute for Advanced Studies, Iran<br>\nPetra Hozzová, Czech Technical University, Czechia<br>\nLorenz Leutgeb, Max Planck Institute for Informatics, Germany<br>\nPedro Lopez-Garcia, IMDEA Software Institute and Spanish Council for <br>\nScientific Research (CSIC), Spain<br>\nDale Miller, INRIA and LIX/Institut Polytechnique de Paris, France<br>\nJose F. Morales, IMDEA Software Research Institute, Spain<br>\nSabina Rossi, Dipartimento di Informatica, Università Ca' Foscari di <br>\nVenezia, Italy<br>\nPhilipp Rümmer, University of Regensburg, Germany<br>\nJonas Schöpf, University of Innsbruck, Austria<br>\nWim Vanhoof, University of Namur, Belgium<br>\nGerman Vidal, MiST, VRAIN, Universitat Politecnica de Valencia, Spain</p>",
        "id": 518011123,
        "sender_full_name": "Email Gateway",
        "timestamp": 1747213824
    }
]