[
    {
        "content": "<p>From: Giles Reger &lt;<a href=\"mailto:giles.reger@manchester.ac.uk\">giles.reger@manchester.ac.uk</a>&gt;</p>\n<hr>\n<p>CALL FOR PAPERS - ATVA 2021</p>\n<hr>\n<p>The 19th International Symposium on Automated Technology for Verification and Analysis (ATVA 2021), 18 - 22 Oct 2021, Gold Coast, Australia. If the pandemic means that travelling is still an issue in October, we might change the plan and host the conference online.</p>\n<p><a href=\"https://formal-analysis.com/atva/2021/\">https://formal-analysis.com/atva/2021/</a></p>\n<p>ATVA 2021 is the 19th in a series of symposia aimed at bringing together academics, industrial researchers and practitioners in the area of theoretical and practical aspects of automated analysis, synthesis, and verification of hardware, software, and machine learning (ML) systems. ATVA is a CORE Rank A conference.</p>\n<hr>\n<p>Important Dates</p>\n<hr>\n<p>Full paper submissions due: 9 April (AOE) 2021</p>\n<p>Notification: 4 June 2021</p>\n<p>Camera-ready due: 4 July 2021<br>\nConference: 18 - 22 Oct 2021</p>\n<hr>\n<p>Scope</p>\n<hr>\n<p>ATVA solicits high-quality submissions in the following suggestive list of topics:</p>\n<ul>\n<li>\n<p>Formalisms for modelling hardware, software and embedded systems</p>\n</li>\n<li>\n<p>Testing, analysis, verification and security of machine learning systems</p>\n</li>\n<li>\n<p>Specification and verification of finite-state, infinite-state and parameterised system</p>\n</li>\n<li>\n<p>Program analysis and software verification</p>\n</li>\n<li>\n<p>Analysis and verification of hardware circuits, system-on-chip and embedded systems</p>\n</li>\n<li>\n<p>Analysis of real-time, hybrid, priced, weighted and probabilistic systems</p>\n</li>\n<li>\n<p>Deductive, algorithmic, compositional, and abstraction/refinement techniques for analysis and verification</p>\n</li>\n<li>\n<p>Analytical techniques for safety, security, and dependability</p>\n</li>\n<li>\n<p>Testing and runtime analysis based on verification technology</p>\n</li>\n<li>\n<p>Analysis and verification of parallel and concurrent systems</p>\n</li>\n<li>\n<p>Verification in industrial practice</p>\n</li>\n<li>\n<p>Synthesis for hardware and software systems</p>\n</li>\n<li>\n<p>Applications and case studies</p>\n</li>\n<li>\n<p>Automated tool support</p>\n</li>\n<li>\n<p>Analysis and verification of Machine Learning and AI systems</p>\n</li>\n</ul>\n<hr>\n<p>Submission and Publication</p>\n<hr>\n<p>ATVA welcomes submissions in the following two categories:</p>\n<p>1) Regular research papers (16 pages, including references)</p>\n<p>2) Tool papers (6 pages, including references)</p>\n<p>Submissions must be in Springer's LNCS format. Additional material may be placed in an appendix, to be read at the discretion of the reviewers and to be omitted in the final version. Formatting style files and further guidelines for formatting can be found at the Springer website. Tool papers must include information about a URL from where the tool can be downloaded or accessed online for evaluation. The URL must also contain a set of examples and a user manual that describes the usage of the tool through examples. In case the tool needs to be downloaded and installed, the URL must contain instructions for installation of the tool on Linux/Windows/macOS.</p>\n<p>Accepted papers in both categories will be published in Springer's Lecture Notes in Computer Science series. At least one author of each accepted paper is expected to register and present the paper at the conference.</p>\n<p>Authors should consult Springer's authors' guidelines (ftp://ftp.springernature.com/cs-proceeding/svproc/guidelines/Springer_Guidelines_for_Authors_of_Proceedings_CS.pdf) and use their proceedings templates, either for LaTeX or for Word, for the preparation of their papers. Springer encourages authors to include their ORCIDs in their papers. In addition, the corresponding author of each paper, acting on behalf of all of the authors of that paper, must complete and sign a Consent-to-Publish form. The corresponding author signing the copyright form should match the corresponding author marked on the paper. Once the files have been sent to Springer, changes relating to the authorship of the papers cannot be made.</p>\n<p>Papers must be submitted through EasyChair.</p>\n<p><a href=\"https://easychair.org/conferences/?conf=atva2021\">https://easychair.org/conferences/?conf=atva2021</a></p>\n<hr>\n<p>Organising Committee</p>\n<hr>\n<p>General Chair</p>\n<p>Jing Sun, University of Auckland, New Zealand</p>\n<p>Program Co-Chairs</p>\n<p>Vijay Ganesh, University of Waterloo, Canada</p>\n<p>Zhe Hou, Griffith University, Australia</p>\n<p>Publicity Co-chairs</p>\n<p>Giles Reger, The University of Manchester, UK</p>\n<p>Meng Sun, Peking University, China</p>\n<p>Workshop Co-chairs</p>\n<p>Guy Katz, Hebrew University of Jerusalem, Israel</p>\n<p>Rayna Dimitrova, CISPA Helmholtz Center for Information Security, Germany</p>",
        "id": 223197039,
        "sender_full_name": "Email Gateway",
        "timestamp": 1611044030
    }
]