[
    {
        "content": "<p>From: Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt;<br>\nDear users of Isabelle/Scala,</p>\n<p>I wonder: What is the current experience with IDE support for Isabelle/Scala? <br>\n(Using Isabelle2022).</p>\n<p>In recent years, I have used IntelliJ IDEA quite successfully, with the <br>\ngenerated project file by \"isabelle project\".</p>\n<p>It was originally done for Gradle, but that broken down at some point. Then I <br>\nchanged to Maven, but it sometimes failed to work. Then I reactivated Gradle, <br>\nto be able to switch on the spot to the build tool that happens to work with <br>\nIntelliJ by chance: presently it is usually Maven again.</p>\n<p>Later in 2022, we upgraded from Scala 2 to 3 with some efforts to get the <br>\nbrand new compiler (and source language). Scala 3 generally looks quite good, <br>\nbut the Scala 3 plugin of IntelliJ IDEA did not quite work so far: e.g. it <br>\ndoes not show compiler errors inline --- it requires a manual batch-build to <br>\nsee them; but such an IDE-based build can also fail unexpectedly.</p>\n<p>So I often end up using plain-text editing in jEdit (not Isabelle/jEdit) for <br>\nthe Isabelle/Scala sources, with plain \"isabelle scala_build\".</p>\n<p>Eventually, our fine Prover IDE should also cover Scala, but that will take <br>\nsome time.</p>\n<p>Right now, I would like to hear from successful uses of a regular Scala/Java <br>\nIDE for Isabelle/Scala 3.</p>\n<p>Makarius</p>",
        "id": 310506989,
        "sender_full_name": "Email Gateway",
        "timestamp": 1668635032
    },
    {
        "content": "<p>From: Fabian Huch &lt;<a href=\"mailto:huch@in.tum.de\">huch@in.tum.de</a>&gt;<br>\nUnfortunately that largely has been my experience as well - the IntelliJ <br>\nScala 3 plugin is not (yet) great.</p>\n<p>Currently, I'm developing larger things in Scala 2 and then migrate them <br>\nwithout IDE support to Scala 3... for smaller things, using the IDE <br>\nwithout inline errors is ok.</p>\n<p>The maven/gradle models work well when the build tasks actually succeed <br>\n(i.e., mvn install or gradle build).</p>\n<p>Fabian</p>",
        "id": 311275730,
        "sender_full_name": "Email Gateway",
        "timestamp": 1669035061
    }
]