[
    {
        "content": "<p>From: Kevin Kappelmann &lt;<a href=\"mailto:kevin.kappelmann@tum.de\">kevin.kappelmann@tum.de</a>&gt;<br>\nHi all,</p>\n<p>Rob Lewis (CC) has been trying to send below announcement to the mailing <br>\nlist, but it seems like his attempts aren't going through. So I offered <br>\nto forward it on his behalf:</p>\n<hr>\n<p>Sander Dahmen, Assia Mahboubi, and I have been planning a workshop for a <br>\nwhile at the Lorentz Center in Leiden. Pandemic planning is impossible <br>\nand the workshop keeps changing shape. But we can finally be certain <br>\nenough to announce: we will be hosting a virtual workshop, <br>\nMachine-Checked Mathematics, March 2-4! It will happen European <br>\nafternoons, in an attempt to be accessible by as many people as possible.</p>\n<p>Our workshop is organized around the idea of a “library showcase.” Proof <br>\nassistant users from different communities will introduce the audience <br>\nto some definition, design decision, abstraction, tool, or other feature <br>\nof their library that is particularly good at serving some purpose. <br>\nThese showcases will be demo-style, with plenty of time for questions <br>\nand discussion. We strongly encourage interacting with the presenters <br>\nduring these demos.</p>\n<p>The goal of these showcases is not for people to describe an entire <br>\nlibrary or present a formal paper. The formalized mathematics community <br>\nis small and fragmented into even smaller communities by prover choice. <br>\nWe want to spur discussion of how good ideas can be adopted or adapted <br>\nacross community boundaries.</p>\n<p>We're still confirming and scheduling speakers. A preliminary schedule <br>\nis on our website: <a href=\"https://lean-forward.github.io/lorentz-center-meeting/\">https://lean-forward.github.io/lorentz-center-meeting/</a><br>\nThe event is officially happening through the Lorentz Center, so if <br>\nyou're interested, please register as soon as possible at <br>\n<a href=\"https://www.lorentzcenter.nl/machine-checked-mathematics.html\">https://www.lorentzcenter.nl/machine-checked-mathematics.html</a></p>\n<p>Hope to see many of you there!</p>\n<p>-Rob (and Sander and Assia)</p>",
        "id": 272591240,
        "sender_full_name": "Email Gateway",
        "timestamp": 1645362261
    }
]