[
    {
        "content": "<p>From: \"Donaldson, Alastair F\" &lt;<a href=\"mailto:alastair.donaldson@imperial.ac.uk\">alastair.donaldson@imperial.ac.uk</a>&gt;<br>\nDear all</p>\n<p>The POPL 2024 submission site is now live:</p>\n<p><a href=\"https://popl24.hotcrp.com\">https://popl24.hotcrp.com</a></p>\n<p>and the deadline for submissions is 11 July 2023, Anywhere on Earth.</p>\n<p>Please spread the word, and consider submitting your best work! Full details below.</p>\n<p>Best wishes</p>\n<p>Ally Donaldson and John Wickerson<br>\nPOPL 2024 Publicity Chairs</p>\n<p>PACMPL Issue POPL 2024 seeks contributions on all aspects of programming languages and programming systems, both theoretical and practical. Authors of papers published in PACMPL Issue POPL 2024 will be invited to present their work in the POPL conference in January 2024, which is sponsored by ACM SIGPLAN, in cooperation with ACM SIGACT and ACM SIGLOG.</p>\n<p>POPL 2024 Website: <a href=\"https://popl24.sigplan.org\">https://popl24.sigplan.org</a></p>\n<p>Call for Papers: <a href=\"https://popl24.sigplan.org/track/POPL-2024-popl-research-papers\">https://popl24.sigplan.org/track/POPL-2024-popl-research-papers</a></p>\n<p>Double-Blind Review FAQ: <a href=\"https://popl24.sigplan.org/track/POPL-2024-popl-research-papers#FAQ-on-Double-Blind-Reviewing\">https://popl24.sigplan.org/track/POPL-2024-popl-research-papers#FAQ-on-Double-Blind-Reviewing</a></p>\n<h3>Organization</h3>\n<p>Conference Location: London, United Kingdom</p>\n<p>Conference Dates: January 17-19, 2024</p>\n<p>General Chair: Philippa Gardner, Imperial College London</p>\n<p>Program Chair: Derek Dreyer, MPI-SWS</p>\n<p>Program Committee: <a href=\"https://popl24.sigplan.org/committee/POPL-2024-popl-research-papers-program-committee\">https://popl24.sigplan.org/committee/POPL-2024-popl-research-papers-program-committee</a></p>\n<h3>Important Dates</h3>\n<p>All the times/deadlines below are Anywhere on Earth (AoE) in 2023.</p>\n<p>Submission deadline: July 11<br>\nStart of author response period: Sept 11<br>\nEnd of author response period: Sept 14<br>\nNotification of conditional acceptance: Oct 2<br>\nArtifact deadline: Oct 9<br>\nRevised submissions due: Oct 26<br>\nNotification of final acceptance (artifacts &amp; papers): Nov 7<br>\nCamera-ready deadline: Nov 10</p>\n<h3>Scope</h3>\n<p>Principles of Programming Languages (POPL) is a forum for the discussion of all aspects of programming languages and programming systems. Both theoretical and experimental papers are welcome. We seek submissions that make principled, enduring contributions to the theory, design, understanding, implementation, or application of programming languages.</p>\n<h3>Evaluation Criteria</h3>\n<p>The Program Committee will evaluate the technical contribution of each submission as well as its accessibility to both experts and the general POPL audience. All papers will be judged on significance, originality, relevance, correctness, and clarity. Each paper must explain its scientific contribution in both general and technical terms, identifying what has been accomplished, explaining why it is significant, and comparing it with previous work. Advice on writing technical papers can be found on the <a href=\"http://www.sigplan.org/Resources/Author/\">SIGPLAN author information page</a>.</p>\n<p>Deadlines and formatting requirements, detailed below, will be strictly enforced.</p>\n<h3>Full Double-Blind Reviewing Process</h3>\n<p>POPL 2024 will use a <strong>full double-blind</strong> reviewing process (similar to the one used for POPL 2023 but different from the lightweight double-blind process used in previous years). This means that identities of authors will not be made visible to reviewers until after conditional-acceptance decisions have been made, and then only for the conditionally-accepted papers. The use of full double-blind reviewing has several consequences for authors.</p>\n<ul>\n<li>\n<p><strong>Submissions</strong>: Authors must omit their names and institutions from their paper submissions. In addition, references to authors' own prior work should be in the third person  (e.g., not \"We build on our previous work …\" but rather \"We build on the work of …\").</p>\n</li>\n<li>\n<p><strong>Supplementary material</strong>: Authors are permitted to provide supplementary material (e.g., detailed proofs, proof scripts, system implementations, or experimental data) along with their submission, which reviewers may (but are not required to) examine. This material may take the form of a single file, such as a PDF or a tarball. <strong>Authors must fully anonymize any supplementary material. Links to supplementary material on external websites are not permitted.</strong></p>\n</li>\n<li>\n<p><strong>Author response</strong>: In responding to reviews, authors should not say anything that reveals their identity, since author identities will not be revealed to reviewers at that stage of the reviewing process.</p>\n</li>\n<li>\n<p><strong>Dissemination of work under submission</strong>: Authors are welcome to disseminate their ideas and post draft versions of their paper(s) on their personal website, institutional repository, or arXiv (reviewers will be asked to turn off arXiv notifications during the review period). But authors should not take steps that would almost certainly reveal their identities to members of the Program Committee, e.g., directly contacting PC members or publicizing the work on widely-visible social media or major mailing lists used by the community.</p>\n</li>\n</ul>\n<p>The purpose of the above restrictions is to help the Program Committee and external reviewers come to a judgment about the paper without bias, not to make it impossible for them to discover the authors' identities if they were to try. In particular, nothing should be done in the name of anonymity that weakens the quality of the submission.</p>\n<p>However, there are occasionally cases where adhering to the above restrictions is truly difficult or impossible for one reason or another. In such cases, the authors should contact the Program Chair to discuss the situation and how to handle it.</p>\n<p>The <a href=\"https://conf.researchr.org/track/POPL-2024/POPL-2024-popl-research-papers#FAQ-on-Double-Blind-Reviewing\">FAQ on Double-Blind Reviewing</a> addresses many common scenarios and answers many common questions about this topic. But there remain many grey areas and trade-offs. If you have any doubts about how to interpret the double-blind rules or you encounter a complex case that is not clearly covered by the FAQ, please contact the Program Chair for guidance.</p>\n<h3>Additional Details of the Reviewing Process</h3>\n<p>POPL 2024 will have four Associate Chairs who will help the Program Chair monitor reviews, solicit external expert reviews for submissions when there is not enough expertise on the committee, and facilitate reviewer discussions.</p>\n<p>As in previous years, authors will have a multi-day period to respond to reviews, as indicated in the Important Dates table. Responses are optional but recommended. A response should address specific points or questions raised in the reviews as well as any erroneous claims made by reviewers; in particular, it should not present new technical results, unless specifically requested by the reviewers.</p>\n<p>The Program Committee (PC) will discuss papers electronically using the HotCRP conference management system. There will be no physical or synchronous PC meeting; this will avoid the time, cost, and environmental impact of transporting an increasingly large committee to one point on the globe. There is also no formal External Program Committee or Extended Review Committee, though experts outside the committee will be consulted as needed. Paper decisions will be accompanied by a \"meta-review\" summarizing the reasoning behind the committee's decision.</p>\n<p>To conform with ACM requirements for journal publication, all POPL papers will be subject to two rounds of review. At the end of the first round, the PC will select a set of _conditionally accepted_ papers, each with a clear list of mandatory revisions that the authors must implement in order for the paper to be accepted. For the second round, authors of conditionally accepted papers will then be required to submit a short description of how they have revised the paper, including how the mandatory revisions have been implemented. The PC will then check the revisions and make final acceptance decisions. Authors of conditionally accepted papers must submit a satisfactory revision to the PC by the second-round deadline or risk rejection.</p>\n<p>For additional information about the reviewing process, see: <a href=\"https://www.sigplan.org/Conferences/POPL/Principles/\">Principles of POPL</a>, a presentation of the underlying organizational and reviewing policies for POPL. For POPL 2024, policies specified in this Call for Papers supersede those in the Principles of POPL document.</p>\n<h3>Submission Site Information</h3>\n<p>The submission site is <a href=\"https://popl24.hotcrp.com\">https://popl24.hotcrp.com</a>.</p>\n<p>Authors can submit multiple times prior to the deadline. Only the last submission will be reviewed. There is no abstract deadline. The submission site requires entering author names and affiliations, relevant topics, and potential conflicts. Addition or removal of authors after the submission deadline will need to be approved by the Program Chair (as this kind of change potentially undermines the goal of eliminating conflicts during paper assignment).</p>\n<p>The submission deadline is 11:59 PM on July 11, 2023, Anywhere on Earth: <a href=\"https://en.wikipedia.org/wiki/Anywhere_on_Earth\">https://en.wikipedia.org/wiki/Anywhere_on_Earth</a></p>\n<h3>Conflicts of Interest</h3>\n<p>For each submission, the authors must make sure that they properly declare all potential conflicts of interest for all of the authors of that submission. This includes marking PC conflicts as well as “Other Conflicts (external)”. A conflict caught late in the reviewing process leads to a voided review which may be infeasible to replace.</p>\n<p>Conflicts should be declared between an adviser and an advisee (e.g., Ph.D., post-doc; forever), between an author and a co-author (papers and proposals; for two years), between people at the same institution (branches of large companies or different locations of research institutes are considered to be the same institution; for two years after leaving an institution), between people with financial conflicts of interest, and between relatives.</p>\n<p>Please do not declare spurious conflicts: such incorrect conflicts are especially harmful if the aim is to exclude potential reviewers, so spurious conflicts can be grounds for rejection. If you are unsure about a conflict, please ask the Program Chair.</p>\n<h3>Submission Guidelines</h3>\n<p>Prior to the paper submission deadline, authors should upload their full anonymized paper. Here are some key requirements concerning pa<br>\n[message truncated]</p>",
        "id": 369415984,
        "sender_full_name": "Email Gateway",
        "timestamp": 1687700785
    }
]