[
    {
        "content": "<p>From: Catherine DUBOIS &lt;<a href=\"mailto:catherine.dubois@ensiie.fr\">catherine.dubois@ensiie.fr</a>&gt;<br>\n**</p>\n<p>*</p>\n<h1>Formal Methods Teaching Workshop (FMTea 2023)</h1>\n<p>6 March 2023 --- Affiliated with Formal Methods 2023</p>\n<p>INVITED SPEAKERS</p>\n<p>to be announced soon</p>\n<p>IMPORTANT DATES</p>\n<p>*</p>\n<p>3 November 2022: Deadline for submission of papers</p>\n<p>*</p>\n<p>5 December 2022: Notifications to authors</p>\n<p>*</p>\n<p>5 January 2023: Deadline for camera-ready version</p>\n<p>*</p>\n<p>6 March 2023: FMTea 2023 Workshop</p>\n<p>OBJECTIVES AND SCOPE</p>\n<p>Formal Methods provide software engineering with tools and techniques <br>\nfor rigorously reasoning about the correctness of systems. While in <br>\nrecent years formal methods are increasingly being used in industry, <br>\nuniversity curricula are not adapting at the same pace. Some existing <br>\nformal methods classes interest and challenge students, whereas others <br>\nfail to ignite student motivation. It is thus important to develop, <br>\nshare, and discuss approaches to effectively teach formal methods to the <br>\nnext generations. This discussion is now more important than ever due to <br>\nthe challenges and opportunities that arose from the pandemic, which <br>\nforced many educators to adapt and deliver their teaching online. <br>\nExchange of ideas is critical to making these new online approaches a <br>\nsuccess and having a greater reach.</p>\n<p>We envision this event as a one-day combination of keynote and workshop <br>\npresentations, where various models of teaching are presented and <br>\nexplored, together with innovative approaches relevant for educators of <br>\nFormal Methods in the 21st century.</p>\n<p>More details can be found on our website: <a href=\"https://fmtea.github.io\">https://fmtea.github.io</a></p>\n<p>TOPICS</p>\n<p>We aim to attract papers detailing authors’ experiences with FM <br>\nTeaching. We would like to get papers discussing successes and failures <br>\nof various methods, case studies, tools, etc. As self-learning seems to <br>\nbe an important aspect of FM teaching, we appreciate experiences with <br>\nonline teaching, including experiences with teaching formal methods via <br>\nMOOCs. A non-exhaustive list of topics of interest for the FMTea23 <br>\nworkshop is below:</p>\n<p>*</p>\n<p>Experiences and proposals related with “traditional” FM learning and<br>\n    teaching</p>\n<p>*</p>\n<p>Experiences and proposals related with online FM learning and teaching</p>\n<p>*</p>\n<p>Integrating/embedding FM teaching/thinking within other computer<br>\n    science courses</p>\n<p>*</p>\n<p>Teaching FM for industry</p>\n<p>*</p>\n<p>Student projects on FM, including group projects</p>\n<p>*</p>\n<p>Innovative learning and teaching methods for FM</p>\n<p>Computer science is transforming into a rigorous engineering discipline. <br>\nImproved teaching techniques will ensure that FM is at the heart of this <br>\ntransformation process.</p>\n<p>ORGANIZATION</p>\n<p>FMTea 2023 is organized by FME’s Teaching Committee. Our broad aim is to <br>\nsupport a worldwide improvement in learning Formal Methods, mainly by <br>\nteaching but also via self-learning. To that end, we have already <br>\ngathered a list of FM courses taught worldwide <br>\n(<a href=\"https://fme-teaching.github.io\">https://fme-teaching.github.io</a>) and plan to collect other resources as <br>\nwell, such as FM case studies, FM inspirational papers, etc.</p>\n<p>Furthermore, the FME Teaching Committee coordinates a tutorial series, <br>\nheld online via zoom. Tutorials are collected on the FME Teaching <br>\nCommittee website (<a href=\"https://fme-teaching.github.io/\">https://fme-teaching.github.io/</a>).</p>\n<p>PROGRAM COMMITTEE (to be completed)</p>\n<p>*</p>\n<p>Catherine Dubois, ENSIIE, France (co-chair)</p>\n<p>*</p>\n<p>Pierluigi San Pietro, Politecnico di Milano, Italy  (co-chair)</p>\n<p>*</p>\n<p>Brijesh Dongol, University of Surrey, UK</p>\n<p>*</p>\n<p>Luigia Petre, Åbo Akademi University, Finland</p>\n<p>*</p>\n<p>Kristin Rozier, Iowa State University, US</p>\n<p>*</p>\n<p>Graeme Smith, The University of Queensland, Australia</p>\n<p>*</p>\n<p>Claudio Menghi,  University of Luxembourg, Luxembourg</p>\n<p>*</p>\n<p>João F. Ferreira, INESC-ID &amp; IST, University of Lisbon, Portugal</p>\n<p>*</p>\n<p>Alexandra Mendez, INESC TEC &amp; University of Beira Interior, Portugal</p>\n<p>*</p>\n<p>Sandrine Blazy, University of Rennes 1, France</p>\n<p>PREVIOUS EDITIONS</p>\n<p>Several events focused on teaching aspects for Formal Methods were held <br>\nat the beginning of the 2000s: two BCS-FACS TFM workshops (Oxford in <br>\n2003 and London in 2006), the TFM 2004 conference in Ghent (with <br>\nproceedings published as Springer LNCS Volume 3294), the FM-Ed 2006 <br>\nworkshop (Hamilton, co-located with FM'06), FORMED (Budapest, at ETAPS <br>\n2008), FMET 2008 (Kitakyushu 2008, co-located with ICFEM), and TFM 2009 <br>\n(Eindhoven, at FM 2009 with proceedings published as Springer LNCS <br>\nVolume 5846). The first  FMTea event was FMTea 2019, the Formal Methods <br>\nTeaching Workshop and Tutorial, in October 2019 in Porto, Portugal, <br>\naffiliated with the 3rd World Congress on Formal Methods (FM19) with <br>\nproceedings as Springer LNCS 11758. The FMTea 2021 workshop, affiliated <br>\nwith FM 2021, the 24th International Symposium on Formal Methods, <br>\nBeijing, was held only online  in November 2021, with proceedings <br>\npublished as Springer LNCS 13122.</p>\n<p>SUBMISSION DETAILS</p>\n<p>FMTea 2023 invites high quality papers reporting on opinions, <br>\napproaches, and experiences related to the topic of teaching Formal <br>\nMethods. Each submitted paper will be reviewed by at least three PC <br>\nmembers. The conference proceedings will be published in Springer's <br>\nLecture Notes in Computer Science series. All submissions must be <br>\noriginal, unpublished, and not submitted for publication elsewhere. <br>\nSubmissions must be in PDF format, using the Springer LNCS style files; <br>\nwe suggest to use the LaTeX2e package (the llncs.cls class file, <br>\navailable in llncs2e.zip and the typeinst.dem available in typeinst.zip <br>\nas a template for your contribution). Papers should not exceed 15 pages <br>\nin length. Submissions should be made using the FMTea 2023 Easychair web <br>\nsite:</p>\n<p><a href=\"https://easychair.org/conferences/?conf=fmtea2023\">https://easychair.org/conferences/?conf=fmtea2023</a></p>\n<p>All accepted papers must be presented at the workshop. Their authors <br>\nmust be prepared to sign a copyright transfer statement. At least one <br>\nauthor of each accepted paper must register to the conference by an <br>\nearly date, to be indicated by the FM2023 organizers, and present the paper.</p>\n<p>*\n<a href=\"/user_uploads/14278/AWdy1uWTcGw2gfmLIihElVXW/catherine_dubois.vcf\">catherine_dubois.vcf</a></p>",
        "id": 296408938,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661965497
    }
]