[
    {
        "content": "<p><strong>From:</strong> \"Milovancevic, Dragana\" &lt;<a href=\"mailto:dragana.milovancevic@imperial.ac.uk\">dragana.milovancevic@imperial.ac.uk</a>&gt;</p>\n<p>[with apologies for cross-postings]</p>\n<p>======================================================================</p>\n<p>6th Workshop on Program Equivalence and Relational Reasoning<br>\n                24 July 2026 at ISCTE campus, Lisbon, Portugal<br>\n                  associated with CAV 2026 at FLOC 2026<br>\n<a href=\"https://perr-workshop.github.io/2026\">https://perr-workshop.github.io/2026</a></p>\n<p>======================================================================</p>\n<p>Submission Deadline: Friday, 24 April, 2026 (AoE)</p>\n<p>Submit at: <a href=\"https://submissions.floc26.org/perr\">https://submissions.floc26.org/perr</a></p>\n<p>CALL FOR PAPERS/PRESENTATIONS</p>\n<p>PERR is an annual international workshop dedicated to the formal verification of program equivalence and related relational problems. It is the 6th in a series of meetings that bring together researchers from different areas interested in equivalence and related questions. PERR 2026 will be a workshop at FLOC 2026, and a satellite event to CAV 2026.</p>\n<p>Program equivalence is arguably one of the most interesting and at the same time important problems in formal verification. It is a cross-cutting topic that has attracted the interest of several research communities: the field of denotational (game) semantics, deductive software verification, bounded model checking, specification inference, software evolution and regression testing, etc.</p>\n<p>The goal of the workshop is to bring researchers of the different fields in touch and to stimulate an exchange of ideas leading to forging a community working on PERR. It welcomes contributions from the topics mentioned above but is also open to new questions regarding program equivalence. This includes related research areas of relational reasoning like program refinement or the verification of hyperproperties, in particular of secure information flow.</p>\n<p>- regression verification<br>\n      - program equivalence<br>\n      - equivalence of higher order programs<br>\n      - product programs, relational calculi<br>\n      - verification of hyperproperties<br>\n      - program refinement, refinement calculus<br>\n      - specification of differences between programs<br>\n      - inferring semantic differences between programs<br>\n      - transformation validation<br>\n      - correct compiler transformations<br>\n      - automata bisimulation<br>\n      - AI-supported equivalence checking<br>\n      - relational properties of AI-based systems<br>\n      - code equivalence checking in teaching and marking</p>\n<p>This is an informal workshop that welcomes work in progress, overviews of more extensive work, programmatic or position papers and tool presentations.</p>\n<p>SUBMISSION GUIDELINES</p>\n<p>We invite two types of submissions:</p>\n<p>- Regular papers. Regular papers should be at most 15 pages (excluding references). They should present original research results, tools, or case studies.</p>\n<p>- Extended Abstracts. Extended abstracts should be at most 3 pages (excluding references). They should introduce work that has recently been published or is under review, or work in progress.</p>\n<p>Submissions should be made using the PERR 2026 submission site:</p>\n<p><a href=\"https://submissions.floc26.org/perr\">https://submissions.floc26.org/perr</a></p>\n<p>Submissions must be a single PDF file, in LNCS format.</p>\n<p>The workshop will have informal proceedings, posted on the webpage, and speakers will be asked to consider submitting papers towards a post-proceedings volume.</p>\n<p>IMPORTANT DATES</p>\n<p>Submission Deadline: Friday, 24 April, 2026 (AoE)<br>\n    Notification: Thursday, 28 May, 2026<br>\n    Workshop: Friday, 24 July, 2026</p>\n<p>ORGANIZERS</p>\n<p>Mattias Ubrich, Karlsruhe Institute of Technology, Germany<br>\n    Dragana Milovancevic, Imperial College London, UK</p>",
        "id": 568226004,
        "sender_full_name": "Email Gateway",
        "timestamp": 1768486991
    }
]