[
    {
        "content": "<p>From: Andreas Lochbihler &lt;<a href=\"mailto:mail@andreas-lochbihler.de\">mail@andreas-lochbihler.de</a>&gt;<br>\nWe have our first two new AFP entries in 2022:</p>\n<p>Roth's Theorem on Arithmetic Progressions<br>\nby Chelsea Edmonds, Angeliki Koutsoukou-Argyraki and Lawrence C. Paulson</p>\n<p>We formalise a proof of Roth's Theorem on Arithmetic Progressions, a major result in <br>\nadditive combinatorics on the existence of 3-term arithmetic progressions in subsets of <br>\nnatural numbers. To this end, we follow a proof using graph regularity. We employ our <br>\nrecent formalisation of Szemerédi's Regularity Lemma, a major result in extremal graph <br>\ntheory, which we use here to prove the Triangle Counting Lemma and the Triangle Removal <br>\nLemma. Our sources are Yufei Zhao's MIT lecture notes \"Graph Theory and Additive <br>\nCombinatorics\" (revised version here) and W.T. Gowers's Cambridge lecture notes \"Topics in <br>\nCombinatorics\". We also refer to the University of Georgia notes by Stephanie Bell and <br>\nWill Grodzicki, \"Using Szemerédi's Regularity Lemma to Prove Roth's Theorem\".</p>\n<p><a href=\"https://www.isa-afp.org/entries/Roth_Arithmetic_Progressions.html\">https://www.isa-afp.org/entries/Roth_Arithmetic_Progressions.html</a></p>\n<p>Gale-Shapley Algorithm<br>\nby Tobias Nipkow</p>\n<p>This is a stepwise refinement and proof of the Gale-Shapley stable matching (or marriage) <br>\nalgorithm down to executable code. Both a purely functional implementation based on lists <br>\nand a functional implementation based on efficient arrays (provided by the Collections <br>\nFramework in the AFP) are developed. The latter implementation runs in time O(n2) where n <br>\nis the cardinality of the two sets to be matched.</p>\n<p><a href=\"https://www.isa-afp.org/entries/Gale_Shapley.html\">https://www.isa-afp.org/entries/Gale_Shapley.html</a></p>\n<p>Andreas</p>",
        "id": 266665233,
        "sender_full_name": "Email Gateway",
        "timestamp": 1641201447
    }
]