[
    {
        "content": "<p>From: <a href=\"mailto:daniel.jurjo@imdea.org\">daniel.jurjo@imdea.org</a><br>\n<strong> Apologies for multiple postings </strong></p>\n<p>33rd International Symposium on Logic-based Program Synthesis and<br>\nTransformation (LOPSTR 2023)<br>\nCo-located with PPDP 2023 as part of SPLASH 2023</p>\n<p>October 23-24, 2023 - Cascais, Lisbon, Portugal</p>\n<p><a href=\"https://lopstr.github.io/2023/\">https://lopstr.github.io/2023/</a></p>\n<p>Important dates:</p>\n<ul>\n<li>Abstract submission: May 19, 2023 (AoE)</li>\n<li>Paper submission: May 26, 2023 (AoE)</li>\n<li>Author notification: July 24, 2023 (AoE)</li>\n<li>Camera-ready: August 18, 2023 </li>\n<li>Symposium: October 23-24, 2023</li>\n</ul>\n<p>OVERVIEW</p>\n<p>The aim of the LOPSTR series is to stimulate and promote international<br>\nresearch and collaboration on logic-based program development. LOPSTR<br>\nis open to contributions in logic-based program development in any<br>\nlanguage paradigm. LOPSTR has a reputation for being a lively,<br>\nfriendly forum for presenting and discussing work in progress.</p>\n<p>LOPSTR 2023 will be held in-person at Hotel Cascais Miragem in<br>\nCascais, Lisbon, Portugal and will be co-located with PPDP 2023 as<br>\npart of SPLASH 2023. At least one of the authors of the accepted paper<br>\nis expected to attend the conference and present the paper. Information<br>\nabout venue and travel is available on the SPLASH 2023 website.</p>\n<p>Topics of interest cover all aspects of logic-based program<br>\ndevelopment, all stages of the software life cycle, and issues of both<br>\nprogramming-in-the-small and programming-in-the-large, including, but<br>\nnot limited to:</p>\n<ul>\n<li>synthesis</li>\n<li>transformation</li>\n<li>specialization</li>\n<li>inversion</li>\n<li>composition</li>\n<li>optimisation</li>\n<li>specification</li>\n<li>analysis and verification</li>\n<li>testing and certification</li>\n<li>program and model manipulation</li>\n<li>AI-methods for program development</li>\n<li>verification and testing of AI-based systems</li>\n<li>transformational techniques in software engineering</li>\n<li>\n<p>logic-based methods for security, cyber-physical and distributed<br>\n   system</p>\n</li>\n<li>\n<p>applications, tools and industrial practice</p>\n</li>\n</ul>\n<p>Survey papers that present some aspects of the above topics from a new<br>\nperspective and papers that describe experience with industrial<br>\napplications and case studies are also welcome.</p>\n<p>PAPER SUBMISSION</p>\n<p>Submissions can be made in two categories:</p>\n<ul>\n<li>Regular Papers (15 pages max.)</li>\n<li>Short Papers (8 pages max.)</li>\n</ul>\n<p>References do NOT count towards the page limit. Additional pages may<br>\nbe used for appendices not intended for publication. Reviewers are not<br>\nrequired to read the appendices, and thus papers should be<br>\nintelligible without them. All submissions must be written in English.</p>\n<p>Submissions must not substantially overlap with papers/tools that have<br>\nbeen published or that are simultaneously submitted to a journal,<br>\nconference, or workshop with refereed proceedings.</p>\n<p>Submissions of Regular Papers must describe the original work. Work<br>\nthat already appeared in unpublished or informally published workshop<br>\nproceedings may be submitted (please contact the PC chair in case of<br>\nquestions).</p>\n<p>Submissions of Short Papers may include presentations of exciting if<br>\nnot fully polished research and tool demonstrations that are of<br>\nacademic and industrial interest. Tool demonstrations should describe<br>\nthe relevant system, usability, and implementation aspects of a tool.</p>\n<p>All accepted papers will be included in the conference proceedings and<br>\npublished by Springer as a Lecture Notes in Computer Science (LNCS)<br>\nvolume.</p>\n<p>After the symposium, a selection of a few best papers will be invited<br>\nfor submission to rapid publication in the Journal of Theory and<br>\nPractice of Logic Programming (TPLP). Authors of selected papers will<br>\nbe invited to revise and/or extend their submissions to be considered<br>\nfor publication. The papers submitted to TPLP will be subject to the<br>\nstandard reviewing process of the journal.</p>\n<p>SUBMISSION GUIDELINES</p>\n<p>Authors should submit an electronic copy of the paper (written in<br>\nEnglish) in PDF, formatted in the Lecture Notes in Computer Science<br>\nstyle. Each submission must include on its first page the paper title;<br>\nauthors and their affiliations; contact author's email; abstract; and<br>\nthree to four keywords which will be used to assist the PC in<br>\nselecting appropriate reviewers for the paper. Authors should consult<br>\nSpringer's authors' instructions at the author's page, and use their<br>\nproceedings templates, either for LaTeX (available also in overleaf)<br>\nor for Word, for the preparation of their papers. Springer encourages<br>\nauthors to include their ORCIDs in their papers. In addition, upon<br>\nacceptance, the corresponding author of each paper, acting on behalf<br>\nof all of the authors of that paper, must complete and sign a<br>\nConsent-to-Publish form. The corresponding author signing the<br>\ncopyright form should match the corresponding author marked on the<br>\npaper. Once the files have been sent to Springer, changes relating to<br>\nthe authorship of the papers cannot be made.</p>\n<p>Page numbers (and, if possible, line numbers) should appear on the<br>\nmanuscript to help the reviewers in writing their report. So, for<br>\nLaTeX, we recommend that authors use:</p>\n<p>\\pagestyle{plain}<br>\n\\usepackage{lineno}<br>\n\\linenumbers</p>\n<p>Papers should be submitted via EasyChair:<br>\n<a href=\"https://easychair.org/conferences/?conf=lopstr2023\">https://easychair.org/conferences/?conf=lopstr2023</a></p>\n<p>BEST PAPER AWARD</p>\n<p>Thanks to Springer's sponsorship, two best paper awards (one for each<br>\nsubmission category), with a 500 EUR prize, will be given at LOPSTR<br>\n2023. The program committee will select the winning papers based on<br>\nrelevance, originality and technical quality but may also take<br>\nauthorship into account (e.g. a student paper).</p>\n<p>PROGRAM CHAIRS</p>\n<p>Robert Glück, University of Copenhagen, Denmark<br>\nBishoksan Kafle, IMDEA Software Institute, Spain</p>\n<p>PUBLICITY CHAIR</p>\n<p>Daniel Jurjo Rivas, IMDEA Software Institute, Spain</p>\n<p>PROGRAM COMMITTEE MEMBERS</p>\n<p>Slim Abdennadher, German International University, Egypt<br>\nJosé Júlio Alferes, Universidade Nova de Lisboa, Portugal<br>\nRoberto Amadini, University of Bologna, Italy<br>\nWilliam Byrd, University of Alabama at Birmingham, USA<br>\nMichael Codish, Ben-Gurion University of the Negev, Israel<br>\nGregory Duck, National University of Singapore, Singapore<br>\nIsabel García-Contreras, University of Waterloo, Canada<br>\nAshutosh Gupta, IIT Bombay, India<br>\nGopal Gupta, The University of Texas at Dallas, USA<br>\nMichael Hanus, University of Kiel, Germany<br>\nTemesghen Kahsai, Amazon, USA<br>\nMaja Hanne Kirkeby, Roskilde University, Denmark<br>\nMichael Leuschel, Heinrich Heine University Düsseldorf, Germany<br>\nNai-Wei Lin, National Chung Cheng University, Taiwan<br>\nFred Mesnard, University of Reunion, France<br>\nJosé F. Morales, IMDEA Software Institute, Spain<br>\nCarlos Olarte, Universitè Sorbonne Paris Nord, France<br>\nAlberto Pettorossi, Università di Roma Tor Vergata, Italy<br>\nChristoph Reichenbach, Lund University, Sweden<br>\nPeter Schachte, The University of Melbourne, Australia<br>\nHelge Spieker, Simula Research Laboratory, Norway<br>\nTheresa Swift, Universidade Nova de Lisboa, Portugal<br>\nLaura Titolo, National Institute of Aerospace, USA<br>\nKazunori Ueda, Waseda University, Japan<br>\nGermán Vidal, Universitat Politècnica de València, Spain<br>\nNisansala Yatapanage, Australian National University, Australia<br>\nFlorian Zuleger, Vienna University of Technology, Austria</p>\n<p>HISTORY</p>\n<p>LOPSTR is a renowned symposium that has been held for more than 30<br>\nyears.  The first meeting was held in Manchester, UK in<br>\n1991. Information about previous symposia:<br>\n<a href=\"http://lopstr.webs.upv.es/\">http://lopstr.webs.upv.es/</a>. You might have a look at the contents of<br>\npast LOPSTR symposia at DBLP<br>\n(<a href=\"https://dblp.uni-trier.de/db/conf/lopstr/index.html\">https://dblp.uni-trier.de/db/conf/lopstr/index.html</a>) and past LNCS<br>\nproceedings at Springer (<a href=\"https://link.springer.com/conference/lopstr\">https://link.springer.com/conference/lopstr</a>).</p>\n<p>Cheers,</p>",
        "id": 350281948,
        "sender_full_name": "Email Gateway",
        "timestamp": 1681637954
    }
]