[
    {
        "content": "<p>From: Tobias Nipkow &lt;<a href=\"mailto:nipkow@in.tum.de\">nipkow@in.tum.de</a>&gt;<br>\nResiduated Transition Systems<br>\nEugene W. Stark</p>\n<p>A residuated transition system (RTS) is a transition system that is equipped <br>\nwith a certain partial binary operation, called residuation, on transitions. <br>\nUsing the residuation operation, one can express nuances, such as a distinction <br>\nbetween nondeterministic and concurrent choice, as well as partial commutativity <br>\nrelationships between transitions, which are not captured by ordinary transition <br>\nsystems. A version of residuated transition systems was introduced in previous <br>\nwork by the author, in which they were called “concurrent transition systems” in <br>\nview of the original motivation for their definition from the study of <br>\nconcurrency. In the first part of the present article, we give a formal <br>\ndevelopment that generalizes and subsumes the original presentation. We give an <br>\naxiomatic definition of residuated transition systems that assumes only a single <br>\npartial binary operation as given structure. From the axioms, we derive notions <br>\nof “arrow“ (transition), “source”, “target”, “identity”, as well as <br>\n“composition” and “join” of transitions; thereby recovering structure that in <br>\nthe previous work was assumed as given. We formalize and generalize the result, <br>\nthat residuation extends from transitions to transition paths, and we <br>\nsystematically develop the properties of this extension. A significant <br>\ngeneralization made in the present work is the identification of a general <br>\nnotion of congruence on RTS’s, along with an associated quotient construction.</p>\n<p>In the second part of this article, we use the RTS framework to formalize <br>\nseveral results in the theory of reduction in Church’s λ-calculus. Using a de <br>\nBruijn index-based syntax in which terms represent parallel reduction steps, we <br>\ndefine residuation on terms and show that it satisfies the axioms for an RTS. An <br>\napplication of the results on paths from the first part of the article allows us <br>\nto prove the classical Church-Rosser Theorem with little additional effort. We <br>\nthen use residuation to define the notion of “development” and we prove the <br>\nFinite Developments Theorem, that every development is finite, formalizing and <br>\nadapting to de Bruijn indices a proof by de Vrijer. We also use residuation to <br>\ndefine the notion of a “standard reduction path”, and we prove the <br>\nStandardization Theorem: that every reduction path is congruent to a standard <br>\none. As a corollary of the Standardization Theorem, we obtain the Leftmost <br>\nReduction Theorem: that leftmost reduction is a normalizing strategy.</p>\n<p><a href=\"https://www.isa-afp.org/entries/ResiduatedTransitionSystem.html\">https://www.isa-afp.org/entries/ResiduatedTransitionSystem.html</a></p>\n<p>Enjoy!<br>\n<a href=\"/user_uploads/14278/7URHr8siNmIgBf-G0BvG0sAG/smime.p7s\">smime.p7s</a></p>",
        "id": 274325422,
        "sender_full_name": "Email Gateway",
        "timestamp": 1646597046
    }
]