[
    {
        "content": "<p>From: Michael Kirsten &lt;<a href=\"mailto:kirsten@kit.edu\">kirsten@kit.edu</a>&gt;<br>\nDear colleagues,</p>\n<p>The Karlsruhe Institute of Technology (KIT), Germany, is inviting<br>\napplications for a full professorship for theoretical informatics.<br>\nApply by September 12, 2021.</p>\n<p>See also<br>\n<a href=\"https://www.pse.kit.edu/karriere/joboffer.php?id=232&amp;new=true&amp;language=de\">https://www.pse.kit.edu/karriere/joboffer.php?id=232&amp;new=true&amp;language=de</a><br>\n(German) or<br>\n<a href=\"https://www.pse.kit.edu/karriere/joboffer.php?id=233&amp;new=true&amp;language=en\">https://www.pse.kit.edu/karriere/joboffer.php?id=233&amp;new=true&amp;language=en</a><br>\n(English)</p>\n<p>Here is the full job offer:</p>\n<p>The Karlsruhe Institute of Technology (KIT) combines its three core<br>\ntasks: research, higher education, and innovation within one mission.<br>\nWith about 9,400 employees and 25,000 students, KIT is one of the big<br>\ninstitutions of research and higher education in natural sciences and<br>\nengineering in Europe.</p>\n<p>The Institute of Theoretical Informatics (ITI) within the Division 2 –<br>\nInformatics, Economics, and Society – with its KIT-Department of<br>\nInformatics is seeking to fill, as soon as possible, the position of a</p>\n<p><em>Professorship (W3) for Theoretical Informatics</em></p>\n<p>We are looking for an internationally recognized personality who<br>\nrepresents the field of theoretical informatics at KIT in research and<br>\nteaching. The thematic orientation of this professorship should<br>\ncomplement the existing competences of theoretical informatics and be<br>\nclosely related to at least one of the following areas:</p>\n<ul>\n<li>Cryptography/Security</li>\n<li>Algorithms</li>\n<li>Formal Methods</li>\n</ul>\n<p>Participation in teaching in the German-language courses of the<br>\nDepartment of Informatics is expected, both in the mandatory and<br>\nelective areas. Willingness to learn the German language within three<br>\nyears is required.</p>\n<p>In case of personal interest and relevant preliminary work, involvement<br>\nin the Competence Center for Applied Security Technologies (KASTEL) is<br>\npossible.</p>\n<p>The requirements for employment are outstanding, internationally visible<br>\nscientific achievements, for example in the context of an excellent<br>\ndissertation and subsequent scientific achievements, as well as a<br>\ndidactic aptitude. In all other respects, employment conditions as<br>\noutlined in § 47 LHG (Act of Baden-Württemberg on Universities and<br>\nColleges) in conjunction with § 20 KITG (KIT-Act) in the version<br>\napplicable until the legal validity of the 2.<br>\nKIT-Weiterentwicklungsgesetz (2nd KIT Further Development Act) shall apply.</p>\n<p>KIT is an equal opportunity employer. Women are especially encouraged to<br>\napply. Applicants with disabilities will be given preferential<br>\nconsideration if equally qualified. The KIT is certified as a<br>\nfamily-friendly university and offers part-time employment, leaves of<br>\nabsence, a Dual Career Service and coaching to actively promote<br>\nwork-life-balance.</p>\n<p>Applications with the required documents (curriculum vitae, degree<br>\ncertificates as well as a list of publications) and a perspective paper<br>\n(maximum of two pages) should be sent - preferably summarized in a<br>\nsingle PDF file and by e-mail - to the Karlsruhe Institute of<br>\nTechnology, Dean's Office of the KIT Department of Informatics, Am<br>\nFasanengarten 5, D-76131 Karlsruhe, <a href=\"mailto:dekanat@informatik.kit.edu\">dekanat@informatik.kit.edu</a> by<br>\nSeptember 12, 2021. For further information, please contact Professor<br>\nDr. Ralf Reussner (+49 721 608 45993, <a href=\"mailto:reussner@kit.edu\">reussner@kit.edu</a>).</p>\n<p>The processing of personal data by the Karlsruhe Institute of Technology<br>\n(KIT) is carried out according to the Privacy Policy.</p>\n<p>Best regards,<br>\nMichael Kirsten<br>\n<a href=\"/user_uploads/14278/i5xrWloCC_7g2PJkS4znr32d/OpenPGP_signature\">OpenPGP_signature</a></p>",
        "id": 248958069,
        "sender_full_name": "Email Gateway",
        "timestamp": 1628588243
    }
]