[
    {
        "content": "<p>From: Peter Lammich &lt;<a href=\"mailto:lammich@in.tum.de\">lammich@in.tum.de</a>&gt;<br>\nEnjoy two new entries on Labeled Transition Systems, and Pushdown <br>\nSystems, verifying the important post<em>, pre</em>, and dual* algorithms for <br>\nreachability in PDSs!</p>\n<p>Labeled Transition Systems</p>\n<p>Labeled transition systems are ubiquitous in computer science. They are <br>\nused e.g. for automata and for program graphs in program analysis. We <br>\nformalize labeled transition systems with and without epsilon <br>\ntransitions. The main difference between formalizations of labeled <br>\ntransition systems is in their choice of how to represent the transition <br>\nsystem. In the present formalization the set of nodes is a type, and a <br>\nlabeled transition system is represented as a locale fixing a set of <br>\ntransitions where each transition is a triple of respectively a start <br>\nnode, a label and an end node. Wimmer [Wim20] provides an overview of <br>\nformalizations of graphs and transition systems.</p>\n<p>Pushdown Systems</p>\n<p>We formalize pushdown systems and the correctness of the pushdown <br>\nreachability algorithms post* (forward search), pre* (backward search) <br>\nand dual* (bi-directional search). For pre* we refine the algorithm to <br>\nan executable version for which one can generate code using Isabelle's <br>\ncode generator. For pre* and post* we follow Stefan Schwoon's PhD thesis <br>\n[Sch02a]. The dual* algorithm is from a paper by Jensen et. al presented <br>\nat ATVA2021 [JSS+21]. The formalization is described in our FMCAD2022 <br>\npaper [SSST22] in which we also document how we have used it to do <br>\ndifferential testing against a C++ implementation of pushdown <br>\nreachability called PDAAAL. Lammich et al. [Lam09, LMW09] formalized the <br>\npre* algorithm for dynamic pushdown networks (DPN) which is a <br>\ngeneralization of pushdown systems. Our work is independent from that <br>\nbecause the post* of DPNs is not regular and additionally the DPN <br>\nformalization does not support epsilon transitions which we use for <br>\npost* and dual*.</p>",
        "id": 402660231,
        "sender_full_name": "Email Gateway",
        "timestamp": 1700215390
    }
]