[
    {
        "content": "<p>From: \"M. Baksys\" &lt;<a href=\"mailto:mb2412@cam.ac.uk\">mb2412@cam.ac.uk</a>&gt;<br>\nDear all,</p>\n<p>While working on a decently long proof (currently ~400 lines), I have started<br>\nto experience some performance issues on my machine. These issues manifest<br>\nthemselves by jEdit becoming unresponsive after a few minutes of use and the<br>\nmessage \"ML Cleanup\" popping up on the bottom right. After this, the said \"ML<br>\nCleanup\" rarely goes away allowing only for small intervals when the editor is<br>\nresponsive (and behaving at its usual speed). I have noticed this slowdown<br>\nonly while working on comparatively longer proofs and my machine is currently<br>\nrunning Windows. Note that during development, I keep the file error-free by<br>\nsorry-ing lemmas and statements to be proved, so this should not be an issue.<br>\nI would appreciate it a lot if anyone suggested any tips on how to tackle the<br>\nissues I've described above. Thanks in advance!</p>\n<p>Mantas Baksys</p>",
        "id": 292424661,
        "sender_full_name": "Email Gateway",
        "timestamp": 1659975761
    },
    {
        "content": "<p>From: Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt;<br>\n\"ML Cleanup\" means that the Poly/ML runtime system is trying to reclaim ML <br>\nheap space by garbage collection or aggressive sharing of immutable values.</p>\n<p>This indicates a general shortage of memory. The \"Monitor\" dockable can show <br>\nyou further details.</p>\n<p>How much RAM do you have on this Windows machine? From the description of the <br>\nproblem, I would guess 4-8 GB, but you need 8-16 GB as a start for reasonable <br>\nIsabelle applications. Experts usually have 32-64 GB.</p>\n<p>Makarius</p>",
        "id": 292552524,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660040418
    },
    {
        "content": "<p>From: Lawrence Paulson &lt;<a href=\"mailto:lp15@cam.ac.uk\">lp15@cam.ac.uk</a>&gt;<br>\nDear Mantas,</p>\n<p>400 lines is not at all long and I suspect something else is going on. For example, does your development depend on HOL-Analysis? Then it makes a huge difference whether you start it by</p>\n<p>isabelle jedit ...</p>\n<p>or</p>\n<p>isabelle jedit HOL-Analysis ...</p>\n<p>In the former case, something like 100 large theories making up HOL-Analysis will be loaded into your session, taking many minutes, and because they are all \"live\", they'll be using up a lot of memory. In the latter case, a precompiled image will be used; the first time round, it will need to be built but then it will be kept for next time.</p>\n<p>Or perhaps your development is loading a bunch of AFP entries. Then what you need is to create an appropriate ROOT file so that you can launch your session with</p>\n<p>isabelle jedit -R &lt;session_name&gt;</p>\n<p>A precompiled image will be built incorporating all the ancestors of your development, so that nothing needs to be held in memory beyond your 400 lines.</p>\n<p>The use of a ROOT file is a technique that everybody will need to learn once they start making extensive use of libraries.</p>\n<p>Larry</p>",
        "id": 292555125,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660041681
    }
]