[
    {
        "content": "<p>From: \"Thiemann, René\" &lt;<a href=\"mailto:Rene.Thiemann@uibk.ac.at\">Rene.Thiemann@uibk.ac.at</a>&gt;<br>\nDear all,</p>\n<p>I'd like to announce a new AFP entry.</p>\n<p>Enjoy,<br>\nRené</p>\n<p>The Balog–Szemerédi–Gowers Theorem <br>\n  by Angeliki Koutsoukou-Argyraki, Mantas Bakšys and Chelsea Edmonds</p>\n<p>We formalise the Balog–Szemerédi–Gowers Theorem, a profound result in additive<br>\ncombinatorics which played a central role in Gowers's proof deriving the first<br>\neffective bounds for Szemerédi's Theorem. The proof is of great mathematical<br>\ninterest given that it involves an interplay between different mathematical<br>\nareas, namely applications of graph theory and probability theory to additive<br>\ncombinatorics involving algebraic objects. This interplay is what made the<br>\nprocess of the formalisation, for which we had to develop formalisations of new<br>\nbackground material in the aforementioned areas, more rich and technically<br>\nchallenging. We demonstrate how locales, Isabelle’s module system, can be<br>\nemployed to handle such interplays. To treat the graph-theoretic aspects of the<br>\nproof, we make use of a new, more general undirected graph theory library<br>\ndeveloped recently by Chelsea Edmonds, which is both flexible and extensible.<br>\nFor the formalisation we followed a proof presented in the 2022 lecture notes by<br>\nTimothy Gowers Introduction to Additive Combinatorics for Part III of the<br>\nMathematics Tripos taught at the University of Cambridge. In addition to the<br>\nmain theorem, which, following our source, is formulated for difference sets, we<br>\nalso give an alternative version for sumsets which required a formalisation of<br>\nan auxiliary triangle inequality following a proof by Yufei Zhao from his book<br>\nGraph Theory and Additive Combinatorics . We moreover formalise a few additional<br>\nresults in additive combinatorics that are not used in the proof of the main<br>\ntheorem. This is the first formalisation of the Balog–Szemerédi–Gowers Theorem<br>\nin any proof assistant to our knowledge.</p>\n<p><a href=\"https://www.isa-afp.org/entries/Balog_Szemeredi_Gowers.html\">https://www.isa-afp.org/entries/Balog_Szemeredi_Gowers.html</a></p>",
        "id": 310434333,
        "sender_full_name": "Email Gateway",
        "timestamp": 1668612287
    }
]