[
    {
        "content": "<p>From: Alexander Steen &lt;<a href=\"mailto:cl-isabelle-users@lists.cam.ac.uk\">cl-isabelle-users@lists.cam.ac.uk</a>&gt;<br>\n===========================================<br>\nDov Gabbay Prize 2024: Call for Nominations<br>\n===========================================</p>\n<p>The ''Dov Gabbay Prize for Logic and Foundations'' is an international <br>\nresearch prize aimed at outstanding and inspirational contributions in <br>\nLogic and Foundations. It targets active researchers combining <br>\nfoundational insight and conceptual innovation with sophisticated <br>\ntheoretical analysis.</p>\n<p>The theme of 2024 is: \"Mathematical Logic and its Foundations\"</p>\n<p>The prize honours the extraordinary, multi-faceted and lifelong <br>\nscientific and editorial work of Dov Gabbay, known among others for <br>\nediting an extensive collection of Logic Handbooks (Short<br>\nbio: <a href=\"https://dgp.iloaf.org/dov.html\">https://dgp.iloaf.org/dov.html</a>).</p>\n<p>Submission:</p>\n<p>Each nomination of a researcher should provide an accessible <br>\njustification and list the main publications considered relevant. It <br>\nalso has to include the name, affiliation, and email address of the <br>\nnominator. Self-nominations are excluded and the nominee should not be <br>\nin a hierarchical relationship with the nominator. Last year's <br>\nsubmissions from Mathematical Logic will be reincluded by default.</p>\n<p>Proposals in pdf-format should be sent to \"dgp[at]iloaf[dot]org\".</p>\n<p>The deadline for this call is April 30, 2024.</p>\n<p>Decision:</p>\n<p>The selection is made by an independent jury consisting of seven <br>\nrenowned logicians representing Mathematical, Philosophical, and <br>\nComputational logic:</p>\n<p>John T. Baldwin (University of Illinois Chicago)<br>\nJohan van Benthem (University of Amsterdam/Stanford University)<br>\nChristoph Benzmueller (University of Bamberg)<br>\nAgata Ciabattoni (TU Vienna)<br>\nLaura Giordano (Università del Piemonte Orientale)<br>\nHannes Leitgeb (LMU Munich)<br>\nPhilip Welch (University of Bristol)</p>\n<p>The winner/s will be awarded a cash prize of 2001 EUR and be invited to <br>\ngive a talk. The details of the ceremony will be determined after the <br>\nrecipient/s and their areas are known.</p>\n<p>The decision will be announced in July 2024.</p>\n<p>Organisation:</p>\n<p>The prize is currently organized by the \"Initiative for Logic and <br>\nFoundations asbl\" (<a href=\"https://iloaf.org\">https://iloaf.org</a>), a registered non-profit <br>\norganization anchored in Luxembourg (reflecting the close links of Dov <br>\nwith the Logic group of Leon van der Torre).</p>\n<p>Contact:</p>\n<p>For any questions, please contact the organizing committee via <br>\n\"dgp[at]iloaf[dot]org\".</p>\n<p>Web: <a href=\"https://dgp.iloaf.org\">https://dgp.iloaf.org</a></p>",
        "id": 424438617,
        "sender_full_name": "Email Gateway",
        "timestamp": 1709407518
    }
]