[
    {
        "content": "<p><strong>From:</strong> Ian Hayes &lt;<a href=\"mailto:cl-isabelle-users@lists.cam.ac.uk\">cl-isabelle-users@lists.cam.ac.uk</a>&gt;</p>\n<p>Hi Makarius,</p>\n<p>An issue I've been having for a few releases is that if I delete a range <br>\nof complete lines in the JEdit IDE, it non-deterministically goes into a <br>\nstrange state where after deletion a range of lines corresponding to the <br>\nposition on the screen where the deleted lines were, is selected, with <br>\nthe cursor at the end. By whole lines I mean the selected range is a <br>\nsequence of whole lines with the cursor at the start of the following <br>\nline. If I select the same lines but have the cursor at the end of the <br>\nlast line, the issue does not occur.</p>\n<p>On top of that also non-deterministically, after it gets in that strange <br>\nstate, I may or may not be able to move the cursor using cursor keys - <br>\nmore precisely I move the cursor and it immediately moves it back. And <br>\non top of that it can get into a very weird state where the cursor <br>\nautonomously moves around and selects text and may paste in selected <br>\ntext at the cursor, like is generating its own input events out of <br>\nnowhere. For these latter issues I just have to re-start Isabelle.</p>\n<p>I have got into the habit of never deleting a range of whole lines, so <br>\nthe problem has simple work around.<br>\nPerhaps you could look into this for the next release.</p>\n<p>I'm running the latest version of MacOS on a Mac Mini M4 Pro.</p>\n<p>Best regards<br>\nIan</p>\n<p>On 20/2/2025 01:00, Makarius wrote:</p>\n<blockquote>\n<p>Dear Isabelle users,</p>\n<p>the release train for Isabelle2025 (March 2025) has arrived at the <br>\nstation Isabelle2025-RC3, see again <br>\n<a href=\"https://isabelle-dev.sketis.net/phame/post/view/85/release_candidates_for_isabelle2025\">https://isabelle-dev.sketis.net/phame/post/view/85/release_candidates_for_isabelle2025</a></p>\n<p>The website is <a href=\"https://isabelle.in.tum.de/website-Isabelle2025-RC3\">https://isabelle.in.tum.de/website-Isabelle2025-RC3</a> <br>\nwith the usual downloads for Linux (Intel), Linux (ARM), macOS (Intel <br>\nand ARM), Windows (Intel).</p>\n<p>This release candidate is sufficiently finished to be ready for <br>\napplications. There will be 3 more weeks until everything becomes <br>\nunchangeable, until the next release in 8-10 months.</p>\n<p>Any feedback about Isabelle release candidates should be posted with a <br>\nmeaningful Subject, not just a clone of the announcement.</p>\n<p>Makarius</p>\n</blockquote>",
        "id": 561586296,
        "sender_full_name": "Email Gateway",
        "timestamp": 1764750498
    }
]