[
    {
        "content": "<p>From: \"Laarman, A.W.\" &lt;<a href=\"mailto:a.w.laarman@liacs.leidenuniv.nl\">a.w.laarman@liacs.leidenuniv.nl</a>&gt;</p>\n<hr>\n<p>Call for Papers</p>\n<p>SPIN 2021</p>\n<p>International Symposium on Model Checking of Software</p>\n<p>July 14-15, 2021</p>\n<p>Aarhus, Denmark</p>\n<p>Conference website: <a href=\"https://conf.researchr.org/home/spin-2021\">https://conf.researchr.org/home/spin-2021</a></p>\n<p>Submission link: <a href=\"https://easychair.org/conferences/?conf=spin20210\">https://easychair.org/conferences/?conf=spin20210</a></p>\n<p>The 27th edition of the SPIN symposium aims at bringing together researchers and practitioners interested in automated tool-based techniques for the analysis of software as well as models of software, for the purpose of verification and validation. The symposium specifically focuses on concurrent software but does not exclude the analysis of sequential software. Submissions are solicited on theoretical results, novel algorithms (classical and quantum), tool development, including for modern hardware (parallel and distributed), and empirical evaluation.</p>\n<p>Topics of interest include, but are not limited to:</p>\n<ul>\n<li>Formal verification techniques for automated analysis of software</li>\n<li>Formal analysis for modeling languages, such as UML/state charts</li>\n<li>Formal specification languages, temporal logic, design-by-contract</li>\n<li>Model checking</li>\n<li>Automated theorem proving, including SAT and SMT</li>\n<li>Verifying compilers</li>\n<li>Abstraction and symbolic execution techniques</li>\n<li>Static analysis and abstract interpretation</li>\n<li>Combination of verification techniques</li>\n<li>Modular and compositional verification techniques</li>\n<li>Verification of timed and probabilistic systems</li>\n<li>Automated testing using advanced analysis techniques</li>\n<li>Combination of static and dynamic analyses</li>\n<li>Derivation of specifications, test cases, or other useful material via formal analysis</li>\n<li>Case studies of interesting systems or with interesting results</li>\n<li>Engineering and implementation of software verification and analysis tools</li>\n<li>Benchmark and comparative studies for formal verification and analysis tools</li>\n<li>Formal methods of education and training</li>\n<li>Insightful surveys or historical accounts on topics of relevance to the symposium</li>\n<li>Relevant tools and algorithms for modern hardware, e.g.: parallel, GPU, TPU, FPGA, cloud, and quantum</li>\n</ul>\n<p>Important Dates</p>\n<p>Submission:        March 1, 2021<br>\nNotification:         May 14, 2021<br>\nCamera-ready:    June 1, 2021<br>\nConference:        July 14-15, 2021</p>\n<p>Submission Guidelines</p>\n<p>The proceedings of SPIN 2020 will be published in Springer's Lecture Notes in Computer Science series. Submissions should adhere to the LNCS format: LNCS Information for Authors</p>\n<p>With the exception of survey and history papers, the papers should contain original work that has not been submitted or accepted for publication elsewhere. We are soliciting three categories of papers:</p>\n<ul>\n<li>Full Research / Tool Papers describing fully developed work and complete results (16 pages - references are not included in this limit);</li>\n<li>Short Papers presenting tools, technology, experiences with lessons learned, new ideas, work in progress with preliminary results, and novel contributions to formal methods (6 pages - references are not included in this limit).</li>\n<li>Tool Demo Papers presenting the foundations, capabilities, application domains and relevant examples using the tools, with a clear description of what is expected to be shown in a live demonstration (4 pages to describe the tool foundations, features and use examples, plus an appendix explaining the content of the demo).<br>\nPapers should be submitted via the EasyChair SPIN 2021 submission website: <a href=\"https://easychair.org/conferences/?conf=spin20210\">https://easychair.org/conferences/?conf=spin20210</a><br>\nAll papers that conform to submission guidelines will be peer-reviewed by members of the program committee. Submissions will be evaluated on the basis of originality, the importance of contribution, soundness, evaluation, quality of presentation, and appropriate comparison to related work.</li>\n</ul>\n<p>At least one author of each accepted paper must attend the symposium and present the paper.</p>\n<p>STTT</p>\n<p>A selection of papers will be invited to a special issue of the International Journal on Software Tools for Technology Transfer (STTT).</p>\n<p>Program Committee Members</p>\n<p>Jiří Barnat, Masaryk University<br>\nMaurice H. ter Beek, ISTI-CNR<br>\nTom van Dijk, University of Twente<br>\nVedran Dunjko, Leiden University<br>\nStefan Edelkamp, University of Koblenz<br>\nGrigory Fedyukovich, Florida State University<br>\nHenri Hansen, Tampere University of Technology<br>\nArnd Hartmanns, University of Twente<br>\nGerard Holzmann, Nimble research<br>\nAntti Hyvärinen, Università della Svizzera italiana<br>\nNils Jansen, Radboud University Nijmegen<br>\nPeter Gjøl Jensen, Aalborg University<br>\nSung-Shik Jongmans, Open University NL, CWI<br>\nJeroen Keiren, Eindhoven University of Technology<br>\nIgor Konnov, Informal Systems Inc<br>\nAlberto Lluch Lafuente, Technical University of Denmark<br>\nKuldeep S. Meel, National University of Singapore<br>\nAlice Miller, University of Glasgow<br>\nSergio Mover, École Polytechnique<br>\nRajagopal Nagarajan, Middlesex University<br>\nDoron Peled, Bar Ilan University<br>\nTatjana Petrov, University of Konstanz<br>\nJaco van de Pol, Aarhus University<br>\nStephen F. Siegel, University of Delaware<br>\nCarsten Sinz, Karlsruhe Institute of Technology<br>\nJiri Srba, Aalborg University<br>\nMichael Tautschnig, Amazon Web Services<br>\nYann Thierry-Mieg, Sorbonne University - LIP6<br>\nYakir Vizel, Technion<br>\nGeorg Weissenbacher, Vienna University of Technology<br>\nAnton Wijs, Eindhoven University of Technology</p>\n<p>Organizing committee</p>\n<p>Alfons Laarman, Leiden University<br>\nAna Sokolova, University of Salzburg</p>\n<p>Venue</p>\n<p>Established in 1928, Aarhus University has since developed into a major Danish university with a strong international reputation with approximately 38,000 students and 8,000 members of staff. Located in beautiful nature and wildlife areas, Aarhus is the second largest city of Denmark, with a rich trade and ancient Viking history.</p>\n<p>Contact</p>\n<p>All questions about submissions should be emailed to a.w.laarman@liacs.leidenuniv.nl&lt;mailto:<a href=\"mailto:a.w.laarman@liacs.leidenuniv.nl\">a.w.laarman@liacs.leidenuniv.nl</a>&gt;.</p>",
        "id": 215948755,
        "sender_full_name": "Email Gateway",
        "timestamp": 1604745149
    }
]