[
    {
        "content": "<p>From: Violet Ka I Pun &lt;<a href=\"mailto:violetpun@gmail.com\">violetpun@gmail.com</a>&gt;<br>\n[apologies for cross-postings]</p>\n<p>==================================================</p>\n<p>Call for Papers<br>\nFM 2023: 25th International Symposium on Formal Methods</p>\n<p>Lübeck, Germany, March 6-10, 2023<br>\n<a href=\"https://fm2023.isp.uni-luebeck.de/\">https://fm2023.isp.uni-luebeck.de/</a></p>\n<p>==================================================</p>\n<p>FM 2023 is the 25th international symposium in a series organised by<br>\nFormal Methods Europe (FME), an independent association whose aim is to<br>\nstimulate the use of, and research on, formal methods for software<br>\ndevelopment. The FM symposia have been successful in bringing together<br>\nresearchers and industrial users around a programme of original papers<br>\non research and industrial experience, workshops, tutorials, reports on<br>\ntools, projects, and ongoing doctoral research. FM 2023 will be both an<br>\noccasion to celebrate and a platform for enthusiastic researchers and<br>\npractitioners from a diversity of backgrounds to exchange their ideas<br>\nand share their experiences.</p>\n<p>=Important Dates=</p>\n<p>Abstract submission:    September 4, 2022, 23:59 AoE (firm)<br>\nFull paper submission:  September 11, 2022, 23:59 AoE (firm)<br>\nNotification:       November 15, 2022<br>\nCamera ready:       December 11, 2022<br>\nConference:         March 6-10, 2023</p>\n<p>=Topics of Interest=</p>\n<p>FM 2023 will highlight the development and application of formal methods<br>\nin a wide range of domains including trustworthy AI, software,<br>\ncomputer-based systems, systems-of-systems, cyber-physical systems,<br>\nsecurity, human-computer interaction, manufacturing, sustainability,<br>\nenergy, transport, smart cities, healthcare and biology. We particularly<br>\nwelcome papers on techniques, tools and experiences in interdisciplinary<br>\nsettings. We also welcome papers on experiences of applying formal methods <br>\nin industrial settings, and on the design and validation of formal method <br>\ntools.</p>\n<p>The topics of interest for FM 2023 include, but are not limited to:</p>\n<p>Interdisciplinary formal methods: Techniques, tools and experiences<br>\ndemonstrating the use of formal methods in interdisciplinary settings.<br>\nFormal methods in practice: Industrial applications of formal methods,<br>\nexperience with formal methods in industry, tool usage reports,<br>\nexperiments with challenge problems. The authors are encouraged to<br>\nexplain how formal methods overcame problems, led to improved designs,<br>\nor provided new insights.</p>\n<p>Tools for formal methods: Advances in automated verification, model<br>\nchecking, and testing with formal methods, tools integration,<br>\nenvironments for formal methods, and experimental validation of tools.<br>\nThe authors are encouraged to demonstrate empirically that the new tool<br>\nor environment advances the state of the art.</p>\n<p>Formal methods in software and systems engineering: Development<br>\nprocesses with formal methods, usage guidelines for formal methods, and<br>\nmethod integration. The authors are encouraged to evaluate process<br>\ninnovations with respect to qualitative or quantitative improvements.<br>\nEmpirical studies and evaluations are also solicited.</p>\n<p>Theoretical foundations of formal methods: All aspects of theory related<br>\nto specification, verification, refinement, and static and dynamic<br>\nanalysis. The authors are encouraged to explain how their results<br>\ncontribute to the solution of practical problems with formal methods or<br>\ntools.</p>\n<p>We explicitly welcome submissions to the special FM 2023 session on <br>\n\"Formal methods meets AI\", which is focused on formal and rigorous <br>\nmodelling and analysis techniques to ensuring safety, robustness etc. (trustworthiness) of AI-based systems.</p>\n<p>=Submission Guidelines=</p>\n<p>Papers should be original work, not published or submitted elsewhere, in<br>\nSpringer LNCS format, written in English, submitted through EasyChair:<br>\n<a href=\"https://easychair.org/conferences/?conf=fm2023\">https://easychair.org/conferences/?conf=fm2023</a></p>\n<p>Each paper will be evaluated by at least three members of the Programme<br>\nCommittee. Authors of papers reporting experimental work are strongly<br>\nencouraged to make their experimental results available for use by the<br>\nreviewers. Similarly, case study papers should describe significant case<br>\nstudies, and the complete development should be made available at the<br>\ntime of review. The usual criteria for novelty, reproducibility,<br>\ncorrectness and the ability for others to build upon the described work<br>\napply. Tool papers and tool demonstration papers should explain<br>\nenhancements made compared to previously published work. A tool<br>\ndemonstration paper need not present the theory behind the tool, but can<br>\nfocus on the tool’s features, how it is used, its evaluation, and<br>\nexamples and screenshots illustrating the tool’s use. Authors of tool<br>\nand tool demonstration papers should make their tool available for use<br>\nby the reviewers.</p>\n<p>We solicit various categories of papers:</p>\n<p>Regular Papers (max 15 pages)<br>\nLong tool papers (max 15 pages)<br>\nCase study papers (max 15 pages)<br>\nShort papers (max 6 pages), including tool demonstration papers.</p>\n<p>Short papers present novel ideas (e.g., without an extensive experimental <br>\nevaluation) or results that can well be presented in 6 pages. Short papers <br>\nwill be given short presentation slots at the conference.</p>\n<p>All page limits do not include references and appendices.</p>\n<p>For all papers, an appendix can provide additional material such as<br>\ndetails on proofs or experiments. The appendix is not part of the page<br>\ncount and not guaranteed to be read or taken into account by the<br>\nreviewers. Thus, it should not contain information necessary for the<br>\nunderstanding and the evaluation of the presented work. Papers will be<br>\naccepted or rejected in the category in which they were submitted and<br>\nwill not be moved between categories.</p>\n<p>At least one author of an accepted paper is expected to present the<br>\npaper at the conference as a registered participant.</p>\n<p>=Best Paper Award=</p>\n<p>At the conference, the PC Chairs will present an award to the authors of<br>\nthe submission selected as the FM 2023 Best Paper.</p>\n<p>=Publication=</p>\n<p>Accepted papers will be published in the Symposium Proceedings to appear<br>\nin Springer’s Lecture Notes in Computer Science. Extended versions of selected <br>\npapers will be invited for publication in a special issue of a journal.</p>\n<p>=General Chair=</p>\n<p>Martin Leucker, University of Lübeck, Germany</p>\n<p>=Program Committee Chairs=</p>\n<p>Marsha Chechik, University of Toronto, Canada<br>\nJoost-Pieter Katoen, RWTH Aachen University, Germany<br>\n                &amp; University of Twente, the Netherlands</p>\n<p>=Program Committee=</p>\n<p>TBD</p>",
        "id": 276310432,
        "sender_full_name": "Email Gateway",
        "timestamp": 1648030040
    }
]