[
    {
        "content": "<p>From: <a href=\"mailto:xldenis@lri.fr\">xldenis@lri.fr</a></p>\n<blockquote>\n<p><strong>* VerifyThis 2023: Call For Problems </strong>*  </p>\n<p>CFP Deadline: February 1st, 2023  <br>\nWebsite: <a href=\"http://verifythis.ethz.ch\">http://verifythis.ethz.ch</a>  </p>\n<p>VerifyThis is an annual program verification competition held as part  <br>\nof ETAPS. It is an opportunity for community members and tool authors  <br>\nto showcase their work and learn from each other with hands-on  <br>\nexercises.  </p>\n<p>The competition proceeds in three rounds. In each round, participants  <br>\nare given 90 minutes to implement and prove specified properties of a  <br>\ngiven algorithm and/or data structures. They are free to use any  <br>\nverification tools they choose.  </p>\n<p>We are looking for problem submissions. If you have recently  <br>\nencountered an interesting challenge in your work, don’t hesitate to  <br>\nsubmit it. Typical challenges have clear input-output specifications  <br>\nand often incorporate one or more of the following: heap allocation,  <br>\nconcurrency, arithmetic reasoning. A challenge usually describes a  <br>\nproblem using natural language together with some pseudocode, and then  <br>\nprovides a list of properties or “verification tasks” of varied levels  <br>\nof difficulty. Contributors are encouraged to look at the Archive of  <br>\nprevious problems on the VerifyThis web site, at the URL above.  </p>\n<p>An award will be given for any submission used in the competition.  </p>\n<p>To avoid spoiling the competition for others, we ask that you keep the  <br>\nsubject of your submission private.  </p>\n<p>Submissions should be sent by email to <a href=\"mailto:xldenis@lri.fr\">xldenis@lri.fr</a> and  <br>\n<a href=\"mailto:siegel@udel.edu\">siegel@udel.edu</a>.  </p>\n<p>Submission Criteria:  </p>\n<ul>\n<li>\n<p>A brief yet precise problem description, specifically identifying  <br>\nverification sub-tasks.  </p>\n</li>\n<li>\n<p>A solution to the challenge is strongly encouraged, otherwise  <br>\nplease provide a sketch of correctness.  </p>\n</li>\n<li>\n<p>The description document can use any reasonable format, including  <br>\nplain text or PDF.  </p>\n</li>\n</ul>\n<p>Sincerely,  </p>\n<p>Stephen Siegel, University of Delaware &lt;<a href=\"mailto:siegel@udel.edu\">siegel@udel.edu</a>&gt;  <br>\n Xavier Denis, Université Paris-Saclay &lt;<a href=\"mailto:xldenis@lri.fr\">xldenis@lri.fr</a>&gt;  <br>\n Co-chairs, VerifyThis 2023</p>\n</blockquote>",
        "id": 307551545,
        "sender_full_name": "Email Gateway",
        "timestamp": 1667402864
    }
]