[
    {
        "content": "<p>From: \"\\\"Titolo, Laura (LARC-D320)[NATIONAL INSTITUTE OF AEROSPACE] via fm-announcements\\\"\" &lt;<a href=\"mailto:cl-isabelle-users@lists.cam.ac.uk\">cl-isabelle-users@lists.cam.ac.uk</a>&gt;<br>\nFMICS 2023: 28th International Conference on Formal Methods for Industrial Critical Systems<br>\nAntwerp, Belgium, 20-22 September 2023<br>\n<a href=\"https://www.uantwerpen.be/en/conferences/confest-2023/fmics/\">https://www.uantwerpen.be/en/conferences/confest-2023/fmics/</a></p>\n<p>The aim of the FMICS conference series is to provide a forum for researchers<br>\nand practitioners who are interested in the development and application of<br>\nformal methods in the industry. FMICS brings together scientists and engineers<br>\nwho are active in the area of formal methods and interested in exchanging their<br>\nexperiences in the industrial usage of these methods.<br>\nThe FMICS conference series also strives to promote research and development<br>\nfor the improvement of formal methods and tools for industrial applications.</p>\n<p>IMPORTANT DATES:</p>\n<p>Paper submission: 15 May 2023<br>\nAuthors’ response period: 28-30 June 2023<br>\nNotification: 14 July 2023<br>\nCamera-ready version: July 31, 2023<br>\nConference: 20-22 September 2023</p>\n<p>TOPICS:</p>\n<p>Topics of interest include (but are not limited to):</p>\n<ul>\n<li>\n<p>Case studies and experience reports on industrial applications of formal<br>\nmethods, focusing on lessons learned or identification of new research<br>\ndirections.</p>\n</li>\n<li>\n<p>Methods, techniques, and tools to support automated analysis, certification,<br>\ndebugging, learning, optimization, and transformation of complex, distributed,<br>\nreal-time, embedded, mobile and autonomous systems.</p>\n</li>\n<li>\n<p>Verification and validation methods (model checking, theorem proving, SAT/SMT<br>\nconstraint solving, abstract interpretation, etc.) that address the shortcomings of<br>\nexisting methods with respect to their industrial applicability (e.g.,<br>\nscalability and usability issues, tool qualification, and certification).</p>\n</li>\n<li>\n<p>Impact of the adoption of formal methods on the development process and<br>\nassociated costs.</p>\n</li>\n<li>\n<p>Application of formal methods in standardization and industrial forums.</p>\n</li>\n</ul>\n<p>PAPER SUBMISSION:</p>\n<p>Papers must describe original research work and results. Submitted papers must<br>\nnot have previously appeared in a journal or conference with published<br>\nproceedings and must not be concurrently submitted to any other peer-reviewed<br>\nworkshop, symposium, conference, or archival journal. Any partial overlap with<br>\nany such published or concurrently submitted paper must be clearly indicated.</p>\n<p>Submissions should clearly motivate relevance to industrial applications. Case<br>\nstudy papers should identify lessons learned, validate theoretical results<br>\n(such as scalability of methods) or provide specific motivation for further<br>\nresearch and development.</p>\n<p>Papers should not exceed 15 pages formatted according to the LNCS style<br>\n(Springer). All submissions will be reviewed by the Programme Committee, which<br>\nwill make a selection among the submissions based on the novelty, soundness,<br>\nand applicability of the presented ideas and results.<br>\nPapers must be written in English and should be submitted as PDF files using<br>\nthe EasyChair submission site: <a href=\"https://easychair.org/conferences/?conf=fmics2023\">https://easychair.org/conferences/?conf=fmics2023</a>.</p>\n<p>PROCEEDINGS:</p>\n<p>The conference proceedings will be published by Springer in the LNCS series. At<br>\nleast one author of each accepted paper is expected to present the paper at the<br>\nconference as a registered participant.</p>\n<p>BEST PAPER AWARD:</p>\n<p>An award will be presented to the authors of the submission selected by the<br>\nProgram Committee as the FMICS 2023 Best Paper. This submission will be awarded<br>\na 1.000 Euro prize sponsored by Springer.</p>\n<p>SPECIAL ISSUE:</p>\n<p>The Program Committee of FMICS 2023 will invite a selection of accepted papers<br>\nto submit extended versions to a special issue of an International Journal.</p>\n<p>PC CHAIRS:</p>\n<p>Alessandro Cimatti, FBK, Italy<br>\nLaura Titolo, NIA/NASA LaRC, USA</p>\n<p>PROGRAM COMMITTEE:</p>\n<p>Jasmin Blanchette (Vrije Universiteit Amsterdam, the Netherlands)<br>\nSupratik Chakraborty (IIT Bombay, India)<br>\nPedro D'Argenio (Universidad Nacional de Cordoba, Argentina)<br>\nJennifer Davis (Collins Aerospace, USA)<br>\nDavid Deharbe (Federal University of Rio Grande do Norte, Brazil)<br>\nAlexandre Duret-Lutz (Laboratoire de Recherche et Développement de l'Epita, France)<br>\nAlessandro Fantechi (University of Florence, Italy)<br>\nAlessio Ferrari  (CNR, Italy)<br>\nHubert Garavel (INRIA, France)<br>\nPierre-Loic Garoche (ENAC, France)<br>\nKlaus Havelund (JPL, USA)<br>\nJean-Baptiste Jeannin (University of Michigan, USA)<br>\nBarbara Jobstmann (EPFL, Switzerland)<br>\nLaura Kovac (TU Wien, Austria)<br>\nTiziana Margaria (University of Limerick and LERO, Ireland)<br>\nPaolo Masci (NIA/NASA Langley, USA)<br>\nStefan Mitsch (CMU, USA)<br>\nRosemary Monahan (Maynooth University, Ireland)<br>\nDavid Monniaux (VERIMAG, France)<br>\nSergio Mover (Ecole Politechnique, France)<br>\nYannick Moy (ADACORE, France)<br>\nJorge Navas (Certora, USA)<br>\nDejan Nickovic (Austrian Institute of Technology, Austria)<br>\nKristine Yvonne Rozier (Iowa State University, USA)<br>\nCristina Seceleanu (Malardalen University, Sweden)<br>\nMartina Seidl (Johannes Kepler University, Austria)<br>\nJaco van de Pol (Aarhus University, Denmark)<br>\nAlicia Villanueva (Universitat Politecnica de Valencia, Spain)<br>\nVirginie Wiels (Onera, France)</p>\n<p>FMICS STEERING COMMITTEE:</p>\n<p>Maurice ter Beek (ISTI-CNR, Italy)<br>\nAlessandro Fantechi (University of Florence, Italy)<br>\nHubert Garavel (INRIA, France)<br>\nTiziana Margaria (University of Limerick and LERO, Ireland)<br>\nRadu Mateescu (INRIA, France)<br>\nJaco van de Pol (Aarhus University, Denmark)</p>\n<p>VENUE:</p>\n<p>As in previous years, FMICS 2023 is part of the CONFEST umbrella conference. In<br>\naddition to FMICS, CONFEST also comprises CONCUR, FORMATS, and QEST, as well as<br>\nworkshops and tutorials.<br>\nCONFEST will be held in Antwerp, Belgium on 18-23 September 2023.</p>",
        "id": 325178464,
        "sender_full_name": "Email Gateway",
        "timestamp": 1675263060
    }
]