[
    {
        "content": "<p>From: Ningning Xie &lt;<a href=\"mailto:xnningxie@gmail.com\">xnningxie@gmail.com</a>&gt;<br>\nPACMPL Issue POPL 2026 seeks contributions on all aspects of programming<br>\nlanguages and programming systems, both theoretical and practical. Authors<br>\nof<br>\npapers published in PACMPL Issue POPL 2026 will be invited to present their<br>\nwork<br>\nin the POPL conference in January 2026, which is sponsored by ACM SIGPLAN,<br>\nin<br>\ncooperation with ACM SIGACT and ACM SIGLOG.</p>\n<p>POPL 2026 Website: <a href=\"https://popl26.sigplan.org/\">https://popl26.sigplan.org/</a></p>\n<p>Call for Papers:<br>\n<a href=\"https://conf.researchr.org/track/POPL-2026/POPL-2026-popl-research-papers\">https://conf.researchr.org/track/POPL-2026/POPL-2026-popl-research-papers</a></p>\n<p>Submission deadline: July 10 2025 AOE</p>\n<p>Double-Blind Review FAQ:<br>\n<a href=\"https://conf.researchr.org/track/POPL-2026/POPL-2026-popl-research-papers#double-blind-reviewing\">https://conf.researchr.org/track/POPL-2026/POPL-2026-popl-research-papers#double-blind-reviewing</a></p>\n<h3>Organization</h3>\n<p>Conference Location: Rennes, France</p>\n<p>Conference Dates: January 11-17, 2026</p>\n<p>General Chair: Sandrine Blazy, University of Rennes</p>\n<p>Program Chair: Suresh Jagannathan, Purdue University</p>\n<p>Program Committee:<br>\n<a href=\"https://popl26.sigplan.org/committee/POPL-2026-popl-research-papers-program-committee\">https://popl26.sigplan.org/committee/POPL-2026-popl-research-papers-program-committee</a></p>\n<h3>Scope</h3>\n<p>Principles of Programming Languages (POPL) is a forum for the discussion of<br>\nall<br>\naspects of programming languages and programming systems. Both theoretical<br>\nand<br>\nexperimental papers are welcome, on topics ranging from formal frameworks to<br>\nexperience reports. We seek submissions that make principled, enduring<br>\ncontributions to the theory, design, understanding, implementation, or<br>\napplication of programming languages.</p>\n<h3>Evaluation Criteria</h3>\n<p>The Review Committee will evaluate the technical contribution of each<br>\nsubmission<br>\nas well as its accessibility to both experts and the general POPL audience.<br>\nAll<br>\npapers will be judged on significance, originality, relevance, correctness,<br>\nand<br>\nclarity. Each paper must explain its scientific contribution in both<br>\ngeneral and<br>\ntechnical terms, identifying what has been accomplished, explaining why it<br>\nis<br>\nsignificant, and comparing it with previous work. Advice on writing<br>\ntechnical<br>\npapers can be found on the SIGPLAN author information page:<br>\n<a href=\"https://www.sigplan.org/Resources/Author/\">https://www.sigplan.org/Resources/Author/</a>.</p>\n<p>Deadlines and formatting requirements, detailed below, will be strictly<br>\nenforced.</p>\n<h3>Double-Blind Reviewing Process</h3>\n<p>POPL 2026 will use a full double-blind reviewing process (similar to the one<br>\nused in recent years (POPL 2023 - 2025) but different from the lightweight<br>\ndouble-blind process used before then). This means that identities of<br>\nauthors<br>\nwill not be made visible to reviewers until after conditional-acceptance<br>\ndecisions have been made, and then only for the conditionally-accepted<br>\npapers.<br>\nThe use of full double-blind reviewing has several consequences for authors.</p>\n<ul>\n<li>\n<p><strong>Submissions</strong>: Authors must omit their names and institutions from their<br>\n  paper submissions. In addition, references to authors’ own prior work<br>\nshould<br>\n  be in the third person (e.g., not “We build on our previous work …” but<br>\nrather<br>\n  “We build on the work of …”).</p>\n</li>\n<li>\n<p><strong>Supplementary material</strong>: Authors are permitted to provide supplementary<br>\n  material (e.g., detailed proofs, proof scripts, system implementations, or<br>\n  experimental data) along with their submission, which reviewers may (but<br>\nare<br>\n  not required to) examine. This material may take the form of a single<br>\nfile,<br>\n  such as a PDF or a tarball. Authors must fully anonymize any supplementary<br>\n  material.</p>\n</li>\n<li>\n<p><strong>Author response</strong>: In responding to reviews, authors should not say<br>\nanything<br>\n  that reveals their identity, since author identities will not be revealed<br>\nto<br>\n  reviewers at that stage of the reviewing process.</p>\n</li>\n<li>\n<p><strong>Dissemination of work under submission</strong>: Authors are welcome to<br>\ndisseminate<br>\n  their ideas and post draft versions of their paper(s) on their personal<br>\n  website, institutional repository, or arXiv (reviewers will be asked to<br>\nturn<br>\n  off arXiv notifications during the review period). But authors should not<br>\ntake<br>\n  steps that would almost certainly reveal their identities to members of<br>\nthe<br>\n  Program Committee, e.g., directly contacting PC members or publicizing the<br>\n  work on widely-visible social media or major mailing lists used by the<br>\n  community.</p>\n</li>\n</ul>\n<p>The purpose of the above restrictions is to help the Program Committee and<br>\nexternal reviewers come to a judgment about the paper without bias, not to<br>\nmake<br>\nit impossible for them to discover the authors’ identities if they were to<br>\ntry.<br>\nIn particular, nothing should be done in the name of anonymity that weakens<br>\nthe<br>\nquality of the submission.</p>\n<p>However, there are occasionally cases where adhering to the above<br>\nrestrictions<br>\nis truly difficult or impossible for one reason or another. In such cases,<br>\nthe<br>\nauthors should contact the Program Chair to discuss the situation and how to<br>\nhandle it.</p>\n<p>The FAQ on Double-Blind Reviewing addresses many common scenarios and<br>\nanswers<br>\nmany common questions about this topic. But there remain many grey areas and<br>\ntrade-offs. If you have any doubts about how to interpret the double-blind<br>\nrules<br>\nor you encounter a complex case that is not clearly covered by the FAQ,<br>\nplease<br>\ncontact the Program Chair for guidance.</p>\n<h3>Evaluation Process</h3>\n<p>POPL 2026 will have five Associate Chairs who will help the PC Chair monitor<br>\nreviews, solicit external expert reviews for submissions when there is not<br>\nenough expertise on the committee, and facilitate reviewer discussions.</p>\n<p>As in previous years, authors will have a multi-day period to respond to<br>\nreviews, as indicated in the Important Dates table. Responses are optional.<br>\nA<br>\nresponse must be concise, addressing specific points raised in the reviews;<br>\nin<br>\nparticular, it must not introduce new technical results. Reviewers will<br>\nwrite a<br>\nshort reaction to these author responses.</p>\n<p>The Review Committee (RC) will discuss papers electronically, and will use<br>\nsynchronous virtual meetings to discuss any papers for which there is<br>\ndisagreement among reviewers, in some cases soliciting additional input from<br>\nother experts in the committee. There is no formal External Review<br>\nCommittee,<br>\nthough experts outside the committee may be consulted for some papers.<br>\nReviews<br>\nwill be accompanied by a short summary of the reasons behind the committee’s<br>\ndecision with the goal of clarifying the reasons behind the decision.</p>\n<p>To conform with ACM requirements for journal publication, all POPL papers<br>\nwill<br>\nbe conditionally accepted; authors will be required to submit a short<br>\ndescription of the changes made to the final version of the paper,<br>\nincluding how<br>\nthe changes address any requirements imposed by the Review Committee. That<br>\nthe<br>\nchanges are sufficient will be confirmed by the original reviewers prior to<br>\nacceptance to POPL. Authors of conditionally accepted papers must submit a<br>\nsatisfactory revision to the Review Committee by the requested deadline or<br>\nrisk<br>\nrejection.</p>\n<p>For additional information about the reviewing process, see: <a href=\"https://www.sigplan.org/Conferences/POPL/Principles/\">Principles of\nPOPL</a>, a presentation<br>\nof<br>\nthe underlying organizational and reviewing policies for POPL. For POPL<br>\n2026,<br>\npolicies specified in this Call for Papers supersede those in the<br>\nPrinciples of<br>\nPOPL document.</p>\n<h3>Submission Site Information</h3>\n<p>The submission site is <a href=\"https://popl26.hotcrp.com\">https://popl26.hotcrp.com</a>.</p>\n<p>Authors can submit multiple times prior to the deadline. Only the last<br>\nsubmission will be reviewed. There is no abstract deadline. The submission<br>\nsite<br>\nrequires entering author names and affiliations, relevant topics, and<br>\npotential<br>\nconflicts. Addition or removal of authors after the submission deadline will<br>\nneed to be approved by the Program Chair (as this kind of change potentially<br>\nundermines the goal of eliminating conflicts during paper assignment).</p>\n<p>The submission deadline is 11:59PM July 10, 2025 anywhere on earth (AOE):<br>\n<a href=\"https://en.wikipedia.org/wiki/Anywhere_on_Earth\">https://en.wikipedia.org/wiki/Anywhere_on_Earth</a></p>\n<h3>Conflicts of Interest</h3>\n<p>For each submission, the authors must make sure that they properly declare<br>\nall<br>\npotential conflicts of interest for all of the authors of that submission.<br>\nThis<br>\nincludes marking PC conflicts as well as “Other Conflicts (external)”. A<br>\nconflict caught late in the reviewing process leads to a voided review<br>\nwhich may<br>\nbe infeasible to replace.</p>\n<p>Conflicts should be declared between an adviser and an advisee (e.g., Ph.D.,<br>\npost-doc; forever), between an author and a co-author (papers and<br>\nproposals; for<br>\ntwo years), between people at the same institution (branches of large<br>\ncompanies<br>\nor different locations of research institutes are considered to be the same<br>\ninstitution; for two years after leaving an institution), between people<br>\nwith<br>\nfinancial conflicts of interest, and between friends or relatives.</p>\n<p>If a possible reviewer does not meet the above criteria, please do not<br>\nidentify<br>\nhim/her as conflicted. Doing so could be viewed as an attempt to prevent a<br>\nqualified, but possibly skeptical reviewer from reviewing your paper. If you<br>\nnevertheless believe that a reviewer who does not meet the above criteria is<br>\nconflicted, or if you are unsure about a possible conflict, you may<br>\nidentify the<br>\nperson and send a note to the PC Chair. Declaring a spurious conflict with<br>\nthe<br>\naim of excluding otherwise qualified reviewers can be grounds for desk<br>\nrejection.</p>\n<h3>Submission Guidelines</h3>\n<p>Prior to the paper submission deadline, authors should upload their full<br>\nanonymized paper. Here are some key requirements concerning paper<br>\nsubmissions:</p>\n<ul>\n<li>Each paper should have no more than **25 pages of text, excluding<br>\n  bibliography**, using the PACMPL format (specifically, the <code>acmart</code> LaTeX<br>\n  class with <code>acmsmall</code> option). It is a single-column page layout with a<br>\n10 pt<br>\n  font, 12 pt line spacing, and wider margins than recent POPL page<br>\nlayouts. In<br>\n  this format, the main text block is 5.478 in (13.91 cm) wide and 7.884 in<br>\n  (20.03 cm) tall. Use of a different format (e.g., smaller fonts or a<br>\nlarger<br>\n  text block) is grounds for summary rejection. The PACMPL template for<br>\nLaTeX<br>\n  can be found at the <a href=\"https://www.sigplan.org/Resources/Author/\">SIGPLAN author information\n  page</a>, and further information<br>\n  about PACMPL submissions can be found on the [PACMPL author guidelines<br>\n[message truncated]</li>\n</ul>",
        "id": 525430185,
        "sender_full_name": "Email Gateway",
        "timestamp": 1750730073
    }
]