[
    {
        "content": "<p>From: Andrei Popescu &lt;<a href=\"mailto:andrei.h.popescu@gmail.com\">andrei.h.popescu@gmail.com</a>&gt;<br>\nDear Colleagues,</p>\n<p>I am delighted to announce that this year’s London Mathematical Society<br>\n(LMS) / British Computer Society -- Formal Aspects of Computing Science<br>\n(BCS-FACS) Evening Seminar will feature Jeremy Avigad as the distinguished<br>\nspeaker. Registration is free but required in advance.</p>\n<p>Date: 6 November 2025<br>\nTime: 19:00 (UK time)<br>\nFormat: Online via Zoom<br>\nTalk title: Mathematics in the Age of AI<br>\nJeremy’s website: <a href=\"https://lnkd.in/ep3w-fiB\">https://lnkd.in/ep3w-fiB</a></p>\n<p>Registration (for access to the Zoom link) is available here:<br>\n<a href=\"https://lnkd.in/eRE-Bb2A\">https://lnkd.in/eRE-Bb2A</a></p>\n<p>Further details about the talk are included below</p>\n<p>Best wishes,<br>\nAndrei</p>\n<p>Speaker: Jeremy Avigad (Carnegie Mellon University)<br>\nTitle: Mathematics in the Age of AI</p>\n<p>Abstract:<br>\nNew technologies for reasoning and discovery are bound to have a profound<br>\neffect on mathematical practice. Proof assistants are already changing the<br>\nnature of collaboration, communication, and curation of mathematical<br>\nknowledge. Automated reasoning tools are used to find mathematical objects<br>\nwith specified properties or rule out their existence, and to decide or<br>\nverify mathematical claims. Machine learning and neural methods can<br>\ndiscover patterns in mathematical data, explore complex mathematical<br>\nspaces, and generate mathematical objects of interest. Neurosymbolic<br>\ntheorem provers, now capable of solving the most challenging competition<br>\nproblems, combine aspects of all of these technologies.</p>\n<p>It is helpful to keep in mind that the phrase \"AI for mathematics\"<br>\nencompasses several distinct technologies that overlap and interact in<br>\ninteresting ways. In this talk, I will survey the landscape, describe a few<br>\nlandmark applications to mathematics, and encourage you to join me in<br>\nthinking about how mathematicians and computer scientists can collaborate<br>\nto guide mathematics through this era of technological change.</p>\n<p>Bio:<br>\nJeremy Avigad is a professor in the Department of Philosophy and the<br>\nDepartment of Mathematical Sciences at Carnegie Mellon University. He is<br>\nthe director of the Institute for Computer-Aided Reasoning in Mathematics,<br>\na new NSF Mathematical Sciences Research Institute, and the director of the<br>\nHoskinson Center for Formal Mathematics, a research center at Carnegie<br>\nMellon. He has contributed to mathematical logic and the history and<br>\nphilosophy of mathematics, and he is currently working on applications of<br>\nformal methods and AI to mathematics. He serves on the Lean Community Admin<br>\nTeam and the board of the Lean Focused Research Organization.</p>",
        "id": 543649084,
        "sender_full_name": "Email Gateway",
        "timestamp": 1759889749
    },
    {
        "content": "<p>From: Andrei Popescu &lt;<a href=\"mailto:andrei.h.popescu@gmail.com\">andrei.h.popescu@gmail.com</a>&gt;<br>\nDear Colleagues,</p>\n<p>Apologies for my earlier message, which included LinkedIn-redirected<br>\nlinks by mistake. I’m resending the seminar info below with the<br>\ncorrect direct links:</p>\n<p>Date: 6 November 2025<br>\nTime: 19:00 (UK time)<br>\nFormat: Online via Zoom<br>\nTalk title: Mathematics in the Age of AI<br>\nJeremy’s website: <a href=\"https://www.andrew.cmu.edu/user/avigad/\">https://www.andrew.cmu.edu/user/avigad/</a></p>\n<p>Registration (for access to the Zoom link):<br>\n<a href=\"https://www.lms.ac.uk/events/lms-bcs-facs-seminar-jeremy-avigad\">https://www.lms.ac.uk/events/lms-bcs-facs-seminar-jeremy-avigad</a></p>\n<p>Best wishes,<br>\nAndrei</p>\n<p>On Wed, Oct 8, 2025 at 3:15 AM Andrei Popescu<br>\n&lt;<a href=\"mailto:andrei.h.popescu@gmail.com\">andrei.h.popescu@gmail.com</a>&gt; wrote:</p>\n<blockquote>\n<p>Dear Colleagues,</p>\n<p>I am delighted to announce that this year’s London Mathematical Society (LMS) / British Computer Society -- Formal Aspects of Computing Science (BCS-FACS) Evening Seminar will feature Jeremy Avigad as the distinguished speaker. Registration is free but required in advance.</p>\n<p>Date: 6 November 2025<br>\nTime: 19:00 (UK time)<br>\nFormat: Online via Zoom<br>\nTalk title: Mathematics in the Age of AI<br>\nJeremy’s website: <a href=\"https://lnkd.in/ep3w-fiB\">https://lnkd.in/ep3w-fiB</a></p>\n<p>Registration (for access to the Zoom link) is available here:<br>\n<a href=\"https://lnkd.in/eRE-Bb2A\">https://lnkd.in/eRE-Bb2A</a></p>\n<p>Further details about the talk are included below</p>\n<p>Best wishes,<br>\nAndrei</p>\n<p>Speaker: Jeremy Avigad (Carnegie Mellon University)<br>\nTitle: Mathematics in the Age of AI</p>\n<p>Abstract:<br>\nNew technologies for reasoning and discovery are bound to have a profound effect on mathematical practice. Proof assistants are already changing the nature of collaboration, communication, and curation of mathematical knowledge. Automated reasoning tools are used to find mathematical objects with specified properties or rule out their existence, and to decide or verify mathematical claims. Machine learning and neural methods can discover patterns in mathematical data, explore complex mathematical spaces, and generate mathematical objects of interest. Neurosymbolic theorem provers, now capable of solving the most challenging competition problems, combine aspects of all of these technologies.</p>\n<p>It is helpful to keep in mind that the phrase \"AI for mathematics\" encompasses several distinct technologies that overlap and interact in interesting ways. In this talk, I will survey the landscape, describe a few landmark applications to mathematics, and encourage you to join me in thinking about how mathematicians and computer scientists can collaborate to guide mathematics through this era of technological change.</p>\n<p>Bio:<br>\nJeremy Avigad is a professor in the Department of Philosophy and the Department of Mathematical Sciences at Carnegie Mellon University. He is the director of the Institute for Computer-Aided Reasoning in Mathematics, a new NSF Mathematical Sciences Research Institute, and the director of the Hoskinson Center for Formal Mathematics, a research center at Carnegie Mellon. He has contributed to mathematical logic and the history and philosophy of mathematics, and he is currently working on applications of formal methods and AI to mathematics. He serves on the Lean Community Admin Team and the board of the Lean Focused Research Organization.</p>\n</blockquote>",
        "id": 543811254,
        "sender_full_name": "Email Gateway",
        "timestamp": 1759948471
    },
    {
        "content": "<p>From: Andrei Popescu &lt;<a href=\"mailto:andrei.h.popescu@gmail.com\">andrei.h.popescu@gmail.com</a>&gt;<br>\nDear Colleagues,</p>\n<p>A brief reminder that Jeremy’s talk is coming up soon. Details are below.</p>\n<p>Best wishes,<br>\nAndrei</p>\n<p>On 08/10/2025 04:22, Andrei Popescu wrote:</p>\n<blockquote>\n<p>Dear Colleagues,</p>\n<p>I am delighted to announce that this year’s London Mathematical<br>\nSociety (LMS) / British Computer Society -- Formal Aspects of<br>\nComputing Science (BCS-FACS) Evening Seminar will feature Jeremy<br>\nAvigad as the distinguished speaker. Registration is free but required<br>\nin advance.</p>\n<p>Date: 6 November 2025<br>\nTime: 19:00 (UK time)<br>\nFormat: Online via Zoom<br>\nRegistration (for access to the Zoom link):<br>\n<a href=\"https://www.lms.ac.uk/events/lms-bcs-facs-seminar-jeremy-avigad\">https://www.lms.ac.uk/events/lms-bcs-facs-seminar-jeremy-avigad</a><br>\nTalk title: Mathematics in the Age of AI<br>\nSpeaker: Jeremy Avigad (Carnegie Mellon University)<br>\nJeremy’s website: <a href=\"https://www.andrew.cmu.edu/user/avigad/\">https://www.andrew.cmu.edu/user/avigad/</a></p>\n<p>Abstract:<br>\nNew technologies for reasoning and discovery are bound to have a<br>\nprofound effect on mathematical practice. Proof assistants are already<br>\nchanging the nature of collaboration, communication, and curation of<br>\nmathematical knowledge. Automated reasoning tools are used to find<br>\nmathematical objects with specified properties or rule out their<br>\nexistence, and to decide or verify mathematical claims. Machine<br>\nlearning and neural methods can discover patterns in mathematical<br>\ndata, explore complex mathematical spaces, and generate mathematical<br>\nobjects of interest. Neurosymbolic theorem provers, now capable of<br>\nsolving the most challenging competition problems, combine aspects of<br>\nall of these technologies.</p>\n<p>It is helpful to keep in mind that the phrase \"AI for mathematics\"<br>\nencompasses several distinct technologies that overlap and interact in<br>\ninteresting ways. In this talk, I will survey the landscape, describe<br>\na few landmark applications to mathematics, and encourage you to join<br>\nme in thinking about how mathematicians and computer scientists can<br>\ncollaborate to guide mathematics through this era of technological<br>\nchange.</p>\n<p>Bio:<br>\nJeremy Avigad is a professor in the Department of Philosophy and the<br>\nDepartment of Mathematical Sciences at Carnegie Mellon University. He<br>\nis the director of the Institute for Computer-Aided Reasoning in<br>\nMathematics, a new NSF Mathematical Sciences Research Institute, and<br>\nthe director of the Hoskinson Center for Formal Mathematics, a<br>\nresearch center at Carnegie Mellon. He has contributed to mathematical<br>\nlogic and the history and philosophy of mathematics, and he is<br>\ncurrently working on applications of formal methods and AI to<br>\nmathematics. He serves on the Lean Community Admin Team and the board<br>\nof the Lean Focused Research Organization.</p>\n</blockquote>",
        "id": 553290765,
        "sender_full_name": "Email Gateway",
        "timestamp": 1762135184
    }
]