[
    {
        "content": "<p>From: Oliver Fernandez Gil &lt;<a href=\"mailto:oliver.fernandez@tu-dresden.de\">oliver.fernandez@tu-dresden.de</a>&gt;<br>\n[Apologies for multiple copies]</p>\n<p>===============================================================<br>\n                                  Call for Papers<br>\n               Journal of Logical and Algebraic Methods in Programming         <br>\n                 Special Issue on Recent Advances on Unification      <br>\n===============================================================</p>\n<p>Scope</p>\n<hr>\n<p>The Journal of Logical and Algebraic Methods in Programming (JLAMP) is <br>\nan international journal that complements Elsevier's Science of Computer <br>\nProgramming and Theoretical Computer Science by its focus on the foundations <br>\nand the application of logical, algebraic and categorical methods to <br>\nprogramming and to the development of trustworthy computing systems. The aim <br>\nof JLAMP special issues is to attract high-quality research papers in <br>\nspecific topics connected to logical and algebraic methods in the theory and <br>\npractice of software development and computing systems.</p>\n<p>The purpose of this special issue of JLAMP is to collect recent, original, <br>\nand high-quality contributions on unification theory and its applications, <br>\nas well as closely related topics. Unification is concerned with the problem <br>\nof making two given terms equal, either syntactically or modulo an equational <br>\ntheory. It is a fundamental process used in various areas of computer science, <br>\nincluding automated reasoning, term rewriting, logic programming, natural <br>\nlanguage processing, program analysis, knowledge representation, types, etc.</p>\n<p>The International Workshop on Unification (UNIF) is the main international <br>\nevent on unification. This special issue is related to the research presented <br>\nin the last four editions of the workshop, i.e., from UNIF 2021 to UNIF 2024. <br>\nNevertheless, submissions of high quality works on unification that were not <br>\npresented at UNIF are also welcome. Thus, participants of UNIF, as well as <br>\nother authors, are invited to submit contributions.</p>\n<p>Topics</p>\n<hr>\n<p>Following the tradition of UNIF, this special issue addresses the topic of unification <br>\nin a broad sense. A non-exhaustive list of topics of interest includes:</p>\n<p>* syntactic and equational unification algorithms<br>\n  * matching and constraint solving<br>\n  * higher-order unification<br>\n  * unification in modal, temporal, and description logics<br>\n  * admissibility of inference rules<br>\n  * narrowing<br>\n  * disunification<br>\n  * anti-unification<br>\n  * complexity issues  <br>\n  * combination methods<br>\n  * implementation techniques<br>\n  * applications</p>\n<p>Submission</p>\n<hr>\n<p>This special issue welcomes original and high-quality contributions on unification <br>\ntheory and its applications, as well as closely related topics. Submissions should <br>\nconsist of articles that have not been previously published and are not under <br>\nconsideration for publication elsewhere. All submissions will be peer-reviewed and <br>\nhandled according to the usual procedures of JLAMP.</p>\n<p>Submitted manuscripts should be written in English and prepared following the guidelines <br>\nof JLAMP. Papers should be submitted electronically by using the Editorial Manager for <br>\nJLAMP, which can be accessed at:</p>\n<p><a href=\"https://www.editorialmanager.com/jlamp/default.aspx\">https://www.editorialmanager.com/jlamp/default.aspx</a></p>\n<p>The submission deadline is: <em>February 15, 2025</em>.</p>\n<p>Please choose VSI:Recent Advances in Unification when you will be selecting the article type.</p>\n<p>Guest Editors</p>\n<hr>\n<p>Santiago Escobar (Universitat Politècnica de València)<br>\nOliver Fernández Gil (TU Dresden)</p>\n<p>Further information</p>\n<hr>\n<p><a href=\"https://lat.inf.tu-dresden.de/~fernandez/jlamp-unif.html\">https://lat.inf.tu-dresden.de/~fernandez/jlamp-unif.html</a></p>\n<p><a href=\"/user_uploads/14278/09RjpdC8KM2fePOf36trABms/smime.p7s\">smime.p7s</a></p>",
        "id": 479314381,
        "sender_full_name": "Email Gateway",
        "timestamp": 1730132643
    }
]