[
    {
        "content": "<p><strong>From:</strong> Meera Sridhar &lt;<a href=\"mailto:cl-isabelle-users@lists.cam.ac.uk\">cl-isabelle-users@lists.cam.ac.uk</a>&gt;</p>\n<p>Project Description:</p>\n<hr>\n<p>We are seeking a highly-motivated Postdoctoral Fellow to join our team for the<br>\nDARPA Bus-based Local Attack Detection and Elimination (BLADE) program, a<br>\ngroundbreaking collaborative project between UNC Charlotte, Electric Power<br>\nResearch Institute (EPRI) and NVIDIA, to secure critical hardware bus systems.<br>\nThis position will lead the formal methods and verification thrust, focusing<br>\non providing mathematical assurances for the security of bus-based<br>\ncommunications.</p>\n<p>Key Responsibilities:</p>\n<hr>\n<ul>\n<li>\n<p>Formally model and verify the correctness of “Forensic Observation<br>\nData” (FODs) to ensure they accurately detect specified vulnerabilities.</p>\n</li>\n<li>\n<p>Investigate and define formal models of formal security properties of the<br>\nPCIe bus and NVIDIA’s DPU, CPU, and NIC for the purposes of security.</p>\n</li>\n<li>\n<p>Explore the use of high-assurance languages and toolchains for the<br>\nimplementation of a verified validation engine.</p>\n</li>\n<li>\n<p>Collaborate closely with our systems and cybersecurity teams to integrate<br>\nformal analysis and verified components into the broader project.</p>\n</li>\n<li>\n<p>Publish research in top-tier security and formal methods conferences and<br>\njournals.</p>\n</li>\n</ul>\n<p>Required Qualifications:</p>\n<hr>\n<ul>\n<li>\n<p>A Ph.D. (or anticipated completion) in Computer Science or a related field.</p>\n</li>\n<li>\n<p>A strong research background in formal methods, with demonstrated experience<br>\nin model checking, theorem proving, or formal specification.</p>\n</li>\n<li>\n<p>An interest in applying formal methods to real-world systems and security<br>\nchallenges.</p>\n</li>\n</ul>\n<p>Preferred Qualifications:</p>\n<hr>\n<ul>\n<li>\n<p>Direct experience with formal specification and verification tools (e.g.,<br>\nLean, TLA+, Coq, SMT solvers, etc.) is strongly preferred.</p>\n</li>\n<li>\n<p>Familiarity with high-assurance languages or provably-correct software<br>\ndevelopment.</p>\n</li>\n<li>\n<p>Knowledge of low-level hardware protocols (e.g., PCIe), computer<br>\narchitecture, or systems security.</p>\n</li>\n<li>\n<p>Understanding of vulnerability analysis or anomaly detection.</p>\n</li>\n</ul>\n<p>To apply, please submit the following materials to Dr. Meera Sridhar<br>\n(<a href=\"mailto:msridhar@charlotte.edu\">msridhar@charlotte.edu</a>):</p>\n<ul>\n<li>\n<p>A Curriculum Vitae (CV).</p>\n</li>\n<li>\n<p>A cover letter detailing your specific experience with formal methods tools<br>\nand your interest in systems security.</p>\n</li>\n<li>\n<p>Contact information for three professional references.</p>\n</li>\n<li>\n<p>One or two representative publications (preferably on formal verification or<br>\nsecurity).</p>\n</li>\n</ul>",
        "id": 562823322,
        "sender_full_name": "Email Gateway",
        "timestamp": 1765323529
    }
]