[
    {
        "content": "<p>From: Samuel Westrick &lt;<a href=\"mailto:shw8119@nyu.edu\">shw8119@nyu.edu</a>&gt;<br>\nWe’ve extended the deadline for the ML Family Workshop! The new deadline is July 3.</p>\n<p>If you (or someone you know) is planning to attend ICFP/SPLASH, we encourage you to consider submitting! The submission requirements are small (only a couple pages), and the scope of the workshop is broad: language design, implementation, memory management, type systems, semantics, applications, tooling, debugging, program analysis -- it's all fair game. This is a great opportunity to discuss works-in-progress, or demo something you've been building, or discuss an interesting take on language design.</p>\n<p>Full CFP below, with updated deadline. We hope you will consider submitting!</p>\n<h1>Higher-order, Typed, Inferred, Strict:</h1>\n<h1>ML Family Workshop 2025</h1>\n<p>October 16, 2025, Singapore<br>\n(Co-located with ICFP/SPLASH)</p>\n<p>Website:<br>\n<a href=\"https://conf.researchr.org/home/icfp-splash-2025/mlsymposium-2025\">https://conf.researchr.org/home/icfp-splash-2025/mlsymposium-2025</a></p>\n<p>Submission Link:<br>\n<a href=\"https://ml2025.hotcrp.com/\">https://ml2025.hotcrp.com/</a></p>\n<p>Submission Deadline (extended!):<br>\nJuly 3, 2025, AoE</p>\n<h2>Call for Presentations</h2>\n<p>ML (originally, \"Meta Language\") is a family of programming languages that includes dialects known as Standard ML, OCaml, and F#, among others. The development of these languages has inspired a large amount of computer science research, both practical and theoretical.</p>\n<p>The ML 2025 workshop will continue the informal approach followed since 2010. Presentations are selected by the program committee from submitted proposals. There are no published proceedings, so contributions may be submitted for publication elsewhere. The main criterion is promoting and informing the development of the entire extended ML family and delivering a lively workshop atmosphere. We particularly encourage talks about works in progress, presentations of negative results (things that were expected to but did not quite work out) and informed positions.</p>\n<p>Each presentation should take 20-25 minutes. The exact time will be decided based on scheduling constraints.</p>\n<p>We plan the workshop to an be in-person event with remote participation (streamed live). We hope that speakers are able to present in person. If a speaker is unable to attend, they may instead present remotely.</p>\n<p>The 2025 ML Family Workshop is co-located with ICFP/SPLASH 2025 and will take place on <strong>October 16, 2025</strong> in Singapore.</p>\n<h2>Scope</h2>\n<p>We seek presentations on topics including (but not limited to):</p>\n<p>Language design: abstraction, higher forms of polymorphism, concurrency and parallelism, distribution and mobility, staging, extensions for semi-structured data, generic programming, object systems, etc.</p>\n<p>Implementation: compilers, interpreters, type checkers, partial evaluators, runtime systems, garbage collectors, foreign function interfaces, etc.</p>\n<p>Type systems: inference, effects, modules, contracts, specifications and assertions, dynamic typing, error reporting, etc.</p>\n<p>Applications: case studies, experience reports, pearls, etc.</p>\n<p>Environments: libraries, tools, editors, debuggers, cross-language interoperability, functional data structures, etc.</p>\n<p>Semantics of ML-family languages: operational and denotational semantics, program equivalence, parametricity, mechanization, etc.</p>\n<p>We specifically encourage reporting what did not meet expectations or<br>\nwhat, despite all efforts, did not work to satisfaction.</p>\n<p>Four kinds of submissions are solicited: Research Presentations,<br>\nExperience Reports, Demos, and Informed Positions.</p>\n<p>Research Presentations: Research presentations should describe new ideas, experimental results, or significant advances in ML-related projects. We especially encourage presentations that describe work in progress, that outline a future research agenda, or that encourage lively discussion. These presentations should be structured in a way which can be, at least in part, of interest to (advanced) users.</p>\n<p>Experience Reports: Users are invited to submit Experience Reports about their use of ML and related languages. These presentations do not need to contain original research but they should tell an interesting story to researchers or other advanced users, such as an innovative or unexpected use of advanced features or a description of the challenges they are facing or attempting to solve.</p>\n<p>Demos: Live demonstrations or short tutorials should show new developments, interesting prototypes, or work in progress, in the form of tools, libraries, or applications built on or related to ML and related languages. (You will need to provide all the hardware and software required for your demo; the workshop organizers are only able to provide a projector.)</p>\n<p>Informed Positions: A justified argument for or against a language feature. The argument must be substantiated, either theoretically (e.g., by a demonstration of (un)soundness, an inference algorithm, a complexity analysis), empirically or by substantial experience. Personal experience is accepted as justification so long as it is extensive and illustrated with concrete examples.</p>\n<h2>Submission details</h2>\n<p>Submissions must be in the PDF format and have a short summary (abstract) at the beginning. Submissions in the categories of Experience Reports, Demos, or Informed Positions should indicate so in the title or subtitle. The point of the submission should be clear from its two first pages (PC members are not obligated to read any further.)</p>\n<p>Submissions must be uploaded to the workshop submission website before the submission deadline.</p>\n<p>Only the short summary/abstract of accepted submissions will be published on the conference website. After acceptance, authors will have the opportunity to attach or link to that summary any relevant material (such as the updated submission, slides, etc.)</p>\n<p><strong>Submission Website</strong>:<br>\n<a href=\"https://ml2025.hotcrp.com/\">https://ml2025.hotcrp.com/</a></p>\n<p><strong>Workshop Website</strong>:<br>\n<a href=\"https://conf.researchr.org/home/icfp-splash-2025/mlsymposium-2025\">https://conf.researchr.org/home/icfp-splash-2025/mlsymposium-2025</a></p>\n<h2>Dates and Deadlines</h2>\n<p><strong>Submission Deadline (extended!)</strong>:<br>\nThursday, July 3, AoE</p>\n<p><strong>Initial Author Notification</strong> (most cases):<br>\nThursday, July 31</p>\n<p><strong>Final Author Notification</strong> (if needed):<br>\nThursday, Aug 7</p>\n<p><strong>Workshop Date</strong>:<br>\nThursday, Oct 16</p>\n<h2>Program Committee</h2>\n<p>Sam Westrick (New York University, USA) (Chair)<br>\nMichael D. Adams (National University of Singapore, Singapore)<br>\nJonathan Brachthäuser (University of Tübingen, Germany)<br>\nChris Casinghino (Jane Street, USA)<br>\nArthur Charguéraud (INRIA, France)<br>\nKiran Gopinathan (University of Illinois Urbana-Champaign, USA)<br>\nMirai Ikebuchi (Kyoto University, Japan)<br>\nKeigo Imai (DeNA Co., Ltd., Japan)<br>\nAnton Lorenzen (University of Edinburgh, UK)<br>\nCyrus Omar (University of Michigan, USA)<br>\nZoe Paraskevopoulou (National Technical University of Athens, Greece)<br>\nFilip Sieczkowski (Heriot-Watt University, UK)<br>\nYong Kiam Tan (A*STAR Institute for Infocomm Research, Singapore)<br>\nYuting Wang (Shanghai Jiao Tong University, China)</p>\n<h2>Past Iterations</h2>\n<p>2024: <a href=\"https://icfp24.sigplan.org/home/mlworkshop-2024\">https://icfp24.sigplan.org/home/mlworkshop-2024</a><br>\n2023: <a href=\"https://icfp23.sigplan.org/home/mlworkshop-2023\">https://icfp23.sigplan.org/home/mlworkshop-2023</a><br>\n2022: <a href=\"https://icfp22.sigplan.org/home/mlfamilyworkshop-2022\">https://icfp22.sigplan.org/home/mlfamilyworkshop-2022</a><br>\n2021: <a href=\"https://icfp21.sigplan.org/home/mlfamilyworkshop-2021\">https://icfp21.sigplan.org/home/mlfamilyworkshop-2021</a></p>\n<p>More info: <a href=\"https://www.mlworkshop.org/home\">https://www.mlworkshop.org/home</a></p>\n<h2>Coordination with the OCaml Users and Developers Workshop</h2>\n<p>The OCaml workshop is seen as more practical and is dedicated in significant part to OCaml community building and the development of the OCaml system. In contrast, the ML family workshop is not focused on any language in particular, is more research-oriented, and deals with general issues of ML-style programming and type systems. There is some overlap, which we are keen to explore in various ways. The authors who feel their submission fits both workshops are encouraged to mention it at submission time or contact the program chairs.</p>",
        "id": 525150003,
        "sender_full_name": "Email Gateway",
        "timestamp": 1750500762
    }
]