[
    {
        "content": "<p>From: Gopalan Nadathur via Cl-isabelle-users &lt;<a href=\"mailto:cl-isabelle-users@lists.cam.ac.uk\">cl-isabelle-users@lists.cam.ac.uk</a>&gt;<br>\nApplications are invited for a one-year postdoctoral position at the<br>\nUniversity of Minnesota. The position is available immediately;<br>\napplications will be reviewed as they are received.</p>\n<p>The project within which the appointment is to be made concerns the<br>\ndevelopment of a framework that supports the encoding of rule-based<br>\nrelational specifications and the process of reasoning about such<br>\nspecifications through the encoding. An emphasis in the project is the use<br>\nof the so-called higher-order abstract syntax approach to representing<br>\nobjects that embody a binding structure. In recent work, we have developed a<br>\nnew logic &lt;<a href=\"https://arxiv.org/abs/2107.00111\">https://arxiv.org/abs/2107.00111</a>&gt; for articulating properties of<br>\nLF specifications, which has provided the basis for a proof assistant<br>\ncalled Adelfa &lt;<a href=\"http://adelfa.cs.umn.edu\">http://adelfa.cs.umn.edu</a>&gt; for reasoning about such<br>\nproperties. In other work, we are developing the capability to reason about<br>\nlinear logic specifications within the Abella proof assistant<br>\n&lt;<a href=\"https://abella-prover.org/\">https://abella-prover.org/</a>&gt; and are also using this system to explore the<br>\nbenefits of higher-order representations of syntax in the verification of<br>\ncompilers and transformers for functional programming languages. The<br>\nsuccessful candidate will be expected to participate in and help lead the<br>\nwork in some of these directions.</p>\n<p>To be suitable for the position, the candidate should be broadly conversant<br>\nwith the areas of computational logic and programming languages and should<br>\nhave the mathematical and programming skills necessary for conducting<br>\nresearch in them. Some particular facets that would be help in engaging<br>\nimmediately with the research problems are a prior exposure to a proof<br>\nassistant or logical framework such as Coq, Isabelle or Abella, programming<br>\nexperience with a functional language such as OCaml, an understanding of<br>\nproof theoretic treatments of aspects such as fixed-point definitions, and<br>\nfamiliarity with issues related to proof search in sequent calculi and<br>\nsimilar logical systems.</p>\n<p>Please feel free to contact me (Gopalan Nadathur, <a href=\"mailto:ngopalan@umn.edu\">ngopalan@umn.edu</a>) for<br>\nmore details about the position. To view the official announcement, please<br>\nvisit the URL</p>\n<p><a href=\"https://hr.myu.umn.edu/jobs/ext/330828\">https://hr.myu.umn.edu/jobs/ext/330828</a>.</p>\n<p>This site also provides details about how to apply and serves as the portal<br>\nfor applications. A prerequisite for employment in this capacity is a<br>\ndoctoral degree in Computer Science or closely related field.</p>\n<p>-Gopalan Nadathur</p>",
        "id": 246956061,
        "sender_full_name": "Email Gateway",
        "timestamp": 1627031762
    }
]