[
    {
        "content": "<p>From: <a href=\"mailto:arithalghomework@sina.com\">arithalghomework@sina.com</a><br>\nDear Isabelle User Mailing List,</p>\n<p>I'm going to submit my formalization of prime number theorem with remainder into an AFP entry. Here is my code: <a href=\"https://github.com/mmew-2022/Isabelle_Prime_Number_Theorem\">https://github.com/mmew-2022/Isabelle_Prime_Number_Theorem</a>. I removed most of custom notations from my first version. What additional changes should I make to fulfill the requirement of an AFP entry? I've read the guideline of <a href=\"https://www.isa-afp.org/submission/\">https://www.isa-afp.org/submission/</a>, and the Isabelle linter reported some warnings about some <code>rule_tac</code> proofs and too long proof lines. Is this important?</p>\n<p>Thanks,</p>\n<p>Shuhao Song</p>",
        "id": 426113947,
        "sender_full_name": "Email Gateway",
        "timestamp": 1710246519
    },
    {
        "content": "<p>From: Lawrence Paulson &lt;<a href=\"mailto:lp15@cam.ac.uk\">lp15@cam.ac.uk</a>&gt;<br>\nDear Shuhao,</p>\n<p>I took a look at your proofs. On the whole, they look good. With regard to rule_tac, we specifically object to references to automatically-generated names e.g. xa, xb, but you don't seem to be doing this. I also noticed that where you are using rule_tac, often sledgehammer yielded up a nice simple proof. </p>\n<p>In one place I noticed compound methods in a proof: </p>\n<p>by (safe, rule zeta_bound_params.zeta_bound_param_axioms)<br>\n       (use assms in auto)</p>\n<p>This sort of thing should be rewritten if possible. Typically what helps is to explicitly prove the hardest subgoals produced by the compound method (if they are not too long to write out).</p>\n<p>So please do look at the output of the Linter, and where the problem is easy to fix, please just fix it. It's okay to leave a few of the warnings. If we don't accept your submission the first time, I'm pretty confident it will be accepted soon. </p>\n<p>Larry Paulson</p>",
        "id": 426315548,
        "sender_full_name": "Email Gateway",
        "timestamp": 1710329538
    },
    {
        "content": "<p>From: <a href=\"mailto:arithalghomework@sina.com\">arithalghomework@sina.com</a><br>\nI'm Shuhao, I have made some changes in my proof of prime number theorem with remainder. Today I will submit it as an AFP entry.I<br>\n will use my academic e-mail (<a href=\"mailto:znssong_meow@sina.com\">znssong_meow@sina.com</a>) instead of this <br>\ne-mail address for submission. Indeed, I want to use <br>\n<code>znssong_meow@sina.com</code> to send the previous e-mail to the mailing list, <br>\nbut I misoperated on my phone and used this mail address. The contract <br>\nauthor will be Bowen Yao, a teacher in Beijing University of Chemical <br>\nTechnology.<br>\nI removed most use of <code>rule_tac</code>, and splitted<br>\n complex proof steps. Now the linter only complains at too short names <br>\nof definition in locale, for example:```definition B where \"B x \\&lt;equiv&gt; 5 / 4 * ln x\" for x :: realdefinition f where \"f x s \\&lt;equiv&gt; x powr s / s * logderiv zeta s\" for x :: real and s :: complex</p>\n<div class=\"codehilite\" data-code-language=\"but\"><pre><span></span><code> this style is common in mathematics (instead of software verification,\nin there you usually use names with its actually meaning); In\nmathematics you usually don't write `Bound`, only write `B` for name.\nIf\n more changes are needed, please tell me. I'd also want to know whether this submitting will be in AFP 2024 release, as it will be forked\nat this Sunday.\n\n[PNT_with_Remainder.thy](/user_uploads/14278/GmSug9AFtHnrcFhagcsFFCUV/PNT_with_Remainder.thy)\n</code></pre></div>",
        "id": 434573486,
        "sender_full_name": "Email Gateway",
        "timestamp": 1713690556
    },
    {
        "content": "<p>From: Manuel Eberl &lt;<a href=\"mailto:manuel@pruvisto.org\">manuel@pruvisto.org</a>&gt;<br>\nHello,</p>\n<p>the AFP fork does not really matter much for you. Until the release of <br>\nthe next Isabelle version, you can still submit your entry for AFP 2023 <br>\nfor Isabelle 2023 and it will be ported to afp-devel and Isabelle 2024 <br>\nby us.</p>\n<p>In any event, your submission will appear on the AFP website and shortly <br>\nthereafter in afp-devel. If you submit before the release of AFP 2024 it <br>\nwill be part of AFP 2023; otherwise it has to work with Isabelle-2024 <br>\nand will be part of AFP 2024. But there is little difference in the end <br>\nresult.</p>\n<p>Manuel</p>",
        "id": 434687121,
        "sender_full_name": "Email Gateway",
        "timestamp": 1713774487
    }
]