[
    {
        "content": "<p>From: Chuangjie Xu &lt;<a href=\"mailto:cj-xu@outlook.com\">cj-xu@outlook.com</a>&gt;<br>\nWe invite applications for a one-year research position in the<br>\nDFG-funded project \"GuideForce: Type-based Enforcement of Secure<br>\nProgramming Guidelines\". The GuideForce project develops tools for the<br>\nautomatic enforcement of secure programming guidelines for Java. It<br>\ncombines ideas from type systems and abstract interpretation to develop<br>\na scalable analysis method. While guidelines for secure programming<br>\nare the first use-case, other applications are of interest too.</p>\n<p>We are looking for a research staff with a background in programming<br>\nlanguages and with excellent programming skills in Java. Experience in<br>\none of the following areas is a plus: compiler construction, security,<br>\nstatic program analysis, type systems and logic, implementation of<br>\nprogramming languages.</p>\n<p>The position is available for a year with the possibility of extension,<br>\nstarting as soon as possible. The salary will be set at level TV-L 13 of<br>\nthe German public salary scale.</p>\n<p>The work will be carried out at fortiss, a research institute in Munich<br>\nwith close connections both to the Munich universities TUM and LMU<br>\nand to industry.</p>\n<p>For any questions about the project or the position, please do not hesitate<br>\nto contact Chuangjie Xu &lt;<a href=\"mailto:xu@fortiss.org\">xu@fortiss.org</a> &lt;mailto:<a href=\"mailto:xu@fortiss.org\">xu@fortiss.org</a>&gt;&gt;.</p>\n<p>Please submit your application by 30.11.2020 via the following link:<br>\n<a href=\"https://recruitment.fortiss.org/RESEARCH-STAFF-ENFORCEMENT-OF-SECURE-PROGRAMMING-GUIDELINE-eng-j104.html\">https://recruitment.fortiss.org/RESEARCH-STAFF-ENFORCEMENT-OF-SECURE-PROGRAMMING-GUIDELINE-eng-j104.html</a> &lt;<a href=\"https://recruitment.fortiss.org/RESEARCH-STAFF-ENFORCEMENT-OF-SECURE-PROGRAMMING-GUIDELINE-eng-j104.html\">https://recruitment.fortiss.org/RESEARCH-STAFF-ENFORCEMENT-OF-SECURE-PROGRAMMING-GUIDELINE-eng-j104.html</a>&gt;</p>",
        "id": 214676872,
        "sender_full_name": "Email Gateway",
        "timestamp": 1603791109
    },
    {
        "content": "<p>From: Chuangjie Xu &lt;<a href=\"mailto:cj-xu@outlook.com\">cj-xu@outlook.com</a>&gt;<br>\nWe are looking for a researcher to strengthen our Safety &amp; Security team<br>\nat fortiss, a research institute in Munich with close connections both to the<br>\nMunich universities TUM and LMU and to industry.</p>\n<p>The Safety &amp; Security team develops new methods and engineering principles<br>\nrelated to safety and security in software and system development. Example<br>\nareas of interest include:</p>\n<ul>\n<li>Automated reasoning for safety/security-engineering</li>\n<li>Security aspects of distributed systems, such as accountability and privacy</li>\n<li>Formal semantics, verification, and analysis of access control systems</li>\n<li>Program analysis and type systems</li>\n</ul>\n<p>The position is available starting as soon as possible and will be for at least<br>\ntwo years initially, with the possibility of extension. You would be a team<br>\nmember contributing to our research in one of the above areas. Applications<br>\nfrom candidates with skills in related areas are also welcome.</p>\n<p>More details about this position can be found at:<br>\n<a href=\"https://recruitment.fortiss.org/RESEARCHER-SAFETYSEVURITY-MFD-eng-j163.html\">https://recruitment.fortiss.org/RESEARCHER-SAFETYSEVURITY-MFD-eng-j163.html</a> &lt;<a href=\"https://recruitment.fortiss.org/RESEARCHER-SAFETYSEVURITY-MFD-eng-j163.html\">https://recruitment.fortiss.org/RESEARCHER-SAFETYSEVURITY-MFD-eng-j163.html</a>&gt;</p>",
        "id": 250748239,
        "sender_full_name": "Email Gateway",
        "timestamp": 1629971766
    }
]