[
    {
        "content": "<p>From: Giles Reger &lt;<a href=\"mailto:giles.reger@manchester.ac.uk\">giles.reger@manchester.ac.uk</a>&gt;<br>\nHello,</p>\n<p>This is an advert for a Research Associate (postdoc) position available for working on data  structures for parallel theorem proving.</p>\n<p>Closing Date: 23rd Nov</p>\n<p>The University of Manchester in the UK has a world-famous automated reasoning group that has produced the award-winning Vampire and iProver theorem provers. This project explores data structures (mainly term indexing  structures) within the context of the Vampire theorem prover (<a href=\"https://vprover.github.io/\">https://vprover.github.io/</a>) and will aim to produce (i) thread safe structures, and (ii) specialise structures for particular reasoning use cases.</p>\n<p>This project is ideal for somebody who wants to tackle a well-defined, significant problem within automated reasoning.</p>\n<p>Salary from £33,309. Should have, or be about to receive, a PhD.</p>\n<p>For further details see here</p>\n<p><a href=\"https://www.jobs.manchester.ac.uk/displayjob.aspx?jobid=21224\">https://www.jobs.manchester.ac.uk/displayjob.aspx?jobid=21224</a></p>\n<p>Note that</p>\n<p>(i)                  Start date is negotiable</p>\n<p>(ii)                The position could be remote within the UK (UK only for tax reasons) if needed</p>\n<p>(iii)               There is funding available to extend the position for up to an additional 12 months (depending on start date)</p>\n<p>The interested candidate may wish to review the short  paper “A Multithreaded Vampire with Shared Persistent Grounding” presented at FMCAD 2021. Video and slides available from FMCAD website. Preprint here: <a href=\"https://easychair.org/publications/preprint/ZDmb\">https://easychair.org/publications/preprint/ZDmb</a>. There are many good resources on Term Indexing techniques and their use within theorem proving – the interested candidate should understand what term indexing is!</p>",
        "id": 261388092,
        "sender_full_name": "Email Gateway",
        "timestamp": 1636849007
    }
]