[
    {
        "content": "<p>From: Daniel Strüber &lt;<a href=\"mailto:danstru@chalmers.se\">danstru@chalmers.se</a>&gt;<br>\n=========================================================<br>\n15th International Conference on Graph Transformation<br>\nICGT 2022 - <a href=\"https://icgt2022.gitlab.io/\">https://icgt2022.gitlab.io/</a><br>\nJuly 7-8, Nantes, France, co-located with STAF 2022</p>\n<p>Second call-for-papers with new and updated information:</p>\n<ul>\n<li>\n<p>Updated extended submission deadlines<br>\n   abstracts due: February 28, 2022<br>\n   full papers due: March 7, 2022</p>\n</li>\n<li>\n<p>Details on keynote speaker and journal for special issue</p>\n</li>\n<li>\n<p>Highlighted special focus of ICGT 2022:<br>\n    Executable Applied Category Theory<br>\n==========================================================</p>\n</li>\n</ul>\n<p>AIMS AND SCOPE</p>\n<p>The use of graphs and graph-like structures as a formalism for <br>\nspecification and modelling is widespread in all areas of computer <br>\nscience as well as in many fields of computational research and <br>\nengineering. Relevant examples include software architectures, pointer <br>\nstructures, state space and control/data flow graphs, UML and other <br>\ndomain-specific models, network layouts, topologies of cyber-physical <br>\nenvironments, quantum computing and molecular structures. Often, these <br>\ngraphs undergo dynamic change, ranging from reconfiguration and <br>\nevolution to various kinds of behaviour, all of which may be captured by <br>\nrule-based graph manipulation. Thus, graphs and graph transformation <br>\nform a fundamental universal modelling paradigm that serves as a means <br>\nfor formal reasoning and analysis, ranging from the verification of <br>\ncertain properties of interest to the discovery of fundamentally new <br>\ninsights.</p>\n<p>The International Conference on Graph Transformation aims at fostering <br>\nexchange and collaboration of researchers from different backgrounds <br>\nworking with graphs and graph transformation, either in contributing to <br>\ntheir theoretical foundations or by applying established formalisms to <br>\nclassical or novel areas. The conference not only serves as a <br>\nwell-established scientific publication outlet, but also as a platform <br>\nto boost inter- and intra-disciplinary research and to leeway for new ideas.</p>\n<p>The 15th International Conference on Graph Transformation (ICGT 2022) <br>\nwill be held in Nantes, France, as part of STAF 2022 (Software <br>\nTechnologies: Applications and Foundations). The conference takes place <br>\nunder the auspices of EATCS and IFIP WG 1.3. Proceedings will be <br>\npublished by Springer in the Lecture Notes in Computer Science (LNCS) <br>\nseries.</p>\n<p>IMPORTANT DATES (updated)</p>\n<ul>\n<li>Abstract submission: February 28, 2022</li>\n<li>Paper submission: March 7, 2022</li>\n<li>Notification: April 18, 2022</li>\n<li>Camera-ready: May 9, 2022</li>\n<li>Conference: July 7-8, 2022</li>\n</ul>\n<p>Note: All times are end-of-day Anywhere on Earth.</p>\n<p>SPECIAL INTEREST TOPIC OF ICGT 2022: EXECUTABLE APPLIED CATEGORY THEORY</p>\n<p>A special focus of this conference will consist of new approaches to <br>\nformalizing the knowledge in the research field of graph transformation <br>\ntheory via proof assistants such as Coq. Referring to the homepage of <br>\nthe GReTA-ExACT workgroup for further information [1], a long-term goal <br>\nof this kind of approach will consist in establishing a Coq-enriched <br>\nwiki for our research field akin to the nLab. This platform will serve <br>\nas a sustainable mechanism for curating applied and mathematical <br>\nknowledge in graph transformation research, and eventually as a research <br>\ntool in its own right, notably through the provision of interactive <br>\ndatabase-supported proof construction. Another avenue of research will <br>\nconcern executable applied category theory (ExACT), i.e., code <br>\nextraction from formalized categorical structures, with the perspective <br>\nof curating a database of correct-by-construction reference prototype <br>\nalgorithms for various forms of graph transformation semantics and <br>\ngraph-like data structures. To introduce the initiative and facilitate <br>\nthe broad involvement of the ICGT community and collect feedback from <br>\nparticipants regarding the scope and format of such a wiki project, a <br>\npeer-reviewed brainstorming session is planned as one of the events at <br>\nthe conference.</p>\n<p>KEYNOTE</p>\n<p>In line with this special focus, we are delighted to announce a keynote <br>\nto be held by Christian Doczkal (Max-Planck Institute for Security and <br>\nPrivacy, Bochum, Germany). Christian Doczkal will present his work on a <br>\nlibrary of formalized graph theory results in Coq and share some of the <br>\nlessons learned along the way.</p>\n<p>SUBMISSIONS</p>\n<ul>\n<li>TOPICS OF INTEREST</li>\n</ul>\n<p>In order to foster a lively exchange of perspectives on the subject of <br>\nthe conference, the programme committee of ICGT 2022 encourages all <br>\nkinds of contributions related to graphs and graph transformation, <br>\neither from a theoretical point of view or a practical one.</p>\n<p>Topics of interest include, but are not limited to the following subjects:</p>\n<ul>\n<li>\n<p>General models of graph transformation (e.g. adhesive categories and <br>\nhyperedge replacement systems)</p>\n</li>\n<li>\n<p>Analysis and verification of graph transformation systems</p>\n</li>\n<li>Graph theoretical properties of graph languages</li>\n<li>Automata on graphs and parsing of graph languages</li>\n<li>Logical aspects of graph transformation</li>\n<li>Computational models based on graphs</li>\n<li>Structuring and modularization of graph transformation</li>\n<li>Hierarchical graphs and decomposition of graphs</li>\n<li>Parallel, concurrent, and distributed graph transformation</li>\n<li>Term graph and string diagram rewriting</li>\n<li>Petri nets and other models of concurrency</li>\n<li>Business process models and notations</li>\n<li>Bigraphs and bigraphical reactive systems</li>\n<li>Graph databases and graph queries</li>\n<li>Model-driven development and model transformation</li>\n<li>\n<p>Model checking, program analysis and verification, simulation and <br>\nanimation</p>\n</li>\n<li>\n<p>Syntax, semantics and implementation of programming languages, <br>\nincluding domain-specific and visual languages</p>\n</li>\n<li>\n<p>Graph transformation languages and tool support</p>\n</li>\n<li>\n<p>Efficient algorithms (e.g. pattern matching, graph traversal, network <br>\nanalysis)</p>\n</li>\n<li>\n<p>Applications and case studies in software engineering (e.g. software <br>\narchitectures, refactoring, access control, and service-orientation)</p>\n</li>\n<li>\n<p>Applications to computing paradigms (e.g. bio-inspired, quantum, <br>\nubiquitous, and visual)</p>\n</li>\n<li>\n<p>Graph transformation and artificial intelligence (e.g., AI for graph <br>\ntransformations, applying graph transformations in AI engineering and <br>\nsearch-based software engineering)</p>\n</li>\n<li>\n<p>SUBMISSION GUIDELINES</p>\n</li>\n</ul>\n<p>Papers can be submitted via EasyChair [2] using Springer’s LNCS format <br>\n(cf. LNCS Overleaf template [3]). For regular and tool demonstration <br>\npapers, simultaneous submission to other conferences with proceedings or <br>\nsubmission of material that has already been published elsewhere is not <br>\nallowed. The page limits are strict and include references. At least one <br>\nauthor for each accepted paper must register before the early <br>\nregistration deadline and present the paper during the conference [4].</p>\n<p>Papers are solicited in three categories:</p>\n<ul>\n<li>\n<p>Regular papers (limited to 16 pages in Springer LNCS format) describe <br>\ninnovative contributions and are evaluated with respect to their <br>\noriginality, significance, and technical soundness. We also solicit case <br>\nstudies describing applications of graph transformation in any <br>\napplication domain. Additional material intended for reviewers but not <br>\nfor publication in the final version may be included in a clearly marked <br>\nappendix.</p>\n</li>\n<li>\n<p>Tool presentation papers (limited to 8 pages in Springer LNCS format) <br>\ndemonstrate the main features and functionality of graph-based tools. A <br>\ntool presentation paper may have an appendix with a detailed demo <br>\ndescription (up to 4 pages), which will be reviewed but not included in <br>\nthe proceedings.</p>\n</li>\n<li>\n<p>New ideas papers (limited to 2 pages in Springer LNCS format) report <br>\non relevant contributions to the theory or applications of graph <br>\ntransformation, which may have been published (or accepted for <br>\npublication) in a peer-reviewed conference other than ICGT, as a book <br>\nchapter or journal article since 2018. Papers in this category will be <br>\nselected for presentation at the conference according to their relevance <br>\nto the graph transformation community, and they will be considered for <br>\nthe special issues. Submissions will consist of a 2-page abstract. In <br>\ncase of extended abstracts of published papers, the submission must <br>\nrefer to the published paper and include the original paper in PDF.</p>\n</li>\n</ul>\n<p>SPECIAL ISSUE</p>\n<p>Authors of the best papers at the conference will be invited to prepare <br>\nand submit extended journal versions to be considered for publication in <br>\na special issue after an independent round of peer review. The special <br>\nissue will be published in the Journal of Logical and Algebraic Methods <br>\nin Programming (Elsevier).</p>\n<p>PROGRAM &amp; LOCAL INFORMATION</p>\n<p>TBA on the conference website [5].</p>\n<p>ORGANIZATION</p>\n<p>Program Chairs</p>\n<ul>\n<li>Nicolas Behr (CNRS, IRIF, Université de Paris, France)</li>\n<li>Daniel Strüber (Chalmers | University of Gothenburg, Sweden, and <br>\nRadboud University, Netherlands)</li>\n</ul>\n<p>Program Committee</p>\n<ul>\n<li>Paolo Baldan (Università degli Studi di Padova, Italy)</li>\n<li>Paolo Bottoni (Sapienza Università di Roma, Italy)</li>\n<li>Andrea Corradini (University of Pisa, Italy)</li>\n<li>Juan de Lara (Universidad Autónoma de Madrid, Spain)</li>\n<li>Juergen Dingel (Queen’s University Kingston, Ontario, Canada)</li>\n<li>Fabio Gadducci (University of Pisa, Italy)</li>\n<li>Holger Giese (Hasso Plattner Institute, University of Potsdam, Germany)</li>\n<li>Russ Harmer (CNRS, ENS Lyon, Université de Lyon, France)</li>\n<li>Reiko Heckel (University of Leicester, United Kingdom)</li>\n<li>Thomas Hildebrandt (University of Copenhagen, Denmark)</li>\n<li>Wolfram Kahl (McMaster University, Canada)</li>\n<li>Timo Kehrer (Humboldt-Universität zu Berlin, Germany)</li>\n<li>Aleks Kissinger (University of Oxford, United Kingdom)</li>\n<li>Barbara König (Universität Duisburg-Essen, Germany)</li>\n<li>\n<p>Leen Lambers (Technical University of Brandenburg (BTU) <br>\nCottbus-Sentenberg, Germany)</p>\n</li>\n<li>\n<p>Yngve Lamo (Western Norway University of Applied Sciences Bergen, Norway)</p>\n</li>\n<li>Koko Muroya (RIMS, Kyoto University)</li>\n<li>Fernando Orejas (Universitat Politècnica de Catalunya)</li>\n<li>Detlef Plump (University of York, United Kingdom)</li>\n<li>Arend Rensink (University of Twente Ensche<br>\n[message truncated]</li>\n</ul>",
        "id": 272785495,
        "sender_full_name": "Email Gateway",
        "timestamp": 1645526511
    }
]