[
    {
        "content": "<p>From: Jaap Boender &lt;<a href=\"mailto:jaapb@kerguelen.org\">jaapb@kerguelen.org</a>&gt;<br>\nHENSOLDT Cyber develops embedded IT products that meet the highest security <br>\nrequirements. It integrates an invulnerable operating system with security-<br>\nhardened hardware to build the most secure product on the global IT market. <br>\nThe company combines more than 50 years of domain experience with world-class <br>\nexpertise in hardware and software design to achieve global leadership.</p>\n<p>We are buidling up a new research team, which is working on cutting-edge <br>\nprojects targeting the aspects formal verification, operating system design and <br>\ncryptography with the focus on secure embedded systems. If you have a strong <br>\ninterest and/or background in secure operating system development, we would <br>\nlike to get in touch with you.</p>\n<p>TASKS</p>\n<ul>\n<li>\n<p>Research on formal verification of software, with a focus on deductive <br>\nverification</p>\n</li>\n<li>\n<p>Design new tools and methods to make verification possible in new areas, or <br>\nextend and improve existing tools to reduce verification effort</p>\n</li>\n<li>\n<p>Actively participate in international and national funded research and <br>\ncustomer projects</p>\n</li>\n<li>\n<p>Contribute to research communities and efforts, including publishing in top <br>\nconferences and relevant journals</p>\n</li>\n</ul>\n<p>REQUIREMENTS</p>\n<ul>\n<li>PhD in Computer Science, Mathematics or other comparable subject</li>\n<li>Demonstrable experience in theorem proving (e.g. Coq, Isabelle, Agda)</li>\n<li>\n<p>Strong publication record and demonstrated research capability (e.g. <br>\nobtained grants, patent submissions, etc.)</p>\n</li>\n<li>\n<p>Prior experience in software verification is a plus</p>\n</li>\n<li>Experience in hardware verification is a plus</li>\n<li>Experience in cryptography is a plus</li>\n<li>Experience in C/C++ programming would be an advantage</li>\n<li>\n<p>Proficiency in English (both written and spoken) and interest to work in a <br>\ntruly diverse cultural environment</p>\n</li>\n<li>\n<p>Excellent communication skills, teamwork spirit, initiative and autonomous <br>\nworking are required</p>\n</li>\n</ul>\n<p>We are not only offering flexible and mobile working, but the opportunity to be <br>\ninvolved in the development of cutting-edge security products in an <br>\ninternational and innovative environment.</p>\n<p>Did we spark your interest? Then we are looking forward to your application. <br>\nIf you have any questions on the vacancy please don't hesitate to contact us <br>\nvia mail (<a href=\"mailto:hr-cyber@hensoldt-cyber.com\">hr-cyber@hensoldt-cyber.com</a>).</p>\n<p>Apply directly through the website: <a href=\"https://hensoldt-cyber.com/job-offers/\">https://hensoldt-cyber.com/job-offers/</a><br>\n#job-549910</p>",
        "id": 213908971,
        "sender_full_name": "Email Gateway",
        "timestamp": 1603195689
    }
]