[
    {
        "content": "<p>From: Georg Weissenbacher &lt;<a href=\"mailto:georg.weissenbacher@tuwien.ac.at\">georg.weissenbacher@tuwien.ac.at</a>&gt;<br>\nOpen PhD position | 40 hours/week | 4 years</p>\n<p>TU Wien is Austria's largest institution of research and higher<br>\neducation in the fields of technology and natural sciences. With over<br>\n26,000 students and more than 4000 scientists, research, teaching and<br>\nlearning dedicated to the advancement of science and technology have<br>\nbeen conducted here for more than 200 years, guided by the motto<br>\n\"Technology for People\". As a driver of innovation, TU Wien fosters<br>\nclose collaboration with business and industry and contributes to the<br>\nprosperity of society.</p>\n<p>The novel interdisciplinary Marie Sklodowska-Curie COFUND doctoral<br>\ntraining programme LogiCS@TUWien - Logics for Computer Science Program<br>\nat TU Wien, co-funded by the European Commission, offers one full-time<br>\nPhD positions.</p>\n<p>The program is hosted by TU Wien, one of the most successful technical<br>\nUniversities in Europe and the largest one in Austria. The Faculty of<br>\nInformatics of TU Wien is a leading research and teaching institution<br>\nwhich consistently ranks among the top 100 computer science faculties<br>\nin the global Times Higher Education ranking. In the heart of Europe,<br>\nVienna has a prominent history in mathematics, computer science, and<br>\nlogic research, and offers one of the highest living standards in the<br>\nworld.</p>\n<p>The programme provides a 4-year long doctoral training for<br>\ninternational PhD candidates within an English-language curriculum.<br>\nThe doctoral positions are open to international high-potential<br>\nearly-stage researchers with a strong background in Logical Methods in<br>\nComputer Science and their applications in areas like Artificial<br>\nIntelligence, Databases, Verification, Algorithms, Security, and<br>\nCyber-Physical Systems. Each PhD candidate will be supervised by at<br>\nleast one of the LogiCS@TUWien professors, see<br>\n<a href=\"http://www.vcla.at/msca/supervisors\">http://www.vcla.at/msca/supervisors</a></p>\n<p>We are looking for exceptional candidates to allocate one position as<br>\na university assistant (Pre-Doc) for 4 years for 40 hours/week.<br>\nExpected start: Second half of 2022. Please see<br>\n<a href=\"http://www.vcla.at/msca/apply\">http://www.vcla.at/msca/apply</a> for the application requirements.<br>\nTasks:<br>\nDeepening of scientific knowledge and independent research work on the<br>\nspecific PhD topic<br>\nCollaboration on current research projects<br>\nPreparation of scientific publications and a PhD thesis in English<br>\nPresentation of research results at international conferences and<br>\nother scientific events<br>\nSuccessful completion of important milestones of the program, see<br>\n<a href=\"http://www.vcla.at/msca/training\">http://www.vcla.at/msca/training</a><br>\nParticipation in events organized by the program LogiCS@TUWien<br>\nYour profile:<br>\nCompletion of a Masters  and Bachelor degree or equivalent in computer<br>\nscience, computational logic, discrete mathematics or related<br>\ndisciplines, with outstanding academic performance<br>\nPrevious research experience in the subjects of the specific project<br>\nis highly desirable, see for details <a href=\"http://www.vcla.at/msca/topics\">http://www.vcla.at/msca/topics</a><br>\nExcellent skills in English communication and writing<br>\nActive readiness for scientific collaboration<br>\nTeam competences and problem-solving skills<br>\nPositive attitude and contribution to the work environment<br>\nStriving for continuous personal development<br>\nWe offer:<br>\nDiverse and exciting research projects on cutting edge topics, see<br>\n<a href=\"http://www.vcla.at/msca/topics\">http://www.vcla.at/msca/topics</a><br>\nContinuing personal and professional education and flexible working hours<br>\nHigh-quality supervision by renowned professors<br>\nAmple possibilities for building an international research network,<br>\ndoing internships, and establishing research collaborations<br>\nVery competitive salary<br>\nAdministrative support in study and life questions<br>\nCentral location with excellent accessibility (U1/U2/U4 Karlsplatz) in<br>\na city regularly ranked first worldwide for life quality<br>\nTU Wien is committed to increasing the proportion of women in<br>\nparticular in leadership positions. Female applicants are explicitly<br>\nencouraged to apply. Preference will be given to women when equally<br>\nqualified, unless reasons specific to a male applicant tilt the<br>\nbalance in his favour.</p>\n<p>People with special needs are equally encouraged to apply. In case of<br>\nany questions, please contact the confidant for disabled persons at<br>\nthe university, Mr. Gerhard Neustätter.<br>\nEntry level salary as a predoctoral researcher is covered by level B1<br>\nof the Austrian Collective Agreement for university staff, and<br>\nreceives a minimum of currently EUR 2.971,50/month for 40 hours/week<br>\n(14 times/year).</p>\n<p>We look forward to receiving your application until 10.09.2022</p>\n<p>NOTE: Please check eligibility criteria such as MSCA mobility rule,<br>\nearly-stage researchers and PhD qualification, see<br>\n<a href=\"http://www.vcla.at/msca/apply\">http://www.vcla.at/msca/apply</a></p>\n<p>For more detail please check our website <a href=\"http://www.vcla.at/msca/programme\">http://www.vcla.at/msca/programme</a></p>",
        "id": 297582166,
        "sender_full_name": "Email Gateway",
        "timestamp": 1662554874
    }
]