[
    {
        "content": "<p>From: Alexander Romanovsky &lt;<a href=\"mailto:cl-isabelle-users@lists.cam.ac.uk\">cl-isabelle-users@lists.cam.ac.uk</a>&gt;<br>\n6th International Conference on Reliability, Safety, and Security of Railway Systems (RSSRail)<br>\nPisa, November 26-28, 2025<br>\n<a href=\"https://rssrail2025.isti.cnr.it/\">https://rssrail2025.isti.cnr.it/</a><br>\nCall for participation<br>\nThe railway industry faces increasing pressure to improve system safety, to decrease production costs and time to market, to reduce carbon emissions and running costs, and to increase the capacity of the railway. Railway systems are now being integrated into larger multi-transport networks. Such systems require an even higher degree of automation at all levels of operation. These trends dramatically increase the complexity of railway applications and pose new challenges in developing novel methods of modelling, analysis, verification and validation to ensure their reliability, safety and security, as well as in supporting novel mechanisms and procedures to help make the case that development processes meet the mandated standards.<br>\nThis conference will bring together researchers and developers working on railway system reliability, security and safety to discuss how all of these requirements can be met in an integrated way. It is also vital to ensure that advances in research (in both academia and industry) are driven by the real industrial needs. This will help ensure that such advances are followed by effective industrial deployment. Another particularly important objective is to integrate advances in research into the current development processes and make them usable and scalable. Finally, a key goal is to develop advanced methods and tools that can ensure that the systems meet the requirements imposed by the regulatory standards and help in building the supportive arguments. This will be a working conference in which research challenges and progress will be discussed and evaluated by both researchers and engineers, focusing on their potential to be deployed in industrial settings.<br>\nTopics of Interest</p>\n<p>*   Safety in development processes and safety management<br>\n  *   Combined approaches to safety and security<br>\n  *   System and software safety analysis<br>\n  *   Formal modelling and verification techniques<br>\n  *   System reliability<br>\n  *   Validation according to the standards<br>\n  *   Safety and security argumentation<br>\n  *   Fault and intrusion modelling and analysis<br>\n  *   Evaluation of system capacity, energy consumption, cost, and their interplay<br>\n  *   Tool and model integration, tool chain<br>\n  *   Domain-specific languages and modelling frameworks<br>\n  *   Model reuse for reliability, safety and security<br>\n  *   Modelling for maintenance strategy engineering</p>\n<p>The programme is now available online - <a href=\"https://easychair.org/smart-program/RSSRail2025/\">https://easychair.org/smart-program/RSSRail2025/</a><br>\nTutorials - <a href=\"https://rssrail2025.isti.cnr.it/tutorials\">https://rssrail2025.isti.cnr.it/tutorials</a><br>\nInvited talks - <a href=\"https://rssrail2025.isti.cnr.it/keynotes\">https://rssrail2025.isti.cnr.it/keynotes</a><br>\nRegistration - <a href=\"https://rssrail2025.isti.cnr.it/registration\">https://rssrail2025.isti.cnr.it/registration</a></p>",
        "id": 542260118,
        "sender_full_name": "Email Gateway",
        "timestamp": 1759234792
    }
]