[
    {
        "content": "<p>From: Georg Weissenbacher &lt;<a href=\"mailto:georg.weissenbacher@tuwien.ac.at\">georg.weissenbacher@tuwien.ac.at</a>&gt;<br>\nThe Faculty of Informatics of TU Wien, one of the top-ranked faculties<br>\nof Informatics in Europe and located in Vienna, Austria, the world's most<br>\nlivable city, is seeking to hire a</p>\n<ul>\n<li>Full Professor in Programming Languages and Compilers *</li>\n</ul>\n<p>Application deadline: June 13, 2024 (<a href=\"http://jobs.tuwien.ac.at/Job/227767\">jobs.tuwien.ac.at/Job/227767</a>)<br>\nPosition to be filled as of October 1, 2025</p>\n<p>TU Wien's Faculty of Informatics is home to world-renowned researchers<br>\nin a wide range of areas including Logic and Computation, Information<br>\nSystems Engineering, Computer Engineering, and Visual Computing and<br>\nHuman-Centered Technology. Numerous initiatives such as the<br>\nCybersecurity Center (<a href=\"https://cysec.wien/\">https://cysec.wien/</a>) and the Center for Artificial<br>\nIntelligence and Machine Learning (<a href=\"https://caiml.org/\">https://caiml.org/</a>) demonstrate the<br>\nFaculty's strong focus on collaboration and interdisciplinarity.</p>\n<p>To complement and strengthen our existing expertise and research<br>\nexcellence, we are looking for a strong candidate with an outstanding<br>\nrecord in research and teaching in the field of Programming Languages and<br>\nCompilers, who will establish an internationally leading research<br>\ngroup at TU Wien.</p>\n<p>Desired areas of research and expertise may include but are not limited to:</p>\n<ul>\n<li>\n<p>Languages and compilers for emerging computing paradigms and<br>\n  specialized architectures</p>\n</li>\n<li>\n<p>AI-assisted code generation, compilation, and programming tools</p>\n</li>\n<li>Language-based security, privacy, and reliability</li>\n<li>Program analysis and formal guarantees for languages and compilers</li>\n<li>Domain-specific languages, Specification Languages, Modeling Languages</li>\n</ul>\n<p>More details can be found on <a href=\"https://informatics.tuwien.ac.at/news/2586\">https://informatics.tuwien.ac.at/news/2586</a></p>",
        "id": 436862298,
        "sender_full_name": "Email Gateway",
        "timestamp": 1714734535
    }
]