[
    {
        "content": "<p>From: Manuel Hermenegildo &lt;<a href=\"mailto:manuel.hermenegildo@imdea.org\">manuel.hermenegildo@imdea.org</a>&gt;</p>\n<hr>\n<p>SAS 2023</p>\n<p>30th Static Analysis Symposium</p>\n<p>Cascais (Lisbon), Portugal, Sun 22 - Tue 24, October 2023</p>\n<p><a href=\"https://2023.splashcon.org/home/sas-2023\">https://2023.splashcon.org/home/sas-2023</a></p>\n<hr>\n<p>The 30th Static Analysis Symposium, SAS 2023, will be co-located with<br>\nSPLASH 2023 in Cascais (Lisbon), Portugal.</p>\n<p>Static Analysis is widely recognized as a fundamental tool for program<br>\nverification, bug detection, compiler optimization, program understanding, and<br>\nsoftware maintenance. The series of Static Analysis Symposia has served as the<br>\nprimary venue for the presentation of theoretical, practical, and application<br>\nadvances in the area.</p>\n<p>IMPORTANT DATES</p>\n<p>All deadlines are AoE (Anywhere on Earth) </p>\n<ul>\n<li>Full paper submission: April 24, 2023 </li>\n<li>Artifact submission: April 29, 2023</li>\n<li>Author response period: June 11-14, 2023</li>\n<li>Notification: June 29, 2023</li>\n<li>Final version due: August 3, 2023</li>\n<li>Conference: Part of SPLASH, Oct 22-24, 2023</li>\n</ul>\n<p>TOPICS </p>\n<p>The technical program for SAS 2023 will consist of invited lectures<br>\nand presentations of refereed papers. Contributions are welcomed on<br>\nall aspects of static analysis, including, but not limited to:</p>\n<p>Abstract interpretation<br>\nAutomated deduction<br>\nData flow analysis<br>\nDebugging techniques<br>\nDeductive methods<br>\nEmerging applications<br>\nModel-checking<br>\nData science<br>\nProgram optimizations and transformations<br>\nProgram synthesis<br>\nProgram verification<br>\nMachine learning and verification<br>\nSecurity analysis<br>\nTool environments and architectures<br>\nTheoretical frameworks<br>\nType checking<br>\nDistributed or networked systems</p>\n<p>PAPER SUBMISSION</p>\n<p>All paper submissions will be judged on the basis of significance, relevance,<br>\ncorrectness, originality, and clarity. </p>\n<p>Submission link: <a href=\"https://easychair.org/conferences/?conf=sas2023\">https://easychair.org/conferences/?conf=sas2023</a></p>\n<p>We welcome regular papers as well as papers focusing on any of the<br>\nfollowing in the NEAT (New questions/areas, Experience, Announcement,<br>\nTool) category:</p>\n<ul>\n<li>Well-motivated discussion of new questions or new areas. </li>\n<li>Experience with static analysis tools, Industrial Reports, and Case Studies </li>\n<li>Brief announcements of work in progress </li>\n<li>Tool papers </li>\n</ul>\n<p>We do not impose a page limit for submitted papers but we encourage<br>\nbrevity as reviewers have a limited time that they can spend on each<br>\npaper. With the exception of experience papers, all other papers will<br>\nfollow a lightweight double-blind reviewing process.  The identity of<br>\nthe authors for the remaining papers will be known to the reviewers.</p>\n<p>Submissions can address any programming paradigm, including<br>\nconcurrent, constraint, functional, imperative, logic,<br>\nobject-oriented, aspect, multi-core, distributed, and GPU<br>\nprogramming.</p>\n<p>Papers must be written and presented in English. A submitted paper<br>\nmust describe original work and must not substantially overlap with<br>\npapers that have been published or that are simultaneously submitted<br>\nto a journal or a conference with refereed proceedings.</p>\n<p>All submitted papers will be judged on the basis of significance,<br>\nrelevance, correctness, originality, and clarity. The review process<br>\nwill include a rebuttal period where authors have the opportunity to<br>\nrespond to preliminary reviews on the paper.</p>\n<p>RADHIA COUSOT AWARD</p>\n<p>The program committee will select an accepted regular paper for the Radhia<br>\nCousot Young Researcher Best Paper Award in memory of Radhia Cousot and her<br>\nfundamental contributions to static analysis, as well as being one of the main<br>\npromoters and organizers of the SAS series of conferences.</p>\n<p>ARTIFACTS</p>\n<p>As in previous years, we encourage authors to submit a virtual machine image<br>\ncontaining any artifacts and evaluations presented in the paper. Artifact<br>\nsubmission is optional. Artifact evaluation will be concurrent with paper<br>\nreview.</p>",
        "id": 343394777,
        "sender_full_name": "Email Gateway",
        "timestamp": 1679410430
    }
]