[
    {
        "content": "<p>From: Manuel Eberl &lt;<a href=\"mailto:manuel@pruvisto.org\">manuel@pruvisto.org</a>&gt;<br>\nI'm very happy to be able to announce the founding of a new journal that <br>\nis very relevant to this community: The Annals of Formalized Mathematics <br>\n(<a href=\"https://afm.episciences.org\">https://afm.episciences.org</a>).</p>\n<p>The AFM is a MathOA-supported diamond open access overlay journal. It <br>\npublishes original articles about formalized mathematics and <br>\nmathematical applications of proof assistants, spanning many proof <br>\nassistant ecosytems. Papers should be written for an audience of <br>\nmathematicians and should not focus on the details of the tools <br>\nthemselves. Papers do not necessarily need to present novel mathematical <br>\nproofs but should describe the mathematical lessons learned during the <br>\nformalization process.</p>\n<p>Please keep the AFM in mind when you write up your next project, and <br>\nhelp us spread the word!</p>\n<p>Scientific advisory board:</p>\n<ul>\n<li>Jeremy Avigad, Carnegie Mellon University, Pittsburgh, PA (United States)</li>\n<li>Georges Gonthier, INRIA Saclay Île-de-France, Palaiseau (France)</li>\n<li>\n<p>Timothy Gowers, Collège de France, Paris (France) and Trinity College, <br>\nCambridge (United Kingdom)</p>\n</li>\n<li>\n<p>Tom Hales, University of Pittsburgh, Pittsburgh, PA (United States)</p>\n</li>\n<li>Sophie Morel, CNRS, École Normale Supérieure de Lyon (France)</li>\n</ul>\n<p>Editorial board:</p>\n<ul>\n<li>Antoine Chambert-Loir, Université Paris-Cité (France)</li>\n<li>Manuel Eberl, University of Innsbruck (Austria)</li>\n<li>Sébastien Gouëzel, CNRS, IRMAR Rennes (France)</li>\n<li>Alex Kontorovich, Rutgers University, Piscataway, NJ (United States)</li>\n<li>Marco Maggesi, Università di Firenze (Italy)</li>\n<li>Assia Mahboubi, INRIA Nantes (France)</li>\n<li>Colleen Robles, Duke University, Durham, NC (United States)</li>\n</ul>\n<p>Managing editors:</p>\n<ul>\n<li>Robert Y. Lewis, Brown University, Providence, RI (United States)</li>\n<li>Filippo A. E. Nuccio Mortarino Majno di Capriglio, Université Jean <br>\nMonnet Saint-Étienne (France)</li>\n</ul>",
        "id": 428442674,
        "sender_full_name": "Email Gateway",
        "timestamp": 1711167571
    }
]