[
    {
        "content": "<p>From: Andrei Popescu &lt;<a href=\"mailto:andrei.h.popescu@gmail.com\">andrei.h.popescu@gmail.com</a>&gt;<br>\nEVENT: Annual LMS/BCS-FACS Evening Seminar</p>\n<p>SPEAKER: Sam Staton, University of Oxford<br>\nTITLE: Programming-based foundations for statistics</p>\n<p>DATE: Thursday, 17 November 2022, Starting time: 18:00 UTC<br>\nVENUE: Online via Zoom<br>\nEVENT PAGE: <a href=\"https://www.lms.ac.uk/events/lectures/lms-bcs-facs-evening-seminars\">https://www.lms.ac.uk/events/lectures/lms-bcs-facs-evening-seminars</a><br>\nREGISTRATION LINK: <a href=\"https://www.lms.ac.uk/civicrm/event/register?id=88&amp;reset=1\">https://www.lms.ac.uk/civicrm/event/register?id=88&amp;reset=1</a></p>\n<p>Prior registration is required for attendance -- the registration site<br>\nwill close on Wednesday, 16 November, at 17:00</p>\n<p>SYNOPSIS</p>\n<p>Probabilistic programming is a popular tool for statistics and<br>\nmachine learning. The idea is to describe a statistical model as<br>\na program with random choices. The program might be a simulation<br>\nof a system, such as a physics model, a model of viral spread,<br>\nor a model of electoral behaviour. We can now carry out<br>\nstatistical inference over the system, for example, by running a<br>\nMonte Carlo simulation – running the simulation 100,000’s of<br>\ntimes.</p>\n<p>As I will discuss in this talk, the idea of treating statistical<br>\nmodels as computer programs also has a foundational appeal. If<br>\nwe can understand statistical models as programs, then the<br>\nfoundations of probability and statistics can be discussed in<br>\nterms of program semantics. There is a chance of new<br>\nfoundational perspectives on statistics, in terms of programming<br>\nlanguages and their formal methods.</p>\n<p>As I will explain, this programming-based foundation for<br>\nstatistics is attractive because there are some intuitively<br>\nsimple scenarios, such as inference over function spaces, which<br>\nhave an easy programming implementation, but for which the<br>\ntraditional mathematical interpretation is complicated.</p>\n<p>SPEAKER BIOGRAPHY</p>\n<p>Sam Staton is a Professor of Computer Science and Royal Society<br>\nUniversity Research Fellow at the University of Oxford. There he<br>\ncurrently runs an ERC grant \"Better Languages for Statistics\".<br>\nBefore arriving in Oxford in 2015, Sam spent time in Nijmegen,<br>\nParis, and Cambridge. His PhD was in Cambridge with Marcelo<br>\nFiore (2007). Sam's main research is in programming language<br>\ntheory, but he is also interested in logic and category theory.<br>\nHe has recent contributions in probabilistic programming<br>\nlanguages, and quantum computing and programming languages.</p>\n<p>Webpage: <a href=\"https://www.cs.ox.ac.uk/people/samuel.staton/main.html\">https://www.cs.ox.ac.uk/people/samuel.staton/main.html</a></p>",
        "id": 309591088,
        "sender_full_name": "Email Gateway",
        "timestamp": 1668430220
    }
]