[
    {
        "content": "<p>From: Besik Dundua &lt;<a href=\"mailto:bdundua@gmail.com\">bdundua@gmail.com</a>&gt;<br>\nThe 13th International Symposium on Algorithms and Complexity is planned to<br>\ntake place from 13 June to 16 June 2023 in Batumi, Georgia. It will follow<br>\nthe recent, very successful editions of CIAC 2021 in Larnaca, Cyprus, CIAC<br>\n2019 in Rome, Italy, CIAC 2017 in Athens, Greece, CIAC 2015 in Paris,<br>\nFrance and CIAC 2013 in Barcelona, Spain.</p>\n<p>LISTS OF TOPICS</p>\n<p>Authors are invited to submit papers presenting original and unpublished<br>\nresearch on algorithms and complexity. Typical areas include:</p>\n<p>algorithm design and analysis<br>\nsequential, parallel and distributed algorithms<br>\ndata structures<br>\ncomputational and structural complexity<br>\nlower bounds and limitations of algorithms<br>\nrandomized and approximation algorithms<br>\nparameterized algorithms and parameterized complexity classes<br>\nsmoothed analysis of algorithms<br>\nalternatives to the worst-case analysis of algorithms (e.g., algorithms<br>\nwith predictions)<br>\non-line computation and competitive analysis<br>\nstreaming algorithms<br>\nquantum algorithms and complexity<br>\nalgorithms in algebra, geometry, number theory and combinatorics<br>\ncomputational geometry<br>\nalgorithmic game theory and mechanism design<br>\nalgorithmic economics (including auctions and contests)<br>\ncomputational learning theory<br>\ncomputational biology and bioinformatics<br>\nalgorithmic issues in communication networks<br>\nalgorithms for discrete optimization (including convex optimization)<br>\nalgorithm engineering</p>\n<p>SUBMISSIONS</p>\n<p>Authors are invited to submit an extended abstract or full paper with at<br>\nmost 15 pages, excluding the title page and the references. The title page<br>\nconsists of the title of the paper, author information and the abstract.<br>\nThe first section of the paper should start on the next page.</p>\n<p>The usage of the LNCS style file is mandatory. No changes to font size,<br>\npage geometry, etc. are permitted. Late submissions and submissions not in<br>\nthe correct format will not be considered. Submissions will be through<br>\nEasyChair.</p>\n<p>The paper should contain a succinct statement of the issues and their<br>\nmotivation a summary of the results, a brief explanation of their<br>\nsignificance and a comparison to related work, accessible to<br>\nnon-specialists. Proofs omitted due to space constraints must be put into<br>\nan appendix, to be read by the PC members at their discretion.</p>\n<p>Simultaneous submission to other conferences with published proceedings or<br>\nto journals is not allowed.</p>\n<p>At least one author of each accepted paper will have to register for the<br>\nconference. For authors who cannot present their paper in person for a<br>\nsignificant reason, possibility for remote presentation may be offered.</p>\n<p>INVITED SPEAKERS (CONFIRMED)</p>\n<p>Friedhelm Meyer auf der Heide (University of Paderborn, Germany)</p>\n<p>Giuseppe Persiano (University of Salerno, Italy)</p>\n<p>Paul Spirakis (University of Liverpool, UK and CTI, Greece)</p>\n<p>PROGRAM COMMITTEE</p>\n<p>Hagit Attiya (The Technion, Israel)<br>\nVittorio Bil\\`{o} (University of Salento, Italy)<br>\nCostas Busch (Augusta University, USA)<br>\nGianlorenzo D’Angelo (Gran Sasso Science Institute, Italy)<br>\nAmin Coja-Oghlan (University of Frankfurt, Germany)<br>\nIoannis Emiris (Athena Research Center and University of Athens, Greece)<br>\nAntonio Fern\\’{a}ndez Anta (IMDEA Networks Institute, Spain)<br>\nNicola Galesi (Sapienza University of Rome, Italy)<br>\nKristoffer Arnsfelt Hansen (Aarhus University, Denmark)<br>\nAlexandros Hollender (EPFL, Switzerland)<br>\nChristos Kaklamanis (University of Patras and CTI, Greece)<br>\nNaoyuki Kamiyama (Kyushu University, Japan)<br>\nMarios Mavronicolas (University of Cyprus, Cyprus) - Chair<br>\nHendrik Molter (Ben-Gurion University of the Negev, Israel)<br>\nLeonidas Palios (University of Ioannina, Greece)<br>\nVicky Papadopoulou Lesta (European University Cyprus, Cyprus)<br>\nNicola Prezza (Ca’ Foscari University of Venice, Italy)<br>\nThomas Sauerwald (University of Cambridge, UK)<br>\nMaria Serna (Polytechnic University of Catalonia, Spain)<br>\nBlerina Sinaimeri (LUISS Guido Carli University, Italy)<br>\nShay Solomon (Tel Aviv University, Israel)<br>\nPaul Spirakis (University of Liverpool, UK and CTI, Greece)<br>\nDaniel \\v{S}tefankovi\\v{c} (University of Rochester, USA)<br>\nAdrian Vladu (IRIF, CNRS and University of Paris, France)<br>\nPeilin Zhong (Google Research New York, USA)</p>\n<p>ORGANIZATION CHAIR</p>\n<p>Besik Dundua (Kutaisi International University and Tbilisi State<br>\nUniversity, Georgia)</p>\n<p>PROCEEDINGS</p>\n<p>Accepted papers will be published in the proceedings of the symposium,<br>\nwhich will appear in the Lecture Notes in Computer Science series of<br>\nSpringer-Verlag. As usual, with the submission of the camera-ready version<br>\nof their accepted paper, authors will have to sign a copyright form.</p>\n<p>IMPORTANT DATES</p>\n<ul>\n<li>Deadline for submissions: November 16, 2022 (AoE)</li>\n<li>Author notification: January 16, 2023</li>\n<li>Camera-ready due:  February 6, 2023</li>\n</ul>\n<p>CONTACT INFORMATION</p>\n<p>Email: <a href=\"mailto:mavronic@ucy.ac.cy\">mavronic@ucy.ac.cy</a>, <a href=\"mailto:bdundua@gmail.com\">bdundua@gmail.com</a></p>",
        "id": 301365721,
        "sender_full_name": "Email Gateway",
        "timestamp": 1664426477
    }
]