[
    {
        "content": "<p>From: Alexander Baumgartner via Cl-isabelle-users &lt;<a href=\"mailto:cl-isabelle-users@lists.cam.ac.uk\">cl-isabelle-users@lists.cam.ac.uk</a>&gt;<br>\nUNIF 2021 - 35th International Workshop on Unification<br>\n             18th of July 2021, Buenos Aires, Argentina<br>\n<a href=\"https://www.uoh.cl/unif-2021/\">https://www.uoh.cl/unif-2021/</a></p>\n<p>SECOND CALL FOR PAPERS</p>\n<p>UNIF 2021 is associated with FSCD 2021 and will be a purely virtual event.</p>\n<p>TOPIC:</p>\n<p>Unification is concerned with the problem of identifying given (first-<br>\nor higher-order) terms, either syntactically or modulo a theory. It is<br>\na fundamental technique that is employed in various areas of Computer<br>\nScience and Mathematics. In particular, unification algorithms are key<br>\ncomponents in completion of term rewriting systems, resolution-based<br>\ntheorem  proving, and logic programming. But unification is, for<br>\nexample, also investigated in the context of natural language<br>\nprocessing, program analysis, types, modal logics, and in knowledge<br>\nrepresentation.</p>\n<p>UNIF 2021 is the 35th in a series of annual workshops on unification<br>\nand related topics. Just as its predecessors', the purpose of UNIF 2021<br>\nis to bring together researchers interested in unification theory and<br>\nits applications, as well as closely related topics, such as matching<br>\n(i.e., one-sided unification), anti-unification (i.e., the dual<br>\nproblem to unification), disunification (i.e., solving equations and<br>\ninequations) and the admissibility problem (which generalizes<br>\nunification in modal logics). It will provide a forum for presenting<br>\nrecent (even unfinished) work, and discuss new ideas and trends in<br>\nthis and related fields.</p>\n<p>Topics of interest of the workshop include syntactic and equational<br>\nunification algorithms, matching and constraint solving, unification<br>\nin modal, temporal, and description logics, higher order unification,<br>\nnarrowing, disunification, anti-unification, complexity issues,<br>\ncombination methods, implementation techniques, and applications.</p>\n<p>IMPORTANT DATES:</p>\n<p>Paper submission: April 16, 2021<br>\nNotification of acceptance: May 21, 2021<br>\nFinal version of accepted papers: June 18, 2021<br>\nWorkshop dates: July 18, 2021</p>\n<p>SUBMISSION INFORMATION:</p>\n<p>Following the tradition of UNIF, we call for submissions of extended<br>\nabstracts (5 pages) in EasyChair style, to be submitted electronically<br>\nas PDF through the EasyChair submission site:</p>\n<p><a href=\"https://easychair.org/conferences/?conf=unif2021\">https://easychair.org/conferences/?conf=unif2021</a></p>\n<p>Abstracts will be evaluated by the Program Committee (if necessary<br>\nwith support from external reviewers) regarding their significance for<br>\nthe workshop. We also allow submission of work presented/submitted<br>\nin/to another conference.</p>\n<p>Accepted abstracts will be presented at the workshop and made<br>\navailable at the Web-page of UNIF 2021.</p>\n<p>Depending on the number and quality of submitted papers, a special<br>\nissue of a journal is planned after the workshop, with full versions<br>\nof the papers going through the reviewing process according to the<br>\nstandards of the chosen journal (e.g., AMAI, JAR, JLC, MSCS).</p>",
        "id": 232727325,
        "sender_full_name": "Email Gateway",
        "timestamp": 1617269199
    }
]