[
    {
        "content": "<p>From: Yutaka Nagashima &lt;<a href=\"mailto:united.reasoning@gmail.com\">united.reasoning@gmail.com</a>&gt;<br>\nCall for Contributions: *Fifth International Workshop on Automated<br>\n(Co)inductive Theorem Proving &lt;<a href=\"https://wait2024.github.io/&gt;*\">https://wait2024.github.io/&gt;*</a><br>\n&lt;<a href=\"https://wait2024.github.io\">https://wait2024.github.io</a>&gt;<br>\nDear Isabelle users,</p>\n<p>(Please accept our apologies if you receive this call through multiple<br>\nchannels. We aim to ensure that all potentially interested parties are<br>\ninformed, but sometimes this leads to overlaps.)</p>\n<p>We are delighted to announce the Fifth International Workshop on Automated<br>\n(Co)inductive Theorem Proving &lt;<a href=\"https://wait2024.github.io\">https://wait2024.github.io</a>&gt;, an event<br>\ndedicated to the latest developments in inductive and coinductive methods<br>\nfor verification. This workshop is a significant gathering for researchers<br>\nand practitioners in the field, providing an invaluable opportunity to<br>\nexplore current challenges and innovations in computational verification.</p>\n<p>Key Themes:</p>\n<ul>\n<li>\n<p>Advances in inductive reasoning for recursive structures and<br>\nloop-containing programs.</p>\n</li>\n<li>\n<p>Developments in coinductive methods and their growing relevance in<br>\nverification and industrial applications.</p>\n</li>\n<li>\n<p>Cross-disciplinary collaboration to foster innovation in computational<br>\nverification methods, including SMT, HOL, FOL, etc.</p>\n</li>\n</ul>\n<p>Featured Speakers Announcement:</p>\n<p>We are thrilled to announce that this year's workshop will feature four<br>\ndistinguished invited speakers:</p>\n<ul>\n<li>\n<p><em>Prof. Andrei Voronkov</em> from the University of Manchester and *Ms. Petra<br>\nHozzová* from the Vienna University of Technology</p>\n</li>\n<li>\n<p><em>Prof. Dmitriy Traytel</em> from the University of Copenhagen</p>\n</li>\n<li><em>Dr. Stefan Hetzl</em> from the Vienna University of Technology</li>\n</ul>\n<p>Call for Abstracts:</p>\n<p>We invite you to submit an extended abstract showcasing your latest<br>\nresearch, findings, or ongoing studies in the field of automated<br>\n(co)inductive theorem proving. This is a fantastic platform to share your<br>\nwork with a diverse and expert audience, engage in intellectual exchange,<br>\nand contribute to the advancement of the field. We welcome studies and<br>\nfindings published within the last five years.</p>\n<p><em>Submission Guidelines:</em></p>\n<p>abstracts are to be sent to <a href=\"mailto:wait.in.france@gmail.com\">wait.in.france@gmail.com</a></p>\n<p><em>Length:</em><br>\n 1-2 pages excluding references.</p>\n<p><em>Recommended Format:</em></p>\n<p>easychair.cls (<a href=\"https://easychair.org/publications/easychair.zip\">https://easychair.org/publications/easychair.zip</a>)</p>\n<p><em>Important Dates:</em></p>\n<ul>\n<li>Abstract Submission Deadline: 15 May.</li>\n<li>Notification of Acceptance: 1 June.</li>\n</ul>\n<p><em>Workshop Format:</em><br>\nThe workshop will feature in-depth tutorials, talks by leading experts, and<br>\na panel discussion for interactive dialogue. It is an ideal setting for<br>\nnetworking, collaboration, and gaining new insights into the challenges and<br>\nopportunities in automated theorem<br>\nproving.</p>\n<p>*Remote Participation: *<br>\nWhile on-site attendance is encouraged to fully benefit from the<br>\ninteractive nature of the workshop, provisions for remote participation<br>\nwill be available for wider accessibility.</p>\n<p><em>Dissemination and Special Issue:</em><br>\nSelected abstracts and presentation slides will be published on the<br>\nworkshop website. There's also a plan for a special journal issue based on<br>\nthe workshop's theme, subject to participant interest.</p>\n<p><em>Join Us!</em><br>\nBe a part of this stimulating event to discuss, learn, and contribute to<br>\nthe future of automated (co)inductive theorem proving. Don’t miss this<br>\nopportunity to engage with a vibrant community and shape the future of<br>\nverification techniques. We look forward to your submissions and<br>\nparticipation!</p>\n<p>For more information, please visit our website &lt;<a href=\"https://wait2024.github.io\">https://wait2024.github.io</a>&gt; or<br>\ncontact the organizers, Yutaka Nagashima and Sorin Stratulat at<br>\n<a href=\"mailto:wait.in.france@gmail.com\">wait.in.france@gmail.com</a>.</p>",
        "id": 437166790,
        "sender_full_name": "Email Gateway",
        "timestamp": 1714946787
    }
]