[
    {
        "content": "<p><strong>From:</strong> Dmitriy Traytel &lt;<a href=\"mailto:cl-isabelle-users@lists.cam.ac.uk\">cl-isabelle-users@lists.cam.ac.uk</a>&gt;</p>\n<p>Two new entries further extend the already substantial HOL-CSP collection in the AFP: one allows terminating processes to return values; another extends processes with a layer of automata. Warning: concurrency inside!</p>\n<p>Parameterized Termination for Sequential Composition and Synchronization Product</p>\n<p>by Benoît Ballenghien</p>\n<p>Recently, parameterized termination has been introduced in HOL-CSP, allowing the termination event tick to carry a result value, in a way analogous to the return of a state monad. This conservative extension of the CSP theory required the generalization of several denotational definitions and the adaptation of numerous proofs. Since Isabelle2025, this work has been completed for the HOL-CSP, HOL-CSPM, and HOL-CSP_OpSem sessions. However, for two operators—namely sequential composition and the synchronization product—the most direct generalizations turn out to be conceptually unsatisfactory, in particular with respect to their interaction with SKIP. To address this issue, we introduce in this entry generalized versions of these operators that fully exploit the expressive power of parameterized termination; in particular, the resulting notion of sequential composition satisfies the monad laws. Building on these definitions, we establish a range of algebraic and operational laws, as well as fundamental properties such as continuity and non-destructiveness.</p>\n<p><a href=\"https://www.isa-afp.org/entries/HOL-CSP_PTick.html\">https://www.isa-afp.org/entries/HOL-CSP_PTick.html</a></p>\n<p>A Bridge between CSP Processes and Functional Automata</p>\n<p>by Benoît Ballenghien and Burkhart Wolff</p>\n<p>This entry develops the Proc-Omata framework on top of HOL-CSP and its extensions. Proc-Omata are defined from functional automata and come in four variants: deterministic, terminating deterministic, non-deterministic, and terminating non-deterministic. This subclass of processes combines the expressiveness of CSP with automata-like structure (reachability, enableness), making it particularly amenable to invariant-based reasoning. We lift sequential composition and synchronization product to the automata level through combination functions and prove compactification theorems that enable reasoning over large process architectures. An essential ingredient is the use of restriction spaces, which guarantees well-defined fixed points even in the non-deterministic setting. Finally, we illustrate the applicability of the framework with the Dining Philosophers, where compactification yields proofs that scale to an arbitrary finite but unbounded number of participants in this parameterized process architecture.</p>\n<p><a href=\"https://www.isa-afp.org/entries/HOL-CSP_Proc-Omata.html\">https://www.isa-afp.org/entries/HOL-CSP_Proc-Omata.html</a></p>\n<p>Enjoy!</p>",
        "id": 571734103,
        "sender_full_name": "Email Gateway",
        "timestamp": 1770143474
    }
]