[
    {
        "content": "<p>From: Erika Abraham &lt;<a href=\"mailto:abraham@informatik.rwth-aachen.de\">abraham@informatik.rwth-aachen.de</a>&gt;</p>\n<hr>\n<p>CALL FOR PAPERS: SC-Square 2023</p>\n<p>8th International Workshop on<br>\n    Satisfiability Checking and Symbolic Computation</p>\n<p>Tromso, Norway</p>\n<p>July 28, 2023</p>\n<p><a href=\"http://www.sc-square.org/CSA/workshop8.html\">http://www.sc-square.org/CSA/workshop8.html</a></p>\n<p>The workshop will be held at The Arctic University of Norway<br>\nin Tromso¸ as satellite event of the International Symposium<br>\non Symbolic and Algebraic Computation (ISSAC 2023).</p>\n<hr>\n<p>-- IMPORTANT DATES --</p>\n<p>Submission deadline: April 1, 2023<br>\nNotification:              May 15, 2023<br>\nFinal version due:     June 15, 2023<br>\nWorkshop date:         July 28, 2023<br>\nSubmission deadline for journal post-proceedings: October 15, 2023</p>\n<p>All deadlines are by the end of the day anywhere on earth.</p>\n<p>-- WORKSHOP SCOPE --</p>\n<p>Symbolic Computation is concerned with the efficient algorithmic<br>\ndetermination of exact solutions to complicated mathematical<br>\nproblems. Satisfiability Checking has recently started to tackle<br>\nsimilar problems but with different algorithmic and<br>\ntechnological solutions.</p>\n<p>The two communities share many central interests, but<br>\nresearchers from these two communities rarely interact. Also,<br>\nthe lack of common or compatible interfaces for tools is an<br>\nobstacle to their fruitful combination. Bridges between the<br>\ncommunities in the form of common platforms and road-maps are<br>\nnecessary to initiate an exchange, and to support and direct<br>\ntheir interaction. The aim of this workshop is to provide an<br>\nopportunity to discuss, share knowledge and experience across<br>\nboth communities.</p>\n<ul>\n<li>KEYNOTE SPEAKER --</li>\n</ul>\n<p>Haniel Barbosa (Universidade Federal de Minas Gerais, Brazil)</p>\n<p>-- SUBMISSIONS AND PARTICIPATION --</p>\n<p>The workshop series has emerged from an H2020 FETOPEN CSA project<br>\n\"SC-Square\", which ran from 2016 to 2018. It has been continued<br>\naiming at building bridges bewteen Satisfiability Checking and<br>\nSymbolic Computation. It is open for submission and participation<br>\nto everyone interested in the topics, whether or not they were<br>\nmembers or associates of the original project.</p>\n<p>The topics of interest include but are not limited to:</p>\n<ul>\n<li>\n<p>Satisfiability Checking for Symbolic Computation</p>\n</li>\n<li>\n<p>Symbolic Computation for Satisfiability Checking</p>\n</li>\n<li>\n<p>Applications relying on both Symbolic Computation<br>\n   and Satisfiability Checking</p>\n</li>\n<li>\n<p>Combination of Symbolic Computation and<br>\n   Satisfiability Checking tools</p>\n</li>\n<li>\n<p>Quantifier elimination and decision procedures and their<br>\n   embedding into computer algebra software and logic provers, including<br>\n   but not limited to SMT solvers</p>\n</li>\n</ul>\n<p>-- SUBMISSION GUIDELINES --</p>\n<p>We welcome submissions in the following categories:</p>\n<ul>\n<li>\n<p>Full papers on research, case studies or tool development<br>\n   should present unpublished work not submitted elsewhere<br>\n   (with a limit of 16 pages, not counting references)</p>\n</li>\n<li>\n<p>Extended abstracts on research, case studies or tool<br>\n   development should present unpublished (potentially ongoing)<br>\n   work not submitted elsewhere<br>\n   (2-4 pages, not counting references)</p>\n</li>\n<li>\n<p>Presentation-only submissions on already published work, work<br>\n   to be published elsewhere, or work in progress on SC-Square<br>\n   related open problems or future challenges. Furthermore,<br>\n   people from other scientific disciplines and industry and<br>\n   business are warmly invited to attend and describe their<br>\n   problems, challenges, goals, and expectations for the<br>\n   SC-Square community. Please submit an abstract for approval by<br>\n   the PC (with a limit of 2 pages).</p>\n</li>\n<li>\n<p>Posters</p>\n</li>\n</ul>\n<p>All submissions must be in English. Full papers and extended<br>\nabstracts must and use the new CEUR-ART format. All submissions<br>\nshould be entered to the EasyChair system before the submission<br>\ndeadline. Please declare the category of your submission by<br>\nprefixing the title on the EasyChair form with \"FULL\",<br>\n\"EA\", \"PRESENTATION\", or \"POSTER\", respectively.</p>\n<p>Submission implies a committment that, in case of acceptance, at<br>\nleast one of the authors attends and presents at the workshop.</p>\n<p>-- PROCEEDINGS --</p>\n<p>We plan to publish the proceedings of the workshop as a CEUR-WS<br>\nproceedings covering full papers and extended abstracts. Authors<br>\nmay opt out of this, should they prefer to publish the material<br>\nelsewhere.</p>\n<p>Furthermore, there will be post-proceedings in an issue of the<br>\nSpringer journal Mathematics in Computer Science dedicated to<br>\nthe workshop. Authors of all four categories are eligible for<br>\nsubmission of a corresponding journal article. Journal versions<br>\nof full papers require at least 30% new material compared to the<br>\nversion originally accepted. All journal submissions will be<br>\nthoroughly peer-reviewed according to the standards of the<br>\njournal.</p>\n<p>-- WORKSHOP CO-CHAIRS --</p>\n<ul>\n<li>Erika Abraham (RWTH Aachen University, Germany)</li>\n<li>Thomas Sturm (CNRS, France &amp; MPI Informatics, Germany)</li>\n</ul>\n<p>-- PROGRAM COMMITTEE --</p>\n<ul>\n<li>Anna Bigatti (University of Genoa, Italy)</li>\n<li>Curtis Bright (University of Windsor, Canada)</li>\n<li>Martin Bromberger (MPI Informatik Saarbruecken, Germany)</li>\n<li>Christopher Brown (United States Naval Academy, USA)</li>\n<li>James H. Davenport (University of Bath, UK)</li>\n<li>Matthew England (Coventry University, UK)</li>\n<li>Pascal Fontaine (University of Liege, Belgium)</li>\n<li>Juergen Gerhard (Maplesoft, Canada)</li>\n<li>Alberto Griggio (FBK, Italy)</li>\n<li>Hoon Hong (North Carolina State University, , USA)</li>\n<li>Ilias Kotsireas (Wilfrid Laurier University &amp; Maplesoft, Canada)</li>\n<li>Gereon Kremer (Certora, Israel)</li>\n<li>Alex Ozdemir (Stanford University, USA)</li>\n<li>Cesare Tinelli (Iowa State University, USA)</li>\n<li>Christoph Wintersteiger (Microsoft Cambridge, UK)</li>\n</ul>",
        "id": 340425101,
        "sender_full_name": "Email Gateway",
        "timestamp": 1678297062
    }
]