[
    {
        "content": "<p>From: Rohit Dureja &lt;<a href=\"mailto:rohit.dureja@gmail.com\">rohit.dureja@gmail.com</a>&gt;<br>\n(apologies for multiple copies)</p>\n<p>========================================================================<br>\n2022 Formal Methods in Computer-Aided Design (FMCAD): Call for Papers<br>\n========================================================================</p>\n<p>IMPORTANT DATES</p>\n<hr>\n<p>Abstract Submission: May 8, 2022<br>\nPaper Submission: May 15, 2022<br>\nAuthor Response: June 22 - 24, 2022<br>\nAuthor Notification: July 1, 2022<br>\nCamera-Ready Version: August 16, 2022</p>\n<p>All deadlines are 11:59 pm AoE (Anywhere on Earth)</p>\n<p>FMCAD Tutorial Day: Oct. 18, 2022<br>\nRegular Program: Oct. 19-21, 2022</p>\n<p>Part of the FMCAD 2022 program: FMCAD Student Forum</p>\n<p>CONFERENCE SCOPE AND PUBLICATION</p>\n<hr>\n<p>FMCAD 2022 is the twenty-second in a series of conferences on the theory<br>\nand applications of formal methods in hardware and system<br>\nverification. FMCAD provides a leading forum to researchers in academia<br>\nand industry for presenting and discussing groundbreaking methods,<br>\ntechnologies, theoretical results, and tools for reasoning formally<br>\nabout computing systems. FMCAD covers formal aspects of computer-aided<br>\nsystem design including verification, specification, synthesis, and<br>\ntesting.</p>\n<p>FMCAD employs a rigorous peer-review process. Accepted papers are<br>\npublished by TU Wien Academic Press under a Creative Commons license<br>\n(the authors retain the copyright) and distributed through the IEEE<br>\nXPlore digital library. There are no publication fees. At least one of<br>\nthe authors is required to register for the conference and present the<br>\naccepted paper.</p>\n<p>TOPICS OF INTEREST</p>\n<hr>\n<p>FMCAD welcomes submission of papers reporting original research on<br>\nadvances in all aspects of formal methods and their applications to<br>\ncomputer-aided design. Topics of interest include (but are not limited<br>\nto):</p>\n<ul>\n<li>\n<p>Model checking, theorem proving, equivalence checking, abstraction and<br>\nreduction, compositional methods, decision procedures at the bit- and<br>\nword-level, probabilistic methods, combinations of deductive methods<br>\nand decision procedures.</p>\n</li>\n<li>\n<p>Synthesis and compilation for computer system descriptions, modeling,<br>\nspecification, and implementation languages, formal semantics of<br>\nlanguages and their subsets, model-based design, design derivation and<br>\ntransformation, correct-by-construction methods.</p>\n</li>\n<li>\n<p>Application of formal and semi-formal methods to functional and<br>\nnon-functional specification and validation of hardware and software,<br>\nincluding timing and power modeling, verification of computing systems<br>\non all levels of abstraction, system-level design and verification for<br>\nembedded systems, cyber-physical systems, automotive systems and other<br>\nsafety-critical systems, hardware-software co-design and verification,<br>\nand transaction-level verification.</p>\n</li>\n<li>\n<p>Experience with the application of formal and semi-formal methods to<br>\nindustrial-scale designs; tools that represent formal verification<br>\nenablement, new features, or a substantial improvement in the<br>\nautomation of formal methods.</p>\n</li>\n<li>\n<p>Application of formal methods to verifying safety, connectivity and<br>\nsecurity properties of networks, distributed systems, smart contracts,<br>\nblock chains, and IoT devices.</p>\n</li>\n</ul>\n<p>SUBMISSIONS</p>\n<hr>\n<p>Submissions must be made electronically in PDF format via EasyChair:</p>\n<p><a href=\"https://easychair.org/conferences/?conf=fmcad2022\">https://easychair.org/conferences/?conf=fmcad2022</a></p>\n<p>Two categories of papers are invited: Regular papers, and Tool &amp; Case<br>\nStudy papers. Regular papers are expected to offer novel foundational<br>\nideas, theoretical results, or algorithmic improvements to existing<br>\nmethods, along with experimental impact validation where<br>\napplicable. Tool &amp; Case Study papers are expected to report on the<br>\ndesign, implementation or use of verification (or related) technology in<br>\na practically relevant context (which need not be industrial), and its<br>\nimpact on design processes.</p>\n<p>Both Regular and Tool &amp; Case study papers must use the IEEE Transactions<br>\nformat on letter-size paper with a 10-point font size. Papers in both<br>\ncategories can be either 8 pages (long) or 4 pages (short) in length not<br>\nincluding references. Short papers that describe emerging results,<br>\npractical experiences, or original ideas that can be described<br>\nsuccinctly are encouraged. Authors will be required to select an<br>\nappropriate paper category at abstract submission time. Submissions may<br>\ncontain an optional appendix, which will not appear in the final version<br>\nof the paper. The reviewers should be able to assess the quality and the<br>\nrelevance of the results in the paper without reading the appendix.</p>\n<p>Submissions in both categories must contain original research that has<br>\nnot been previously published, nor is concurrently submitted for<br>\npublication. Any partial overlap with published or concurrently<br>\nsubmitted papers must be clearly indicated. If experimental results are<br>\nreported, authors are strongly encouraged to provide the reviewers<br>\naccess to their data at submission time, so that results can be<br>\nindependently verified. The review process is single blind.</p>\n<p>Authors of accepted contributions will be required to sign the FMCAD<br>\ncopyright transfer form found here:<br>\n<a href=\"https://fmcad.or.at/pdf/copyright.pdf\">https://fmcad.or.at/pdf/copyright.pdf</a>.</p>\n<p>STUDENT FORUM</p>\n<hr>\n<p>Continuing the tradition of the previous years, FMCAD 2022 is hosting a<br>\nStudent Forum that provides a platform for graduate students at any<br>\ncareer stage to introduce their research to the wider Formal Methods<br>\ncommunity, and solicit feedback.</p>\n<p>Submissions for the event must be short reports describing research<br>\nideas or ongoing work that the student is currently pursuing, and must<br>\nbe within the scope of FMCAD. Work, part of which has been previously<br>\npublished, will be considered; the novel aspect to be addressed in<br>\nfuture work must be clearly described in such cases. All submissions<br>\nwill be reviewed by a select group of FMCAD program committee members.</p>\n<p>CO-LOCATED EVENTS</p>\n<hr>\n<p>14th International Conference on Verified Software: Theories, Tools, and<br>\nExperiments (VSTTE 2022): <a href=\"https://vstte22.fbk.eu/\">https://vstte22.fbk.eu/</a></p>\n<p>FMCAD 2022 COMMITTEES</p>\n<hr>\n<p>PROGRAM CHAIRS:</p>\n<p>Alberto Griggio Fondazione Bruno Kessler, Italy<br>\nNeha Rungta Amazon Web Services, Inc., CA, USA</p>\n<p>PROGRAM COMMITTEE:</p>\n<p>Erika Abraham RWTH Aachen University<br>\nJade Alglave University College London<br>\nJosh Berdine Facebook<br>\nPer Bjesse Synopsys Inc.<br>\nNikolaj Bjorner Microsoft Research<br>\nRoderick Bloem Graz University of Technology<br>\nSupratik Chakraborty IIT Bombay<br>\nSylvain Conchon Universite Paris-Sud<br>\nVijay D'Silva Google<br>\nRayna Dimitrova CISPA Helmholtz Center for Information Security<br>\nRohit Dureja IBM<br>\nGrigory Fedukovich Florida State University<br>\nArie Gurfinkel University of Waterloo<br>\nFei He Tsinghua University<br>\nAlexander Ivrii IBM<br>\nBarbara Jobstmann EPFL<br>\nTim King Google<br>\nKuldeep Meel National University of Singapore<br>\nSergio Mover École Polytechnique<br>\nAlexander Nadel Intel<br>\nAina Niemetz Stanford University<br>\nElizabeth Polgreen University of California Berkeley<br>\nRahul Purandare IIT-Delhi<br>\nAndrew Reynolds University of Iowa<br>\nMarco Roveri Università di Trento<br>\nKristin Yvonne Rozier Iowa State University<br>\nPhilipp Ruemmer Uppsala University<br>\nCristoph Scholl University of Freiburg<br>\nNatasha Sharygina USI Lugano<br>\nElena Sherman University of Iowa<br>\nSharon Shoham Tel Aviv University<br>\nAnna Slobodova Intel<br>\nChristoph Sticksel The Mathworks<br>\nMichael Tautschnig AWS<br>\nNestan Tsiskaridze Stanford University<br>\nYakir Vizel Technion<br>\nGeorg Weissenbacher Vienna University of Technology<br>\nMichael Whalen Amazon Web Services, Inc.</p>\n<p>STUDENT FORUM CHAIR:</p>\n<p>Mathias Preiner Stanford University, CA, USA</p>\n<p>SPONSORSHIP AND WEB CHAIR:</p>\n<p>Martin Jonáš Fondazione Bruno Kessler, Italy</p>\n<p>PUBLICATION CHAIR:</p>\n<p>Georg Weissenbacher TU Wien</p>\n<p>FMCAD STEERING COMMITTEE:</p>\n<p>Clark Barrett Stanford University, CA, USA<br>\nArmin Biere University of Freiburg, Germany<br>\nAnna Slobodova Intel Corporation, TX, USA<br>\nGeorg Weissenbacher TU Vienna, Austria</p>",
        "id": 275536295,
        "sender_full_name": "Email Gateway",
        "timestamp": 1647447485
    }
]