[
    {
        "content": "<p>From: Bartek Klin &lt;<a href=\"mailto:klin@mimuw.edu.pl\">klin@mimuw.edu.pl</a>&gt;<br>\nCSL’23 -- CALL FOR WORKSHOPS</p>\n<p><a href=\"https://csl2023.mimuw.edu.pl/\">https://csl2023.mimuw.edu.pl/</a></p>\n<p>Computer Science Logic 2023 (CSL’23) will be held in Warsaw, Poland, between 13 and 16 February 2023. Following the long tradition of this event, we invite researchers and practitioners to submit proposals for co-located workshops on topics relating to mathematical logic and computer science. Workshops can target the logic in computer science community in general, focus on particular applications, or highlight more specific issues or recent developments.</p>\n<p>Co-located events will take place Friday February 17, 2023 and will be held on the same premises as the main conference. Conference facilities are offered free of charge to the organisers. Workshops-only attendees will enjoy a significantly reduced registration fee.</p>\n<p>Detailed organisational matters such as paper submission and review process, or publication of proceedings, are up to the organisers of individual workshops. All accepted workshops/tutorials will be expected to have their program ready by 17 January 2023.</p>\n<p>Proposals for workshops should contain at least the following pieces of information:</p>\n<p>- name and contact details of the main organiser(s)<br>\n    - (if applicable:) names of additional organisers<br>\n    - title<br>\n    - preferred length of workshop (between half day and one day)<br>\n    - estimated number of attendees<br>\n    - short (up to one page) description of topic<br>\n    - (if applicable:) pointers to previous editions of the workshop, or to similar events<br>\n    - The publication plan (only invited speakers, no published proceedings, pre-/post-proceedings published with EPTCS/LNCS...).</p>\n<p>Proposals are invited to be submitted by email to <a href=\"mailto:e.pimentel@ucl.ac.uk\">e.pimentel@ucl.ac.uk</a>, no later than 20 April 2022. Selected events will be notified by 30 April 2022. The workshop selection committee consists of the CSL program chairs and the conference organisers.</p>\n<p>CSL 2023 is planned as a physical, in-person event, with certain support for remote presence, both for speakers and for other participants who are unable or unwilling to come.</p>\n<p>Depending on the pandemic situation, we may have to make a decision whether to cancel the physical component of the event or not. This should be definitely decided by the end of November 2022.</p>",
        "id": 276450818,
        "sender_full_name": "Email Gateway",
        "timestamp": 1648114830
    }
]