[
    {
        "content": "<p>From: Matt Kaufmann &lt;<a href=\"mailto:kaufmann@cs.utexas.edu\">kaufmann@cs.utexas.edu</a>&gt;<br>\n<strong>* SECOND CALL FOR PARTICIPATION </strong>*</p>\n<p><em>Apologies for multiple postings</em></p>\n<p>ACL2-2025</p>\n<p>19th International Workshop on the ACL2 Theorem Prover and Its<br>\n  Applications</p>\n<p>May 12-13, 2025, Austin, Texas, USA and also online</p>\n<p><a href=\"http://www.cs.utexas.edu/users/moore/acl2/workshop-2025/index.html\">http://www.cs.utexas.edu/users/moore/acl2/workshop-2025/index.html</a></p>\n<p>The 2025 ACL2 Workshop will be held in Austin, Texas, USA and online.<br>\nWe invite users of ACL2, users of other theorem provers, and persons<br>\ninterested in the applications of theorem proving technology to<br>\nattend.  There will be two invited keynote talks: \"Scaling Formal<br>\nVerification with Machine Learning\" by Swarat Chaudhuri (University of<br>\nTexas at Austin), and \"The Future of ACL2 Community\" by Warren<br>\nA. Hunt, Jr. (UT Austin) and Anna Slobodova (Arm Ltd).  See the above<br>\nwebsite for accepted papers as well as updates, which will include a<br>\nprogram with details on a pre-workshop reception on May 11 and a<br>\nbanquet on May 12.</p>\n<p>REGISTRATION</p>\n<p>Registration details (including free online-only registration) may be<br>\nfound at:</p>\n<p><a href=\"https://acl2.regfox.com/acl2-workshop-2025\">https://acl2.regfox.com/acl2-workshop-2025</a></p>\n<p>AIMS AND SCOPE (quoting from<br>\n<a href=\"https://www.cs.utexas.edu/users/moore/acl2/workshop-2025/index.html#scope\">https://www.cs.utexas.edu/users/moore/acl2/workshop-2025/index.html#scope</a>):</p>\n<p>The ACL2 Workshop series is the major technical forum for users of the<br>\nACL2 theorem proving system to present research related to the ACL2<br>\ntheorem prover and its applications. ACL2 is an industrial-strength<br>\nautomated reasoning system, the latest in the Boyer-Moore family of<br>\ntheorem provers. The 2005 ACM Software System Award was awarded to<br>\nBoyer, Kaufmann, and Moore for their work on ACL2 and the other<br>\ntheorem provers in the Boyer-Moore family.</p>\n<p>ACL2-2025 will be held in Austin, Texas, USA and also online, May<br>\n12-13, 2025.  The workshop will take place in person on the University<br>\nof Texas at Austin campus.  In addition to in-person participation,<br>\nthe workshop will support online participation for all talks and<br>\npresentations. The workshop will be the 19th in the series of ACL2<br>\nworkshops, which occur approximately every 18 months.  It will feature<br>\ntechnical papers as well as rump sessions that discuss ongoing<br>\nresearch.</p>\n<p>FOR MORE INFORMATION:</p>\n<p>See the website<br>\n<a href=\"https://www.cs.utexas.edu/users/moore/acl2/workshop-2025/index.html\">https://www.cs.utexas.edu/users/moore/acl2/workshop-2025/index.html</a><br>\nfor further information including accepted papers, organization,<br>\nvenue, and lodging.</p>",
        "id": 512284963,
        "sender_full_name": "Email Gateway",
        "timestamp": 1744713423
    }
]