[
    {
        "content": "<p>From: \"\\\"Laarman, A.W. (Alfons)\\\"\" &lt;<a href=\"mailto:cl-isabelle-users@lists.cam.ac.uk\">cl-isabelle-users@lists.cam.ac.uk</a>&gt;</p>\n<hr>\n<p>iFM 2023 - Call for Papers<br>\n      18th International Conference on integrated Formal Methods<br>\n             13-15 November 2023, Leiden, the Netherlands<br>\n<a href=\"https://ifm23.liacs.nl\">https://ifm23.liacs.nl</a></p>\n<hr>\n<p>IMPORTANT DATES<br>\nAbstract submission:              25 May 2023<br>\nPaper submission:                 1 June 2023<br>\nAcceptance notification:       10 August 2023<br>\niFM 2023 main conference: 13-15 November 2023</p>\n<p>OBJECTIVE AND SCOPE<br>\nIn the last decades, we have witnessed a proliferation of approaches<br>\nthat integrate several modelling, verification and simulation<br>\ntechniques, facilitating more versatile and efficient analysis of<br>\nsoftware-intensive systems. These approaches provide powerful support<br>\nfor the analysis of different functional and non-functional properties<br>\nof the systems, complex interaction of components of different nature as<br>\nwell as validation of diverse aspects of system behaviour. The iFM<br>\nconference series is a forum for discussing recent research advances in<br>\nthe development of integrated approaches to formal modelling and<br>\nanalysis. The conference covers all aspects of the design of integrated<br>\ntechniques, including language design, verification and validation,<br>\nautomated tool support and the use of such techniques in software<br>\nengineering practice. To credit the effort of tool developers, we use<br>\nEAPLS artefact badging &lt;<a href=\"https://eapls.org/pages/artifact_badges/\">https://eapls.org/pages/artifact_badges/</a>&gt;.</p>\n<p>Areas of interest include (but are not limited to):</p>\n<p>* Formal and semi-formal modelling notations<br>\n  * Combining formal methods with different performance, simulation and<br>\n    system analysis techniques</p>\n<p>* Program verification, model checking, and static analysis<br>\n  * Theorem proving, decision procedures and SAT/SMT solving<br>\n  * Runtime analysis, monitoring and testing<br>\n  * Program synthesis<br>\n  * Modelling, analysis and synthesis of cyber-physical, hybrid,<br>\n    embedded, probabilistic, distributed or concurrent systems</p>\n<p>* Abstraction and refinement<br>\n  * Model learning and inference<br>\n  * Approaches to integrating formal methods into software engineering<br>\n    practice or industry</p>\n<p>* Approaches to integrating formal methods into standardisation or<br>\n    certification processes</p>\n<p>* Formal methods for AI<br>\n  * Tools and case studies supporting the integration of formal methods</p>\n<p>PAPER CATEGORIES<br>\niFM 2023 solicits high-quality papers reporting research results and/or<br>\nexperience reports related to the overall theme of formal methods<br>\nintegration.</p>\n<p>We accept papers in the following categories:</p>\n<p>(1) Regular papers (limit 16 pages) on</p>\n<p>* original scientific research results<br>\n    * tools, their foundation and evaluations<br>\n    * applications of formal methods, including rigorous evaluations</p>\n<p>(2) Short papers (limit 6 pages) on</p>\n<p>* any subject of interest in the area of formal methods that can be<br>\n      described with sufficient detail within the page limit</p>\n<p>All page limits exclude the references. Appendices may be included, but<br>\nthey will only be read by a reviewer at their discretion.</p>\n<p>Regular and short papers must be original, unpublished, and not<br>\nsubmitted for publication elsewhere. Papers will undergo a thorough<br>\nreview process. Submissions will be judged on the basis of significance,<br>\nrelevance, correctness, originality and clarity.</p>\n<p>The submissions will be reviewed and selected for publication based on<br>\nthe above mentioned criteria as well as suitability to the conference’s<br>\ntechnical program.</p>\n<p>SUBMISSION GUIDELINES<br>\nSubmissions for all categories should be made using the iFM 2023<br>\nEasyChair site <a href=\"https://easychair.org/conferences/?conf=ifm2023\">https://easychair.org/conferences/?conf=ifm2023</a></p>\n<p>Submissions must be in PDF format, using the Springer LNCS style files.</p>\n<p>Springer requires that authors should consult Springer’s authors’ guidelines<br>\nand use their proceedings templates, either for LaTeX or for Word, for the <br>\npreparation of their papers. Springer encourages authors to include their <br>\nORCIDs in their papers. After a paper is accepted, the corresponding author <br>\nof each paper, acting on behalf of all of the authors of that paper, must <br>\ncomplete and sign a Consent-to-Publish form. The corresponding author <br>\nsigning the copyright form should match the corresponding author marked <br>\non the paper. Once the files have been sent to Springer, changes relating <br>\nto the authorship of the papers cannot be made.</p>\n<p>The conference proceedings will be published in Springer’s Lecture Notes<br>\nin Computer Science series. We will apply for a special issue of the Formal <br>\nAspects of Computing journal for extended versions of selected papers from <br>\niFM 2023, as well as a special issue of the Original Software Publication <br>\ntrack in Science of Computer Programming (see EAPLS Artifact Badging below).</p>\n<p>All accepted papers must be presented at the conference. At least one<br>\nauthor of each accepted paper must register to the conference by the<br>\nearly registration date.</p>\n<p>EAPLS ARTEFACT BADGING<br>\nReproducibility of experiments is crucial to foster an atmosphere of<br>\nopen, reusable and trustworthy research. To improve and reward<br>\nreproducibility and to give more visibility and credit to the effort of<br>\ntool developers in our community, authors of accepted papers will be<br>\ninvited to submit possible artefacts associated with their paper for<br>\nevaluation, and based on the level of reproducibility they will be<br>\nawarded one or more badges. See <a href=\"https://eapls.org/pages/artifact_badges/\">https://eapls.org/pages/artifact_badges/</a>. <br>\nArtefact submission is optional and the result of the artefact evaluation <br>\nwill not alter the paper’s acceptance decision.</p>\n<p>To credit the effort of tool developers, we plan to apply for a special<br>\nissue of the Original Software Publication track in Science of Computer <br>\nProgramming. Authors of selected artefacts will be invited to contribute <br>\nto this issue.</p>\n<p>GENERAL CHAIR<br>\nMarcello M. Bonsangue (LIACS, Leiden University, The Netherlands)</p>\n<p>PROGRAM COMMITTE CHAIRS<br>\nPaula Herber (University of Münster, Germany)<br>\nAnton Wijs (Eindhoven University of Technology, The Netherlands)</p>\n<p>PUBLICITY CHAIRS<br>\nAlfons Laarman (LIACS, Leiden University, The Netherland)</p>\n<p>PROGRAM COMMITTEE<br>\nWolfgang Ahrendt (Chalmers University, Sweden)<br>\nMaurice H. ter Beek (ISTI-CNR, Italy)<br>\nPetra van den Bos (University of Twente, The Netherlands)<br>\nAlessandro Cimatti (University of Trento, Italy)<br>\nDavid Safranek (Masaryk University, Czech Republic)<br>\nPedro D’Argenio (Universidad Nacional de Córdoba, Spain)<br>\nRichard DeFrancisco (Augusta University, Georgia, USA)<br>\nJohn Derrick (University of Sheffield, United Kingdom)<br>\nClaire Dross (AdaCore, France)<br>\nKarine Even-Mendoza (King’s College London, United Kingdom)<br>\nMarie Farrell (University of Manchester, United Kingdom)<br>\nCarlo A. Furia (Universita della Svizzera italiana, Switzerland)<br>\nDilian Gurov (KTH Stockholm, Sweden)<br>\nMarieke Huisman (University of Twente, The Nethrlands)<br>\nSebastian Junges (Radboud University, The Netherlands)<br>\nEinar Broch Johnson (University of Oslo, Norway)<br>\nNikolai Kosmatov (CEA List, CEA Saclay, France)<br>\nAlfons Laarman (Leiden University, The Netherlands)<br>\nMartin Leucker (University of Lübeck, Germany)<br>\nRosemary Monahan (Maynooth University, Ireland)<br>\nThomas Neele (Eindhoven University of Technology, The Netherlands)<br>\nWytse Oortwijn (TNO, The Netherlands)<br>\nJun Pang (University of Luxembourg, Luxembourg)<br>\nLuigia Petre (Åbo Akademi University, Finland)<br>\nGiles Reger (Amazon Web Services and University of Manchester, United Kingdom)<br>\nAnne Remke (University of Münster, Germany)<br>\nThomas Santen (Formal Assurance, Germany)<br>\nIna Schäfer (Karlsruhe Institute of Technology, Germany)<br>\nAna Sokolova (University of Salzburg, Germany)<br>\nSilvia Lizeth Tapia Tarifa (University of Oslo, Norway)<br>\nHeike Wehrheim (University of Oldenburg, Germany)<br>\nKirsten Winter (University of Queensland, Australia)<br>\nNaijun Zhan (Chinese Academy of Sciences, P.R. of China)</p>\n<p>© iFM 2023</p>",
        "id": 340433084,
        "sender_full_name": "Email Gateway",
        "timestamp": 1678299313
    }
]