[
    {
        "content": "<p>From: 伊藤洋介 &lt;<a href=\"mailto:glacier345@gmail.com\">glacier345@gmail.com</a>&gt;<br>\nDear Gunnar Teege,</p>\n<p>Thank you for sharing the tutorial.<br>\nThis is very helpful for me, and presumably for beginners.<br>\nI will let you know if I find any errors.</p>\n<p>Best regards,</p>\n<p>2024年3月25日(月) 18:27 Gunnar Teege &lt;<a href=\"mailto:gunnar.teege@unibw.de\">gunnar.teege@unibw.de</a>&gt;:</p>",
        "id": 429394938,
        "sender_full_name": "Email Gateway",
        "timestamp": 1711372087
    },
    {
        "content": "<p>From: Gunnar Teege &lt;<a href=\"mailto:gunnar.teege@unibw.de\">gunnar.teege@unibw.de</a>&gt;<br>\nDear Isabelle Community,</p>\n<p>when I started to use Isabelle some years ago I had no background in <br>\nformal proof systems other than a basic knowledge of mathematical <br>\nlogics. I found it very challenging to understand what the system does <br>\nand how it is used. The extensive documentation (which I appreciate a <br>\nlot in the meantime) was of limited help at the beginning: it is spread <br>\nacross several documents and it is either oriented towards specific <br>\napplications (the tutorials about program semantics) or requires <br>\nprofound knowledge of proof systems for understanding (the reference <br>\nmanual etc). It did not provide the orientation I needed for a thorough <br>\ninsight into the <em>language</em> used to write theories and proofs.</p>\n<p>At some point I started to turn my notes into a document to help my <br>\nstudents and research assistants with this task. It became much larger <br>\nthan expected, but it was perceived to be helpful. Then I decided that <br>\nit may be useful for others as well, if it covers a substantial part of <br>\nIsabelle and Isabelle/HOL. So I revised and extended it, while having <br>\nfun in exploring the features of Isabelle and Isabelle/HOL, and it again <br>\nbecame much larger than intended.</p>\n<p>Here I share the current state of the document. There are still some <br>\nparts missing and many possible improvements, but it should already give <br>\nan impression about what it intends to be. If you like it I will <br>\ncontribute it to the Isabelle community and extend and maintain it <br>\naccording to my capacities. Perhaps it can be helpful in further <br>\nenlarging the community of Isabelle users.</p>\n<p>Of course I appreciate all kinds of feedback, in particular, if you note <br>\nerrors, misconceptions or over-simplifications. And no, I do not expect <br>\nthat you proof-read a 200 pages document. Just get an impression.</p>\n<p>Best regards</p>\n<p>Gunnar Teege</p>\n<p><a href=\"/user_uploads/14278/YA5wwkxAdkRQ5l24NsUKk7be/man-isabelle.pdf\">man-isabelle.pdf</a><br>\n<a href=\"/user_uploads/14278/YPFlyi2fchiEd7aRv1_nersl/smime.p7s\">smime.p7s</a></p>",
        "id": 429446204,
        "sender_full_name": "Email Gateway",
        "timestamp": 1711381816
    }
]