[
    {
        "content": "<p>From: Giorgio Audrito &lt;<a href=\"mailto:cl-isabelle-users@lists.cam.ac.uk\">cl-isabelle-users@lists.cam.ac.uk</a>&gt;<br>\nECOOP is Europe’s longest-standing annual Programming Languages conference,<br>\nbringing together researchers, practitioners, and students to share their<br>\nideas and experiences in all topics related to programming languages,<br>\nsoftware development, systems and applications. ECOOP welcomes high quality<br>\nresearch papers relating to these fields in a broad sense. ECOOP was<br>\noriginally focused on object orientation, but now includes all practical<br>\nand theoretical investigations of programming languages, systems and<br>\nenvironments. ECOOP solicits innovative solutions to real problems as well<br>\nas evaluations of existing solutions.</p>\n<p>ECOOP is committed to affordable open access publishing. Recent year’s<br>\npublications have been published by Dagstuhl’s LIPIcs series under a<br>\nCreative Commons CC-BY license where the authors retain their copyright.<br>\nECOOP articles have been published without open access publishing fee and<br>\ncan be accessed via a DOI. LIPIcs is indexed in DBLP, Google Scholar,<br>\nScopus and others.</p>\n<p>In 2025, ECOOP will be hosted by the Software Engineering research group<br>\n&lt;<a href=\"https://selabhvl.github.io/\">https://selabhvl.github.io/</a>&gt; at the Høgskulen på Vestlandet (Western<br>\nNorway University of Applied Sciences) &lt;<a href=\"https://www.hvl.no/\">https://www.hvl.no/</a>&gt; in Bergen,<br>\nNorway, between June 30th and July 4th. More information can be found on<br>\nthe conference website: <a href=\"https://2025.ecoop.org\">https://2025.ecoop.org</a></p>\n<p>ECOOP Publicity Chair</p>\n<p>Giorgio Audrito, University of Turin, Italy<br>\n<a href=\"mailto:giorgio.audrito@unito.it\">giorgio.audrito@unito.it</a></p>\n<p>Important Dates</p>\n<p>-</p>\n<p>Mon 6 Jan 2025: Round 1 Submissions<br>\n   -</p>\n<p>Mon 17 - Tue 18 Feb 2025: Round 1 Author response deadline<br>\n   -</p>\n<p>Fri 28 Feb 2025: Round 1 Notification<br>\n   -</p>\n<p>Wed 5 Mar 2025: Round 2 Submissions<br>\n   -</p>\n<p>Tue 8 - Thu 10 Apr 2025: Round 2 Author response deadline<br>\n   -</p>\n<p>Fri 25 Apr 2025: Round 2 Notification<br>\n   -</p>\n<p>Mon 30 Jun 09:00 - Wed 2 Jul 18:00 2025: Main conference</p>\n<p>Submissions</p>\n<p>Submissions will be done through HotCRP &lt;<a href=\"https://ecoop25.hotcrp.com\">https://ecoop25.hotcrp.com</a>&gt; but<br>\nare not yet open at the time of this writing. Authors are asked to pick one<br>\nof the following paper categories:</p>\n<p>-</p>\n<p>Research. The most traditional category for papers that advance the<br>\n   state of the art.<br>\n   -</p>\n<p>Replication. An empirical evaluation that reconstructs a published<br>\n   experiment in a different context in order to validate the results of that<br>\n   earlier work.<br>\n   -</p>\n<p>Experience. Applications of known PL techniques in practice as well as<br>\n   tools. Industry papers will be reviewed by practitioners. We welcome<br>\n   negative results that may provide inspiration for future research.<br>\n   -</p>\n<p>Pearls/Brave New Ideas. Articles that either explain a known idea in an<br>\n   elegant way or unconventional papers introducing ideas that may take some<br>\n   time to substantiate. These papers may be short.</p>\n<p>Submission must not have been published, or have major overlap with<br>\nprevious work. In case of doubt, contact the PC chairs (listed below).<br>\nProceedings will be published in open access by Dagstuhl LIPIcs in the<br>\nDagstuhl LIPIcs LaTeX-style template (<br>\n<a href=\"https://submission.dagstuhl.de/series/details/LIPIcs#author\">https://submission.dagstuhl.de/series/details/LIPIcs#author</a>). To reduce<br>\nfriction when resubmitting, ACM’s PACMPL and TOPLAS formatted papers can be<br>\nsubmitted as such (with the understanding that if accepted, they will need<br>\nto be reformatted and reduced to the page limit).</p>\n<p>ECOOP uses double-anonymous reviewing. Authors’ identities are only<br>\nrevealed if a paper is accepted. Papers must omit author names and<br>\ninstitutions, and use the third person when referencing the authors’ own<br>\nwork. Nothing should be done in the name of anonymity that weakens the<br>\nsubmission; see the FAQ &lt;<a href=\"https://2024.ecoop.org/track/ecoop-2024-papers#FAQ\">https://2024.ecoop.org/track/ecoop-2024-papers#FAQ</a>&gt;.<br>\nIf in doubt, contact the chairs.</p>\n<p>There is no page limit on submissions, but authors must understand that<br>\nreviewers have a fixed time budget for each paper, so the length of the<br>\nfeedback is likely to be unaffected by length. Brevity is a virtue. Authors<br>\nalso have to consider that the camera-ready version must be (at most) 25<br>\npages in LIPIcs format (not including references).</p>\n<p>Authors will be given a three-day period to read and respond to the reviews<br>\nof their papers before the program committee meeting. Responses have no<br>\nlength limit.</p>\n<p>ECOOP will continue to have two deadlines for submissions. Papers submitted<br>\nin each round can be (a) accepted, (b) rejected, or (c) asked for<br>\nrevisions. Rejected papers that are submitted to the immediate next round<br>\ncan be desk-rejected if they do not sufficiently differ from the previous<br>\nsubmission. Revisions can be submitted at any later round. Papers retain<br>\ntheir reviewers during revision.</p>\n<p>Review Criteria</p>\n<p>Each paper will be evaluated based on the following criteria:</p>\n<p>-</p>\n<p>Soundness: How well the paper’s contributions are supported by rigorous<br>\n   application of appropriate research methods;<br>\n   -</p>\n<p>Significance: The extent to which the paper’s contributions are novel,<br>\n   original, and important, with respect to the existing body of knowledge;<br>\n   -</p>\n<p>Presentation: Whether the paper’s quality of writing meets the high<br>\n   standards of ECOOP.</p>\n<p>After author response and reviewer discussion, papers will be accepted if<br>\nthe PC decides that the paper meets our high bar for Soundness and<br>\nPresentation, and if one reviewer judges the paper to meet the bar for<br>\nSignificance. The goal of this process is to ensure quality of writing and<br>\nconfidence in results, while assuming that if one reviewer finds the paper<br>\nto be significant then there will be readers who do so as well.</p>\n<p>Artifact Evaluation and Intent</p>\n<p>To support replication of experiments, authors of research papers may<br>\nsubmit artifacts to the Artifact Evaluation Committee. They will be asked<br>\nwhether they intend to submit an artifact at submission time. It is<br>\nunderstood that some papers do not have artifacts. AEC members will serve<br>\non the extended review committee.</p>\n<p>Journal First and Journal After</p>\n<p>We have Journal First/After arrangements with ACM’s Transactions on<br>\nProgramming Languages and Systems (TOPLAS), Elsevier’s Science of Computer<br>\nProgramming (SCP) and AITO’s Journal of Object Technology (JOT).</p>\n<p>Only new research papers are eligible to be Journal First (JF). JF papers<br>\nwill have an extended abstract in the ECOOP proceedings. The deadline is<br>\nthe same as Round 1 of submissions and the notification is aligned with<br>\nRound 2 notification. TOPLAS JF papers should be submitted according to<br>\nthis announcement. SCP JF papers should follow this call for papers. JF<br>\npapers are presented at the conference and eligible for awards.</p>\n<p>Journal After (JA) papers are papers for which the authors request to be<br>\nconsidered for post conference journal publication. Once accepted by the<br>\nECOOP PC, these papers will be forwarded to the journal editors. Reviews<br>\nand reviewers will be forwarded and used at the editor’s discretion. JA<br>\npapers will have an extended abstract (up to 12 pages) in the conference<br>\nproceedings.</p>\n<p>Program Committee</p>\n<p>Chairs:</p>\n<p>-</p>\n<p>Jonathan Aldrich &lt;<a href=\"https://www.cs.cmu.edu/~aldrich/\">https://www.cs.cmu.edu/~aldrich/</a>&gt;, Carnegie Mellon<br>\n   University, United States<br>\n   -</p>\n<p>Alexandra Silva &lt;<a href=\"http://www.alexandrasilva.org/\">http://www.alexandrasilva.org/</a>&gt;, Cornell University,<br>\n   United States</p>\n<p>Members:</p>\n<p>-</p>\n<p>Elvira Albert, Complutense University of Madrid, Spain<br>\n   -</p>\n<p>Aaron Bembenek, University of Melbourne, Australia</p>\n<p>-</p>\n<p>Einar Broch Johnsen, University of Oslo, Norway<br>\n   -</p>\n<p>Luís Caires, University of Lisbon, Portugal<br>\n   -</p>\n<p>Farzaneh Derakhshan, Illinois Institute of Technology, United States<br>\n   -</p>\n<p>Werner Dietl, University of Waterloo, Canada<br>\n   -</p>\n<p>Sophia Drossopoulou, Imperial College London, United Kingdom<br>\n   -</p>\n<p>Serena Elisa Ponta, SAP Security Research<br>\n   -</p>\n<p>Sebastian Erdweg, JGU Mainz, Germany<br>\n   -</p>\n<p>João F. Ferreira, University of Lisbon, Portugal<br>\n   -</p>\n<p>Carla Ferreira, NOVA University Lisbon, Portugal<br>\n   -</p>\n<p>Elisa Gonzalez Boix, Vrije Universiteit Brussel, Belgium<br>\n   -</p>\n<p>Ping Hou, University of Oxford, United Kingdom<br>\n   -</p>\n<p>Jules Jacobs, Cornell University, United States<br>\n   -</p>\n<p>Sung-Shik Jongmans, Open University of the Netherlands, Netherlands<br>\n   -</p>\n<p>Robbert Krebbers, Radboud University Nijmegen, Netherlands<br>\n   -</p>\n<p>Mira Mezini, TU Darmstadt, Germany<br>\n   -</p>\n<p>Daniele Nantes-Sobrinho, Imperial College London, United Kingdom<br>\n   -</p>\n<p>Federico Olmedo, University of Chile, Chile<br>\n   -</p>\n<p>Albert Rubio, Complutense University of Madrid, Spain<br>\n   -</p>\n<p>Peter Thiemann, University of Freiburg, Germany<br>\n   -</p>\n<p>Niki Vazou, IMDEA Software Institute<br>\n   -</p>\n<p>Michael Vollmer, University of Kent, United Kingdom<br>\n   -</p>\n<p>Di Wang, Peking University, China<br>\n   -</p>\n<p>Pascal Weisenburger, University of St. Gallen, Switzerland<br>\n   -</p>\n<p>Max Willsey, UC Berkeley, United States<br>\n   -</p>\n<p>Tobias Wrigstad, Uppsala University, Sweden<br>\n   -</p>\n<p>Jingling Xue, UNSW Sydney, Australia<br>\n   -</p>\n<p>Wenjia Ye, National University of Singapore, Singapore<br>\n   -</p>\n<p>Lingming Zhang, University of Illinois at Urbana-Champaign, United States</p>",
        "id": 491023123,
        "sender_full_name": "Email Gateway",
        "timestamp": 1735327045
    }
]