[
    {
        "content": "<p>From: Talia Ringer &lt;<a href=\"mailto:tringer@cs.washington.edu\">tringer@cs.washington.edu</a>&gt;<br>\nHi all, hope you're doing well.</p>\n<p>In the fall, I'm teaching my second iteration of the Proof Automation<br>\n&lt;<a href=\"https://dependenttyp.es/classes/598fa2022.html\">https://dependenttyp.es/classes/598fa2022.html</a>&gt; class. Last semester, the<br>\nmain thing students struggled with was grasping the foundations of<br>\ndifferent proof assistants, since I didn't spend enough time explaining<br>\nthem. This semester I'm spending a few extra lectures on this.</p>\n<p>For one of those lectures, I'd like to look at the foundations of<br>\nIsabelle/HOL. I'm curious if you all have any recommended readings both for<br>\nme and for my students.</p>\n<p>Really two things are important to teach here, I think:</p>\n<p>- ephemeral proof objects / LCF-style proving (vs. Coq's explicit proof<br>\n   objects)</p>\n<p>- the HOL logic itself</p>\n<p>For the former, I know the history very well, but I still find it a little<br>\nhard to grasp the specifics well enough to teach them. Like, in the<br>\nabstract, I understand that proofs in Isabelle/HOL are correct by<br>\nconstruction, and so the kernel is more like the set of functions that can<br>\nbe used to construct the proof to begin with, at the very core, via some<br>\nclever ML engineering. And then explicit proof objects can be reconstructed<br>\nfrom those calls to the kernel if desired, and checked by an independent<br>\nkernel, but actually doing so is not very common.</p>\n<p>I think I just want something a bit more concrete than that. Can someone<br>\nlink me to the Isabelle/HOL kernel so I can show it to the class, for<br>\nexample? And how does automation interact with this in a way such that<br>\nguarantees are preserved? What are good readings for this---maybe the<br>\noriginal LCF work? I vaguely recall the paper that defines the type<br>\nsignature for tactics discussing this kind of thing.</p>\n<p>For the latter, I know the HOL is a classical higher-order logic based on<br>\nthe simply-typed predicate calculus. What confuses me a lot is the<br>\nseparation of the type system from the logic itself, especially since by<br>\nCurry-Howard one could imagine the logic itself as being analogous to a<br>\ntype system, I assume one that would *not *be simply typed. What are the<br>\npractical implications of this, also? Last semester, students were very<br>\nconfused about what dependent types bought that would be too hard to<br>\nexpress in Isabelle/HOL.</p>\n<p>Anyways, I'd appreciate any pointers for either of those, to take me from<br>\nmy current understanding to knowing enough to really teach this well.</p>\n<p>Talia</p>",
        "id": 293366096,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660473691
    },
    {
        "content": "<p>From: Lawrence Paulson &lt;<a href=\"mailto:lp15@cam.ac.uk\">lp15@cam.ac.uk</a>&gt;<br>\nDear Talia,</p>\n<p>Regarding the LCF approach: I wrote a blogpost here: <a href=\"https://lawrencecpaulson.github.io/2022/01/05/LCF.html\">https://lawrencecpaulson.github.io/2022/01/05/LCF.html</a></p>\n<p>I cite Mike Gordon's “From LCF to HOL: a short history”, but I forgot to include a free link. It’s here:</p>\n<p><a href=\"https://www.cl.cam.ac.uk/archive/mjcg/papers/HolHistory.pdf\">https://www.cl.cam.ac.uk/archive/mjcg/papers/HolHistory.pdf</a></p>\n<p>It’s interesting that many people today, even those firmly in the programming languages community, struggle with the idea that implementing type “thm” as an abstract data type immediately ensures soundness, through type-checking alone. (And they somehow conflate this with Curry–Howard, which is not connected in any way.) Maybe it’s because ADTs were trendy in the 1970s, before they were shunted aside by OOP, where the data abstraction barriers are intentionally porous.</p>\n<p>If you want to go further back in time, see \"A Metalanguage for interactive proof in LCF”:</p>\n<p><a href=\"https://dl.acm.org/doi/10.1145/512760.512773\">https://dl.acm.org/doi/10.1145/512760.512773</a></p>\n<p>Starting on page 124 you’ll find a detailed description of how to implement the syntax, inference rules and tactics of a simple logic.</p>\n<p>The Isabelle kernel is here: </p>\n<p><a href=\"https://isabelle.in.tum.de/repos/isabelle/file/tip/src/Pure/thm.ML\">https://isabelle.in.tum.de/repos/isabelle/file/tip/src/Pure/thm.ML</a></p>\n<p>Of course, it’s not just that file but everything that comes before, including tonnes of basic library code supporting syntax and even concurrency.</p>\n<p>Larry</p>",
        "id": 293377100,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660480006
    },
    {
        "content": "<p>From: Lawrence Paulson &lt;<a href=\"mailto:lp15@cam.ac.uk\">lp15@cam.ac.uk</a>&gt;<br>\nDear Talia,</p>\n<p>Regarding higher-order logic, you may find something of value in Section 5 of my bio of Mike Gordon:</p>\n<p><a href=\"https://arxiv.org/abs/1806.04002\">https://arxiv.org/abs/1806.04002</a></p>\n<p>I don’t know what you mean by \"the separation of the type system from the logic itself”. Types are intrinsic to higher-order logic. Church’s original paper, after all, is entitled \"A Formulation of the Simple Theory of Types” (<a href=\"https://doi.org/10.2307/2266170\">https://doi.org/10.2307/2266170</a>).</p>\n<p>By the way, Curry–Howard with simple types gives you only intuitionistic propositional logic. </p>\n<p>Regarding \"what dependent types bought that would be too hard to express in Isabelle/HOL”: to my mind, this remains one of the key scientific questions of our field. Dependent types are obviously more expressive, and yet dependent type systems have rigidities that we don’t have in simple type theory. A term has a unique type, so x : T(i) does not imply x : T(j) even if i=j, unless i and j are <em>definitionally equal</em>, a concept that’s all but meaningless in simple type theory. It’s notable that an Isabelle/HOL team was able to formalise schemes on their first attempt when none of us even knew what a scheme was, while the Lean team required three attempts. And we didn’t copy them either.</p>\n<p>Larry</p>",
        "id": 293402154,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660485110
    },
    {
        "content": "<p>From: Talia Ringer &lt;<a href=\"mailto:tringer@cs.washington.edu\">tringer@cs.washington.edu</a>&gt;<br>\nThanks, all helpful!</p>\n<p>With respect to separation of types and logic, by some lens, if you have<br>\nuniversal quantification over terms, you can view this as analogous to a<br>\nkind of dependent type. And yet the type system for the logic itself is<br>\nsimply typed, so there is separation between the type system that would be<br>\nanalogous to the logic by Curry-Howard, and the type system actually used<br>\ninside of the logic. I think this is what is so counterintuitive to the<br>\ntypes folks like me.</p>",
        "id": 293404683,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660486550
    },
    {
        "content": "<p>From: Talia Ringer &lt;<a href=\"mailto:tringer@cs.washington.edu\">tringer@cs.washington.edu</a>&gt;<br>\n(By Curry-Howard, I don't mean the limited correspondence between STLC and<br>\npropositional logic, I mean the generalized version wherein any logic can<br>\nbe viewed as a type system. IME this is what people mean by Curry-Howard<br>\nthese days.)</p>",
        "id": 293404872,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660486647
    },
    {
        "content": "<p>From: Lawrence Paulson &lt;<a href=\"mailto:lp15@cam.ac.uk\">lp15@cam.ac.uk</a>&gt;<br>\nAs a general remark, I think we’ve gone too far from Curry–Howard as revealing beautiful similarities between the formal systems for propositions and types, from a formal representation of Heating’s conception of intuitionistic logic. Now it is something that’s expected to solve all problems. Yet from the very beginning, there were practical issues. AUTOMATH incorporated related ideas, but people immediately saw the need for proof irrelevance. Now many type theories have a proof-irrelevant layer, which separates the types and propositions again. </p>\n<p>A philosophical difficulty, for me, is seeing the name of intuitionism’s arch-enemy (Curry) connected with a form of “constructive logic” that is formalistic enough that Curry would feel right at home.</p>\n<p>Larry</p>",
        "id": 293423874,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660497801
    },
    {
        "content": "<p>From: Ken Kubota &lt;<a href=\"mailto:mail@kenkubota.de\">mail@kenkubota.de</a>&gt;</p>\n<blockquote>\n<p>Regarding \"what dependent types bought that would be too hard to express in Isabelle/HOL”: to my mind, this remains one of the key scientific questions of our field. Dependent types are obviously more expressive, and yet dependent type systems have rigidities that we don’t have in simple type theory. A term has a unique type, so x : T(i) does not imply x : T(j) even if i=j, unless i and j are <em>definitionally equal</em>, a concept that’s all but meaningless in simple type theory.</p>\n</blockquote>\n<p>Dependent type systems are not necessarily restricted to terms with a unique type, they also can be implemented as a “Curry-style” system as defined in the classical sense:</p>\n<p>\"Systems of intersection types are usually “Curry-style” systems, in which types are assigned to untyped terms by rules and an infinite number of types may be assigned to one term, rather than “Church-style” systems, in which each term has a unique built-in type.\"<br>\n<a href=\"http://www.users.waitrose.com/~hindley/SomePapers_PDFs/2006CarHin,HistlamRp.pdf\">http://www.users.waitrose.com/~hindley/SomePapers_PDFs/2006CarHin,HistlamRp.pdf</a> &lt;<a href=\"http://www.users.waitrose.com/~hindley/SomePapers_PDFs/2006CarHin,HistlamRp.pdf\">http://www.users.waitrose.com/~hindley/SomePapers_PDFs/2006CarHin,HistlamRp.pdf</a>&gt; (p. 40)<br>\n    Bibliographical reference: [Cardone and Hindley, 2009] in: <a href=\"https://owlofminerva.net/files/fom_2018.pdf\">https://owlofminerva.net/files/fom_2018.pdf</a> &lt;<a href=\"https://owlofminerva.net/files/fom_2018.pdf\">https://owlofminerva.net/files/fom_2018.pdf</a>&gt;</p>\n<p>For example, in my logic R0, types are related to sets, such that a term has a type as soon it is established that it fulfils the definition of the set. For example, the term 3 can have both the type N (for natural numbers) and the type R (for real numbers).</p>\n<p>You can also implement substitution at the type level such that \"x : T(i) does\" (!) \"imply x : T(j)\" \"if i=j\".<br>\nThis was intended for R0, but not implemented, since further research is needed: \"An implementation of a substitution rule directly at the type (subscript) level appeared too experimental to the author and was removed, since further case studies (here using the recursion operator R) should be undertaken.\"<br>\n<a href=\"https://www.owlofminerva.net/files/formulae.pdf#page=12\">https://www.owlofminerva.net/files/formulae.pdf#page=12</a> &lt;<a href=\"https://www.owlofminerva.net/files/formulae.pdf#page=12\">https://www.owlofminerva.net/files/formulae.pdf#page=12</a>&gt;</p>\n<p>Since HOL was created for practical purposes (hardware verification), it uses a natural deduction variant of Church's type theory from 1940:<br>\n    Mike Gordon on the development of HOL: “The design of HOL was largely taken ‘off the shelf,’ the theory being classical higher order logic and the implementation being LCF. The development of the system was, at first, primarily driven by hardware verification case studies.” [Gordon, 2000, p. 174] – <a href=\"https://owlofminerva.net/files/fom_2018.pdf#page=15\">https://owlofminerva.net/files/fom_2018.pdf#page=15</a> &lt;<a href=\"https://owlofminerva.net/files/fom_2018.pdf#page=15\">https://owlofminerva.net/files/fom_2018.pdf#page=15</a>&gt;</p>\n<p>However, Church's original simple theory of types is a Hilbert-style system, which is (from a logical point of view) more concise.<br>\nThe most elegant reformulation of Church's theory of types is Peter B. Andrews' logic Q0 (which is, of course, a Hilbert-style system):<br>\n<a href=\"https://plato.stanford.edu/archives/sum2018/entries/type-theory-church/#ForBasEqu\">https://plato.stanford.edu/archives/sum2018/entries/type-theory-church/#ForBasEqu</a> &lt;<a href=\"https://plato.stanford.edu/archives/sum2018/entries/type-theory-church/#ForBasEqu\">https://plato.stanford.edu/archives/sum2018/entries/type-theory-church/#ForBasEqu</a>&gt;<br>\n    Bibliographical reference: [Andrews, 2002, pp. 210–215] in: <a href=\"https://owlofminerva.net/files/fom_2018.pdf\">https://owlofminerva.net/files/fom_2018.pdf</a> &lt;<a href=\"https://owlofminerva.net/files/fom_2018.pdf\">https://owlofminerva.net/files/fom_2018.pdf</a>&gt;</p>\n<p>Referring to the famous quote from Andy Pitts in the HOL handbook:<br>\n    Andrew M. Pitts on the natural deduction system HOL in comparison to the axiomatic (Hilbert-style) deductive system Q0: “From a logical point of view, it would be better to have a simpler substitution primitive, such as ‘Rule R’ of Andrews’ logic Q0, and then to derive more complex rules from it.” [Gordon and Melham, 1993, p. 213] – <a href=\"https://owlofminerva.net/files/fom_2018.pdf#page=6\">https://owlofminerva.net/files/fom_2018.pdf#page=6</a> &lt;<a href=\"https://owlofminerva.net/files/fom_2018.pdf#page=6\">https://owlofminerva.net/files/fom_2018.pdf#page=6</a>&gt;</p>\n<p>Peter B. Andrews on equality as the basic primitive notion: “A formulation of type theory based on these ideas was introduced by Church in [Church, 1940], and proved complete by Henkin in [Henkin, 1950]. In this system equality can be defined using connectives and quantifiers. However, it is also possible to define connectives and quantifiers in terms of equality. Equality is a very basic and simple notion, so instead of using Church’s formulation of type theory, we shall use a slight variant of it (first introduced in [Henkin, 1963] and simplified in [Andrews, 1963]) in which equality is taken as the basic primitive notion.” [Andrews, 2002, p. 208] – <a href=\"https://owlofminerva.net/files/fom_2018.pdf#page=5\">https://owlofminerva.net/files/fom_2018.pdf#page=5</a> &lt;<a href=\"https://owlofminerva.net/files/fom_2018.pdf#page=5\">https://owlofminerva.net/files/fom_2018.pdf#page=5</a>&gt;</p>\n<p>I have never been convinced of the philosophical relevance of the Curry-Howard isomorphism.<br>\nMathematics should be expressed naturally (Andrews), hence directly, unencoded, not encoded in some manner.<br>\nFinding parallels in mathematical structures may be fascinating for some mathematicians, but I do not see any foundational character of this isomorphism in a philosophical sense.<br>\nThe Curry-Howard isomorphism seems to be of incidental nature, and not of foundational nature.</p>\n<hr>\n<p>Ken Kubota<br>\n<a href=\"https://doi.org/10.4444/100\">https://doi.org/10.4444/100</a></p>\n<blockquote>\n<p>Am 14.08.2022 um 19:22 schrieb Lawrence Paulson &lt;<a href=\"mailto:lp15@cam.ac.uk\">lp15@cam.ac.uk</a>&gt;:</p>\n<p>As a general remark, I think we’ve gone too far from Curry–Howard as revealing beautiful similarities between the formal systems for propositions and types, from a formal representation of Heating’s conception of intuitionistic logic. Now it is something that’s expected to solve all problems. Yet from the very beginning, there were practical issues. AUTOMATH incorporated related ideas, but people immediately saw the need for proof irrelevance. Now many type theories have a proof-irrelevant layer, which separates the types and propositions again. </p>\n<p>A philosophical difficulty, for me, is seeing the name of intuitionism’s arch-enemy (Curry) connected with a form of “constructive logic” that is formalistic enough that Curry would feel right at home.</p>\n<p>Larry</p>\n<p>On 14 Aug 2022, at 15:15, Talia Ringer &lt;<a href=\"mailto:tringer@cs.washington.edu\">tringer@cs.washington.edu</a>&gt; wrote:</p>\n<blockquote>\n<p>Thanks, all helpful!</p>\n<p>With respect to separation of types and logic, by some lens, if you have universal quantification over terms, you can view this as analogous to a kind of dependent type. And yet the type system for the logic itself is simply typed, so there is separation between the type system that would be analogous to the logic by Curry-Howard, and the type system actually used inside of the logic. I think this is what is so counterintuitive to the types folks like me.<br>\n</p>\n</blockquote>\n<p>On Sun, Aug 14, 2022, 6:51 AM Lawrence Paulson &lt;<a href=\"mailto:lp15@cam.ac.uk\">lp15@cam.ac.uk</a>&gt; wrote:</p>\n<blockquote>\n<p>Dear Talia,</p>\n<p>Regarding higher-order logic, you may find something of value in Section 5 of my bio of Mike Gordon:</p>\n<p><a href=\"https://arxiv.org/abs/1806.04002\">https://arxiv.org/abs/1806.04002</a></p>\n<p>I don’t know what you mean by \"the separation of the type system from the logic itself”. Types are intrinsic to higher-order logic. Church’s original paper, after all, is entitled \"A Formulation of the Simple Theory of Types” (<a href=\"https://doi.org/10.2307/2266170\">https://doi.org/10.2307/2266170</a>).</p>\n<p>By the way, Curry–Howard with simple types gives you only intuitionistic propositional logic. </p>\n<p>Regarding \"what dependent types bought that would be too hard to express in Isabelle/HOL”: to my mind, this remains one of the key scientific questions of our field. Dependent types are obviously more expressive, and yet dependent type systems have rigidities that we don’t have in simple type theory. A term has a unique type, so x : T(i) does not imply x : T(j) even if i=j, unless i and j are <em>definitionally equal</em>, a concept that’s all but meaningless in simple type theory. It’s notable that an Isabelle/HOL team was able to formalise schemes on their first attempt when none of us even knew what a scheme was, while the Lean team required three attempts. And we didn’t copy them either.</p>\n<p>Larry</p>\n<p>On 14 Aug 2022, at 11:40, Talia Ringer &lt;<a href=\"mailto:tringer@cs.washington.edu\">tringer@cs.washington.edu</a>&gt; wrote:</p>\n<blockquote>\n<p>For the latter, I know the HOL is a classical higher-order logic based on the simply-typed predicate calculus. What confuses me a lot is the separation of the type system from the logic itself, especially since by Curry-Howard one could imagine the logic itself as being analogous to a type system, I assume one that would not be simply typed. What are the practical implications of this, also? Last semester, students were very confused about what dependent types bought that would be too hard to express in Isabelle/HOL.<br>\n</p>\n</blockquote>\n</blockquote>\n</blockquote>",
        "id": 293454722,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660527066
    }
]