[
    {
        "content": "<p>From: Mathias Fleury &lt;<a href=\"mailto:mathias.fleury12@gmail.com\">mathias.fleury12@gmail.com</a>&gt;<br>\nSAT/SMT/AR 2024: International Summer School on Satisfiability, <br>\nSatisfiability Modulo Theories, and Automated Reasoning<br>\n<a href=\"https://sat-smt-ar-school.gitlab.io/www/2024/index.html\">https://sat-smt-ar-school.gitlab.io/www/2024/index.html</a><br>\nJune 26-29, 2024, Nancy, France</p>\n<p>Satisfiability (SAT), Satisfiability Modulo Theories (SMT), and <br>\nAutomated Reasoning (AR) continue to make rapid advances and find novel <br>\nuses in a wide variety of applications, both in computer science and <br>\nbeyond. The SAT/SMT/AR Summer School aims to bring a select group of <br>\nstudents up to speed quickly in this exciting research area. The school <br>\ncontinues the successful line of Summer Schools that ran from 2011 to 2022.</p>\n<p>We are pleased to announce that the next edition of the SAT/SMT/AR <br>\nSummer School will take place in Nancy, France from June 26 to June 29, <br>\n2024. The lectures planned this year are detailed on the website and <br>\ninclude a mix of basic and advanced theory as well as practical sessions.</p>\n<p>The school is intended for PhD students, Master students, and industrial <br>\npractitioners who want to get a good understanding of capabilities and <br>\ncurrent research directions in the area of SAT, SMT, and Automated <br>\nReasoning. Prior knowledge in those areas is not required, but knowledge <br>\nof logic, general problem solving skills, good programming and math <br>\nskills are helpful.</p>\n<p>As the number of participants is limited, all prospective participants <br>\nwill have to apply by filling this form:</p>\n<p><a href=\"https://sondages.inria.fr/index.php/171451?lang=en\">https://sondages.inria.fr/index.php/171451?lang=en</a></p>\n<p>including:</p>\n<p>* a short CV (at most 3 pages, including publications, if any),<br>\n  * a letter of motivation written by the applicant (1 page),<br>\n  * for students, the name of a supervisor from which to ask a<br>\n    supporting email (1 paragraph).</p>\n<p>The letter should explain the motivation for attending the Summer <br>\nSchool. Based on the application letters approximately 50 participants <br>\nwill be chosen from all qualified applicants. Admitted participants will <br>\nthen be provided a link for registration. The registration cost will be <br>\n/free/. Students that need travel support may indicate so in the <br>\napplication form. Students that have a paper accepted at IJCAR and plan <br>\nto attend the conference are encouraged to apply for the Woody Bledsoe <br>\naward (<a href=\"https://cadeinc.org/WoodyBledsoeAward\">https://cadeinc.org/WoodyBledsoeAward</a>). Information on how to <br>\napply is available on the IJCAR 2024 website ( <br>\n<a href=\"https://merz.gitlabpages.inria.fr/2024-ijcar/post/bledsoe/\">https://merz.gitlabpages.inria.fr/2024-ijcar/post/bledsoe/</a> ).</p>\n<p>Applications to the SAT/SMT/AR Summer School close on the 10th of May. <br>\nFor more information, see the webpage: <br>\n<a href=\"https://sat-smt-ar-school.gitlab.io/www/2024/index.html\">https://sat-smt-ar-school.gitlab.io/www/2024/index.html</a></p>",
        "id": 437240137,
        "sender_full_name": "Email Gateway",
        "timestamp": 1714993676
    }
]