[
    {
        "content": "<p>From: MACKENZIE Carlin &lt;<a href=\"mailto:s1724780@sms.ed.ac.uk\">s1724780@sms.ed.ac.uk</a>&gt;<br>\nDear all,</p>\n<p>We (Carlin MacKenzie, James Vaughan and Jacques Fleuriot) would like to present a prototype of our redesign of the Archive of Formal Proofs. Our earlier survey (<a href=\"https://arxiv.org/abs/2104.01052\">https://arxiv.org/abs/2104.01052</a>) was a part of this project and informed our strategy.</p>\n<p>As well as a redesign, the are many new features, including:</p>\n<p>*   A dynamic search with autocomplete and integration with FindFacts (a web interface to search the code of the AFP).<br>\n  *   Author pages which list all entries by an author.<br>\n     *   Similar pages for topics (which can be found on an entry page).<br>\n  *   Related entries have been added to entry pages where appropriate.<br>\n  *   A new browse theories interface. All scripts appear on one page and can be directly navigated to from the entry page.<br>\n     *   Additionally, there are links to jump directly to specific lemmas from the sidebar. We will continue to improve this feature.<br>\n  *   New Help and Contribution pages in the menu.<br>\n  *   The metadata of the AFP can now be downloaded from the Download page.</p>\n<p>The prototype can be accessed at:</p>\n<p><a href=\"https://afp.theoremproving.org/\">https://afp.theoremproving.org/</a></p>\n<p>Please note that this project is unaffiliated with the AFP and that this website is not a replacement for the official archive.</p>\n<p>As this is still a work in progress, we would be grateful to hear your thoughts and feedback. We intend to open-source the code at the end of the project and are open to collaborations.</p>\n<p>Regards,<br>\nCarlin MacKenzie, James Vaughan and Jacques Fleuriot<br>\nThe University of Edinburgh<br>\nThe University of Edinburgh is a charitable body, registered in Scotland, with registration number SC005336. Is e buidheann carthannais a th' ann an Oilthigh Dhùn Èideann, clàraichte an Alba, àireamh clàraidh SC005336.</p>",
        "id": 237156708,
        "sender_full_name": "Email Gateway",
        "timestamp": 1620046833
    }
]