[
    {
        "content": "<p>From: Sunjay Cauligi &lt;<a href=\"mailto:sunjay.cauligi@mpi-sp.org\">sunjay.cauligi@mpi-sp.org</a>&gt;<br>\nDear Fellow Researchers,</p>\n<p>We welcome submissions to the 17th Workshop on Programming Languages and Analysis for Security (PLAS 2022). This year PLAS is uniquely designed to make it as easy as possible for authors to simply focus on science: No proceedings, no registration fees, no travel, no page limits or complex submission formats - just share and discuss your great ideas with fellow researchers in the areas of programming languages and security.</p>\n<p>We look forward to receiving your submissions by November 14th, 2022.</p>\n<p>Best regards,<br>\nMusard Balliu and Sunjay Cauligi</p>\n<hr>\n<p>PLAS 2022 Call for Papers<br>\n17th Workshop on Programming Languages and Analysis for Security (PLAS 2022)</p>\n<p><a href=\"https://plas2022.github.io/\">https://plas2022.github.io/</a> &lt;<a href=\"https://plas2022.github.io/\">https://plas2022.github.io/</a>&gt;<br>\nVirtual Event <br>\nDecember 12, 2022</p>\n<hr>\n<p>Important Dates</p>\n<p>Paper submission: November 14, 2022 (AoE)<br>\nAuthor notification: November 30, 2022<br>\nWorkshop date: December 12, 2022</p>\n<hr>\n<p>PLAS provides a forum for exploring and evaluating the use of programming language and program analysis techniques for promoting security in the complete range of software systems, from compilers to machine-learned models and smart contracts. The workshop encourages proposals of new, speculative ideas, evaluations of new or known techniques in practical settings, and discussions of emerging threats and problems. We also host position papers that are radical, forward-looking, and lead to lively and insightful discussions influential to the future research at the intersection of programming languages and security. </p>\n<p>The scope of PLAS includes, but is not limited to: </p>\n<p>Language-based techniques for detecting and eliminating side-channel vulnerabilities <br>\nProgramming language techniques and verification applied to security in other domains (e.g. adversarial learning and smart contracts)<br>\nSoftware isolation techniques (e.g., SFI and sandboxing) and compiler-based hardening techniques (e.g, secure compilation). <br>\nCompiler-based security mechanisms (e.g. security type systems) or runtime-based security mechanisms (e.g. inline reference monitors)<br>\nTechniques for discovering and detecting security vulnerabilities, including program (binary) analysis and fuzzing<br>\nAutomated introduction and/or verification of security enforcement mechanisms<br>\nLanguage-based verification of security properties in software, including verification of cryptographic protocols<br>\nSpecifying and enforcing security policies for information flow and access control<br>\nModel-driven approaches to security<br>\nSecurity concerns for Web programming languages<br>\nLanguage design for security in new domains such as cloud computing and IoT<br>\nApplications, case studies, and implementations of these techniques</p>\n<hr>\n<p>We invite both short papers and long papers. All submissions should be anonymous. For short papers, we especially encourage the submission of position papers that are likely to generate lively discussion as well as short papers covering ongoing and future work. </p>\n<p>Full papers: There is no page limit on long papers. Papers in this category are expected to have relatively mature content. Papers that present promising preliminary and exploratory work, or recently published work are particularly welcome in this category. Long papers may receive longer talk slots at the workshop than short papers, depending on the number of accepted submissions. <br>\nShort papers: should be at most 2 pages long, plus as many pages as needed for references. Papers that present radical, open-ended and forward-looking ideas are particularly welcome in this category. Authors submitting papers in this category must prepend the phrase \"Short Paper:\" to the title of the submitted paper. <br>\nThe workshop has no published workshop proceedings and there is no restriction on paper format other than the page limits stated above. Presenting a paper (either short or long) at the workshop does not preclude submission to or publication in other venues that are before, concurrent, or after the workshop. Papers presented at the workshop will be made available to workshop participants only.</p>",
        "id": 306245409,
        "sender_full_name": "Email Gateway",
        "timestamp": 1666792570
    }
]