[
    {
        "content": "<p>From: Andrei Popescu &lt;<a href=\"mailto:andrei.h.popescu@gmail.com\">andrei.h.popescu@gmail.com</a>&gt;<br>\n<em>LMS/BCS-FACS Seminar 2025</em></p>\n<p><em>Wednesday 15 January 2025, from 19:00 (GMT)Online via Zoom</em></p>\n<p>*https://www.lms.ac.uk/events/lms-bcs-facs-seminar-2025<br>\n&lt;<a href=\"https://www.lms.ac.uk/events/lms-bcs-facs-seminar-2025&gt;*\">https://www.lms.ac.uk/events/lms-bcs-facs-seminar-2025&gt;*</a></p>\n<p>In association with the British Computer Society Formal Aspects of<br>\nComputing Science (BCS-FACS &lt;<a href=\"http://www.bcs.org/server.php?show=nav.12459\">http://www.bcs.org/server.php?show=nav.12459</a>&gt;),<br>\nthe LMS hosts an annual online seminar on aspects of the computer<br>\nscience–mathematics interface. These events are free to anyone who wishes<br>\nto attend and have attracted high-quality speakers.</p>\n<p>Speaker:</p>\n<p>Annabelle McIver (Macquarie University)</p>\n<p>*Probabilistic Datatypes: automating verification for abstract<br>\nprobabilistic reasoning*</p>\n<p>Abstract:</p>\n<p>Datatypes - in which data is encapsulated together with methods that access<br>\nit - play an important role in the organisation of large software projects.<br>\nCorrectness of datatypes has traditionally been carried out using<br>\nsimulation relations to simplify the verification by separating concerns:<br>\nthe datatype can be verified independently from the programs that use it,<br>\nwhilst those programs themselves can be verified using the specifications<br>\nof the datatype's methods. Use of these principles enables complex programs<br>\nto be brought within reach of automated proof.</p>\n<p>When probabilistic choice is included, however, it turns out that obtaining<br>\nsimilar simplifications of the verification problem will require<br>\ndistinguishing between \"hidden\" and \"observable\" probabilistic behaviour -<br>\nif demonic choice is allowed in the surrounding program. And that is not<br>\nrequired in the non-probabilistic setting: the crucial issue is the<br>\npotential interaction of probabilistic- and demonic choice.</p>\n<p>In the main part of this talk I will use examples to explain why the<br>\ninteraction is problematic, and I will suggest how extension of existing<br>\npGCL-based automated reasoning-tools, will by taking that interaction into<br>\naccount, enable automated probabilistic abstract reasoning about \"hard to<br>\ncrack\" probabilistic programs.</p>\n<p>Registration:</p>\n<p><em>To attend remotely via Zoom, please complete the registration form here</em><br>\n&lt;<a href=\"https://www.lms.ac.uk/civicrm/event/info?reset=1&amp;id=139\">https://www.lms.ac.uk/civicrm/event/info?reset=1&amp;id=139</a>&gt;. You will receive<br>\nthe link to the meeting upon registration, as well as an automated reminder<br>\nemail sent 24 hours before the event is scheduled to start.</p>\n<p>For all queries regarding the seminar, please contact<br>\n<a href=\"mailto:lmscomputerscience@lms.ac.uk\">lmscomputerscience@lms.ac.uk</a>.</p>",
        "id": 489349688,
        "sender_full_name": "Email Gateway",
        "timestamp": 1734385529
    }
]