[
    {
        "content": "<p>From: AARON CRIGHTON &lt;<a href=\"mailto:crightoa@mcmaster.ca\">crightoa@mcmaster.ca</a>&gt;<br>\nHello Everyone,</p>\n<p>I have been working on a project in HOL-Algebra and have encountered an<br>\nissue with a certain kind of construction I'd like to perform. I would like<br>\nto prove some lemmas and perform constructions involving ring<br>\nlocalizations. I understand that there is an AFP submission which<br>\nconstructs the localization of a ring at a multiplicative subset, but I was<br>\nhoping I could formulate an abstract locale for a ring R and a localization<br>\nof that ring in terms of the universal property of localizations. This<br>\nwould be desirable because in many cases the localization of a ring can<br>\narise in ways other than the canonical construction (such as when one is<br>\nalready working with a local ring). In my case, I would like to be able to<br>\nview localizations of the integers as subrings of the field of rational<br>\nnumbers. My first attempt at this definition was:</p>\n<p>locale abstract_localization = ring_hom_cring R S h +<br>\nmult_submonoid_of_crng R D for<br>\n                                R and S and h and D</p>\n<ul>\n<li>assumes localization_universal_property:<br>\n        \"⋀T ψ. ⟦ cring T; ψ ∈ ring_hom R T; ψ ` D ⊆ Units T⟧ ⟹<br>\n          (∃! φ. φ ∈ ring_hom R S ∩ extensional (carrier R) ∧<br>\n          (∀ a ∈ carrier R. φ (h a) = ψ a))  \"</li>\n</ul>\n<p>This definition does not work, however, because the locale fixes a type for<br>\nthe elements of the ring T in the axiom, and so the axiom only applies to<br>\nrings of this type. Of course this means that there will be many instances<br>\nof this locale satisfied by rings S which are not the localization of R.</p>\n<p>One workaround for this that I have considered would be to replace my axiom<br>\nwith the assertion that my ring is isomorphic to the concrete construction<br>\nof the localization from the AFP, and then prove a lemma which states that<br>\nthe universal property above is necessary and sufficient for verifying an<br>\ninstance of this locale.</p>\n<p>I was wondering if anyone might have any thoughts on a general way to do<br>\nthis kind of construction, or if there are reasons why this construction is<br>\nsuboptimal in HOL-Algebra.</p>\n<p>Thanks for your consideration,</p>\n<p>Aaron</p>",
        "id": 230404832,
        "sender_full_name": "Email Gateway",
        "timestamp": 1615836965
    }
]