[
    {
        "content": "<p>From: Temur Kutsia &lt;<a href=\"mailto:kutsia@risc.jku.at\">kutsia@risc.jku.at</a>&gt;<br>\nDue to requests, the submission deadline for the special issue of the<br>\nAnnals of Mathematics and Artificial Intelligence (AMAI) on Symbolic<br>\nComputation in Software Science has been extended to</p>\n<p>June 13, 2022.</p>\n<hr>\n<p>Call for submissions</p>\n<p>Annals of Mathematics and Artificial Intelligence<br>\nSpecial Issue on Symbolic Computation in Software Science  --<br>\nIn the Era of Computational and Artificial Intelligence</p>\n<p><a href=\"https://www.risc.jku.at/people/tkutsia/organization/amai-scss.html\">https://www.risc.jku.at/people/tkutsia/organization/amai-scss.html</a></p>\n<hr>\n<p>SCOPE</p>\n<hr>\n<p>In 2020, Annals of Mathematics and Artificial Intelligence (AMAI)<br>\ncelebrated its 30th anniversary. Over the years, the journal has<br>\npromoted better understanding of the application of quantitative,<br>\ncombinatorial, logical, algebraic and algorithmic methods to artificial<br>\nintelligence areas as diverse as decision support, automated deduction,<br>\nreasoning, knowledge-based systems, machine learning, computer vision,<br>\nrobotics and planning. AMAI special issues are intended to be<br>\ncollections of original research papers reflecting the intersection of<br>\nmathematics and a focused discipline demonstrating how each has<br>\ncontributed greatly to the other. A further goal of the journal is to<br>\nclose the gaps between the fields even further. Papers should report on<br>\ncurrent research in the appropriate areas, as well as more retrospective<br>\npapers in which progress has been ongoing over a period of time.</p>\n<p>The purpose of this special issue of AMAI is to promote research on<br>\ntheoretical and practical aspects of symbolic computation in software<br>\nscience, combined with recent artificial intelligence techniques.<br>\nSymbolic Computation is the science of computing with symbolic objects<br>\n(terms, formulae, programs, representations of algebraic objects etc.).<br>\nPowerful algorithms have been developed during the past decades for the<br>\nmajor subareas of symbolic computation: computer algebra and<br>\ncomputational logic. These algorithms and methods are successfully<br>\napplied in various fields, including software science, which covers a<br>\nbroad range of topics about software construction and analysis.<br>\nMeanwhile, artificial intelligence methods and machine learning<br>\nalgorithms are widely used nowadays in various domains and, in<br>\nparticular, combined with symbolic computation. Several approaches mix<br>\nartificial intelligence and symbolic methods and tools deployed over<br>\nlarge corpora to create what is known as cognitive systems. Cognitive<br>\ncomputing focuses on building systems which interact with humans<br>\nnaturally by reasoning, aiming at learning at scale.</p>\n<p>The special issue is related to the topics of the The 9th International<br>\nSymposium on Symbolic Computation in Software Science - SCSS 2021.<br>\nParticipants of the symposium, as well as other authors are invited to<br>\nsubmit contributions.</p>\n<p>TOPICS</p>\n<hr>\n<p>This special issue focuses on advanced results on the topics that<br>\ninclude, but are not limited to, the following:</p>\n<p>- software science-relevant applications of<br>\n      * automated reasoning, knowledge reasoning, common-sense<br>\nreasoning, reasoning in science</p>\n<p>* combinations of linguistic/learning-based and semantic/reasoning<br>\nmethods</p>\n<p>* algebras, co-algebras, categories, proof theory, model theory<br>\n      *  artificial intelligence and machine learning methods<br>\n  - algorithm (program) analysis, synthesis, verification<br>\n  - extraction of specifications from algorithms (programs)<br>\n  - algorithm (program) transformation<br>\n  - formal methods for network and system security<br>\n  - programming models<br>\n  - formalization and computerization of knowledge; large-scale computer<br>\nunderstanding of mathematics and science</p>\n<p>- alignment and joint processing of formal, semi-formal, and informal<br>\nlibraries</p>\n<p>- formal verification of artificial intelligence and machine learning<br>\nalgorithms, explainable artificial intelligence, symbolic artificial<br>\nintelligence</p>\n<p>- cognitive computing, cognitive vision, perception systems and<br>\nartificial reasoners for robotics</p>\n<p>- computational origami</p>\n<p>SUBMISSION</p>\n<hr>\n<p>This special issue welcomes original high-quality contributions that<br>\nhave been neither published in nor simultaneously submitted to any<br>\njournals or refereed conferences. Submissions will be peer-reviewed<br>\nusing the standard refereeing procedure of the Annals of Mathematics and<br>\nArtificial Intelligence.</p>\n<p>Submitted papers must be in English, prepared in LaTeX according to the<br>\nguidelines of the journal:<br>\n<a href=\"https://www.springer.com/journal/10472/submission-guidelines\">https://www.springer.com/journal/10472/submission-guidelines</a>.</p>\n<p>PDF versions of papers should be uploaded at the submission page</p>\n<p><a href=\"https://www.editorialmanager.com/amai\">https://www.editorialmanager.com/amai</a></p>\n<p>by June 13, 2022.</p>\n<p>Please choose S710: SCSS - Symbolic Computation in Software Science when<br>\nyou will be selecting the article type.</p>\n<p>GUEST EDITORS</p>\n<hr>\n<p>Adel Bouhoula (Arabian Gulf University, Bahrain)<br>\nBruno Buchberger (RISC, Johannes Kepler University Linz, Austria)<br>\nTetsuo Ida (University of Tsukuba, Japan)<br>\nTemur Kutsia (RISC, Johannes Kepler University Linz, Austria)</p>",
        "id": 283874139,
        "sender_full_name": "Email Gateway",
        "timestamp": 1653481144
    }
]