[
    {
        "content": "<p>From: Christine Rizkallah &lt;<a href=\"mailto:c.rizkallah@unsw.edu.au\">c.rizkallah@unsw.edu.au</a>&gt;<br>\nCALL FOR APPLICATIONS (<strong>DEADLINE: November 1 AoE</strong>)</p>\n<p>ACM SIGPLAN Programming Languages Mentoring Workshop, Philadelphia, Pennsylvania</p>\n<p>Tuesday, January 18, 2022</p>\n<p>PLMW is co-located with POPL 2022, which takes place \"in person\" in Philadelphia. PLMW will feature lightweight options for \"remote participation\" (details below).</p>\n<p>Web page: <a href=\"https://popl22.sigplan.org/home/PLMW-2022\">https://popl22.sigplan.org/home/PLMW-2022</a></p>\n<p>After the success of the first ten Programming Languages Mentoring Workshops at POPL 2012-2021, we are announcing the 11th SIGPLAN Programming Languages Mentoring Workshop (PLMW), co-located with the virtual POPL 2022 and organized by Stephanie Balzer, Paul Downen, Robbert Krebbers, and Christine Rizkallah.</p>\n<p>The purpose of this mentoring workshop is to encourage graduate students and senior undergraduate students to pursue careers in programming language research. This workshop will bring together world leaders in programming languages research and teaching from academia and industry to provide (a) technical sessions on cutting-edge PL research and (b) mentoring sessions on how to prepare for a research career. The workshop will help students imagine how they might contribute to our research community.</p>\n<p>We especially encourage women and underrepresented minority students, and people with disabilities to attend PLMW.</p>\n<p>This workshop is part of the activities surrounding POPL, the Symposium on Principles of Programming Languages, and takes place the day before the main conference. One goal of the workshop is to make the POPL conference more accessible to newcomers. We hope that participants will stay through the entire conference.</p>\n<p>Because physical travel to the workshop location this year may be more difficult for some, there is also an option to attend PLMW remotely. Remote participants of PLMW will be able to view online videos of the workshop talks, access the PLMW Slack channel, and sign up for virtual mentoring sessions with experienced researchers.</p>\n<p>A number of sponsors (listed below) have generously donated scholarship funds for qualified students to attend PLMW. These scholarships can cover expenses (airfare, hotel, and registration fees) for attendance at both the workshop and the POPL conference.</p>\n<p>Students attending this year will get one year free student membership of SIGPLAN, unless they prefer to opt out during their application.</p>\n<p>The workshop registration is open to all. Students with alternative sources of funding are welcome as well.</p>\n<h1>APPLICATION for PLMW</h1>\n<p>The application can be accessed at the following URL:</p>\n<p><a href=\"https://forms.gle/tsQhsUyB2W4c6ps36\">https://forms.gle/tsQhsUyB2W4c6ps36</a></p>\n<p>The deadline for full consideration of funding is Monday, November 1. Please note on the application form whether you intend to attend PLMW in-person, or remotely.</p>\n<p>Confirmed sponsors (so far):</p>\n<ul>\n<li>NSF</li>\n<li>ACM SIGPLAN</li>\n<li>Jane Street</li>\n<li>Certora</li>\n<li>Correct Computation<br>\n<a href=\"/user_uploads/14278/Tj2g8TlX1nk8UWDcP6GbfokE/smime.p7s\">smime.p7s</a></li>\n</ul>",
        "id": 258654915,
        "sender_full_name": "Email Gateway",
        "timestamp": 1634871130
    }
]