[
    {
        "content": "<p>From: Alex Meyer &lt;<a href=\"mailto:alex153@outlook.lv\">alex153@outlook.lv</a>&gt;</p>\n<hr>\n<p>Bird's eye view is that Isabelle is __interactive__ theorem prover and in requires human intervention for the writing of theorems, definitions, proof suggestions. Leo III is trying to do the proof part automatically, without human intervention.</p>\n<p>Artificial intelligence (neural, symbolic, hybrid neuro-symbolic) is trying to do the human part of the interaction with Isabelle. It can go from proof suggestions (neural theorem proving) through the writing of the bodies of functions (program synthesis) up to the concept generation and computational creativity for the creation of interesting mathematical concepts and theories (e.g. <a href=\"http://ccg.doc.gold.ac.uk/simoncolton/\">http://ccg.doc.gold.ac.uk/simoncolton/</a>).</p>\n<p>I am big fan of <a href=\"https://people.idsia.ch/~juergen/\">https://people.idsia.ch/~juergen/</a>.</p>\n<p>And my view (as a student) is that AI community is in the need for the universal language of the knowledge representation, the most general language possible (that can be embedded in the neural networks and that can be extracted from the results of neural network computing). And my feeling is that Isabelle is exactly such language - it can express everything, it has strong tool support, it has the richest set of content (in comparison to Coq, Mizar or Lean).</p>\n<p>Of course the thesis \"it can express everything\" requires some caution (e.g. I am not sure how the termination requirement of the Isabelle code contradicts to this), but there are philosophical and empirical suggestions that very simple structures and rules (e.g. Isabelle/Pure) gan generate the complexity that is comparable to the Universe/Multiverse, see. e.g. <a href=\"https://www.wolframphysics.org/\">https://www.wolframphysics.org/</a></p>\n<p>We should be thankful to all those involved in building and maintaing Isabelle that we have this language, tools and culture of thoughts. There would not be possible the development of neuro-symbolic AI without the basis of the symbolic formalization efforts.</p>\n<p>Alex</p>",
        "id": 225367616,
        "sender_full_name": "Email Gateway",
        "timestamp": 1612564744
    }
]