[
    {
        "content": "<p>From: Gwen Salaün &lt;<a href=\"mailto:gwen.salaun@inria.fr\">gwen.salaun@inria.fr</a>&gt;<br>\nCall for Papers: FORMALISE 2025 </p>\n<p>13th International Conference on Formal Methods in Software Engineering </p>\n<p>27 and 28 April, 2025 </p>\n<p>co-located with ICSE 2025 (April 27-May 3, 2025), Ottawa, Canada </p>\n<p><a href=\"https://conf.researchr.org/home/Formalise-2025\">https://conf.researchr.org/home/Formalise-2025</a> </p>\n<p>Overview </p>\n<p>Historically, formal methods academic research and practical software development have had limited mutual interactions — except possibly in specialized domains such as safety-critical software. In recent times, the outlook has considerably improved: on the one hand, formal methods research has delivered more flexible techniques and tools that can support various aspects of the software development process: from user requirements elicitation, to design, implementation, verification and validation, as well as the creation of documentation. On the other hand, software engineering has developed a growing interest in rigorous techniques applied at scale. </p>\n<p>The FormaliSE conference series promotes work at the intersection of the formal methods and software engineering communities, providing a venue to exchange ideas, experiences, techniques, and results. We believe more collaboration between these two communities can be mutually beneficial by fostering the creation of formal methods that are practically useful and by helping develop higher-quality software. </p>\n<p>Originally a workshop event, since 2018 FormaliSE has been organized as a conference co-located with ICSE. The 13th edition of FormaliSE will also take place as a co-located conference of ICSE 2025. </p>\n<p>Areas of interest include but are not limited to: </p>\n<p>* </p>\n<p>requirements formalization and formal specification; </p>\n<p>* </p>\n<p>approaches, methods and tools for verification and validation; </p>\n<p>* </p>\n<p>formal approaches to safety and security related issues; </p>\n<p>* </p>\n<p>analysis of performance and other non-functional properties based on formal approaches; </p>\n<p>* </p>\n<p>scalability of formal method applications </p>\n<p>* </p>\n<p>integration of formal methods within the software development lifecycle (e.g., change management, continuous integration, regression testing, and deployment) </p>\n<p>* </p>\n<p>model-based engineering approaches; </p>\n<p>* </p>\n<p>correctness-by-construction approaches for software and systems engineering; </p>\n<p>* </p>\n<p>application of formal methods to specific domains, e.g., autonomous, cyber-physical, intelligent, and IoT systems; </p>\n<p>* </p>\n<p>formal methods for AI-based systems (FM4AI), and AI applied in formal method approaches (AI4FM); </p>\n<p>* </p>\n<p>formal methods in a certification context </p>\n<p>* </p>\n<p>case studies developed/analyzed with formal approaches </p>\n<p>* </p>\n<p>experience reports on the application of formal methods to real-world problems; </p>\n<p>* </p>\n<p>guidelines to use formal methods in practice; </p>\n<p>* </p>\n<p>usability of formal methods. </p>\n<p>Important dates : </p>\n<p>* </p>\n<p>Abstracts due: 18 November 2024 (AoE) - EXTENDED DEADLINE </p>\n<p>* </p>\n<p>Submissions: 25 November 2024 (AoE) - EXTENDED DEADLINE </p>\n<p>* </p>\n<p>Notifications: 13 January 2025 </p>\n<p>* </p>\n<p>Camera ready copies: 5 February 2025 </p>\n<p>* </p>\n<p>FormaliSE conference: 27-28 April 2025 </p>\n<p>Paper submission guidelines <br>\nWe accept papers in three categories: </p>\n<p>* </p>\n<p>Full research papers describing original research work and results. We encourage authors to include validation of their contributions by means of a case study or experiments. We also welcome research papers focusing on tools and tool development. </p>\n<p>* </p>\n<p>Case study papers discussing a significant application that suggests general lessons learned and motivates further research, or empirically validates theoretical results (such as a technique's scalability). </p>\n<p>* </p>\n<p>Research ideas papers describing new ideas in preliminary form, in a way that can stimulate interesting discussions at the conference, and suggest future work. </p>\n<p>All papers submitted to the FormaliSE 2025 conference must be written in English, must be unpublished original work, and must not be under review or submitted elsewhere at the time of submission. Submissions must comply with the FormaliSE's lightweight double-anonymous review process (see below). </p>\n<p>Full research papers and case study papers can take up to 10 pages including all text, figures, tables and appendices, but excluding references. Research ideas papers can take up to 4 pages, plus up to 1 additional page solely for references. </p>\n<p>To avoid that authors waste time fitting their papers into the stated limit at the expense of presentation clarity, paper lengths slightly exceeding the stated limit will still be considered, provided that the reviewers find that the presentation is of high quality. </p>\n<p>All submissions must be in PDF format and must conform to the IEEE conference proceedings template, specified in the IEEE Conference Proceedings Formatting Guidelines (i.e., title in 24pt font and full text in 10pt type): <a href=\"https://www.ieee.org/conferences/publishing/templates.html\">https://www.ieee.org/conferences/publishing/templates.html</a> </p>\n<p>In LaTeX, use \\documentclass[10pt,conference]{IEEEtran} without including the compsoc or compsocconf options. </p>\n<p>To submit a paper to FormaliSE 2025 use this HotCRP link: <a href=\"https://formalise25.hotcrp.com/\">https://formalise25.hotcrp.com/</a> </p>\n<p>Lightweight Double-Blind Review Process for Papers <br>\nAs in recent editions, FormaliSE 2025 will use a lightweight double-anonymous process. Authors must omit their names and institutions from the title page, cite their own work in the third person, and omit acknowledgments that may reveal their identity or affiliation. The purpose is reducing chances of reviewer bias influenced by the authors’ identities. The double-anonymous process is, however, lightweight, which means that it should not pose a heavy burden for authors, nor should make a paper's presentation weaker or more difficult to review. Also, advertising the paper as part of your usual research activities (for example, on your personal web-page, in a pre-print archive, by email, in talks or discussions with colleagues) is permitted without penalties. </p>\n<p>Paper selection <br>\nEach paper will be reviewed by at least three program committee members that will judge its overall quality in terms of its soundness, significance, novelty, verifiability, and presentation clarity. </p>\n<p>FormaliSE 2025 will adopt a lightweight response process: if all the reviewers of a given paper agree that a clarification from the authors regarding a specific question could move the paper from \"borderline\" to \"accept\", the chairs will relay the reviewers' questions to the authors by email, and then share their reply with the reviewers in HotCRP. The goal of lightweight responses is reducing the chance of random decisions on borderline papers. Hence, they will only be used for a minority of submissions; most papers will not require such an author response. Nevertheless, we would ask the corresponding authors of all submissions to make sure that they are available to answer questions by email upon request. </p>\n<p>Artifact Evaluation <br>\nReproducibility of experimental results is crucial to foster an atmosphere of trustworthy, open, and reusable research. To improve and reward reproducibility, FormaliSE 2025 continues its Artifact Evaluation (AE) procedure. An artifact is any additional material (software, data sets, machine-checkable proofs, etc.) that substantiates the claims made in the paper and ideally makes them fully reproducible. </p>\n<p>Submission of an artifact is optional but encouraged for all papers where it can support the results presented in the paper. Artifact review is single-anonymous (the paper corresponding to an artifact must still follow the double-anonymous submissions requirements) and will be conducted concurrently with the paper reviewing process. Artifacts will be handled by a separate Artifact Evaluation Committee, and the Artifact Evaluation process will be set up such that the anonymization of the corresponding papers will not be compromised. Accepted papers with a successfully evaluated artefact will be awarded the [EAPLS badges ( [ <a href=\"https://eapls.org/pages/artifact_badges/\">https://eapls.org/pages/artifact_badges/</a> | <a href=\"https://eapls.org/pages/artifact_badges/\">https://eapls.org/pages/artifact_badges/</a> ] ) that apply (among \"Functional\", \"Reusable\", and \"Available\"). Awarded badges are to be added to the camera-ready version of the paper. </p>\n<p>Artifacts will be assessed with respect to their consistency with the results presented in the paper, their completeness, their documentation, and their ease of use. The Artifact Evaluation will include an initial check for technical issues; authors of artifacts may be contacted by email within the first two weeks after artifact submission to help resolve any technical problems that prevent the evaluation of an artifact if necessary. </p>\n<p>The results of an artifact evaluation will not be available to the reviewers of the corresponding paper; hence, they will not affect the paper's acceptance decision. However, reviewers will know whether a paper has submitted <em>any</em> artifacts; this piece of information may be taken into account to decide whether the paper should be accepted. Thus, if there are justifiable reasons why a paper's artifacts cannot be submitted, they should be pointed out in the paper so that the reviewers can appreciate them and adjust their expectations accordingly. </p>\n<p>Detailed guidelines for preparation and submission of artifacts will be described in a dedicated page in FormaliSE 2025's website. </p>\n<p>Publication <br>\nAll accepted papers are published as part of the ICSE 2025 Proceedings in the ACM and IEEE Digital Libraries. </p>\n<p>At least one author of each accepted paper is required to register for the conference and present the paper at the conference — physically or, if the circumstances do not allow so, virtually. Failure to register an author will result in a paper being removed from the proceedings. </p>\n<p>General Chairs </p>\n<p>* </p>\n<p>Stefania Gnesi, Istituto di Scienza e Tecnologie dell’Informazione, Italy </p>\n<p>* </p>\n<p>Nico Plat, Thanos, The Netherlands </p>\n<p>Program Chairs </p>\n<p>* </p>\n<p>Anastasia Mavridou, KBR / NASA Ames Research Center, USA </p>\n<p>* </p>\n<p>Gwen Salaün, University Grenoble Alpes, France </p>\n<p>Artifact Evaluation<br>\n[message truncated]</p>",
        "id": 482018123,
        "sender_full_name": "Email Gateway",
        "timestamp": 1731438878
    }
]