[
    {
        "content": "<p>From: Andreas Lochbihler &lt;<a href=\"mailto:mail@andreas-lochbihler.de\">mail@andreas-lochbihler.de</a>&gt;<br>\nI'm happy to announce a new AFP entry by Martin Raszyk: Multi-Head Monitoring of Metric <br>\nDynamic Logic</p>\n<p>Runtime monitoring (or runtime verification) is an approach to checking compliance of a <br>\nsystem's execution with a specification (e.g., a temporal query). The system's execution <br>\nis logged into a trace---a sequence of time-points, each consisting of a time-stamp and <br>\nobserved events. A monitor is an algorithm that produces verdicts on the satisfaction of a <br>\ntemporal query on a trace. We formalize a monitoring algorithm for metric dynamic logic, <br>\nan extension of metric temporal logic with regular expressions. The monitor computes <br>\nwhether a given query is satisfied at every position in an input trace of time-stamped <br>\nevents. We formalize the time-stamps as an abstract algebraic structure satisfying certain <br>\nassumptions. Instances of this structure include natural numbers, real numbers, and <br>\nlexicographic combinations of them. Our monitor follows the multi-head paradigm: it reads <br>\nthe input simultaneously at multiple positions and moves its reading heads asynchronously. <br>\nThis mode of operation results in unprecedented time and space complexity guarantees for <br>\nmetric dynamic logic: The monitor's amortized time complexity to process a time-point and <br>\nthe monitor's space complexity neither depends on the event-rate, i.e., the number of <br>\nevents within a fixed time-unit, nor on the numeric constants occurring in the <br>\nquantitative temporal constraints in the given query. The multi-head monitoring algorithm <br>\nfor metric dynamic logic is reported in our paper \"Multi-Head Monitoring of Metric Dynamic <br>\nLogic\" published at ATVA 2020. We have also formalized unpublished specialized algorithms <br>\nfor the temporal operators of metric temporal logic.</p>\n<p>You can find it online at <a href=\"https://www.isa-afp.org/entries/VYDRA_MDL.html\">https://www.isa-afp.org/entries/VYDRA_MDL.html</a></p>\n<p>Andreas</p>",
        "id": 271869835,
        "sender_full_name": "Email Gateway",
        "timestamp": 1644864286
    }
]