[
    {
        "content": "<p>From: Peter Lammich &lt;<a href=\"mailto:lammich@in.tum.de\">lammich@in.tum.de</a>&gt;<br>\nHi List,</p>\n<p>I cannot find on the Isabelle homepage, nor in the Isabelle System<br>\nManual, that it refers to for \"further technical background\" any hint<br>\nwhat a reasonable minimal system requirement (e.g. RAM, Processor<br>\nspeed, etc.) is. Does this information exist somewhere?</p>",
        "id": 211200904,
        "sender_full_name": "Email Gateway",
        "timestamp": 1600988964
    },
    {
        "content": "<p>From: Lawrence Paulson &lt;<a href=\"mailto:lp15@cam.ac.uk\">lp15@cam.ac.uk</a>&gt;<br>\nI don’t know if the “system requirements” are posted anywhere, and it depends a lot on the size of the project you are working on. There will be more informed responses but anyway,</p>\n<ul>\n<li>Processor speed: not particularly important but you should have four cores minimum</li>\n<li>RAM: 8 GB should be okay but you will be happier with more.</li>\n</ul>\n<p>Remember that Isabelle does a lot of multithreading, and sledgehammer also launches multiple processes. And you need more RAM if you get more cores.</p>\n<p>Larry</p>",
        "id": 211236048,
        "sender_full_name": "Email Gateway",
        "timestamp": 1601026342
    },
    {
        "content": "<p>From: Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt;<br>\n8 GB RAM / 4 CPU cores is indeed the base line for practical work of modest size.</p>\n<p>4 GB RAM / 2 CPU cores is the bare minimum to startup the Isabelle/jEdit<br>\napplication to do a few basic things.</p>\n<p>Real applications require more, lets say 16-32 GB RAM / 8 CPU cores.</p>\n<p>Maybe we should add a few words about this on the website, for the<br>\nIsabelle2021 release (Jan/Feb-2021).</p>\n<p>Moreover, I am about to try a new hardware base line: Raspberry Pi 4 with 8 GB<br>\nRAM / 4 CPU cores, which I have ordered yesterday for 100 EUR. But that is<br>\nARM64, and we don't have a proper Poly/ML code generator for that yet, only a<br>\nbyte-code interpreter.</p>\n<p>Makarius</p>",
        "id": 211476508,
        "sender_full_name": "Email Gateway",
        "timestamp": 1601290141
    }
]