[
    {
        "content": "<p>From: Vineet Rajani &lt;<a href=\"mailto:V.Rajani@kent.ac.uk\">V.Rajani@kent.ac.uk</a>&gt;<br>\nApologies for cross posting.</p>\n<p>Dear colleagues,</p>\n<p>We seek a talented and motivated postdoc/Research associate to join the School of Computing at the University of Kent, Canterbury, UK. The Research Associate will participate in cutting edge research on type-based enforcement and compilation techniques for enforcement of security properties of higher-order programs. The position is on an EPSRC funded project titled \"TYPDSEC: Type-based information declassification and its secure compilation\". The post is based in Canterbury and will be directly supervised by Dr. Vineet Rajani (<a href=\"https://vineetrajani.github.io/\">https://vineetrajani.github.io/</a>).</p>\n<p>The project will be in the intersection of modal type theory, information flow control and secure compilation. It will also involve mechanisation in the HOL4 theorem prover and implementation in the CakeML ecosystem. Applicants should have a strong background in formal methods evidenced by high-quality research publications or artifacts in top-tier venues of programming languages, formal verification or security research. The project will involve close collaboration with Prof. Magnus Myreen (Chalmers).</p>\n<p>As a Research Associate you will:</p>\n<ol>\n<li>build novel type theories, proof techniques and compilation methods to reason about hyperproperties relevant for security of higher-order programs.</li>\n<li>work on mechanisation of the above in HOL4.</li>\n<li>integrate them in the CakeML framework, a real world compiler for the ML like language.</li>\n</ol>\n<p>To be successful in this role you must:</p>\n<ol>\n<li>have a PhD or equivalent experience in Computing or in a related discipline.</li>\n<li>have a track record of peer-reviewed publications at scientific workshops, conferences or journals.</li>\n<li>have excellent mathematical skills relevant for analysis of computer programs.</li>\n</ol>\n<p>The university of Kent is walking distance from the charming city of Canterbury. It has a high speed connection to London, and travel to Europe is convenient by rail or car.</p>\n<p>Please apply through any of the following URLs:</p>\n<ul>\n<li><a href=\"https://www.jobs.ac.uk/job/DGO984/research-associate\">https://www.jobs.ac.uk/job/DGO984/research-associate</a></li>\n<li><a href=\"https://jobs.kent.ac.uk/Vacancy.aspx?id=7355&amp;forced=2\">https://jobs.kent.ac.uk/Vacancy.aspx?id=7355&amp;forced=2</a></li>\n</ul>\n<p>We are looking to have the successful candidate start as soon as possible. For any queries formal or informal, please do not hesitate to get in touch Dr. Vineet Rajani (<a href=\"mailto:v.rajani@kent.ac.uk\">v.rajani@kent.ac.uk</a>).</p>\n<p>Best regards,<br>\nVineet</p>",
        "id": 426793345,
        "sender_full_name": "Email Gateway",
        "timestamp": 1710524525
    }
]