[
    {
        "content": "<p>From: \"Weissenbacher, Georg\" &lt;<a href=\"mailto:georg.weissenbacher@tuwien.ac.at\">georg.weissenbacher@tuwien.ac.at</a>&gt;<br>\nThe Faculty of Informatics of TU Wien, one of the top-ranked faculties<br>\nof Informatics in Europe and located in Vienna, Austria, the world's<br>\nmost liveable city, offers</p>\n<p>4 funded positions for doctoral students<br>\nin the newly established doctoral college on Automated Reasoning.</p>\n<p>Application deadline: November 27, 2025<br>\nDetails and application link: <a href=\"https://www.forsyte.at/docfunds/\">https://www.forsyte.at/docfunds/</a></p>\n<p>Successful applicants are expected to start as soon as possible<br>\nand will receive funding for up to 4 years.</p>\n<p>Successful applicants will work on exciting projects at the intersection of<br>\nsecurity and artificial intelligence with Automated Reasoning at the core.<br>\nEach doctoral students will be working with and will be supervised by two<br>\nfaculty members who are internationally renowned experts in their respective<br>\nfields  (<a href=\"https://www.forsyte.at/docfunds#supervisors\">https://www.forsyte.at/docfunds#supervisors</a>).</p>\n<p>The doctoral college is designed to educate the next generation of experts<br>\non Automated Reasoning. It targets foundational questions such as rigorously<br>\ndefining the notion of safety and security across domains and applications, the<br>\ndevelopment of automated techniques and analyses to ensure safety and security<br>\nof electronic systems, and explores synergies between the fields of security and<br>\nartificial intelligence (a list of potential research topics can be found on<br>\n<a href=\"https://www.forsyte.at/docfunds#topics\">https://www.forsyte.at/docfunds#topics</a>).</p>\n<p>TU Wien is located in the heart of Vienna, Austria, which has been<br>\nrepeatedly ranked as one of the most liveable city. The Faculty of<br>\nInformatics is home to world-renowned researchers in a wide range of<br>\nAreas including Logic and Computation, Information Systems Engineering,<br>\nComputer Engineering, and Visual Computing and Human-Centered Technology.<br>\nNumerous initiatives such as the Cybersecurity Center<br>\n(<a href=\"https://cysec.wien/\">https://cysec.wien/</a>) and the Center for Artificial Intelligence and<br>\nMachine Learning (<a href=\"https://caiml.org/\">https://caiml.org/</a>) demonstrate the Faculty's strong<br>\nfocus on collaboration and interdisciplinarity.</p>\n<p>Further details can be found on <a href=\"https://www.forsyte.at/docfunds/\">https://www.forsyte.at/docfunds/</a>.</p>",
        "id": 555297970,
        "sender_full_name": "Email Gateway",
        "timestamp": 1763024241
    }
]