[
    {
        "content": "<p>From: Alexis Saurin &lt;<a href=\"mailto:alexis.saurin@irif.fr\">alexis.saurin@irif.fr</a>&gt;<br>\n(Apologies for multiple postings)</p>\n<p>=== Preliminary Call for contributions ===</p>\n<p>Workshop on Fixed Points in Computer Science<br>\n19 &amp; 20 February 2024<br>\n<a href=\"https://www.irif.fr/users/saurin/fics2024/index.html\">https://www.irif.fr/users/saurin/fics2024/index.html</a></p>\n<p>This year, FICS workshop (Workshop on Fixed Points in Computer Science) <br>\nwill take place in Naples on the 19th and 20th of February, 2024, <br>\naffiliated with CSL 2024 (<a href=\"https://csl2024.github.io/Home/\">https://csl2024.github.io/Home/</a>).</p>\n<p>== About FICS workshop series ==</p>\n<p>The goal is to bring together people from different subfields such as <br>\nalgebra/coalgebra, verification, logic, around the thematic of fixed <br>\npoints. Fixed points play a fundamental role in several areas of <br>\ncomputer science. They are used to justify (co)recursive definitions and <br>\nassociated reasoning techniques. The construction and properties of <br>\nfixed points have been investigated in many different settings such as: <br>\ndesign and implementation of programming languages, logics, <br>\nverification, databases.</p>\n<p>== Scope ==</p>\n<p>Topics include, but are not restricted to:</p>\n<ul>\n<li>fixed points in algebra and coalgebra</li>\n<li>fixed points in formal languages and automata</li>\n<li>fixed points in game theory</li>\n<li>fixed points in programming language semantics</li>\n<li>fixed points in proofs</li>\n<li>fixed points in the mu-calculus and modal logics</li>\n<li>fixed points in process algebras and process calculi</li>\n<li>fixed points in functional programming and type theory</li>\n<li>fixed points in relation to dataflow and circuits</li>\n<li>\n<p>fixed points in automated theorem proving, interactive theorem proving <br>\nand logic programming</p>\n</li>\n<li>\n<p>fixed points in finite model theory, descriptive complexity theory, <br>\nand databases</p>\n</li>\n<li>\n<p>fixed points in category theory for logic in computer science</p>\n</li>\n</ul>\n<p>== Important dates ==</p>\n<ul>\n<li>Submission deadline for short and extended abstracts: 1 December 2023;</li>\n<li>Notification: 21 December 2023;</li>\n<li>Workshop: 19 and 20 February 2024.</li>\n</ul>\n<p>== Types of submissions ==</p>\n<p>This year, we welcome two categories of submissions, short abstracts as <br>\nwell as extended abstracts:</p>\n<ul>\n<li>\n<p>short abstracts are abstracts of 3 to 5 pages, references included, <br>\ndescribing the topic of the proposed contributed talk. They may contain <br>\n(i) new completed results, (ii) work in progress or (iii) already <br>\n(recently) published or submitted works. The submission can refer to a <br>\npublished paper or a preprint but the description given in the short <br>\nabstract should be sufficiently detailed for the PC to judge the <br>\nrelevance of the proposed talk to the workshop program.</p>\n</li>\n<li>\n<p>extended abstracts are papers of 6 to 10 pages, references excluded, <br>\ndescribing original results which have not been published nor are <br>\ncurrently submitted elsewhere. The results must be presented in <br>\nsufficient details to constitute a scientific publication. An appendix <br>\ncan provide additional details for the reviewer but will be read at the <br>\ndiscretion of the reviewers. We plan to have formal proceedings for <br>\nextended abstract, more details will be posted on FICS website and in <br>\nforthcoming calls for contributions.</p>\n</li>\n</ul>\n<p>Both types of submissions will be handled via Easychair and will be <br>\npeer-reviewed by the PC.</p>\n<p>== Journal publication ==</p>\n<p>Depending on the number and quality of submissions, we will plan a <br>\nsubsequent special issue of a journal, as often done for previous <br>\neditions of the workshop.</p>\n<p>== Program Committee ==</p>\n<p>Alexis Saurin, PC chair</p>\n<p>Program committee: to be announced soon</p>\n<p>== Contact ==</p>\n<p>Alexis Saurin<br>\n<a href=\"mailto:alexis.saurin@irif.fr\">alexis.saurin@irif.fr</a><br>\n<a href=\"https://www.irif.fr/users/saurin/index\">https://www.irif.fr/users/saurin/index</a></p>",
        "id": 396282624,
        "sender_full_name": "Email Gateway",
        "timestamp": 1697115436
    }
]