[
    {
        "content": "<p>From: Andrei Popescu &lt;<a href=\"mailto:andrei.h.popescu@gmail.com\">andrei.h.popescu@gmail.com</a>&gt;<br>\nDear all,</p>\n<p>Next week there will be an online talk (via zoom) by Lawrence Paulson<br>\non a topic that is likely to be of interest to quite a few people on<br>\nthese lists. Please note the information about registration below.</p>\n<p>Best wishes,<br>\nAndrei</p>\n<p>Information: <a href=\"https://www.bcs.org/events-calendar/2024/january/webinar-formalising-21st-century-mathematics/\">https://www.bcs.org/events-calendar/2024/january/webinar-formalising-21st-century-mathematics/</a></p>\n<p>Date/Time: 15 January 2024, 4-6pm GMT<br>\nSpeaker: Lawrence C. Paulson FRS, University of Cambridge<br>\nWeb: <a href=\"https://www.cl.cam.ac.uk/~lp15/\">https://www.cl.cam.ac.uk/~lp15/</a></p>\n<p>Registration: <a href=\"https://www.lms.ac.uk/events/lms-bcs-facs-seminar-2024\">https://www.lms.ac.uk/events/lms-bcs-facs-seminar-2024</a></p>\n<p>Title: Formalising 21st-Century Mathematics</p>\n<p>Abstract: The formalisation of mathematics is an ongoing process that<br>\narguably started as early as the 19th century, intensified with the<br>\nfoundational crisis at the start of the 20th century, and since the<br>\n1970s has been conducted with the help of computers. Recent decades<br>\nhave seen the machine formalisation of lengthy and technically<br>\ncomplicated proofs, but some have argued that even these were not<br>\nrepresentative of modern mathematics. Recent achievements by a number<br>\nof different groups are starting to challenge this scepticism. The<br>\nspeaker will outline some of these, while also noting some of the<br>\nremaining trouble spots.</p>\n<p>Biography: Lawrence Paulson FRS is an American computer scientist. He<br>\nis a Professor of Computational Logic at the University of Cambridge<br>\nComputer Laboratory and a Fellow of Clare College, Cambridge. He is<br>\nbest known for the cornerstone text on the programming language ML, ML<br>\nfor the Working Programmer. His research is based around the<br>\ninteractive theorem prover Isabelle, which he introduced in 1986. He<br>\nhas worked on the verification of cryptographic protocols using<br>\ninductive definitions, and he has also formalised the constructible<br>\nuniverse of Kurt Gödel. Recently he has built a new theorem prover,<br>\nMetiTarski, for real-valued special functions.</p>",
        "id": 411716152,
        "sender_full_name": "Email Gateway",
        "timestamp": 1704711631
    },
    {
        "content": "<p>From: Andrei Popescu &lt;<a href=\"mailto:andrei.h.popescu@gmail.com\">andrei.h.popescu@gmail.com</a>&gt;<br>\nDear colleagues,</p>\n<p>Another note: This talk will be recorded and made available on youtube<br>\n(I will come back with the link). I would like to apologise to those<br>\nof you attending CPP -- when scheduling this (which happened a while<br>\nago) I lost sight of the overlap with CPP.  :-(</p>\n<p>Best wishes,<br>\nAndrei</p>",
        "id": 411731744,
        "sender_full_name": "Email Gateway",
        "timestamp": 1704718030
    }
]