[
    {
        "content": "<p>From: \"Thiemann, René\" &lt;<a href=\"mailto:Rene.Thiemann@uibk.ac.at\">Rene.Thiemann@uibk.ac.at</a>&gt;<br>\nDear all,</p>\n<p>I’m happy to announce two new AFP entries, both written by Emin Karayel.</p>\n<p>A Combinator Library for Prefix-Free Codes [1]</p>\n<p>This entry contains a set of binary encodings for primitive data types, such as<br>\nnatural numbers, integers, floating-point numbers as well as combinators to<br>\nconstruct encodings for products, lists, sets or functions of/between such<br>\ntypes. For natural numbers and integers, the entry contains various encodings,<br>\nsuch as Elias-Gamma-Codes and exponential Golomb Codes, which are efficient<br>\nvariable-length codes in use by current compression formats. A use-case for this<br>\nlibrary is measuring the persisted size of a complex data structure without<br>\nhaving to hand-craft a dedicated encoding for it, independent of Isabelle's<br>\ninternal representation.</p>\n<p>Formalization of Randomized Approximation Algorithms for Frequency Moments [2]</p>\n<p>In 1999 Alon et. al. introduced the still active research topic of approximating<br>\nthe frequency moments of a data stream using randomized algorithms with minimal<br>\nspace usage. This includes the problem of estimating the cardinality of the<br>\nstream elements - the zeroth frequency moment. But, also higher-order frequency<br>\nmoments that provide information about the skew of the data stream. (The k-th<br>\nfrequency moment of a data stream is the sum of the k-th powers of the<br>\noccurrence counts of each element in the stream.) This entry formalizes three<br>\nrandomized algorithms for the approximation of F_0, F_2 and F_k for k ≥ 3 based <br>\non [3, 4] and verifies their expected accuracy, success probability and space<br>\nusage.</p>\n<p>Enjoy,<br>\nRené</p>\n<p>1: <a href=\"https://www.isa-afp.org/entries/Prefix_Free_Code_Combinators.html\">https://www.isa-afp.org/entries/Prefix_Free_Code_Combinators.html</a><br>\n2: <a href=\"https://www.isa-afp.org/entries/Frequency_Moments.html\">https://www.isa-afp.org/entries/Frequency_Moments.html</a><br>\n3: <a href=\"https://doi.org/10.1006/jcss.1997.1545\">https://doi.org/10.1006/jcss.1997.1545</a><br>\n4: <a href=\"https://doi.org/10.1007/3-540-45726-7_1\">https://doi.org/10.1007/3-540-45726-7_1</a></p>",
        "id": 279376717,
        "sender_full_name": "Email Gateway",
        "timestamp": 1650355956
    }
]