[
    {
        "content": "<p>From: Sebastian Alexander Mödersheim &lt;<a href=\"mailto:cl-isabelle-users@lists.cam.ac.uk\">cl-isabelle-users@lists.cam.ac.uk</a>&gt;<br>\nDear colleagues,</p>\n<p>Alceste Scalas and I are hiring two PhD students for an upcoming Horizon Europe project called TaRDIS.  The application deadline is 27 November 2022, and the start date is 1 March 2023 (negotiable).  Here is a brief description of the positions.  If you can circulate it among your students and contacts, it would really help!</p>\n<p>Thanks!  Best,</p>\n<p>Sebastian</p>\n<hr>\n<p>We are looking for two bright and motivated students for two PhD positions (3 years each) at DTU Compute - section for Software Systems Engineering. The research topic is the verification of the correctness and security of concurrent and distributed applications.</p>\n<p>The application deadline is 27 November 2022, and the expected starting date is 1 March 2023 (negotiable). An MSc degree is needed to start the position, but it is possible to apply before graduating.</p>\n<p>The ideal candidates should have some familiarity with formal methods for programming languages, or distributed systems, or security.  It is an advantage to have good programming skills (especially functional programming) and experience in developing distributed applications.</p>\n<p>Application link with complete details: <a href=\"https://www.dtu.dk/english/about/job-and-career/vacant-positions/job?id=dd8bd8bc-8712-4883-981c-d91a1247f444\">https://www.dtu.dk/english/about/job-and-career/vacant-positions/job?id=dd8bd8bc-8712-4883-981c-d91a1247f444</a></p>\n<p>The two PhD positions are part of the upcoming Horizon Europe project TaRDIS (Trustworthy and Resilient Decentralised Intelligence for edge Systems). The goal of TaRDIS is design and develop a novel, event-driven programming model and toolkit (with solid foundations based on formal methods) to help programmers in creating safe and reliable distributed systems - with a focus on applications with smart and autonomous components deployed across the cloud-edge continuum. The TaRDIS project is a collaboration between DTU (Denmark), NOVA University Lisbon (Portugal, project coordinator), the University of Oxford (UK), the University of Novi Sad (Serbia), the National and Kapodistrian University of Athens (Greece), and 6 industry partners.</p>\n<p>For inquiries, please contact:</p>\n<p>*   Alceste Scalas &lt;alcsc@dtu.dk&lt;mailto:<a href=\"mailto:alcsc@dtu.dk\">alcsc@dtu.dk</a>&gt;&gt;<br>\n  *   Sebastian Alexander Mödersheim &lt;samo@dtu.dk&lt;mailto:<a href=\"mailto:samo@dtu.dk\">samo@dtu.dk</a>&gt;&gt;</p>",
        "id": 311270743,
        "sender_full_name": "Email Gateway",
        "timestamp": 1669033006
    }
]