[
    {
        "content": "<p>From: \"João F. Ferreira\" &lt;<a href=\"mailto:joao@joaoff.com\">joao@joaoff.com</a>&gt;<br>\n[ Please distribute, apologies for multiple postings. ]</p>\n<p>=========================================================</p>\n<p>Call for Papers: Formal Methods Teaching Workshop and Tutorial (FMTea 2021)</p>\n<p>21 November 2021, <em>online</em></p>\n<p>Co-located with the 24th International Symposium on Formal Methods, FM 2021</p>\n<p>FMTea21 is a one-day combined workshop and tutorial that brings together<br>\nresearchers and educators working on formal methods to share their<br>\nexperiences<br>\nin teaching formal methods, discuss key challenges, and stimulate<br>\ncollaboration<br>\nthat can lead to ways to reboot the presence of formal methods in curricula.</p>\n<p>FMTea21 will be an online event at the 24th International Symposium on<br>\nFormal<br>\nMethods, FM2021. More details can be found on the workshop website:</p>\n<p><a href=\"https://fmtea.github.io\">https://fmtea.github.io</a></p>\n<p>=========================================================</p>\n<p>Invited Speakers<br>\n========================</p>\n<ul>\n<li>\n<p>Tobias Nipkow (Technical University Munich, Germany)<br>\n   Provisional title: \"Teaching Algorithms and Data Structures with a Proof<br>\nAssistant\"</p>\n</li>\n<li>\n<p>A second invited speaker will be announced soon!</p>\n</li>\n</ul>\n<p>Important Dates<br>\n========================</p>\n<ul>\n<li>2 July 2021: Deadline for submission of papers (AoE)</li>\n<li>2 August 2021: Notifications to authors</li>\n<li>17 September 2021: Deadline for camera-ready version</li>\n<li>21 November 2021: FMTea21 Workshop (online)</li>\n</ul>\n<p>Objectives and Scope<br>\n========================</p>\n<p>Formal Methods provide software engineering with tools and techniques for<br>\nrigorously reasoning about the correctness of systems. While in recent years<br>\nformal methods are increasingly being used in industry, university<br>\ncurricula are<br>\nnot adapting at the same pace. Some existing formal methods classes<br>\ninterest and<br>\nchallenge students, whereas others fail to ignite student motivation. It is<br>\nthus<br>\nimportant to develop, share, and discuss approaches to effectively teach<br>\nformal<br>\nmethods to the next generations. This discussion is now more important than<br>\never<br>\ndue to the challenges and opportunities that arose from the pandemic, which<br>\nforced many educators to adapt and deliver their teaching online. Exchange<br>\nof<br>\nideas is critical to making these new online approaches a success and<br>\nhaving a<br>\ngreater reach.</p>\n<p>Topics<br>\n========================</p>\n<p>In the workshop part of the event, we welcome papers detailing experiences<br>\nwith<br>\nFM Teaching, including papers discussing successes and failures of various<br>\nmethods, case studies, tools, etc. Given the increasing importance of online<br>\nteaching and self-learning, we also welcome reports of experiences with<br>\nonline<br>\nteaching, including experiences with teaching formal methods via MOOCs. We<br>\ninvite novel papers that cover, but are not limited to, the following<br>\naspects:</p>\n<ul>\n<li>\n<p>Experiences and proposals related with \"traditional\" FM learning and<br>\nteaching</p>\n</li>\n<li>\n<p>Experiences and proposals related with online FM learning and teaching</p>\n</li>\n<li>\n<p>Integrating/embedding FM teaching/thinking within other computer science<br>\ncourses</p>\n</li>\n<li>\n<p>Teaching FM for industry</p>\n</li>\n<li>Innovative learning and teaching methods for FM</li>\n</ul>\n<p>Submission Details<br>\n========================</p>\n<p>FMTea21 invites high quality papers reporting on opinions, approaches, and<br>\nexperiences related to the topic of teaching Formal Methods. Each submitted<br>\npaper will be reviewed by at least three PC members. As in previous events,<br>\nthe<br>\nconference proceedings will be published in Springer's Lecture Notes in<br>\nComputer<br>\nScience series. All submissions must be original, unpublished, and not<br>\nsubmitted<br>\nfor publication elsewhere. Submissions must be in PDF format, using the<br>\nSpringer<br>\nLNCS style files. Papers should not exceed 15 pages in length. Submissions<br>\nshould be made using the FMTea21 Easychair web site:</p>\n<p><a href=\"https://easychair.org/conferences/?conf=fmtea21\">https://easychair.org/conferences/?conf=fmtea21</a></p>\n<p>All accepted papers must be remotely presented at the workshop. Authors<br>\nmust be<br>\nprepared to sign a copyright transfer statement. At least one author of each<br>\naccepted paper must register to the conference by an early date, to be<br>\nindicated<br>\nby the FM2021 organizers, and present the paper.</p>\n<p>Organization<br>\n========================</p>\n<p>FMTea21 is organized by FME’s Teaching Committee, whose broad aim is to<br>\nsupport<br>\na worldwide improvement in learning Formal Methods, mainly by teaching but<br>\nalso<br>\nvia self-learning. To that end, the committee manages a list of FM courses<br>\ntaught worldwide (<a href=\"https://fme-teaching.github.io\">https://fme-teaching.github.io</a>) and plans to collect other<br>\nresources as well, such as FM case studies, FM inspirational papers, etc.</p>\n<p>Program Committee<br>\n========================</p>\n<ul>\n<li>\n<p>João F. Ferreira (co-chair), INESC-ID &amp; IST, University of Lisbon,<br>\nPortugal</p>\n</li>\n<li>\n<p>Alexandra Mendes (co-chair), INESC TEC &amp; University of Beira Interior,<br>\nPortugal</p>\n</li>\n<li>\n<p>Claudio Menghi (co-chair), University of Luxembourg, Luxembourg</p>\n</li>\n<li>Sandrine Blazy, University of Rennes 1, France</li>\n<li>Brijesh Dongol, University of Surrey, UK</li>\n<li>Catherine Dubois, ENSIIE, France</li>\n<li>Rustan Leino, Amazon Web Services, US</li>\n<li>José N. Oliveira, University of Minho, Portugal</li>\n<li>Luigia Petre, Åbo Akademi University, Finland</li>\n<li>Leila Ribeiro, Federal University of Rio Grande do Sul, Brazil</li>\n<li>Kristin Rozier, Iowa State University, US</li>\n<li>Pierluigi San Pietro, Politecnico di Milano, Italy</li>\n<li>Emil Sekerinski, McMaster University, Canada</li>\n<li>Graeme Smith, The University of Queensland, Australia</li>\n<li>Kenji Taguchi, CAV, Japan</li>\n</ul>\n<p>Contact<br>\n========================<br>\nAll questions about submissions should be emailed to the chairs.</p>",
        "id": 238594897,
        "sender_full_name": "Email Gateway",
        "timestamp": 1620894393
    }
]