[
    {
        "content": "<p>From: Magnus Myreen &lt;<a href=\"mailto:myreen@chalmers.se\">myreen@chalmers.se</a>&gt;<br>\nWe are pleased to announce the call for proposals for hosting and organising FroCoS-ITP-TABLEAUX 2025, on their 15th, 16th and 33rd editions, respectively.</p>\n<ul>\n<li>\n<p>FroCoS (<a href=\"http://frocos.cs.uiowa.edu/\">http://frocos.cs.uiowa.edu/</a>) is the main international event for research on the development of techniques and methods for the combination and integration of formal systems, their modularization and analysis.</p>\n</li>\n<li>\n<p>ITP (<a href=\"https://itp-conference.github.io/\">https://itp-conference.github.io/</a>) is concerned with all topics related to interactive theorem proving, ranging from theoretical foundations to implementation aspects and applications in program verification, security, and formalization of mathematics.</p>\n</li>\n<li>\n<p>TABLEAUX (<a href=\"http://www.tableaux-ar.org/\">http://www.tableaux-ar.org/</a>) is the main international conference at which research on all aspects, theoretical foundations, implementation techniques, systems development and applications, of the mechanization of tableaux-based reasoning and related methods is presented.</p>\n</li>\n</ul>\n<p>FroCoS and Tableaux have co-located for quite a number of editions, and in 2017 we had a very successful edition of the three conferences running together. In 2025 we intend to resume this partnership. We expect the 2025 edition of FroCoS+Tableaux to have around 100 participants. ITP tends to have 75-100 participants.</p>\n<p>Bids should be sent to <a href=\"mailto:frocos.itp.tableaux@gmail.com\">frocos.itp.tableaux@gmail.com</a> and should include at least the following information:</p>\n<p>• name and email address of a contact person<br>\n       • names of other people involved<br>\n       • address of website for the bid<br>\n       • approximate dates of the conference<br>\n       • structure (e.g., k workshop days and n days of presentations, excursion, etc.)<br>\n       • advantages of the proposed venue<br>\n       • estimated costs and registration fee</p>\n<p>The deadline for bids is Monday, 15 April 2024. Shortly after, all admitted bids will be made public and the voting phase will take place. The people eligible to vote are those who are seriously considering attending FroCoS-ITP-TABLEAUX 2025. The voting system used will be single transferable vote between all received bids.</p>\n<p>FroCoS-ITP-TABLEAUX Steering Committees</p>",
        "id": 421861021,
        "sender_full_name": "Email Gateway",
        "timestamp": 1708091091
    }
]