[
    {
        "content": "<p><strong>From:</strong> Tobias Nipkow &lt;<a href=\"mailto:nipkow@in.tum.de\">nipkow@in.tum.de</a>&gt;</p>\n<p>Swap Distance<br>\nManuel Eberl</p>\n<p>Given two lists that are permutations of one another, the swap distance (also <br>\nknown as the Kendall tau distance) is the minimum number of swap operations of <br>\nadjacent elements required to make the two lists the same.</p>\n<p>Equivalently, the swap distance of two finite linear orders and is the number of <br>\ndisagreements of the two orders, i.e. of pairs such that and .</p>\n<p>This article defines these two notions of swap distance as well as their <br>\nequivalence under the obvious isomorphism between lists and linear orders given <br>\nby interpreting a list as a ranking of elements in descending order.</p>\n<p>An efficient O(n log n) algorithm to compute the swap distance is also provided <br>\nvia the connection to the number of inversions of a list, for which an efficient <br>\nalgorithm is already available in the AFP.</p>\n<p><a href=\"https://www.isa-afp.org/entries/Swap_Distance.html\">https://www.isa-afp.org/entries/Swap_Distance.html</a></p>\n<hr>\n<p>Linear orders as rankings<br>\nManuel Eberl</p>\n<p>This entry formalises the obvious isomorphism between finite linear orders and <br>\nlists, where the list in question is interpreted as a ranking, i.e. it lists the <br>\nelements in descending order without repetition.</p>\n<p>It also provides an executable algorithm to compute topological sortings, i.e. <br>\nall rankings whose linear orders are extensions of a given relation.</p>\n<p><a href=\"https://www.isa-afp.org/entries/Rankings.html\">https://www.isa-afp.org/entries/Rankings.html</a></p>\n<hr>\n<p>The Impossibility of Strategyproof Rank Aggregation<br>\nManuel Eberl and Patrick Lederer</p>\n<p>In Social Choice Theory, a social welfare function (SWF) is a function that <br>\ntakes a collection of individual preferences on some set of alternatives and <br>\nreturns an aggregated preference relation.</p>\n<p>More formally: Consider finite sets of agents N = {1,...,n} and alternatives A = <br>\n{x1,...,xm}. The input of an SWF is an n-tuple of rankings (i.e. linear orders) <br>\nof A, and its output is a ranking of A as well.</p>\n<p>Various desirable properties on SWFs can be defined:</p>\n<p>Anonymity: The SWF is invariant under permutation of the agents.</p>\n<p>Unanimity: If all voters prefer x over y, then x is preferred over y in the <br>\noutput ranking as well.</p>\n<p>Majority consistency: If there exists a ranking x1,...,xm such that for every i <br>\n&lt; j, the alternative xi is preferred over xj by more than half of the agents, <br>\nthat ranking must be returned.</p>\n<p>Kemeny strategyproofness: Strategic voting is not possible for a single agent, <br>\ni.e. no agent can achieve a result more aligned with their own preferences by <br>\nlying about them.</p>\n<p>This entry contains two impossibility results for SWFs with alternatives and agents:</p>\n<p>There exists no anonymous, unanimous, and Kemeny-strategyproof SWF for m &gt;= <br>\n5 and n even or for m = 4 and n a multiple of 4.<br>\n     There exists no majority-consistent and Kemeny-strategyproof SWF for m = 4 <br>\nand n &gt;= 3 or m &gt;= 4 and n : {9,11,13,15} Un {17,...}.</p>\n<p>For some of the base cases, SAT solving is used by letting specialised <br>\nautomation prove a large number of clauses, translating to the DIMACS format, <br>\nand importing a proof pre-generated by an external SAT solver using Lammich's <br>\nGRAT format.</p>\n<p><a href=\"https://www.isa-afp.org/entries/SWF_Impossibility.html\">https://www.isa-afp.org/entries/SWF_Impossibility.html</a></p>\n<p>Enjoy 3 times!</p>\n<p><a href=\"/user_uploads/14278/wkWtdJCE0-XUlM8GGHRbPny_/smime.p7s\">smime.p7s</a></p>",
        "id": 569962264,
        "sender_full_name": "Email Gateway",
        "timestamp": 1769355933
    }
]