[
    {
        "content": "<p><strong>From:</strong> Andrei Popescu &lt;<a href=\"mailto:andrei.h.popescu@gmail.com\">andrei.h.popescu@gmail.com</a>&gt;</p>\n<p>Dear Colleagues,</p>\n<p>Please see below details about the event, which will be preceded by the<br>\nBCS-FACS Annual General Meeting. The event can be attended either online or<br>\nin person.</p>\n<p>Best wishes,<br>\nAndrei</p>\n<p><a href=\"https://www.bcs.org/events-calendar/2025/december/hybrid-facs-agm-and-peter-landin-semantics-seminar/\">https://www.bcs.org/events-calendar/2025/december/hybrid-facs-agm-and-peter-landin-semantics-seminar/</a><br>\n(free registration online)<br>\nHybrid event:<br>\n<em>BCS-FACS AGM &amp; Peter Landin Semantics Seminar</em><br>\n<em>Formal Methods: Whence and Whither</em><br>\nBCS London office (near Moorgate underground station) and on Zoom, 4<br>\nDecember 2025</p>\n<p>Speaker: *J &lt;<a href=\"https://sites.google.com/site/jpbowen/&gt;**onathan\">https://sites.google.com/site/jpbowen/&gt;**onathan</a> Bowen<br>\n&lt;<a href=\"https://sites.google.com/site/jpbowen/&gt;*\">https://sites.google.com/site/jpbowen/&gt;*</a> (Chair of FACS)Agenda</p>\n<p>3:30pm - Networking for attendees (refreshments and biscuits)<br>\n<em>4:00pm</em> - 5:00pm <em>FACS AGM</em> (optional!)<br>\n5:15pm - Networking for physical/online attendees. Includes refreshments<br>\nand biscuits for those in person.<br>\n<em>6:00pm</em> - *Peter *<em>Landin Semantics Seminar Talk</em><br>\n7:00pm - Questions and answers<br>\n7:15pm - Networking for physical attendees (light refreshments)<br>\n8:00pm - Event ends for online attendees<br>\n<em>8:30pm</em> - Event ends for in-person attendees<br>\nSynopsis</p>\n<p>Alan Turing arguably wrote the first paper on formal methods over 75 years<br>\nago. Since then, there have been claims and counterclaims about formal<br>\nmethods. Tool development has been slow but aided by Moore’s Law, with the<br>\nincreasing power of computers. Although formal methods are not widespread<br>\nin practical usage at a heavyweight level, their influence has crept into<br>\nsoftware engineering practice to the extent that they are no longer<br>\nnecessarily called formal methods in their use. In addition, in areas where<br>\nsafety and security are important, with the increasing use of computers in<br>\nsuch applications, formal methods are a viable way to improve the<br>\nreliability of such software-based systems. Their use in hardware, where a<br>\nmistake can be very costly, is also important. This talk explores the<br>\njourney of formal methods to the present day and speculates on future<br>\ndirections, including the use of Artificial Intelligence.<br>\nAbout the speaker</p>\n<p><em>Jonathan Bowen</em>, FBCS FRSA, is Chairman of Museophile Limited (founded in<br>\n2002), an Emeritus Professor at London South Bank University, where he was<br>\nProfessor of Computing, establishing and heading the Centre for Applied<br>\nFormal Methods from 2000. From 2017, he has been an Adjunct Professor at<br>\nSouthwest University, Chongqing, China. Between 2013–15, he was Professor<br>\nof Computer Science at Birmingham City University. During 2006–07, he was a<br>\nvisiting academic at University College London. Between 2007–09, he was a<br>\nVisiting Professor at King's College, London, and during 2008–09, he was an<br>\nAssociate at Praxis High Integrity Systems (now Altran). From 2010, he was<br>\na Visiting Professor at the University of Westminster. During 2010, he was<br>\na Visiting Professor at Waikato University in New Zealand, and in 2012, he<br>\nwas a Visiting Professor at the Pratt Institute in New York. He is the<br>\ncurrent Chair of the BCS-FACS Specialist Group.</p>\n<hr>\n<p>Our events are for adults aged 16 years and over.</p>\n<p>BCS is a membership organisation. If you enjoy this event, please consider<br>\njoining BCS. You’ll be very welcome. You’ll receive access to many<br>\nexclusive career development tools, an introduction to a thriving<br>\nprofessional community and also help us Make IT Good For Society. Join BCS<br>\ntoday &lt;<a href=\"https://www.bcs.org/membership/events\">https://www.bcs.org/membership/events</a>&gt;</p>\n<p>Please note: if you have any accessibility needs, please let us know via<br>\n<a href=\"mailto:groups@bcs.uk\">groups@bcs.uk</a> and we’ll work with you to make suitable arrangements.</p>\n<p>If you are attending in person, please familiarise yourself with the Visitor<br>\nInstructions &lt;<a href=\"https://www.bcs.org/media/ww4jlkud/visitor-instructions.docx\">https://www.bcs.org/media/ww4jlkud/visitor-instructions.docx</a>&gt; for<br>\nthe BCS London Office.</p>\n<p>For overseas delegates who wish to attend the event, please note that BCS<br>\ndoes not issue invitation letters. Photo by Markus Spiske</p>\n<p>This event is brought to you by: FACS (Formal Aspects of Computing Science)<br>\ngroup<br>\n&lt;<a href=\"https://www.bcs.org/membership-and-registrations/member-communities/facs-formal-aspects-of-computing-science-group\">https://www.bcs.org/membership-and-registrations/member-communities/facs-formal-aspects-of-computing-science-group</a>&gt;</p>",
        "id": 560289754,
        "sender_full_name": "Email Gateway",
        "timestamp": 1764125120
    }
]