[
    {
        "content": "<p>From: Dominique Unruh &lt;<a href=\"mailto:cl-isabelle-users@lists.cam.ac.uk\">cl-isabelle-users@lists.cam.ac.uk</a>&gt;<br>\n[Apologies for multiple copies.]</p>\n<p>We are looking for applicants for the PhD project</p>\n<p>“Towards Zero-Defect Quantum Programs”</p>\n<p>at RWTH Aachen University.</p>\n<p>The aim of the project is to develop methods for statically analysing <br>\nprograms intended for near-term quantum computers by combining <br>\ntechniques from the verification of probabilistic programs and the <br>\nverification of quantum programs. This shall enable developers on <br>\nquantum hardware to drastically reduce the amount of testing and <br>\nsimulation required, and to detect errors early in the program design <br>\nand to understand them more easily, thus streamlining the software <br>\ndevelopment process and significantly reducing testing and simulation <br>\ncosts. A particular focus will be on near-term systems with realistic <br>\nerror models (NISQ), and on use-cases from practice.</p>\n<p>The project is a cooperation between the Chair of Quantum Information <br>\nSystems and the Software Modeling and Verification (MOVES) group at RWTH <br>\nAachen University and will be jointly supervised by Joost-Pieter Katoen <br>\nand Dominique Unruh.</p>\n<p><em>Application deadline:</em> September 25, 23:59 (AoE)</p>\n<p><em>Required profile.</em> Candidates must have (or soon obtain) a master <br>\ndegree in Computer Science, Mathematics, Physics or related area and <br>\nhave completed their studies with excellent grades. You should have <br>\ninterest in performing original, highly competitive scientific research, <br>\npublishing your results in top conferences and scientific journals. <br>\nSelf-motivation and the ability to work both independently and as a team <br>\nplayer in local and international research groups are expected. Fluency <br>\nin English is required; proficiency in German is helpful but not <br>\ncompulsory.</p>\n<p><em>What do we offer?</em> We offer a stimulating international research <br>\nenvironment, the possibility to participate in highly competitive and <br>\ninterdisciplinary research and the opportunity to involve students in <br>\nyour research through project work. Doctoral researchers have a status <br>\nas employee with a salary according to the German federal employee scale <br>\nTV-L E13; the exact salary is subject to your family situation. The <br>\nduration of the position is four years.</p>\n<p>For further details see:</p>\n<p><a href=\"https://dominique-unruh.github.io/qis-chair/positions/zero-defect.html\">https://dominique-unruh.github.io/qis-chair/positions/zero-defect.html</a></p>",
        "id": 389273380,
        "sender_full_name": "Email Gateway",
        "timestamp": 1693945195
    }
]