[
    {
        "content": "<p>From: Osman Hasan &lt;<a href=\"mailto:cl-isabelle-users@lists.cam.ac.uk\">cl-isabelle-users@lists.cam.ac.uk</a>&gt;<br>\nWe are pleased to invite submissions to our upcoming collection for<br>\nDiscover Networks (A Springer Nature Journal) focusing on \"Bridging Formal<br>\nVerification and Neural Networks: Ensuring Reliable Networked Systems,\"<br>\nwhich explores advancements in the formal verification of networks and the<br>\nuse of neural networks to optimize verification processes.</p>\n<p>This collection aims to bring together cutting-edge research at the<br>\nintersection of formal verification methods and networked systems, spanning<br>\na broad range of applications and approaches. The scope of this collection<br>\nincludes, but is not limited to, the formal verification of networks<br>\nparticularly in the context of safety-critical systems. We also seek<br>\ninnovative methods and techniques that leverage neural networks and machine<br>\nlearning to optimize and accelerate the formal verification process. Hybrid<br>\napproaches that combine symbolic methods, model checking, and neural<br>\nnetwork-based strategies are of particular interest.</p>\n<p>Scope and Topics</p>\n<p>This collection welcomes original research and review articles in the<br>\nfollowing areas:</p>\n<ul>\n<li>\n<p>Formal Verification of Networks: Computer networks, network protocols,<br>\nsoftware-defined networks (SDNs), and neural networks in safety-critical<br>\nsystems.</p>\n</li>\n<li>\n<p>Safety-Critical Applications: Cyber-physical systems, IoT networks, and<br>\nmission-critical infrastructures requiring high assurance of correctness<br>\nand security.</p>\n</li>\n<li>\n<p>Neural Network-Based Optimization for Verification: Machine<br>\nlearning-driven acceleration of formal verification techniques.</p>\n</li>\n<li>\n<p>Hybrid Approaches: Combining symbolic methods, model checking, and<br>\nAI-based strategies for efficient verification.</p>\n</li>\n</ul>\n<p>Given the evolving nature of this field, we also encourage short<br>\n(in-progress) papers showcasing promising preliminary results and novel<br>\ndirections.</p>\n<p>Why Submit?</p>\n<p>Engage with a growing community of experts in formal verification and<br>\nnetworked systems.<br>\nGain visibility in a rapidly emerging research area with high impact.<br>\nContribute to the development of robust, safety-assured networked systems.</p>\n<p>Important Dates</p>\n<p>Submission Deadline: June 30, 2025<br>\nFirst-Round review decisions: September 15, 2025<br>\nDeadline for revision Submission: October 15,2025<br>\nNotification of final decisions: December 1, 2025</p>\n<p>Submission Information</p>\n<p>Manuscripts should follow the journal's formatting guidelines and be<br>\nsubmitted through the designated online portal. For further details, please<br>\nvisit <a href=\"https://link.springer.com/collections/dcjcgjigbc\">https://link.springer.com/collections/dcjcgjigbc</a></p>\n<p>Discover Networks is an Open access journal while the Publication costs for<br>\nDiscover Networks will be covered by Springer Nature until 31 December<br>\n2025. Authors whose articles are accepted for publication up to and<br>\nincluding that date will not pay an article-processing charge.</p>\n<p>We look forward to your submissions and to advancing the field of formal<br>\nverification for networks together.</p>\n<p>Best regards,<br>\nOsman Hasan</p>\n<p>-- <br>\nOsman Hasan, Ph.D.<br>\nProfessor<br>\nSchool of Electrical Engineering and Computer Science (SEECS)<br>\nNational University of Sciences and Technology (NUST)<br>\nSector H12, Islamabad, Pakistan<br>\nWeb: <a href=\"http://ohasan.seecs.nust.edu.pk\">ohasan.seecs.nust.edu.pk</a></p>",
        "id": 504321281,
        "sender_full_name": "Email Gateway",
        "timestamp": 1741470738
    }
]