[
    {
        "content": "<p>From: Stepan Holub &lt;<a href=\"mailto:holub@karlin.mff.cuni.cz\">holub@karlin.mff.cuni.cz</a>&gt;<br>\nDear all,</p>\n<p>find attached two little theories related to fractional parts.<br>\nThe first one are useful facts about arithmetic of frac, which, somewhat <br>\nsurprisingly, seem not available in the current distribution.<br>\nThe second one contains motivation for the first one, namely the <br>\ninterpretation of the addition modulo one as an Abelian group.</p>\n<p>Is this of a general interest?</p>\n<p>Stepan</p>\n<p>P.S.: I also have a third little theory showing that the unit interval <br>\nis an abstract metric space with the obvious circular distance (the only <br>\nnontrivial part being the triangle inequality). However,  importing the  <br>\n\"HOL-Analysis.Abstract_Metric_Spaces\" takes quite some time, and the <br>\ntheory is used only twice in HOL, and never in AFP.<br>\nBTW, the time required for import is hardly necessary. <br>\nAbstract_Metric_Spaces.thy itself takes over 5 minutes on my machine, <br>\nand it contains proofs requiring many seconds. These are mostly familiar <br>\ntime consuming smt one-liners most likely found by sledgehammer.<br>\nFor example, line 3995<br>\n       by (smt (verit, ccfv_threshold) comp_apply f g Pi_iff <br>\nuniformly_continuous_map_def)<br>\ntaking over 7 sec. can be reduced to under 100ms by<br>\n   using f g<br>\n   unfolding uniformly_continuous_map_def comp_apply Pi_iff<br>\n   by metis.</p>\n<p><a href=\"/user_uploads/14278/uDTcDvVkZWV6dfN6k2h_Ms1a/Fractional_Part_Arithmetic.thy\">Fractional_Part_Arithmetic.thy</a><br>\n<a href=\"/user_uploads/14278/n9mB75uYM8RBry1pIr9NvTOe/Unit_Interval_Group.thy\">Unit_Interval_Group.thy</a></p>",
        "id": 394481352,
        "sender_full_name": "Email Gateway",
        "timestamp": 1696267845
    },
    {
        "content": "<p>From: Lawrence Paulson &lt;<a href=\"mailto:lp15@cam.ac.uk\">lp15@cam.ac.uk</a>&gt;<br>\nDear Stepan, thanks for the fractional part material, which I’d like to incorporate into the repository. Also thanks for the suggestions to improve the build time of Abstract_Metric_Spaces, Which I have also incorporated. But remember, unless you are a developer (i.e. working with a regularly changing code base), you only ever have to build HOL-Analysis once.</p>\n<p>It would be interesting to see your third example. </p>\n<p>Larry</p>",
        "id": 394619122,
        "sender_full_name": "Email Gateway",
        "timestamp": 1696333974
    },
    {
        "content": "<p>From: Stepan Holub &lt;<a href=\"mailto:holub@karlin.mff.cuni.cz\">holub@karlin.mff.cuni.cz</a>&gt;<br>\nDear Larry,</p>\n<p>thanks for you feedback. I enclose the third theory (I should mention <br>\nthis is a joint work with Stepan Starosta). The theory also includes an <br>\nalternative approach using quotient_type of reals. I will appreciate any <br>\ncomment concerning the comparison of the two approaches. My impression <br>\nis that the locale  approach is (and is considered) the better and more <br>\nflexible option, although it requires a lot of superscripts and carriers...<br>\nAs I mentioned in am older post (which went unnoticed) an intermediate <br>\ngoal was to show that an irrational number generates a dense subgroup of <br>\nthe real unit interval. As far as I can see, existing theories, <br>\nincluding the abstract spaces are not of much help. I will be happy if I <br>\nam wrong.</p>\n<p>Two more comments:</p>\n<ul>\n<li>\n<p>yes, I am aware of the possibility to build the heap of the persistent <br>\nheap of HOL-Analysis. Just a side remark: if I am not missing something <br>\nbasic, this is inconvenient not only for development, but also for <br>\nexploring. I imagine a situation in which I want to see or show somebody <br>\nhow reals are defined, running into \"Cannot update finished theory\" with <br>\nvery little possibilities, an have to restart, and wait anyway if I want <br>\nto see more.</p>\n</li>\n<li>\n<p>in general, the situation is quite common that sledgehammer comes with <br>\nsome crazy looking smt proof which takes ages, but it is quite <br>\nstraightforward to unpack it into a super fast proof, which moreover <br>\ngives the right insight. I wonder whether this process could be somehow <br>\nfacilitated. To start with, we use a macro written by Martin Raska which <br>\ntransforms \"by (smt A B C)\" into \"using A B C by smt\" (and the same for <br>\nmetis)</p>\n</li>\n</ul>\n<p>Best regards</p>\n<p>Stepan</p>\n<p><a href=\"/user_uploads/14278/xOgvZv4_ueBwagcKJN80YNiY/Real_Unit_Interval.thy\">Real_Unit_Interval.thy</a></p>",
        "id": 394668433,
        "sender_full_name": "Email Gateway",
        "timestamp": 1696349738
    }
]