[
    {
        "content": "<p>From: Lex Bailey &lt;<a href=\"mailto:cl-isabelle-users@lists.cam.ac.uk\">cl-isabelle-users@lists.cam.ac.uk</a>&gt;<br>\nHi,<br>\nI have a fork of isabelle, and I want to produce releases of it to<br>\ndistribute to users across macos/ubuntu/windows. How do I generate packages<br>\nlike the ones available on the isabelle website?</p>\n<p>I have come across the program Admin/build_release, and I have tried using<br>\nit, but had no luck.<br>\nThe first hurdle was that it depends on the mercurial history, but I forked<br>\nfrom a git mirror, so mercurial commands don't work. I tried using the -S<br>\noption instead which I think is supposed to bypass this by using an archive<br>\nfile of the repo, and that looked like it was going to work until it<br>\ncrashed with this error:</p>\n<p>*** java.lang.OutOfMemoryError: Requested array size exceeds VM limit</p>\n<p>If this error is unexpected then I'm happy to do some deeper debugging if<br>\nsomeone can provide a few pointers about how and where to start. (I don't<br>\nhave much experience debugging java or scala.) Otherwise: what am I doing<br>\nwrong?</p>\n<p>Thanks.<br>\nLex.</p>",
        "id": 360030571,
        "sender_full_name": "Email Gateway",
        "timestamp": 1684664970
    },
    {
        "content": "<p>From: Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt;<br>\nOn 20/05/2023 16:19, Lex Bailey (via cl-isabelle-users Mailing List) wrote:</p>\n<blockquote>\n<p>I have come across the program Admin/build_release, and I have tried using it, <br>\nbut had no luck.</p>\n</blockquote>\n<blockquote>\n<p>The first hurdle was that it depends on the mercurial history, but I forked <br>\nfrom a git mirror, so mercurial commands don't work.</p>\n</blockquote>\n<p>All git \"mirrors\" of Isabelle consist mainly of broken glass. The Mercurial <br>\nhistory of Isabelle is very valuable to the project, and there is no proper <br>\nway to migrate it to git --- I've investigated that thoroughly a few years ago.</p>\n<p>Better forget git for now. You do need \"hg\" to get it right.</p>\n<blockquote>\n<p>If this error is unexpected then I'm happy to do some deeper debugging if <br>\nsomeone can provide a few pointers about how and where to start. (I don't have <br>\nmuch experience debugging java or scala.) Otherwise: what am I doing wrong?</p>\n</blockquote>\n<p>What is already wrong here is the idea that making Isabelle fork releases is <br>\neasy, just because almost everything works most of the time for official releases.</p>\n<p>For each release I spend a lot of time. And I had to learn many things in <br>\napprox. 20 years doing this. From that background I can only say: Please spare <br>\nthe world bad Isabelle clones!</p>\n<p>You did not even provide any proof why you think you need that. (I do know a <br>\nfew people who make their own internal releases for their working group, but <br>\nthat is hardly a proper public release.)</p>\n<p>Makarius</p>",
        "id": 360119749,
        "sender_full_name": "Email Gateway",
        "timestamp": 1684701847
    },
    {
        "content": "<p>From: Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt;<br>\nOn 22/05/2023 00:02, Lex Bailey wrote:</p>\n<blockquote>\n<p>Currently our install instructions include: install git to clone and build the <br>\nwhole thing locally, or boot a prebuilt VM image.</p>\n</blockquote>\n<p>As as user, I would find this very awkward.</p>\n<p>I've seen bad things happen when users are asked to work with git, often for <br>\nthe very first time: e.g. a bad default on Windows to convert LF to CRLF <br>\neverywhere. (How do you address Windows users anyway?)</p>\n<blockquote>\n<p>We had to fork Isabelle to add one extra feature that we need.<br>\nAs far as I'm aware, the changes we needed to make to Isabelle have already <br>\nbeen deemed unsuitable for upstream Isabelle.</p>\n</blockquote>\n<p>Can you open this existential quantifier, and say explicitly what it is about?</p>\n<p>Isabelle is a system where end-users can do almost everything, without having <br>\nto patch + fork.</p>\n<p>Makarius</p>",
        "id": 360346221,
        "sender_full_name": "Email Gateway",
        "timestamp": 1684779594
    },
    {
        "content": "<p>From: Lex Bailey &lt;<a href=\"mailto:cl-isabelle-users@lists.cam.ac.uk\">cl-isabelle-users@lists.cam.ac.uk</a>&gt;<br>\nHi,</p>\n<p>See my responses inline below...<br>\nI hope these address your concerns.<br>\nI look forward to hearing your suggestions about how best to proceed.</p>\n<p>Thanks.<br>\nLex.</p>\n<p>On Sun, 21 May 2023 at 21:43, Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt; wrote:</p>\n<blockquote>\n<p>On 20/05/2023 16:19, Lex Bailey (via cl-isabelle-users Mailing List) wrote:</p>\n<blockquote>\n<p>I have come across the program Admin/build_release, and I have tried<br>\nusing it,<br>\nbut had no luck.</p>\n</blockquote>\n<blockquote>\n<p>The first hurdle was that it depends on the mercurial history, but I<br>\nforked<br>\nfrom a git mirror, so mercurial commands don't work.</p>\n</blockquote>\n<p>All git \"mirrors\" of Isabelle consist mainly of broken glass. The<br>\nMercurial<br>\nhistory of Isabelle is very valuable to the project, and there is no<br>\nproper<br>\nway to migrate it to git --- I've investigated that thoroughly a few years<br>\nago.</p>\n<p>Better forget git for now. You do need \"hg\" to get it right.<br>\n</p>\n</blockquote>\n<p>As far as I can tell, the release process only uses hg to determine a<br>\nrelease name and to generate an archive of the tracked files. I can easily<br>\nmap this onto git for our fork if I need to. Is there anything else that<br>\nspecifically needs hg?<br>\nFurthermore, we have plenty of experience with git, but not so much with<br>\nmercurial. All our related projects also use git, and it simplifies our<br>\nworkflow. We're not going to move away from git, and we don't expect<br>\nIsabelle to move away from mercurial.</p>\n<blockquote>\n<blockquote>\n<p>If this error is unexpected then I'm happy to do some deeper debugging<br>\nif<br>\nsomeone can provide a few pointers about how and where to start. (I<br>\ndon't have<br>\nmuch experience debugging java or scala.) Otherwise: what am I doing<br>\nwrong?</p>\n</blockquote>\n<p>What is already wrong here is the idea that making Isabelle fork releases<br>\nis<br>\neasy, just because almost everything works most of the time for official<br>\nreleases.<br>\n</p>\n</blockquote>\n<p>I never expected it to be easy.</p>\n<blockquote>\n<p>For each release I spend a lot of time. And I had to learn many things in<br>\napprox. 20 years doing this. From that background I can only say: Please<br>\nspare<br>\nthe world bad Isabelle clones!<br>\n</p>\n</blockquote>\n<p>I'm trying to make proper releases so that this fork is NOT a bad isabelle<br>\nclone. It makes minimal changes to isabelle (just enough to enable one<br>\nsmall extra feature)<br>\nCurrently our install instructions include: install git to clone and build<br>\nthe whole thing locally, or boot a prebuilt VM image.<br>\nIn my mind, this kind of thing is what makes a \"bad Isabelle clone\". If we<br>\nwere able to make proper releases using the existing process then we would<br>\nhave a \"good Isabelle clone\".<br>\nI'm asking how to do this because I deliberately want to avoid our fork<br>\nbeing labeled as a bad fork.<br>\nThis fork is going to be used by students, including students that are<br>\ntotally new to Isabelle, so we want their first experience of installing<br>\nIsabelle to be an easy one.</p>\n<blockquote>\n<p>You did not even provide any proof why you think you need that. (I do know<br>\na<br>\nfew people who make their own internal releases for their working group,<br>\nbut<br>\nthat is hardly a proper public release.)</p>\n<p>I didn't know that I needed to justify making a fork release before asking<br>\nfor help.<br>\nWe had to fork Isabelle to add one extra feature that we need.<br>\nAs far as I'm aware, the changes we needed to make to Isabelle have already<br>\nbeen deemed unsuitable for upstream Isabelle.</p>\n</blockquote>\n<blockquote>\n<p>Makarius</p>\n</blockquote>",
        "id": 360624437,
        "sender_full_name": "Email Gateway",
        "timestamp": 1684870710
    },
    {
        "content": "<p>From: Lex Bailey &lt;<a href=\"mailto:cl-isabelle-users@lists.cam.ac.uk\">cl-isabelle-users@lists.cam.ac.uk</a>&gt;<br>\nI agree that we shouldn't expect users to install Git to be able to use<br>\nIsabelle or any fork of it.</p>\n<p>The change that we have adds in an ML command<br>\n\"Active.run_system_shell_command\", which is then used by some ML code in a<br>\ntheory file to provide clickable text in the output pane which lets the<br>\nuser run the command in a console pane. Correct me if I'm wrong, but my<br>\nunderstanding is that this change was already rejected as it is \"risky\".<br>\n(it makes it easier for theory files to run arbitrary commands on a users<br>\nmachine when they might not expect that to be possible)</p>\n<p>If there is a way that we can achieve that without forking then that would<br>\nbe ideal. If that is the case then how do we do that? and what is the best<br>\nway to package a vanilla Isabelle distribution with some custom heap images?</p>\n<p>Full patch is here:<br>\n<a href=\"https://github.com/isabelle-utp/interaction-trees/blob/master/Isabelle2021-1-CyPhyAssure.diff\">https://github.com/isabelle-utp/interaction-trees/blob/master/Isabelle2021-1-CyPhyAssure.diff</a><br>\n(there is also a patch for the 2022 release)</p>\n<p>Thanks.</p>",
        "id": 360624452,
        "sender_full_name": "Email Gateway",
        "timestamp": 1684870716
    }
]