[
    {
        "content": "<p>From: Alessandro Bruni &lt;<a href=\"mailto:cl-isabelle-users@lists.cam.ac.uk\">cl-isabelle-users@lists.cam.ac.uk</a>&gt;<br>\nThe 26th International Symposium on<br>\nPrinciples and Practice of Declarative Programming</p>\n<p>Part of FM 2024 and co-located with LOPSTR 2024, FACS 2024, FMICS 2024,<br>\nand TAP 2024.</p>\n<p>September 9-11, 2024 - Milan, Italy</p>\n<p><a href=\"https://ppdp2024.github.io/\">https://ppdp2024.github.io/</a></p>\n<p>Important dates:</p>\n<ul>\n<li>Title and abstract registration: 06 May 2024 (AoE)</li>\n<li>Paper submission: 13 May 2024 (AoE)</li>\n<li>Rebuttal period (48 hours): 22-23 June 2024 (AoE)</li>\n<li>Author notification: 3 July 2024</li>\n<li>Final paper version: 24 July 2024</li>\n</ul>\n<p>OVERVIEW</p>\n<p>The PPDP 2024 symposium brings together researchers from the<br>\ndeclarative programming communities, including those working in the<br>\nfunctional, logic, answer-set, and constraint handling programming<br>\nparadigms. The goal is to stimulate research in the use of logical<br>\nformalisms and methods for analyzing, performing, specifying, and<br>\nreasoning about computations, including mechanisms for concurrency,<br>\nsecurity, static analysis, and verification.</p>\n<p>PPDP 24  will be held at Politecnico di Milano, Milan, Italy and,<br>\nas part of FM 2024. At least one of the authors of an accepted<br>\npaper is expected to attend the conference and present the paper.<br>\nInformation about venue and travel will be available on the FM 2024<br>\nwebsite.</p>\n<p>Submissions are invited on all topics related to declarative<br>\nprogramming, from principles to practice, from foundations to<br>\napplications. Topics of interest include, but are not limited to:</p>\n<ul>\n<li>\n<p>Language Design: domain-specific languages; interoperability;<br>\nconcurrency, parallelism and distribution; modules; functional<br>\nlanguages; reactive languages; languages with objects; languages for<br>\nquantum computing; languages inspired by biological and chemical<br>\ncomputation; metaprogramming.</p>\n</li>\n<li>\n<p>Declarative languages in artificial intelligence: logic programming;<br>\ndatabase languages; knowledge representation languages;<br>\nprobabilistic languages; differentiable languages.</p>\n</li>\n<li>\n<p>Implementations: abstract machines; interpreters; compilation;<br>\ncompile-time and run-time optimization; memory management.</p>\n</li>\n<li>\n<p>Foundations: types; logical frameworks; monads and effects;<br>\nsemantics.</p>\n</li>\n<li>\n<p>Analysis and Transformation: partial evaluation; abstract<br>\ninterpretation; control flow; data flow; information flow;<br>\ntermination analysis; resource analysis; type inference and type<br>\nchecking; verification; validation; debugging; testing.</p>\n</li>\n<li>\n<p>Tools and Applications: programming and proof environments;<br>\nverification tools; case studies in proof assistants or interactive<br>\ntheorem provers; certification; novel applications of declarative<br>\nprogramming inside and outside of CS; declarative programming<br>\npearls; practical experience reports and industrial application;<br>\neducation.</p>\n</li>\n</ul>\n<p>PAPER SUBMISSION</p>\n<p>Submissions can be made in three categories:</p>\n<ul>\n<li>Regular Research Papers,</li>\n<li>System Descriptions, and</li>\n<li>Experience Reports.</li>\n</ul>\n<p>Submissions of Research Papers must present original research which is<br>\nunpublished and not submitted elsewhere. They must not exceed 12 pages<br>\nACM style 2-column (including figures, but excluding bibliography).<br>\nWork that already appeared in unpublished or informally<br>\npublished workshop proceedings may be submitted (please contact the PC<br>\nchair in case of questions). Research papers will be judged on<br>\noriginality, significance, correctness, clarity, and readability.</p>\n<p>Submission of System Descriptions must describe a working system whose<br>\ndescription has not been published or submitted elsewhere. They must<br>\nnot exceed 10 pages and should contain a link to a working<br>\nsystem. System Descriptions must be marked as such at the time of<br>\nsubmission and will be judged on originality, significance,<br>\nusefulness, clarity, and readability.</p>\n<p>Submissions of Experience Reports are meant to help create a body of<br>\npublished, refereed, citable evidence where declarative programming<br>\nsuch as functional, logic, answer-set, constraint programming, etc.,<br>\nis used in practice. They must not exceed 5 pages <strong>including references</strong>.<br>\nExperience Reports must be marked as such at the time<br>\nof submission and need not report original research results. They will<br>\nbe judged on significance, usefulness, clarity, and readability.</p>\n<p>Possible topics for an Experience Report include, but are not limited to:</p>\n<ul>\n<li>\n<p>insights gained from real-world projects using declarative<br>\nprogramming</p>\n</li>\n<li>\n<p>comparison of declarative programming with conventional<br>\nprogramming in the context of an industrial project or a<br>\nuniversity curriculum</p>\n</li>\n<li>\n<p>curricular issues encountered when using declarative programming<br>\nin education</p>\n</li>\n<li>\n<p>real-world constraints that created special challenges for an<br>\nimplementation of a declarative language or for declarative<br>\nprogramming in general</p>\n</li>\n<li>\n<p>novel use of declarative programming in the classroom</p>\n</li>\n<li>\n<p>programming pearl that illustrates a nifty new data structure or<br>\nprogramming technique.</p>\n</li>\n</ul>\n<p>Supplementary material may be provided via a link to an extended<br>\nversion of the submission (recommended), or in a clearly marked appendix<br>\nbeyond the above-mentioned page limits. Reviewers are not required to<br>\nstudy extended versions or any material beyond the respective page<br>\nlimit. Material beyond the page limit will not be included in the<br>\nfinal published version.</p>\n<p>SUBMISSION GUIDELINES</p>\n<p>For each paper category, you must use the most recent version of the<br>\n\"Current ACM Master Template\" which is available at<br>\n(<a href=\"https://www.acm.org/publications/proceedings-template\">https://www.acm.org/publications/proceedings-template</a>). You must use<br>\nthe LaTeX sigconf proceedings template as the conference organizers<br>\nare unable to process final submissions in other formats.</p>\n<p>Authors should note ACM's statement on author's<br>\nrights (<a href=\"http://authors.acm.org/\">http://authors.acm.org/</a>) which apply to final papers.<br>\nSubmitted papers should meet the requirements of ACM's plagiarism<br>\npolicy] <a href=\"http://www.acm.org/publications/policies/plagiarism_policy\">http://www.acm.org/publications/policies/plagiarism_policy</a>).</p>\n<p>The reviewing is single-blind, with a two-days rebuttal phase.</p>\n<p>PROGRAM CHAIRS</p>\n<p>Alessandro Bruni, IT-University of Copenhagen, Denmark,<br>\nAlberto Momigliano, Università degli studi di Milano, Italy</p>\n<p>PROGRAM COMMITTEE MEMBERS</p>\n<p>Amy Felty        University of Ottawa<br>\nKaustuv Chaudhuri    INRIA<br>\nCristina Matache    University of Edinburgh<br>\nMałgorzata Biernacka    University of Wroclaw<br>\nGabriele Vanoni        Università di Bologna and INRIA Sophia Antipolis<br>\nNiccolò Veltri        Tallinn University of Technology<br>\nMarco Gavanelli        Università di Ferrara<br>\nMarino Miculan        Università di Udine<br>\nRoberto Casadei        Università di Bologna<br>\nYannick Zakowski    Inria<br>\nCarlos Olarte        Université Sorbonne Paris Nord<br>\nFrank Pfenning        Carnegie Mellon University<br>\nAnders Schlichtkrull    Aalborg University<br>\nPaola Giannini        Universita' del Piemonte Orientale<br>\nWen Kokke        University of Strathclyde<br>\nPaul Rowe        The MITRE Corporation<br>\nXuejing Huang             University of Hong Kong</p>\n<p><a href=\"/user_uploads/14278/cVgp7t4j2qDZ4e17n5f1Tx5Q/brun.vcf\">brun.vcf</a></p>",
        "id": 421013539,
        "sender_full_name": "Email Gateway",
        "timestamp": 1707738971
    }
]