[
    {
        "content": "<p>From: Ian Hayes &lt;<a href=\"mailto:cl-isabelle-users@lists.cam.ac.uk\">cl-isabelle-users@lists.cam.ac.uk</a>&gt;<br>\nI'm using MacOS Sequoia 15.3.</p>\n<p>Issue 1:<br>\nFor the attached theory file,<br>\na Command click on the reference to lemma subset in locale test2, it <br>\ntakes one to the lemma in locale test1, however,<br>\na Command click on the reference to HT_def in locale test2 it takes one <br>\nto the head of locale test2.<br>\nA Command click on the reference to HT_def in locale test1 it takes one <br>\nto the definition (in test1) as expected.<br>\nA Command click on the reference to XX_def in locale test2 it takes one <br>\nto the definition (outside the locales) as expected.<br>\nThe difference is that XX is defined outside the locale but HT is <br>\ndefined inside.<br>\nI think same behaviour occurs in Isabelle-2024.</p>\n<p>Issue 2: Again this is not a new issue.<br>\nA slight movement of the mouse when Command clicking through to a <br>\nlemma/definition means it fails and selects the character under the <br>\ncursor. I'm guessing this is something to do with the fact that the <br>\nCommand click occurs, not on pressing the mouse, but when it is then <br>\nreleased. For example, if you Command press and move the mouse a little <br>\nand then release, it won't go through to the definition but rather <br>\nselects the text under the cursor. And the behaviour is worse when I use <br>\nan Apple magic mouse in place of an old mouse -- I suspect because the <br>\nMagic mouse will generate a small movement more easily.</p>\n<p>A similar issue occurs when clicking on a the output of sledgehammer to <br>\nget it to copy the suggested proof into the theory file.</p>\n<p>Another issue is double-clicking the name of a theory in the theories <br>\nmenu is also flaky if the mouse moves slightly between the two clicks, <br>\neven if one remains within the same menu item.</p>\n<p>Many thanks in advance<br>\nIan</p>\n<p>On 4/2/2025 05:22, Makarius wrote:</p>\n<blockquote>\n<p>Dear Isabelle users,</p>\n<p>we are now ready to start the release process for Isabelle2025 (March <br>\n2025). See also the continuously updated blog entry <br>\n<a href=\"https://isabelle-dev.sketis.net/phame/post/view/85/release_candidates_for_isabelle2025\">https://isabelle-dev.sketis.net/phame/post/view/85/release_candidates_for_isabelle2025</a></p>\n<p>The current release candidate is available from <br>\n<a href=\"https://isabelle.in.tum.de/website-Isabelle2025-RC1\">https://isabelle.in.tum.de/website-Isabelle2025-RC1</a></p>\n<p>A corresponding version of the Archive of Formal Proofs is <br>\n<a href=\"https://isabelle.sketis.net/repos/afp-devel/rev/634f3bc5f94b\">https://isabelle.sketis.net/repos/afp-devel/rev/634f3bc5f94b</a></p>\n<p>The NEWS and ANNOUNCE files are already up-to-date, but some <br>\ndocumentation still requires update.</p>\n<p>The rules of the game are the same as in the past few decades: NOW is <br>\nthe window of opportunity to discuss observations and problems, in <br>\norder to get changes into the code-base. The final release remains <br>\nunchangeable, until the next one (8-10 months later).</p>\n<p>Any feedback about Isabelle release candidates should be posted with a <br>\nmeaningful Subject, not just a clone of this announcement.</p>\n<p>Makarius</p>\n</blockquote>\n<p><a href=\"/user_uploads/14278/v3Va8_-IYVOt6XDoH--2kAfy/test2.thy\">test2.thy</a></p>",
        "id": 498049563,
        "sender_full_name": "Email Gateway",
        "timestamp": 1738825545
    },
    {
        "content": "<p>From: Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt;<br>\nOn 06/02/2025 08:04, Ian Hayes (via cl-isabelle-users Mailing List) wrote:</p>\n<blockquote>\n<p>Issue 1:<br>\nFor the attached theory file,<br>\na Command click on the reference to lemma subset in locale test2, it takes one <br>\nto the lemma in locale test1, however,<br>\na Command click on the reference to HT_def in locale test2 it takes one to the <br>\nhead of locale test2.<br>\nA Command click on the reference to HT_def in locale test1 it takes one to the <br>\ndefinition (in test1) as expected.<br>\nA Command click on the reference to XX_def in locale test2 it takes one to the <br>\ndefinition (outside the locales) as expected.<br>\nThe difference is that XX is defined outside the locale but HT is defined inside.<br>\nI think same behaviour occurs in Isabelle-2024.</p>\n</blockquote>\n<p>This refers to the attached test2.thy which imports test1, but I did not see <br>\ntest1.thy: using \"imports Main\" instead works, but maybe you intended to show <br>\nsomething else in test1.thy?</p>\n<p>Anyway, I have clicked through the formal entities as sketched above, and <br>\ndon't see anything suspicious. Note that \"locale test2 = test1 ...\" in is not <br>\njust a plain import, but a new locale based on existing locale(s) via locale <br>\nexpressions that are internally turned into morphisms. Formal entities of the <br>\nnew locale then get the position of the morphism that was applied to the old <br>\nentities, instead of the old entities, or both the morphism and entity. That <br>\ncould be certainly improved at some point, but it is not a regression from <br>\nIsabelle versions in the past decade.</p>\n<p>Side-remark: mixing up theory names (test1, test2) and local names (test1, <br>\ntest2) is generally a bad idea: the name-space policies have been specifically <br>\ndesigned some decades ago under the assumption that both kinds are disjoint. <br>\nThis is easy to achieve by following ancient naming conventions: theory names <br>\ncapitalized, almost everything inside a theory lower-case (including types, <br>\nclasses, locales). A rare use of capitalized names inside a theory is OK.</p>\n<blockquote>\n<p>Issue 2: Again this is not a new issue.<br>\nA slight movement of the mouse when Command clicking through to a lemma/ <br>\ndefinition means it fails and selects the character under the cursor. I'm <br>\nguessing this is something to do with the fact that the Command click occurs, <br>\nnot on pressing the mouse, but when it is then released. For example, if you <br>\nCommand press and move the mouse a little and then release, it won't go <br>\nthrough to the definition but rather selects the text under the cursor. And <br>\nthe behaviour is worse when I use an Apple magic mouse in place of an old <br>\nmouse -- I suspect because the Magic mouse will generate a small movement more <br>\neasily.</p>\n</blockquote>\n<p>It sounds like input device problems. I don't have an Apple mouse nor a <br>\ntouchpad to test it: I always use an old Logitech wheel-mouse with my test <br>\nmachine Mac Mini for testing.</p>\n<p>I do have macOS Sequoia 15.3 available.</p>\n<blockquote>\n<p>A similar issue occurs when clicking on a the output of sledgehammer to get it <br>\nto copy the suggested proof into the theory file.</p>\n<p>Another issue is double-clicking the name of a theory in the theories menu is <br>\nalso flaky if the mouse moves slightly between the two clicks, even if one <br>\nremains within the same menu item.</p>\n</blockquote>\n<p>I cannot reproduce that with my Apple test equipment.</p>\n<p>Can seasoned Apple user confirm any of these problems? Is there anything new <br>\nin macOS Sequoia and/or Isabelle2025-RC1?</p>\n<p>Makarius</p>",
        "id": 498198764,
        "sender_full_name": "Email Gateway",
        "timestamp": 1738871310
    },
    {
        "content": "<p>From: \"Thiemann, René\" &lt;<a href=\"mailto:cl-isabelle-users@lists.cam.ac.uk\">cl-isabelle-users@lists.cam.ac.uk</a>&gt;</p>\n<blockquote>\n<blockquote>\n<p>Issue 2: Again this is not a new issue.<br>\nA slight movement of the mouse when Command clicking through to a lemma/ definition means it fails and selects the character under the cursor. I'm guessing this is something to do with the fact that the Command click occurs, not on pressing the mouse, but when it is then released. For example, if you Command press and move the mouse a little and then release, it won't go through to the definition but rather selects the text under the cursor. And the behaviour is worse when I use an Apple magic mouse in place of an old mouse -- I suspect because the Magic mouse will generate a small movement more easily.</p>\n</blockquote>\n<p>It sounds like input device problems. I don't have an Apple mouse nor a touchpad to test it: I always use an old Logitech wheel-mouse with my test machine Mac Mini for testing.</p>\n<p>I do have macOS Sequoia 15.3 available.</p>\n<blockquote>\n<p>A similar issue occurs when clicking on a the output of sledgehammer to get it to copy the suggested proof into the theory file.<br>\nAnother issue is double-clicking the name of a theory in the theories menu is also flaky if the mouse moves slightly between the two clicks, even if one remains within the same menu item.</p>\n</blockquote>\n<p>I cannot reproduce that with my Apple test equipment.</p>\n<p>Can seasoned Apple user confirm any of these problems? Is there anything new in macOS Sequoia and/or Isabelle2025-RC1?</p>\n</blockquote>\n<p>I can confirm the behaviour: if you move the mouse-pointer between click-and-release or between a double-click, then this<br>\nis interpreted differently than a standard click and double-click without movement when running Isabelle 2025-RC1 and Seqouia 15.3.</p>\n<p>However, neither with my laptop touchpad nor with a classical (non-magic) mouse I a have a problem that there actually<br>\nis movement between click-release or double-click, if I do not (on purpose) move my finger on the touchpad, or move the mouse<br>\nduring these actions.</p>\n<p>Best,<br>\nRené</p>",
        "id": 498361829,
        "sender_full_name": "Email Gateway",
        "timestamp": 1738941005
    },
    {
        "content": "<p>From: Ian Hayes &lt;<a href=\"mailto:cl-isabelle-users@lists.cam.ac.uk\">cl-isabelle-users@lists.cam.ac.uk</a>&gt;<br>\nHi Makarius,</p>\n<p>Issue 1: Apologies test2 should just include Main (I was experimenting <br>\nwith references across theory files and found that it was just across <br>\nlocales so copied test1.thy into test2.thy so there was just a single <br>\nfile but forgot to replace the import). I agree it is not a regression <br>\nand look forward to improvement at some point in the future. <br>\nSide-remark: The naming was me being lazy in building a minimal test file.</p>\n<p>Issue2: For MacOS for a left mouse click there are the following mouse <br>\nevents:</p>\n<p>* Press down the button:  NSLeftMouseDown which invokes mouseDown<br>\n  * Move the mouse while pressing the button: NSLeftMouseDragged which<br>\n    invokes mouseDragged</p>\n<p>* Release the button:|NSLeftMouseUp which invokesmouseUp|<br>\n  * ||Move the mouse without pressing any button: NSMouseMoved which<br>\n    invokes mouseMoved</p>\n<p>A combination of mouseDown-mouseDragged-mouseUp selects the text between <br>\nthe coordinates of the mouseDown and mouseUp. The problem with <br>\nCommand-click would appear to be that the text selection behaviour is <br>\nhappening when the Command key is held down (for a click through) and <br>\nthe selection behaviour is taking precedence over the Command click*. If <br>\nthe selection behaviour was disabled while the Command key is held down <br>\nthat might fix the problem. Alternatively, the Command click behaviour <br>\nshould take precedence over selection of text.</p>\n<p>*In practice, sometimes it recognises the Command-click and other it <br>\nrecognises a selection, so this looks like a classic (concurrency) race <br>\nbetween the two actions. With the Command key held down, mouseDown-move <br>\na few characters-mouseUp always selects the text, even if it is in the <br>\none name.</p>\n<p>An alternative scenario is the following.<br>\nThe mouseDown-mouseUp combination (*without *Command key held) moves the <br>\ncursor to the location of the mouse. With the Command key held down, it <br>\nnon-deterministically either moves the cursor or clicks through to the <br>\ndefinition. Again this looks like a race between the two actions. If the <br>\ncursor movement action was disabled while the Command key is held down <br>\nor the Command-click given precedence that may work.</p>\n<p>From my experimentation, it appears the Command-click does not happen <br>\nuntil the mouse is released (mouseUp). If the Command click action was <br>\ninvoked on mouseDown, the issue might be resolved.</p>\n<p>Using the track-pad rather than the mouse is more reliable but can still <br>\nexhibit the same behaviour. The detailed behaviour is that with Command <br>\nheld down, mouseDown moves the cursor to the mouse location and on <br>\nmouseUp it moves it to the definition of the item. On some occasions it <br>\njust moves the cursor to the mouse location and does not go to the <br>\ndefinition, and on other occasions it moves the cursor to the mouse <br>\nposition and removes the highlight from the item under the mouse, where <br>\nby highlight, I mean the highlighting that occurs when one presses the <br>\nCommand key.</p>\n<p>Another symptom is that if the cursor is on name and the Command key <br>\nheld, the name is not highlighted, but if one leaves the Command key <br>\nheld and moves the cursor a little, the name is then highlighted.<br>\nA related symptom is that when the Command key is held and the name <br>\nhighlighted for a couple of seconds, a pop-up window appears and the <br>\nhighlight is removed from the name until one moves the cursor again.</p>\n<p>An old Dell wheel mouse is more reliable than the track-pad, which is in <br>\nturn more reliable than a magic mouse. But note that even with the old <br>\nDell mouse a small mouse movement between down and up gives a cursor <br>\nmove or select text action, and not a click-through to definition <br>\naction. The symptoms occur on both my old M1 laptop and a new mini with <br>\na fresh install of everything.</p>\n<p>Probably not relevant here but in the Finder under MacOS, if wants to <br>\nselect multiple files, one holds down the Command key while clicking on <br>\neach file.</p>\n<p>Disclaimer: I'm not a mouse event handling expert.</p>\n<p>Thanks in advance<br>\nIan</p>\n<p>On 7/2/2025 05:47, Makarius wrote:</p>\n<blockquote>\n<p>On 06/02/2025 08:04, Ian Hayes (via cl-isabelle-users Mailing List) <br>\nwrote:</p>\n<blockquote>\n<p>Issue 1:<br>\nFor the attached theory file,<br>\na Command click on the reference to lemma subset in locale test2, it <br>\ntakes one to the lemma in locale test1, however,<br>\na Command click on the reference to HT_def in locale test2 it takes <br>\none to the head of locale test2.<br>\nA Command click on the reference to HT_def in locale test1 it takes <br>\none to the definition (in test1) as expected.<br>\nA Command click on the reference to XX_def in locale test2 it takes <br>\none to the definition (outside the locales) as expected.<br>\nThe difference is that XX is defined outside the locale but HT is <br>\ndefined inside.<br>\nI think same behaviour occurs in Isabelle-2024.</p>\n</blockquote>\n<p>This refers to the attached test2.thy which imports test1, but I did <br>\nnot see test1.thy: using \"imports Main\" instead works, but maybe you <br>\nintended to show something else in test1.thy?</p>\n<p>Anyway, I have clicked through the formal entities as sketched above, <br>\nand don't see anything suspicious. Note that \"locale test2 = test1 <br>\n...\" in is not just a plain import, but a new locale based on existing <br>\nlocale(s) via locale expressions that are internally turned into <br>\nmorphisms. Formal entities of the new locale then get the position of <br>\nthe morphism that was applied to the old entities, instead of the old <br>\nentities, or both the morphism and entity. That could be certainly <br>\nimproved at some point, but it is not a regression from Isabelle <br>\nversions in the past decade.</p>\n<p>Side-remark: mixing up theory names (test1, test2) and local names <br>\n(test1, test2) is generally a bad idea: the name-space policies have <br>\nbeen specifically designed some decades ago under the assumption that <br>\nboth kinds are disjoint. This is easy to achieve by following ancient <br>\nnaming conventions: theory names capitalized, almost everything inside <br>\na theory lower-case (including types, classes, locales). A rare use of <br>\ncapitalized names inside a theory is OK.</p>\n<blockquote>\n<p>Issue 2: Again this is not a new issue.<br>\nA slight movement of the mouse when Command clicking through to a <br>\nlemma/ definition means it fails and selects the character under the <br>\ncursor. I'm guessing this is something to do with the fact that the <br>\nCommand click occurs, not on pressing the mouse, but when it is then <br>\nreleased. For example, if you Command press and move the mouse a <br>\nlittle and then release, it won't go through to the definition but <br>\nrather selects the text under the cursor. And the behaviour is worse <br>\nwhen I use an Apple magic mouse in place of an old mouse -- I suspect <br>\nbecause the Magic mouse will generate a small movement more easily.</p>\n</blockquote>\n<p>It sounds like input device problems. I don't have an Apple mouse nor <br>\na touchpad to test it: I always use an old Logitech wheel-mouse with <br>\nmy test machine Mac Mini for testing.</p>\n<p>I do have macOS Sequoia 15.3 available.</p>\n<blockquote>\n<p>A similar issue occurs when clicking on a the output of sledgehammer <br>\nto get it to copy the suggested proof into the theory file.</p>\n<p>Another issue is double-clicking the name of a theory in the theories <br>\nmenu is also flaky if the mouse moves slightly between the two <br>\nclicks, even if one remains within the same menu item.</p>\n</blockquote>\n<p>I cannot reproduce that with my Apple test equipment.</p>\n<p>Can seasoned Apple user confirm any of these problems? Is there <br>\nanything new in macOS Sequoia and/or Isabelle2025-RC1?</p>\n<p>Makarius<br>\n</p>\n</blockquote>",
        "id": 498655252,
        "sender_full_name": "Email Gateway",
        "timestamp": 1739152236
    }
]