[
    {
        "content": "<p>From: \"Nadel, Alexander\" &lt;<a href=\"mailto:alexander.nadel@intel.com\">alexander.nadel@intel.com</a>&gt;<br>\n<strong>* SMT 2021: 19th International Workshop on Satisfiability Modulo Theories </strong>*<br>\n                          Los Angeles, CA, United States, July 18-19, 2021</p>\n<p>Conference website: <a href=\"http://smt-workshop.cs.uiowa.edu/2021/\">http://smt-workshop.cs.uiowa.edu/2021/</a><br>\nSubmission link: <a href=\"https://easychair.org/conferences/?conf=smt2021\">https://easychair.org/conferences/?conf=smt2021</a><br>\nSubmission deadline: April 30, 2021</p>\n<p><strong>* Overview </strong>*</p>\n<p>SMT 2021 will be co-located with CAV 2021 in Los Angeles.</p>\n<p>The aim of the workshop is to bring together researchers and users of SMT tools and techniques. Relevant topics include but are not limited to:</p>\n<p>•   Decision procedures and theories of interest<br>\n•   Combinations of decision procedures<br>\n•   Novel implementation techniques<br>\n•   Benchmarks and evaluation methodologies<br>\n•   Applications and case studies<br>\n•   Theoretical results</p>\n<p>Papers on pragmatic aspects of implementing and using SMT tools, as well as novel applications of SMT, are especially encouraged.</p>\n<p><strong>* Important Dates </strong>*</p>\n<p>•   Paper submission: April 30, 2021<br>\n•   Notification: May 28, 2021<br>\n•   Workshop: July 18-19, 2021</p>\n<p><strong>* Submission Guidelines </strong>*</p>\n<p>We invite researchers to submit extended abstracts, original papers, and presentation only-papers. We intend to publish open-access proceedings for SMT 2021 as a volume of the EPiC Series EasyChair Proceedings. Extended abstracts and original papers must not have been published or submitted elsewhere and will be included in the proceedings.</p>\n<p>•   Extended abstracts: given the informal style of the workshop, we strongly encourage the submission of preliminary reports of work in progress. They may range in length from very short (a couple of pages) to the full 10 pages and they will be judged based on the expected level of interest for the SMT community.<br>\n•   Original papers: contain original research and sufficient detail to assess the merits and relevance of the submission. For papers reporting experimental results, authors are strongly encouraged to make their data available.<br>\n•   Presentation-only papers: describe work recently published or submitted and will not be included in the proceedings. We see this as a way to provide additional access to important developments that SMT Workshop attendees may be unaware of.</p>\n<p>Papers in all three categories will be peer-reviewed. Papers should not exceed 10 pages and should be in standard-conforming PDF. Technical details may be included in an appendix to be read at the reviewers' discretion. Final versions should be prepared in LaTeX using the easychair.cls class file. (The 10 page limit does not include references.)</p>\n<p>To submit, please go to the EasyChair page <a href=\"https://easychair.org/conferences/?conf=smt2021\">https://easychair.org/conferences/?conf=smt2021</a> and follow the instructions there.</p>\n<p><strong>* Organizers and Program Committee </strong>*</p>\n<p>See <a href=\"http://smt-workshop.cs.uiowa.edu/2021/committees.shtml\">http://smt-workshop.cs.uiowa.edu/2021/committees.shtml</a>.</p>\n<p>Invited Speakers<br>\n•   Karem Sakallah, University of Michigan<br>\n•   Guy Katz, University of Jerusalem</p>\n<hr>\n<p>Intel Israel (74) Limited</p>\n<p>This e-mail and any attachments may contain confidential material for<br>\nthe sole use of the intended recipient(s). Any review or distribution<br>\nby others is strictly prohibited. If you are not the intended<br>\nrecipient, please contact the sender and delete all copies.</p>",
        "id": 228122495,
        "sender_full_name": "Email Gateway",
        "timestamp": 1614509332
    }
]