[
    {
        "content": "<p>From: Giorgio Audrito &lt;<a href=\"mailto:cl-isabelle-users@lists.cam.ac.uk\">cl-isabelle-users@lists.cam.ac.uk</a>&gt;<br>\nDear all,</p>\n<p>We are seeking nominations for the 2025 Dahl-Nygaard junior and senior<br>\nprizes!</p>\n<p><strong> Deadline: 31 January 2025 </strong></p>\n<p>Established by AITO in 2004, these annual prizes are named after Ole-Johan<br>\nDahl and Kristen Nygaard, whose pioneering conceptual and technical work in<br>\nthe sixties shaped that view of programming and modeling which is now known<br>\nas object-orientation.</p>\n<p>The junior prize is awarded to a researcher who obtained the PhD degree at<br>\nmost 7 years before the award year, excluding any parental leave. The prize<br>\nrecognises a promising contribution to the field through a paper, a thesis,<br>\nor a prototype implementation.</p>\n<p>The senior prize is awarded to a researcher who has made a significant<br>\nlong-term contribution to the field in research or engineering.</p>\n<p>The winners of both prizes will be given the opportunity of giving an<br>\ninvited talk at ECOOP 2025 in Bergen, Norway.</p>\n<p>Lists of previous winners of the prizes are given below.</p>\n<p>Nominations are due by January 31 and should be made using this form:<br>\n<a href=\"https://docs.google.com/forms/d/e/1FAIpQLSd9qQb8MmtkWM01vLhIpqPTIlmgciNwDiiLtSxot05x6k6c4w/viewform\">https://docs.google.com/forms/d/e/1FAIpQLSd9qQb8MmtkWM01vLhIpqPTIlmgciNwDiiLtSxot05x6k6c4w/viewform</a></p>\n<p>Please help me by circulating this call for nominations as widely as<br>\npossible, and I very much look forward to receiving your nominations!</p>\n<p>Thanks</p>\n<p>Klaus Ostermann</p>\n<p>Dahl-Nygaard prize committee chair, 2025</p>\n<p>2024, Vienna</p>\n<p>Rachid Guerraoui (senior prize), and Alvin Cheung (junior prize)</p>\n<p>2023, Seattle</p>\n<p>Sophia Drosspoulou (senior prize), and Heather Miller (junior prize</p>\n<p>2022, Berlin</p>\n<p>Dan Ingalls(senior prize), and Magnus Madsen (junior prize)</p>\n<p>2021, Aarhus</p>\n<p>Kim Bruce (senior prize), and Karim Ali (junior prize)</p>\n<p>2020, Berlin</p>\n<p>Jan Vitek (senior prize), and Jonathan Bell (junior prize)</p>\n<p>2019, London</p>\n<p>Laurie Hendren (senior prize), and Ilya Sergey (junior prize)</p>\n<p>2018, Amsterdam</p>\n<p>Lars Bak (senior prize), and Guoqing Harry Xu (junior prize)</p>\n<p>2017, Barcelona</p>\n<p>Gilad Bracha (senior prize), and Ross Tate (junior prize)</p>\n<p>2016, Rome</p>\n<p>James Noble (senior prize), and Emina Torlak (junior prize)</p>\n<p>2015, Prague</p>\n<p>Bjarne Stroustrup (senior prize), and Alexander J. Summers (junior prize)</p>\n<p>2014, Uppsala</p>\n<p>William Cook (senior prize), Robert France (senior prize), and Tudor Gîrba<br>\n(junior prize)</p>\n<p>2013, Montpellier</p>\n<p>Oscar Nierstrasz (senior prize) and Matthew Parkinson (junior prize)</p>\n<p>2012, Beijing</p>\n<p>Gregor Kiczales (senior prize) and Tobias Wrigstad (junior prize)</p>\n<p>2011, Lancaster</p>\n<p>Craig Chambers (senior prize) and Atsushi Igarashi (junior prize)</p>\n<p>2010, Maribor</p>\n<p>Doug Lea (senior prize) and Erik Ernst (junior prize)</p>\n<p>2009, Genoa</p>\n<p>David Ungar (senior prize)</p>\n<p>2008, Paphos</p>\n<p>Akinori Yonezawa (senior prize) and Wolfgang De Meuter (junior prize)</p>\n<p>2007, Berlin</p>\n<p>Luca Cardelli (senior prize) and Jonathan Aldrich (junior prize)</p>\n<p>2006, Nantes</p>\n<p>Erich Gamma, Richard Helm, Ralph Johnson, and (posthumously) John Vlissides</p>\n<p>2005, Glasgow</p>\n<p>Bertrand Meyer (senior prize) and Gail Murphy (junior prize)</p>",
        "id": 493975017,
        "sender_full_name": "Email Gateway",
        "timestamp": 1736960423
    }
]