[
    {
        "content": "<p>From: Ekaterina Komendantskaya &lt;<a href=\"mailto:komendantskaya@gmail.com\">komendantskaya@gmail.com</a>&gt;<br>\n*... Apologies for multiple postings, please help to distribute to<br>\npotential applicants in your research area*</p>\n<p>ASSISTANT PROFESSOR / ASSOCIATE PROFESSOR / PROFESSOR<br>\n                                   in COMPUTER SCIENCE<br>\n                     HERIOT-WATT UNIVERSITY, EDINBURGH, SCOTLAND, UK<br>\n        SALARY (for ASSISTANT/ASSOCIATE PROFESSOR LEVEL):<br>\n                             £59,135 -£41,526 per annum<br>\n         START DATE: FROM SEPTEMBER 2021 (NEGOTIABLE)<br>\n             CLOSING DATE FOR APPLICATIONS: 11 April 2021</p>\n<p>Heriot-Watt University has established a reputation for world-class<br>\nteaching and leading-edge,<br>\nrelevant research, which has made it one of the top UK universities for<br>\ninnovation, business and industry.<br>\nTo celebrate our 2021 bicentenary of pioneering research, we have set<br>\nourselves the target of recruiting<br>\none hundred outstanding research academics between 2018 and 2021.</p>\n<p>As part of this prestigious programme, the School of Mathematical and<br>\nComputer Sciences (MACS)<br>\nwelcomes applications for the posts of Assistant / Associate Professor /<br>\nProfessor in Computer Science.<br>\nWe particularly welcome applicants with expertise in either:</p>\n<p>(i) Artificial Intelligence and Robotics (which includes pervasive and<br>\nubiquitous systems, planning,<br>\ndata science and semantic web, autonomous agents, human-robot interaction,<br>\nhuman computer interaction and multimodal interaction);</p>\n<p>(ii) Security and Verification (including verification of system safety and<br>\nsecurity, cybersecurity,<br>\nautomated reasoning, theorem proving, programming languages and semantics,<br>\nfoundations of computer science).</p>\n<p>In addition, and as part of the School’s on-going plans to open new joint<br>\nMathematics-CS and Statistics-CS posts,<br>\nwe encourage applicants who have interdisciplinary training or experience<br>\nlinking one of the outlined CS priority<br>\nareas and topics in Mathematics and Statistics (including, but not limited<br>\nto, algebra and category theory, discrete<br>\nmathematics and logic, financial risk, cyber risk, actuarial and<br>\nstatistical data science, statistical machine learning,<br>\nBayesian computational methods).</p>\n<p>The School strongly encourages and supports the generation of industry<br>\nimpact from research, and we welcome<br>\ncandidates with experience of working in industry on AI, data science,<br>\nrobotics, autonomous systems, verification<br>\nor security projects or a strong track record of collaborating with<br>\nindustrial partners.</p>\n<p>Exceptional candidates possessing an extensive track record of<br>\ninternationally excellent research and leadership<br>\nmay be considered for appointment at Chair level; candidates interested in<br>\nthe position at Chair level should in<br>\nthe first instance contact the Head of School, Prof Beatrice Pelloni,<br>\n<a href=\"mailto:b.pelloni@hw.ac.uk\">b.pelloni@hw.ac.uk</a>.</p>\n<p>The School of Mathematical and Computer Sciences is committed to support<br>\nfamily friendly work practices and<br>\npart-time working options as part of our Athena Swan Bronze award<br>\n(see<br>\n<a href=\"https://www.hw.ac.uk/schools/mathematical-computer-sciences/about/athena-swan.htm\">https://www.hw.ac.uk/schools/mathematical-computer-sciences/about/athena-swan.htm</a>).</p>\n<p>We especially encourage women and members of underrepresented groups to<br>\napply for this position.<br>\nWe welcome and will consider flexible working patterns e.g. part-time<br>\nworking and job share options.</p>\n<p>ABOUT OUR TEAM:</p>\n<p>The Department of Computer Scienceis internationally renowned for its<br>\nworld-class research across a number of areas,<br>\nincluding artificial intelligence and machine learning, data integration,<br>\nknowledge representation, visualization and analytics,<br>\nnatural language processing, formal methods, logic, type theory,<br>\nprogramming languages, parallel computation, human-computer<br>\nand human-robot interaction, and cybersecurity.</p>\n<p>Jointly with University of Edinburgh, we host the center for doctoral<br>\ntraining “Edinburgh Centre for Robotics” and<br>\nthe UK’s first National Robotarium, that together form a £129M joint<br>\nventure, a center of excellence for AI research on<br>\nan international scale, and a research and innovation hub with &gt;150 staff<br>\nand PhD students. In RCUK’s recent Grand Challenges Scheme:<br>\nTrustworthy Autonomous Systems (TAS), our academics form core teams in 2<br>\nout of 7TAS nodes (each node is supported by a £3M research grant).<br>\nThe two nodes stand for“Trust” and “Governance” in Autonomous Systems.  Our<br>\ngrant funding in this area has also grown<br>\nthrough being awarded jointly with another school at HWU an EPSRC<br>\nIndustrial Strategy Challenge Strategy Fund for<br>\nthe Robotics Hub for Offshore Robotics for Certification of Assets (ORCA)<br>\nworth £14.6M, which is one of the largest<br>\nindustrial strategy challenge funds awards in Scotland.</p>\n<p>The department has strong collaboration with Industry. Since 2014, we have<br>\nundertaken 107 projects with industrial partners,<br>\nthrough our doctoral training centers (40 industrial partners), the ORCA<br>\nhub (30 industrial partners), and the TAS nodes.<br>\nAmong our collaborators are Amazon Research, BP, Chevron, FiveAI, Horiba<br>\nMira, Imandra, Kawasaki, Kuka Robotics, Lloyds,<br>\nSchlumberger, and many others.</p>\n<p>For further information, please consult the university job portal (h<br>\nttps://www.hw.ac.uk/uk/about/work/job-opportunities.htm<br>\n&lt;<a href=\"https://www.hw.ac.uk/uk/about/work/job-opportunities.htm\">https://www.hw.ac.uk/uk/about/work/job-opportunities.htm</a>&gt;).<br>\nFor informal discussions about the position or the department of Computer<br>\nScience please contact<br>\nProf. Ekaterina Komendantskaya (Head of Computer Science) at <a href=\"mailto:ek19@hw.ac.uk\">ek19@hw.ac.uk</a><br>\nAlternatively, you may like to approach one of the members of the<br>\nrecruitment committee:</p>\n<p>James McKinna (Logic, Semantics of Programming languages, Verification),<br>\nRon Petrick (AI planning, Symbolic AI),<br>\nSasa Radomirovic (Security)</p>",
        "id": 226635167,
        "sender_full_name": "Email Gateway",
        "timestamp": 1613555940
    }
]