[
    {
        "content": "<p>From: Giles Reger &lt;<a href=\"mailto:giles.reger@manchester.ac.uk\">giles.reger@manchester.ac.uk</a>&gt;<br>\n[Apologies for cross-posting]</p>\n<p>Do you have a PhD (or will you soon have) in runtime verification, symbolic execution, fuzzing, automated reasoning, interactive theorem proving, or other methods for statically or dynamically reasoning about software systems?</p>\n<p>We are looking for two outstanding and ambitious postdoctoral research associates to work on our “SCorCH: Secure Code for Capability Hardware” project (<a href=\"https://scorch-project.github.io/\">https://scorch-project.github.io/</a>).  SCorCH is a collaboration between The University of Manchester, The University of Oxford, ARM Ltd, and Amazon Web Services that will leverage new advances in formal analysis tools to find security issues in code running on a new generation of security-aware hardware chips i.e. Capability Hardware. Our website provides an overview of our vision.</p>\n<p>The two positions are available at the University of Manchester, UK and are available to start ‘as soon as possible’. These are fixed-term positions for 3 years with a salary from £32,816.</p>\n<p>The University of Manchester (UK) is the largest single-site university in the UK, with the biggest student community, ranked 36th in the world, and fifth in the UK in the Shanghai Jiao Tong World Ranking. The research strength of the Department of Computer Science is reflected in consistently strong returns in UK research assessment exercises (5* in RAE 2000, 2nd in Research Power in RAE 2008, 4th in overall GPA in REF 2014 and ranked equal 1st for research environment). In particular, we have a strong Formal Methods group with expertise in model checking, runtime verification, and automated reasoning.</p>\n<p>For more information (see Further Particulars at bottom of page) and to apply see <a href=\"https://www.jobs.manchester.ac.uk/displayjob.aspx?jobid=18989\">https://www.jobs.manchester.ac.uk/displayjob.aspx?jobid=18989</a>. We welcome informal enquiries to Dr Giles Reger (<a href=\"mailto:giles.reger@manchester.ac.uk\">giles.reger@manchester.ac.uk</a>).</p>",
        "id": 207789465,
        "sender_full_name": "Email Gateway",
        "timestamp": 1598213838
    }
]