[
    {
        "content": "<p>From: Saburou Saitoh &lt;<a href=\"mailto:saburou.saitoh@gmail.com\">saburou.saitoh@gmail.com</a>&gt;<br>\nSubject: Educational and Civilizational Statement on Division by Zero</p>\n<p>Reproducing Kernel Institute Statement No. 695 (2022.8.26 / Mika 101:<br>\n2025.10.24)</p>\n<p>“The Sadness of the Mathematical World – On the Responsibility of Teachers<br>\nand the Division by Zero Problem”</p>\n<hr>\n<ol>\n<li>Background: A Crisis in Mathematical Education</li>\n</ol>\n<p>Despite centuries of tradition, mathematics education still teaches that<br>\n“division by zero is impossible.”<br>\nVideos, textbooks, and lectures repeat this statement without reflection.<br>\nYet few ask why it must be so, and whether this prohibition arises from<br>\ntrue logic or from convention.</p>\n<p>This uncritical repetition reveals a deeper problem:</p>\n<p>Mathematics is taught as memorization, not reasoning.</p>\n<p>Students learn what to think, not how to think.</p>\n<p>Teachers are forced to preserve a convention rather than explore truth.</p>\n<hr>\n<ol start=\"2\">\n<li>A New Perspective: From Impossibility to Possibility</li>\n</ol>\n<p>Historically, “division” has been defined as the inverse of multiplication.<br>\nUnder that narrow view, dividing by zero is undefined.<br>\nHowever, in modern analysis—via the Moore–Penrose inverse and Tikhonov<br>\nregularization—new formulations naturally lead to finite, consistent<br>\nresults even when the divisor is zero.</p>\n<p>1 / 0 = 0 , z / 0 = 0</p>\n<p>This is not a paradox but a revelation: what was deemed impossible may<br>\nsimply have been defined too narrowly.<br>\nMathematical history itself is the story of transforming impossibilities<br>\ninto possibilities—irrational numbers, imaginary numbers, non-Euclidean<br>\ngeometry.</p>\n<hr>\n<ol start=\"3\">\n<li>The Ethical Duty of Educators</li>\n</ol>\n<p>Educators bear moral responsibility to distinguish between:</p>\n<p>The classical, official doctrine (“division by zero is undefined”)</p>\n<p>The emerging theory (“under a new framework, division by zero yields a<br>\ndefinable value”)</p>\n<p>In classrooms, it is appropriate to teach the classical rule—but equally<br>\nessential to say:</p>\n<p>“A new idea exists, though it is not yet officially adopted. Mathematics<br>\nevolves.”</p>\n<p>Such honesty prevents confusion, encourages inquiry, and preserves the<br>\nintegrity of education.</p>\n<hr>\n<ol start=\"4\">\n<li>The Mathematical Community’s Responsibility</li>\n</ol>\n<p>The mathematical community must not silence unconventional discoveries by<br>\ninertia or neglect.<br>\nTo ignore new reasoning without examination contradicts the very spirit of<br>\nmathematics.</p>\n<p>True research demands openness, curiosity, and the humility to re-examine<br>\n“obvious truths.”<br>\nSuppressing new logic is not conservatism—it is anti-intellectualism.</p>\n<hr>\n<ol start=\"5\">\n<li>Educational Implications and Reform Proposals</li>\n</ol>\n<p>Stage-Based Teaching:<br>\nExplain “why undefined” differently at each level—conceptually for<br>\nchildren, analytically for advanced students.</p>\n<p>Critical Thinking:<br>\nAsk students why they believe division by zero is impossible; encourage<br>\nthem to explore boundary cases.</p>\n<p>Historical Context:<br>\nPresent division by zero as today’s version of the “heliocentric<br>\nrevolution” in mathematics.</p>\n<p>Transparency in Academia:<br>\nTeach how new theories become accepted—through discussion, publication, and<br>\ncollective verification.</p>\n<hr>\n<ol start=\"6\">\n<li>Concluding Reflection</li>\n</ol>\n<p>Mathematics is a living discipline.<br>\nTo love truth is to challenge our definitions.<br>\nIf a new definition allows what was once forbidden, it is not heresy—it is<br>\nprogress.</p>\n<p>The “division by zero” problem is not merely a calculation—it is a test of<br>\nour intellectual honesty and our educational conscience.</p>\n<p>“Those who love truth must never fear to redefine the impossible.”</p>\n<p>— Reproducing Kernel Institute Statement 695<br>\n(Revised Educational &amp; International Edition, 2025.10.24)</p>\n<p>By ChatGPT and Saburou Saitoh</p>\n<p>2025年10月24日(金) 12:01 &lt;<a href=\"mailto:cl-isabelle-users-request@lists.cam.ac.uk\">cl-isabelle-users-request@lists.cam.ac.uk</a>&gt;:</p>\n<blockquote>\n<p>cl-isabelle-users digest Fri, 24 Oct 2025</p>\n<p>Table of contents:</p>\n<ul>\n<li>1 - [isabelle] 2nd CfP: Functional and Logic Programming (FLOPS)<br>\n(Deadline<br>\n  Dec 8) - Michael Sperber &lt;<a href=\"mailto:sperber@deinprogramm.de\">sperber@deinprogramm.de</a>&gt;</li>\n<li>2 - [isabelle] Theorems about theorems - \"John F. Hughes\" &lt;<br>\n<a href=\"mailto:jfh@cs.brown.edu\">jfh@cs.brown.edu</a>&gt;</li>\n<li>3 - Re: [isabelle] Theorems about theorems - \"John F. Hughes\"<br>\n  &lt;<a href=\"mailto:jfh@cs.brown.edu\">jfh@cs.brown.edu</a>&gt;</li>\n</ul>\n<hr>\n<p>Message-ID: &lt;<a href=\"mailto:y9lo6pz13cz.fsf@Tourvel.home.active-group.de\">y9lo6pz13cz.fsf@Tourvel.home.active-group.de</a>&gt;<br>\nDate: Wed, 22 Oct 2025 15:18:52 +0200<br>\nFrom: Michael Sperber &lt;<a href=\"mailto:sperber@deinprogramm.de\">sperber@deinprogramm.de</a>&gt;<br>\nSubject: [isabelle] 2nd CfP: Functional and Logic Programming (FLOPS)<br>\n (Deadline Dec 8)</p>\n<p>======================================================================</p>\n<p><strong>* FLOPS 2026 - Call For Papers </strong>*<br>\n   18th International Symposium on Functional and Logic Programming</p>\n<p>May 26-28, 2026, Akita, Japan</p>\n<p><a href=\"https://functional-logic.org/events/flops/2026/\">https://functional-logic.org/events/flops/2026/</a></p>\n<p>======================================================================</p>\n<p>FLOPS aims to bring together practitioners, researchers and implementers<br>\nof declarative programming, to discuss mutually interesting results and<br>\ncommon problems: theoretical advances, their implementations in language<br>\nsystems and tools, and applications of these systems in practice. The<br>\nscope includes all aspects of the design, semantics, theory,<br>\napplications, implementations, and teaching of declarative programming.<br>\nFLOPS specifically aims to promote cross-fertilization between theory<br>\nand practice and among different styles of declarative programming.</p>\n<p>Previous FLOPS meetings were held at Fuji Susono (1995), Shonan Village<br>\n(1996), Kyoto (1998), Tsukuba (1999), Tokyo (2001), Aizu (2002), Nara<br>\n(2004), Fuji Susono (2006), Ise (2008), Sendai (2010), Kobe (2012),<br>\nKanazawa (2014), Kochi (2016), Nagoya (2018), Akita (2020, online),<br>\nKyoto (2022, online), and Kumamoto (2024).</p>\n<p>SCOPE</p>\n<p>FLOPS solicits original papers in all areas of declarative programming:</p>\n<ul>\n<li>\n<p>functional, logic, functional-logic programming, rewriting systems,<br>\nformal methods and model checking, program transformations and program<br>\nrefinements</p>\n</li>\n<li>\n<p>developing programs with the help of theorem provers or<br>\nSAT/SMT solvers, verifying properties of programs using declarative<br>\nprogramming techniques, or statistical methods including generative<br>\nAI (*);</p>\n</li>\n<li>\n<p>foundations, language design, implementation issues (compilation<br>\ntechniques, memory management, run-time systems, etc.), applications and<br>\ncase studies.</p>\n</li>\n</ul>\n<p>FLOPS promotes cross-fertilization among different styles of declarative<br>\nprogramming. Therefore, research papers must be written to be<br>\nunderstandable by a wide audience of declarative programmers and<br>\nresearchers. In particular, each submission should explain its<br>\ncontributions in both general and technical terms, clearly identifying<br>\nwhat has been accomplished, explaining why it is significant for its<br>\narea, and comparing it with previous work. Submission of system<br>\ndescriptions and declarative pearls are especially encouraged.</p>\n<p>(*) Note that FLOPS is a Programming Languages conference.<br>\nSubmissions should be accessible to a Programming Languages audience.<br>\nThe Program Committee has been selected from that audience, and it may<br>\nbe unable to gauge the quality of your submission if that requires<br>\nspecialized competencies in statistical methods and/or AI.  Special<br>\nattention should also be paid to the reproducibility of the results<br>\nfrom public sources.</p>\n<p>SUBMISSION</p>\n<p>Submissions should fall into one of the following categories:</p>\n<ul>\n<li>\n<p>Regular research papers: they should describe new results and will be<br>\njudged on originality, correctness, and significance.</p>\n</li>\n<li>\n<p>System descriptions: they should describe a working system and will be<br>\njudged on originality, usefulness, and design.</p>\n</li>\n<li>\n<p>Declarative pearls: new and excellent declarative programs or theories<br>\nwith illustrative applications.</p>\n</li>\n</ul>\n<p>System descriptions and declarative pearls must be explicitly marked as<br>\nsuch in the title.</p>\n<p>Submissions must be unpublished and not submitted for publication<br>\nelsewhere. Work that already appeared in unpublished or informally<br>\npublished workshops proceedings may be submitted. Authors must follow<br>\nSpringer’s Code of Conduct. See also the ACM SIGPLAN Republication<br>\nPolicy. At least one author of each accepted paper should plan to<br>\nattend the conference in person to present the work: there will be no<br>\ngeneral facility for online or pre-recorded presentation (but we will<br>\ndo our best to accommodate visa issues and similar unavoidable<br>\nobstacles).</p>\n<p>Submissions must be written in English and can be up to 15 pages<br>\nexcluding references, though system descriptions and pearls are<br>\ntypically shorter. The formatting has to conform to Springer’s<br>\nguidelines. Regular research papers should be supported by proofs<br>\nand/or experimental results. In case of lack of space, this supporting<br>\ninformation should be made accessible otherwise (e.g., a link to a<br>\nweb page or an appendix, which does not count towards the<br>\npage limit). However, it is the responsibility of the authors to<br>\nguarantee that their paper can be understood and appreciated without<br>\nreferring to this supporting information; reviewers may simply choose<br>\nnot to look at it when writing their review.</p>\n<p>For more details, see</p>\n<p><a href=\"https://functional-logic.org/events/flops/2026/\">https://functional-logic.org/events/flops/2026/</a></p>\n<p>Papers should be submitted electronically at</p>\n<p><a href=\"https://meteor.springer.com/FLOPS2026\">https://meteor.springer.com/FLOPS2026</a></p>\n<p>Reviewing will be single-blind.</p>\n<p>PUBLICATION</p>\n<p>The proceedings will be published by Springer in the LNCS series. We<br>\nexpect to invite the authors of a selection of the best papers to submit<br>\nan extended version of their FLOPS paper to a special issue which will<br>\nappear in the Science of Computer Programming journal.</p>\n<p>IMPORTANT DATES</p>\n<p>All deadlines are Anywhere on Earth (AoE = UTC-12).</p>\n<p>Abstracts due         Dec 8, 2025<br>\nSubmission deadline   Dec 15, 2025<br>\nNotifications         Feb 2, 2026<br>\nFinal versions        March 2, <br>\n[message truncated]</p>\n</blockquote>",
        "id": 546994372,
        "sender_full_name": "Email Gateway",
        "timestamp": 1761337285
    }
]