[
    {
        "content": "<p>From: Alexander Romanovsky &lt;<a href=\"mailto:Alexander.Romanovsky@formal-route.com\">Alexander.Romanovsky@formal-route.com</a>&gt;<br>\n6th International Conference on Reliability, Safety, and Security of Railway Systems<br>\nRSSRail 2025<br>\nPisa, Italy<br>\nNovember 26-28, 2025<br>\n<a href=\"https://gram.isti.cnr.it/rssrail2025/\">https://gram.isti.cnr.it/rssrail2025/</a></p>\n<p>Call for Papers</p>\n<p>The railway industry faces increasing pressure to improve system safety, to decrease production costs and time to market, to reduce carbon emissions and running costs, and to increase the capacity of the railway. Railway systems are now being integrated into larger multi-transport networks. Such systems require an even higher degree of automation at all levels of operation. These trends dramatically increase the complexity of railway applications and pose new challenges in developing novel methods of modelling, analysis, verification and validation to ensure their reliability, safety and security, as well as in supporting novel mechanisms and procedures to help make the case that development processes meet the mandated standards.</p>\n<p>This conference will bring together researchers and developers working on railway system reliability, security and safety to discuss how all of these requirements can be met in an integrated way. It is also vital to ensure that advances in research (in both academia and industry) are driven by the real industrial needs. This will help ensure that such advances are followed by effective industrial deployment. Another particularly important objective is to integrate advances in research into the current development processes and make them usable and scalable. Finally, a key goal is to develop advanced methods and tools that can ensure that the systems meet the requirements imposed by the regulatory standards and help in building the supportive arguments. This will be a working conference in which research challenges and progress will be discussed and evaluated by both researchers and engineers, focusing on their potential to be deployed in industrial settings.</p>\n<p>Important Dates</p>\n<ul>\n<li>Abstract submission (papers/tutorials): 6 June 2025</li>\n<li>Paper submission: 13 June 2025</li>\n<li>Notification (tutorials): 18 July 2025</li>\n<li>Notification (papers): 1 August 2025</li>\n<li>Camera-ready version: 12 September 2025</li>\n<li>Abstract submission (posters): 26 September 2025</li>\n<li>Notification (posters): 10 October 2025</li>\n<li>Conference: 26-28 November 2025<br>\nDeadlines expire at 23:59 anywhere on earth on the dates displayed above.</li>\n</ul>\n<p>Topics of Interest</p>\n<ul>\n<li>Safety in development processes and safety management</li>\n<li>Combined approaches to safety and security</li>\n<li>System and software safety analysis</li>\n<li>Formal modelling and verification techniques</li>\n<li>System reliability</li>\n<li>Validation according to the standards</li>\n<li>Safety and security argumentation</li>\n<li>Fault and intrusion modelling and analysis</li>\n<li>Evaluation of system capacity, energy consumption, cost and their interplay</li>\n<li>Tool and model integration, tool chain</li>\n<li>Domain-specific languages and modelling frameworks</li>\n<li>Model reuse for reliability, safety and security</li>\n<li>Modelling for maintenance strategy engineering</li>\n</ul>\n<p>Paper Categories<br>\nRSSRail 2025 solicits high-quality papers reporting research results and/or experience reports as well as tutorials and posters related to the Reliability, Safety, and Security of Railway Systems.</p>\n<p>We accept contributions in the following five categories:</p>\n<ol>\n<li>Regular papers (limit 16 pages) on</li>\n</ol>\n<ul>\n<li>original scientific research results</li>\n<li>tools, their foundation, and evaluations</li>\n<li>applications, including rigorous evaluations</li>\n</ul>\n<ol start=\"2\">\n<li>Short papers (limit 8 pages) on</li>\n</ol>\n<ul>\n<li>any topic of interest that can be described in sufficient detail within the page limit</li>\n</ul>\n<ol start=\"3\">\n<li>Journal-First papers (limit 4 pages)</li>\n</ol>\n<ul>\n<li>summarising recently published papers in high-quality journals on any topic of interest</li>\n</ul>\n<ol start=\"4\">\n<li>Tutorial proposals (limit 2 pages)</li>\n</ol>\n<ul>\n<li>describing the topic and intended audience, the plan for conducting the tutorial (content/schedule<br>\n   and duration), and the backgrounds of the presenters (experience) and the tutorial (first iteration?).</li>\n</ul>\n<ol start=\"5\">\n<li>Posters on any topic of interest</li>\n</ol>\n<p>All page limits exclude the references. Appendices may be included, but they will only be read by a reviewer at their discretion.</p>\n<p>Regular and short papers submitted in categories (1) and (2) must be original, unpublished, and not submitted for publication elsewhere. Papers in these two categories will undergo a thorough review process. Submissions will be judged on the basis of significance, relevance, correctness, originality and clarity.</p>\n<p>The aim of journal-first papers in category (3) is to further enrich the RSSRail program and to provide more visibility in the community to already published journal papers. Authors of published papers in high-quality journals can submit a proposal to present their journal paper during RSSRail. The published journal paper must adhere to the following four criteria:</p>\n<ul>\n<li>It should be clearly within the scope of the conference.</li>\n<li>It should be recent: published in a journal after RSSRail 2023 (October 2023).</li>\n<li>It should report completely new research results or novel contributions that were not previously presented at the RSSRail conference.</li>\n<li>It has not been presented at, and is not under consideration for, journal-first tracks of other conferences.</li>\n</ul>\n<p>The 4-page submission to RSSRail for category (3) should provide a concise summary of the published journal paper, which makes it clear</p>\n<ul>\n<li>why its topics fit the conference's scope, and</li>\n<li>why a presentation of its results would enrich the conference program.<br>\nJournal-first submissions must explicitly include full bibliographic details (including a DOI) of the journal publication they are based on. Submissions will be judged on the basis of the above criteria, but also considering how well they would complement the conference program.</li>\n</ul>\n<p>Submission guidelines<br>\nSubmissions for all categories should be made using the RSSRail 2025 EasyChair site:<br>\n<a href=\"https://easychair.org/conferences/?conf=rssrail2025\">https://easychair.org/conferences/?conf=rssrail2025</a><br>\nSubmissions must be in PDF format, following Springer LNCS style files and guidelines:<br>\n<a href=\"https://www.springer.com/gp/computer-science/lncs/conference-proceedings-guidelines\">https://www.springer.com/gp/computer-science/lncs/conference-proceedings-guidelines</a><br>\nThe conference proceedings will be published in Springer's Lecture Notes in Computer Science series.</p>\n<p>As for previous editions, one or more special issues are planned for extended versions of selected papers from RSSRail 2025.</p>\n<p>Organisation<br>\nConference Chairs</p>\n<ul>\n<li>Maurice ter Beek, CNR-ISTI, Pisa, Italy</li>\n<li>Simon Collart Dutilleul, Université Gustave Eiffel, France</li>\n<li>Thierry Lecomte, CLEARSY, France</li>\n</ul>\n<p>Program Committee</p>\n<ul>\n<li>Abderrahim Ait Wakrime, UM5r, Rabat, Morocco</li>\n<li>Dalay Almeida, CLEARSY System Engineering, France</li>\n<li>Davide Basile, CNR-ISTI, Pisa, Italy</li>\n<li>Maurice ter Beek, CNR-ISTI, Pisa, Italy (co-chair)</li>\n<li>Nikola Besinovic, Technical University of Dresden, Germany</li>\n<li>Philippe Bon, Gustave Eiffel University, France</li>\n<li>Alessandro Borselli, Trenord, Italy</li>\n<li>Alessandro Cimatti, FBK, Trento, Italy</li>\n<li>Sana Debbech, SNCF Réseau, France</li>\n<li>Simon Collart Dutilleul, Université Gustave Eiffel, France (co-chair)</li>\n<li>Alessandro Fantechi, University of Florence, Italy</li>\n<li>Alessio Ferrari, University College Dublin, Ireland</li>\n<li>Francesco Flammini, Mälardalen University, Sweden</li>\n<li>Barbara Gallina, Mälardalen University, Sweden</li>\n<li>Stephan Griebel, Siemens AG, Germany</li>\n<li>Alexandra Halchin, RATP, France</li>\n<li>Anne Haxthausen, Technical University of Denmark, Denmark</li>\n<li>Akram Idani, Polytech Grenoble, France</li>\n<li>Alexei Iliasov, The Formal Route Ltd., UK</li>\n<li>Kenji Imamoto, Hitachi Ltd., Japan</li>\n<li>Thierry Lecomte, CLEARSY, France (co-chair)</li>\n<li>Michael Leuschel, University of Düsseldorf, Germany</li>\n<li>Riccardo Licciardello, Sapienza University of Rome, Italy</li>\n<li>Christophe Limbrée, UCLouvain, Belgium</li>\n<li>Bas Luttik, Eindhoven University of Technology, The Netherlands</li>\n<li>Davide Moroni, CNR-ISTI, Pisa, Italy</li>\n<li>Marcel Oliveira, Federal University of Rio Grande do Norte, Brazil</li>\n<li>Matthieu Perin, Systerel, France</li>\n<li>Jaco van de Pol, Aarhus University, Denmark</li>\n<li>Christophe Ponsard, CETIC, Belgium</li>\n<li>José Proença, CISTER and University of Porto, Portugal</li>\n<li>Vito Renò, CNR-STIIMA, Bari, Italy</li>\n<li>Alexander Romanovsky, The Formal Route Ltd., UK</li>\n<li>Aryldo Russo, GESTE Engineering, France</li>\n<li>Marc Sango, SNCF, France</li>\n<li>Monika Seisenberger, Swansea University, UK</li>\n<li>Thai Son Hoang, University of Southampton, UK</li>\n<li>Mariëlle Stoelinga, University of Twente, The Netherlands</li>\n<li>Davide Tarsitano, Polytechnic University of Milan, Italy</li>\n<li>Stefano Tonetta, FBK, Trento, Italy</li>\n<li>Elena Troubitsyna, KTH Royal Institute of Technology, Sweden</li>\n<li>Laurent Voisin, Systerel, France</li>\n</ul>\n<p>Organisation Chairs</p>\n<ul>\n<li>Stefania Gnesi, CNR-ISTI, Pisa, Italy</li>\n<li>Laura Semini, University of Pisa, Italy</li>\n</ul>\n<p>Web Chair</p>\n<ul>\n<li>Giorgio O. Spagnolo, CNR-ISTI, Pisa, Italy</li>\n</ul>\n<p>Publicity Chair</p>\n<ul>\n<li>Giovanna Broccia, CNR-ISTI, Pisa, Italy</li>\n</ul>\n<p>Steering Committee</p>\n<ul>\n<li>Simon Collart Dutilleul, Université Gustave Eiffel, France (Chair)</li>\n<li>Alessandro Fantechi, University of Florence, Italy</li>\n<li>Anne Haxthausen, Technical University of Denmark, Denmark</li>\n<li>Thierry Lecomte, CLEARSY, France</li>\n<li>Alexander Romanovsky, The Formal Route Ltd., UK</li>\n</ul>",
        "id": 504321164,
        "sender_full_name": "Email Gateway",
        "timestamp": 1741470658
    }
]