[
    {
        "content": "<p>From: Favonia &lt;<a href=\"mailto:cl-isabelle-users@lists.cam.ac.uk\">cl-isabelle-users@lists.cam.ac.uk</a>&gt;<br>\nCALL FOR SCHOLARSHIP APPLICATIONS</p>\n<p><em>DEADLINE: 14 October 2022, 23:59 AoE</em> (Anywhere on Earth)</p>\n<p>ACM SIGPLAN Programming Languages Mentoring Workshop</p>\n<p>Location: Boston, Massachusetts, USA</p>\n<p>Date: Tuesday, January 17, 2023</p>\n<p>Web page: <a href=\"https://popl23.sigplan.org/home/PLMW-POPL-2023\">https://popl23.sigplan.org/home/PLMW-POPL-2023</a></p>\n<p>Following the success of the first eleven Programming Languages Mentoring<br>\nWorkshops at POPL 2012-2022, we are pleased to announce the 12th SIGPLAN<br>\nProgramming Languages Mentoring Workshop (PLMW), co-located with POPL 2023<br>\nand organized by Hannah Gommerstadt, Michael Greenberg, Kuen-Bang Hou<br>\n(Favonia), and Robbert Krebbers. The workshop will take place <em>in person</em><br>\nin Boston.</p>\n<p>PLMW aims to encourage graduate students and senior undergraduate students<br>\nto pursue careers in programming language (PL) research. This workshop will<br>\nbring together world leaders in PL research and teaching from both academia<br>\nand industry to provide (a) technical sessions on cutting-edge PL research<br>\nand (b) mentoring sessions on how to prepare for a research career. The<br>\nworkshop will help students imagine how they might contribute to our<br>\nvibrant and thriving research community.</p>\n<p>We especially encourage women, members of underrepresented minorities, and<br>\npeople with disabilities to attend PLMW.</p>\n<p>This workshop is part of the activities surrounding POPL, the Symposium on<br>\nPrinciples of Programming Languages, and takes place the day before the<br>\nmain conference. One goal of the workshop is to make the POPL conference<br>\nmore accessible to newcomers. We hope that participants will stay for the<br>\nwhole conference.</p>\n<p>A number of sponsors (listed below) have generously donated scholarship<br>\nfunds for qualified students to attend PLMW. These scholarships can cover<br>\nexpenses (airfare, hotel, and registration fees) for attendance at both the<br>\nworkshop and the POPL conference itself. The workshop registration is open<br>\nto all (with or without scholarships). Students with alternative sources of<br>\nfunding are welcome as well.</p>\n<p>APPLICATION FOR PLMW SCHOLARSHIP</p>\n<p>The application form can be accessed at the following URL:</p>\n<p><a href=\"https://forms.gle/Ct19QcsKjSLoE38B9\">https://forms.gle/Ct19QcsKjSLoE38B9</a></p>\n<p>The deadline for full consideration of funding is *14 October 2022, 23:59<br>\nAoE.*</p>\n<p>Confirmed sponsors so far:</p>\n<p>-</p>\n<p>NSF<br>\n   -</p>\n<p>ACM SIGPLAN<br>\n   -</p>\n<p>Jane Street<br>\n   -</p>\n<p>Galois</p>",
        "id": 300399709,
        "sender_full_name": "Email Gateway",
        "timestamp": 1663948864
    }
]