[
    {
        "content": "<p>From: Carsten Fuhs &lt;<a href=\"mailto:c.fuhs@bbk.ac.uk\">c.fuhs@bbk.ac.uk</a>&gt;<br>\n(Apologies for multiple copies of this announcement. Please circulate.)</p>\n<hr>\n<p>Call for Location for FSCD 2027</p>\n<p>The FSCD conference covers all aspects of Formal Structures for<br>\nComputation and Deduction from theoretical foundations to<br>\napplications.  The annual FSCD conference comprises the main<br>\nconference and a considerable number of affiliated workshops<br>\n(expectedly, more than ten).</p>\n<p>We invite proposals for locations to host the 12th FSCD International<br>\nConference to be held at the end of august/beginning of september<br>\n2027. The deadline for proposals is</p>\n<p><strong>* Sat, May 24th, 2025 </strong>*</p>\n<p>Proposals should be sent to the FSCD Steering Committee Chair (see<br>\ncontact information below). We encourage proposers to register their<br>\nintention informally as soon as possible. For 2027, the Steering<br>\nCommittee wishes that the conference takes place either during<br>\nthe last week of August or the first one of September<br>\n(i.e., week starting on August 23rd, 2027 or on August 30th).</p>\n<p>Previous (and upcoming) FSCD meetings include:<br>\nFSCD 2016 in Porto (Portugal);<br>\nFSCD 2017 in Oxford (UK) co-located with ICFP 2017;<br>\nFSCD 2018 in Oxford (UK) as part of FLoC 2018;<br>\nFSCD 2019 in Dortmund (Germany);<br>\nFSCD 2020 in Paris (France) co-located with IJCAR 2020;<br>\nFSCD 2021 in Buenos Aires (Argentina);<br>\nFSCD 2022 in Haifa (Israel) as part of FLOC2022;<br>\nFSCD 2023 in Rome (Italy) co-located with CADE 2023;<br>\nFSCD 2024 in Tallinn (Estonia) co-located with LICS 2024 and ICALP 2024;<br>\nFSCD 2025 in Birmingham (UK);<br>\nFSCD 2026 in Lisbon (Portugal) as part of FLoC 2026.</p>\n<p>Selected proposals are to be presented at the business meeting of FSCD<br>\n2025 taking place in Birmingham in July 2025. The final decision about<br>\nhosting and organising of FSCD 2027 will be taken by the SC after an<br>\nadvisory vote of the members of the community in attendance at the<br>\nbusiness meeting.</p>\n<p>Proposals should address the following points:</p>\n<ul>\n<li>\n<p>FSCD Conference Chair (complete name and current position), host<br>\n   institution, FSCD Local Committee (complete names and current<br>\n   positions), availability of student-volunteers.</p>\n</li>\n<li>\n<p>National, regional, and local government and industry support, both<br>\n   organizational and financial.</p>\n</li>\n<li>\n<p>Accessibility to the location (i.e., transportation) and<br>\n   attractiveness of the proposed site. Accessibility can include both<br>\n   information about local transportation and travel information to the<br>\n   location (flight and/or train connections), as well as estimated<br>\n   costs.</p>\n</li>\n<li>\n<p>Proposed dates: they are expected to be either during the week<br>\n   starting on August 23rd, 2027, or that starting on August 30th.<br>\n   They should include allowing 2-3 days before and/or after the<br>\n   main conference for affiliated workshops. (Please also take into<br>\n   consideration holidays or local events during the period).</p>\n</li>\n<li>\n<p>Estimated costs of registration for the conference and workshops,<br>\n   both for regular and student participants.</p>\n</li>\n<li>\n<p>Conference and exhibit facilities for the anticipated number of<br>\n   registrants (including all workshop participants, typically around 200).<br>\n   For example:<br>\n   = number, capacity and audiovisual equipment of meeting rooms;<br>\n   = a large plenary session room that can hold all the registrants;<br>\n   = enough rooms for parallel session workshops/tutorials in the two<br>\n     days before and the two days after the main conference;<br>\n   = internet connectivity and workstations for demos/competitions;<br>\n   = catering services;<br>\n   = presence of professional staff.</p>\n</li>\n<li>\n<p>Support for hybrid attendance to the conference.</p>\n</li>\n<li>\n<p>Residence accommodations and food services in a range of price<br>\n   categories and close to the conference venue, for example, number<br>\n   and cost range of hotels, and availability and cost of dormitory<br>\n   rooms (e.g., at local universities) and kind of services they offer.</p>\n</li>\n<li>\n<p>Other relevant information, which can include information about<br>\n   leisure activities and attractiveness of the location (e.g.,<br>\n   cultural and historical aspects, touristic activities, etc...).</p>\n</li>\n</ul>\n<p>Contact information:<br>\nPatrick Baillot<br>\n<a href=\"mailto:patrick.baillot@univ-lille.fr\">patrick.baillot@univ-lille.fr</a><br>\nFSCD SC Chair</p>",
        "id": 509940683,
        "sender_full_name": "Email Gateway",
        "timestamp": 1743686959
    }
]