[
    {
        "content": "<p>From: Bernhard Beckert &lt;<a href=\"mailto:beckert@kit.edu\">beckert@kit.edu</a>&gt;<br>\nWe are hiring:</p>\n<p>PhD Researchers and Postdoctoral Researchers<br>\n    in applied formal methods for software and algorithm engineering</p>\n<p><a href=\"https://formal.kastel.kit.edu/offers/jobs.phtml\">https://formal.kastel.kit.edu/offers/jobs.phtml</a></p>\n<p>Are you ready to embark on a thrilling scientific journey bringing together <br>\nthe precision of rigorous formal foundations with the latest advances in <br>\nsoftware and algorithm engineering research? Then apply now to shape the <br>\nfuture of formal verification in an excellent working environment.</p>\n<p>We are delighted to announce several Ph.D. and PostDoc positions in the group <br>\nApplication-oriented Formal Verification. The group is part of the Institute <br>\nfor Information Security and Dependability (KASTEL) and the KIT Department of <br>\nInformatics, one of the leading Computer Science Departments in Germany.</p>\n<p>Within the DFG CRC 1608: Convide – Consistency in the View-Based Development <br>\nof Cyber-Physical Systems, we plan to investigate the application of formal <br>\nmethods to establish, exploit, and recover consistency in domain-spanning <br>\nmodels within the Model-Driven Development of cyber-physical systems.<br>\nIn the Helmholtz Pilot Programme: KiKIT – Kerninformatik we will explore how <br>\nformal refinement approaches empower us to tackle the complexity of <br>\nsophisticated models in a modular and collaborative manner. By leveraging <br>\ndifferent formal techniques and abstractions, we aim to integrate diverse <br>\napproaches with a particular focus on cyber-physical systems.</p>\n<p>We are seeking PhD candidates and postdoctoral researchers with the following <br>\nqualifications:<br>\n• a very good master's degree (MSc) in Computer Science or a related field <br>\n(PhD candidates) or a PhD degree in computer science, software engineering, <br>\nsystems engineering, or a related discipline (postdocs)<br>\n• a strong background in formal methods,<br>\n• ideally a background in software engineering and/or algorithm engineering,<br>\n• a strong commitment to research: independent work ethic and a passion for <br>\nworking independently and in teams on challenging research questions,<br>\n• excellent communication skills, both written and verbal,<br>\n• proficiency in English, German language skills are an advantage.</p>\n<p>The positions will be full-time employee positions at KIT (TV-L E13), offering <br>\na competitive salary starting at approximately 4200-4800 €/month (before <br>\ntaxes). We provide an excellent working environment within a vibrant and <br>\ninternationally recognized research group.</p>\n<p>Benefits from a position at KIT:<br>\n• Graduate school within the CRC Convide<br>\n• Access to a network of leading scientists, computer scientists, and engineers.<br>\n• Opportunities to collaborate with interdisciplinary teams working on complex <br>\nsoftware-intensive technical systems.<br>\n• Varied job responsibilities and ample opportunities for further training and <br>\nprofessional development.<br>\n• Flexible working time models to ensure a healthy work-life balance.<br>\n• Subsidy for the BW job ticket and access to on-site casino/cafeteria facilities.</p>\n<p>Contact:<br>\n     Prof. Dr. Bernhard Beckert &lt;<a href=\"mailto:beckert@kit.edu\">beckert@kit.edu</a>&gt;<br>\n     Dr. Mattias Ulbrich &lt;<a href=\"mailto:ulbrich@kit.edu\">ulbrich@kit.edu</a>&gt;<br>\nTo apply, please send your application documents as a single PDF file, <br>\nincluding a cover letter, a curriculum vitae, references, thesis, list of <br>\npublications (if applicable), academic transcripts etc.<br>\nWe strongly encourage applications from women to ensure balanced <br>\nrepresentation in our team. Equally qualified applicants with recognized <br>\nsevere disabilities will receive preferential consideration.<br>\nJoin us in shaping the future of formal verification and model-driven <br>\ndevelopment. Take this opportunity to contribute to groundbreaking research <br>\nand make a meaningful impact on the development of sustainable technical products.</p>\n<p>Application until: 31 August 2023 (1st round, later applications will also be <br>\nconsidered)</p>\n<p>Apply now and be part of a dynamic research environment at KIT!</p>",
        "id": 382439772,
        "sender_full_name": "Email Gateway",
        "timestamp": 1691355309
    }
]