[
    {
        "content": "<p>From: Temur Kutsia &lt;<a href=\"mailto:kutsia@risc.jku.at\">kutsia@risc.jku.at</a>&gt;<br>\nCall for papers</p>\n<p>Journal of Symbolic Computation<br>\nSpecial Issue on the Interaction of Symbolic Computation and Machine <br>\nLearning in Artificial Intelligence</p>\n<p><a href=\"https://www.sciencedirect.com/journal/journal-of-symbolic-computation/about/call-for-papers\">https://www.sciencedirect.com/journal/journal-of-symbolic-computation/about/call-for-papers</a></p>\n<p>Extended submission deadline: September 17<br>\n=============================</p>\n<p>SCOPE</p>\n<hr>\n<p>Symbolic computation (SC) aims at providing algorithmic solutions to <br>\nproblems dealing with symbolic objects such as terms, formulas, <br>\nprograms, representations of algebraic objects, etc. Algorithms and <br>\nmethods developed for the major subfields of SC (computer algebra, <br>\ncomputational logic, automatic programming) have found successful <br>\napplications in various areas.</p>\n<p>From the beginning, SC was also considered a major approach to <br>\n\"artificial intelligence\", since the problems solved by SC, typically, <br>\nare problems that were considered hard for \"human intelligence\" (like <br>\nsymbolic integration, theorem proving, SAT/SMT solving, program <br>\nverification, hardware verification, etc.).</p>\n<p>Meanwhile, recent advances in artificial intelligence methods have <br>\nprovided new exciting opportunities in science and industry, being more <br>\nand more integrated into most aspects of life. Machine learning (ML) <br>\nmethods, developed in parallel to symbolic methods for solving hard <br>\n\"artificial intelligence\" problems, achieved spectacular results in <br>\nnumerous applications in recent years.</p>\n<p>This special issue is dedicated to the interaction of symbolic <br>\ncomputation and machine learning methods seen as the two major <br>\napproaches to \"artificial intelligence\". We expect dramatic advances <br>\nfrom a much closer interaction of the SC and the ML approaches to <br>\nartificial intelligence. This interplay is, in fact, essential in the <br>\ncurrent scenario where the economy and society demand the development of <br>\ncomplex, data-intensive, trustable, and high-performant computational <br>\nsystems that accompany humans in more and more facets of their daily life.</p>\n<p>The special issue is organized as a follow-up of the 24th International <br>\nSymposium on Symbolic and Numeric Algorithms for Scientific Computing, <br>\nSYNASC 2022. Participants of the symposium, as well as other authors, <br>\nare invited to submit contributions. We welcome submissions describing <br>\nthe interaction of SC and ML methods, techniques, and tools, and their <br>\napplications in AI.</p>\n<p>SUBMISSION</p>\n<hr>\n<p>This special issue welcomes high-quality contributions, including papers <br>\nwith original research results as well as review articles. They will be <br>\npeer-reviewed using the standard refereeing procedure of the Journal of <br>\nSymbolic Computation.</p>\n<p>Submitted papers must be in English, prepared in LaTeX according to the <br>\nguidelines of the journal:<br>\n<a href=\"https://www.elsevier.com/journals/journal-of-symbolic-computation/0747-7171/guide-for-authors\">https://www.elsevier.com/journals/journal-of-symbolic-computation/0747-7171/guide-for-authors</a></p>\n<p>PDF versions of manuscripts must be submitted via Journal of Symbolic <br>\nComputation online submission system (Editorial Manager):</p>\n<p><a href=\"https://www.editorialmanager.com/jsco/default2.aspx\">https://www.editorialmanager.com/jsco/default2.aspx</a>.</p>\n<p>Please select the article type \"VSI: SYNASC 2022\" when submitting your <br>\nmanuscript online.</p>\n<p>Submission deadline: September 17, 2023</p>\n<p>GUEST EDITORS</p>\n<hr>\n<p>Bruno Buchberger (RISC, Johannes Kepler University Linz, Austria)<br>\nTemur Kutsia (RISC, Johannes Kepler University Linz, Austria)<br>\nMircea Marin (West University of Timisoara, Romania)<br>\nWolfgang Windsteiger (RISC, Johannes Kepler University Linz, Austria)</p>",
        "id": 382502771,
        "sender_full_name": "Email Gateway",
        "timestamp": 1691387601
    }
]