[
    {
        "content": "<p>From: Carsten Fuhs &lt;<a href=\"mailto:carsten@dcs.bbk.ac.uk\">carsten@dcs.bbk.ac.uk</a>&gt;<br>\n(Apologies for the cross postings.)</p>\n<hr>\n<p>Call for Workshop and Tutorial Proposals</p>\n<ul>\n<li>\n<p>FSCD 2023, 8th edition of the International Conference on Formal Structures for Computation and Deduction<br>\n(<a href=\"https://easyconferences.eu/fscd2023/\">https://easyconferences.eu/fscd2023/</a>)<br>\nJuly 3-6, 2023</p>\n</li>\n<li>\n<p>CADE-29, the 29th Conference on Automated Deduction<br>\n(<a href=\"https://easyconferences.eu/cade2023/\">https://easyconferences.eu/cade2023/</a>)<br>\nJuly 1-4, 2023<br>\nRome, Italy</p>\n</li>\n</ul>\n<p>We invite proposals for workshops, tutorials or other satellite events, on any topic related to formal structures in computation, deduction and automated reasoning, from theoretical foundations to tools and applications.</p>\n<p>FSCD satellite events will take place before the main conference on July 1-2, and CADE satellite events will take place after the main conference on July 4 (afternoon)-5. It is expected that satellite events would run for 1/2, 1 or 2 days (max 1 and 1/2 day for CADE satellite events), and be open to participants of parallel events. Please note overlaps between FSCD workshops and CADE conference and between CADE workshops and FSCD conference (see Important Dates below).</p>\n<p>PROPOSALS</p>\n<hr>\n<p>Proposals must be limited to three pages and should be submitted via easychair:<br>\n<a href=\"https://easychair.org/my/conference?conf=fscd23cade29ws\">https://easychair.org/my/conference?conf=fscd23cade29ws</a></p>\n<p>Each proposal should consist of the following two parts.</p>\n<p>1) A description part including:</p>\n<p>- a short scientific justification of the proposed topic, its significance, and the particular benefits of the workshop to the community, as well as a list of previous or related workshops (if relevant);<br>\n    - a brief description (up to 120 words) of the event for the website and publicity material.</p>\n<p>2) An organisational part including:</p>\n<p>- contact information for the workshop organisers;<br>\n    - proposed affiliated conference;<br>\n    - estimate of the number of workshop participants;<br>\n    - proposed format and agenda (e.g. paper presentations, tutorials, demo sessions, etc.)<br>\n    - potential invited speakers;<br>\n    - procedures for selecting papers and participants;<br>\n    - tentative schedule for paper submission and notification of acceptance;<br>\n    - plans for dissemination, if any (e.g. a journal special issue);<br>\n    - duration (which may vary from half a day to two days (max 1 and 1/2 days for CADE));<br>\n    - any other special requirements.</p>\n<p>The Organising Committee of FSCD-CADE will determine the final list of accepted workshops based on the recommendations from the Workshop Chairs of the hosting conferences and availability of space and facilities.</p>\n<p>The organisers of satellite events are expected to create and maintaina website for the event; handle paper selection, reviewing and acceptance; draw up a tentative programme of talks; advertise their event though specialist mailing lists; prepare the informal pre-proceedings (if applicable) in a timely fashion; and arrange any post-proceedings.</p>\n<p>The FSCD-CADE organising committee will handle promotion of the event on the main conference website; integration of the event's programme into the overall timetable; registration of participants; arrangement of an appropriate meeting room; and provision of lunch and coffee breaks for participants.</p>\n<p>The organisers may rely on one free registration for every workshop, to be used e.g. for one invited speaker. No other cost will be covered by the local organisation. Workshop organisers are encouraged to find sponsors for financing workshop expenses.</p>\n<p>IMPORTANT DATES</p>\n<hr>\n<p>Main Conferences:<br>\n    CADE July 1-4, 2023<br>\n    FSCD July 3-6, 2023<br>\nWorkshops:<br>\n    CADE July 4 (afternoon) and 5, 2023<br>\n    FSCD July 1-2, 2023<br>\nSubmission of workshop proposals: December 18th, 2022<br>\nNotification of success of proposals: December 23rd, 2022</p>\n<hr>\n<p>Best wishes,<br>\nIvano Salvo<br>\nWorkshop Chair</p>",
        "id": 312825990,
        "sender_full_name": "Email Gateway",
        "timestamp": 1669723168
    }
]