[
    {
        "content": "<p>From: Harsh Beohar &lt;<a href=\"mailto:cl-isabelle-users@lists.cam.ac.uk\">cl-isabelle-users@lists.cam.ac.uk</a>&gt;<br>\n<strong> Apologies if you receive multiple copies of these open positions </strong></p>\n<p>Up to three fully funded research and teaching assistant positions with the<br>\nopportunity of undertaking a PhD are available within the Verification<br>\nGroup, Department of Computer Science, at the University of Sheffield:</p>\n<p>*https://www.sheffield.ac.uk/dcs/research/groups/verification<br>\n&lt;<a href=\"https://www.sheffield.ac.uk/dcs/research/groups/verification&gt;*\">https://www.sheffield.ac.uk/dcs/research/groups/verification&gt;*</a></p>\n<p>The verification group at Sheffield is growing rapidly. These posts provide<br>\nexcellent opportunities for graduate students (UK and overseas) to obtain a<br>\nPhD in any active research area of the group, including semantics of<br>\nconcurrent and distributed systems, logics and complexity, algebraic and<br>\ncategorical approaches to program semantics, coalgebras, verification of<br>\nmulti-core programs and weak memory models, interactive theorem proving.</p>\n<p>The posts are fully funded for 6 years with 60% devoted to research and 40%<br>\nto teaching support. For more detailed information (including roles and<br>\nresponsibilities), please see:</p>\n<p><a href=\"https://www.jobs.ac.uk/job/CTM862/teaching-and-research-assistant-in-computer-science-3-posts\">https://www.jobs.ac.uk/job/CTM862/teaching-and-research-assistant-in-computer-science-3-posts</a></p>\n<p>For details on possible supervisors and research projects, please contact<br>\nour personal websites from our group webpage. For informal enquiries,<br>\nplease do not hesitate to contact any group member by email.</p>\n<p>The candidates interested in the interplay of category theory (coalgebras),<br>\nlogic, and semantics can write directly to me at <a href=\"mailto:h.beohar@sheffield.ac.uk\">h.beohar@sheffield.ac.uk</a>.<br>\nCurrent topics include expressive modal logics, behavioural equivalence<br>\ngames, synthesising distinguishing/characteristic formulae all at the level<br>\nof coalgebras.</p>\n<p>With kind regards,<br>\nHarsh Beohar</p>",
        "id": 301416896,
        "sender_full_name": "Email Gateway",
        "timestamp": 1664450027
    }
]