[
    {
        "content": "<p>From: \"Thiemann, René\" &lt;<a href=\"mailto:Rene.Thiemann@uibk.ac.at\">Rene.Thiemann@uibk.ac.at</a>&gt;<br>\nDear all,</p>\n<p>I’m happy to announce a new quantifier elimination procedure in the AFP.</p>\n<p>Verified Quadratic Virtual Substitution for Real Arithmetic<br>\n  by Matias Scharager, Katherine Cordwell, Stefan Mitsch and André Platzer</p>\n<p>This paper presents a formally verified quantifier elimination (QE) algorithm<br>\nfor first-order real arithmetic by linear and quadratic virtual substitution<br>\n(VS) in Isabelle/HOL. The Tarski-Seidenberg theorem established that the<br>\nfirst-order logic of real arithmetic is decidable by QE. However, in practice,<br>\nQE algorithms are highly complicated and often combine multiple methods for<br>\nperformance. VS is a practically successful method for QE that targets formulas<br>\nwith low-degree polynomials. To our knowledge, this is the first work to<br>\nformalize VS for quadratic real arithmetic including inequalities. The proofs<br>\nnecessitate various contributions to the existing multivariate polynomial<br>\nlibraries in Isabelle/HOL. Our framework is modularized and easily expandable<br>\n(to facilitate integrating future optimizations), and could serve as a basis for<br>\ndeveloping practical general-purpose QE algorithms. Further, as our<br>\nformalization is designed with practicality in mind, we export our development<br>\nto SML and test the resulting code on 378 benchmarks from the literature,<br>\ncomparing to Redlog, Z3, Wolfram Engine, and SMT-RAT. This identified<br>\ninconsistencies in some tools, underscoring the significance of a verified<br>\napproach for the intricacies of real arithmetic.</p>\n<p><a href=\"https://www.isa-afp.org/entries/Virtual_Substitution.html\">https://www.isa-afp.org/entries/Virtual_Substitution.html</a></p>\n<p>Enjoy,<br>\nRené</p>",
        "id": 258196561,
        "sender_full_name": "Email Gateway",
        "timestamp": 1634651066
    }
]