[
    {
        "content": "<p>From: FRANCISCO JESUS MARTIN MATEOS &lt;<a href=\"mailto:fjesus@us.es\">fjesus@us.es</a>&gt;<br>\nHello</p>\n<p>I teach Mathematical Logic at University of Seville and I use Isabelle to explain natural deduction rules.<br>\nI have found a situation difficult to explain to my students. It happens when we use 'frule' with 'impI', for example, in order to prove<br>\n\"(P ⟹ Q) ⟹ P ⟶ Q\" (this is a simplified situation):</p>\n<p>A typical proof could be:</p>\n<p>lemma<br>\n  \"(P ⟹ Q) ⟹ P ⟶ Q\"<br>\n  apply (drule impI)<br>\n  apply assumption<br>\n  done</p>\n<p>But if I use 'frule' instead of 'drule' the new goal generated is:<br>\n  (P ⟹ Q) ⟹ ?P ⟶ ?P ⟹ P ⟶ Q</p>\n<p>I consider that 'drule' is the same as 'frule' but dropping the assumption used to unify the premise, as is indicated in <a href=\"https://svhol.pbmichel.com/reference/frule\">https://svhol.pbmichel.com/reference/frule</a>, so I don't understand why the new hypotesis included by 'frule' is '?P ⟶ ?P'.<br>\nMoreover, (frule_tac P=\"P\" and Q=\"Q\" in impI) does not work.<br>\nCould you explain me this?</p>\n<p>Thanks in advance.<br>\nRegards</p>\n<p>Francisco J. Martín Mateos<br>\nComputational Logic Group<br>\nUniversity of Seville</p>",
        "id": 273787965,
        "sender_full_name": "Email Gateway",
        "timestamp": 1646218531
    },
    {
        "content": "<p>From: Lawrence Paulson &lt;<a href=\"mailto:lp15@cam.ac.uk\">lp15@cam.ac.uk</a>&gt;<br>\nDear Francisco,</p>\n<p>These low-level natural deduction proof methods need to be used with the correct sort of natural deduction inference rule. These are classified as</p>\n<ul>\n<li>\n<p>Introduction rules, indicated by the suffix I<br>\n  For these, including impI, the appropriate proof method is “rule”.</p>\n</li>\n<li>\n<p>Elimination rules, indicated by the suffix E <br>\n  (these should have a fully general conclusion such as ?P that’s also in all the minor premises)<br>\n  For these, say conjE, disjE, impCE or exE, the appropriate proof method is “erule”.</p>\n</li>\n<li>\n<p>Destruction rules, sometimes indicated by the suffix D <br>\n  (my own terminology, for elimination rules not of the form above)<br>\n  For these, say conjunct1, mp or spec, the appropriate proof methods are “drule” and “frule”.</p>\n</li>\n</ul>\n<p>To me the mystery is not that frule exhibits the behaviour you show, but that either drule or frule succeed at all. They are intended to operate on a formula of the object logic (i.e., first-order or higher-order logic) and not on anything of the form P ==&gt; Q, which is a formula of the logical framework itself.</p>\n<p>Try your examples using the appropriate proof method and see how that goes.</p>\n<p>Larry Paulson</p>",
        "id": 273793073,
        "sender_full_name": "Email Gateway",
        "timestamp": 1646220941
    }
]