[
    {
        "content": "<p>From: Adnan Rashid via Cl-isabelle-users &lt;<a href=\"mailto:cl-isabelle-users@lists.cam.ac.uk\">cl-isabelle-users@lists.cam.ac.uk</a>&gt;<br>\n=============================================================================<br>\n                             Second Call for Papers</p>\n<p>Workshop on Formal Verification of Physical Systems (FVPS 2021)</p>\n<p>July 26 - 31, 2021<br>\n                      Timișoara, Romania</p>\n<p>Co-located with CICM 2021<br>\n                   &lt;<a href=\"https://easychair.org/cfp/FVPS-2021\">https://easychair.org/cfp/FVPS-2021</a>&gt;<br>\n<a href=\"https://cicm-conference.org/2021/cicm.php?event=fvps\">https://cicm-conference.org/2021/cicm.php?event=fvps</a><br>\n&amp;menu=general<br>\n=============================================================================</p>\n<p>Theme<br>\n=====<br>\nOne of the main issues behind many failing systems is the ad-hoc<br>\nverification approach that involves a variety of formalism and techniques<br>\nfor the modeling and analysis of various components of the present-age<br>\n(cyber)-physical systems. For example, control and communication protocols<br>\nare usually modeled using automata theory, and thus analyzed using model<br>\nchecking techniques, while the modeling of physical aspects often requires<br>\nmultivariate calculus foundations, which are in turn analyzed using<br>\npaper-and-pencil based analytical proofs, simulation or theorem proving.<br>\nThe fundamental differences between these modeling and analysis techniques<br>\nlimit us to analyze the whole system as one unit and thus miss many corner<br>\ncases, which arise due to the operation of all the sub-components of the<br>\nsystem together. One of the major concerns is that, despite the<br>\nabove-mentioned evident limitations in the analysis methods, many<br>\nsafety-critical systems, such as aerospace, smart-transportation,<br>\nsmart-grid and e-healthcare, are increasingly involving physical elements.<br>\nMoreover, we are moving towards integrating more complex physical elements<br>\nin our engineering systems. For example, we are moving towards Quantum<br>\nComputers to meet the high-performance needs. Similarly, phonic components<br>\nare increasingly being advocated and used in aerospace applications due to<br>\ntheir lightweight and temperature independency compared to traditional<br>\nelectronics-based components. Finally, the impact of physical components is<br>\nrelevant to both safety and security of the overall system. For example,<br>\nmalfunction in sensor measurement may lead to safety issues whereas<br>\nsophisticated physics-based side-channel (e.g., power and acoustic<br>\nmeasurements) attacks lead to the security violation of the underlying<br>\nsystem.</p>\n<p>The focus of the workshop will be on formal verification techniques for the<br>\nmodeling, analysis and verification of safety and security critical<br>\nphysical systems. We encourage submissions on interdisciplinary approaches<br>\nthat bring together formal methods and techniques from other knowledge<br>\nareas such as quantum computing, control theory, biology, optimization<br>\ntheory and artificial intelligence.</p>\n<p>Topics of Interest<br>\n==================<br>\nTopics of interest include (but are not limited to):</p>\n<p>General Topics</p>\n<hr>\n<p>- Formalization of mathematics and physics theories<br>\n   - Interactive and automated theorem proving for physical systems<br>\n   - Model Checking algorithms and tools for physical systems<br>\n   - Formalization of security and safety of physical systems<br>\n   - Runtime verification of safety and security properties<br>\n   - Combination of formal, semi formal and informal approaches<br>\n   - Formal verification of numerical algorithms<br>\n   - Refinement based verification of physical systems<br>\n   - Formalization of probability, reliability and statistical metrics<br>\n   - Hybrid systems<br>\n   - Benchmarks for physical systems<br>\n   - Formal requirement specification and validation</p>\n<p>Application Domain</p>\n<hr>\n<p>- Aerospace and avionics systems<br>\n   - Automotive cyber physical systems<br>\n   - Robotics<br>\n   - Smart Grids<br>\n   - Smart transportation<br>\n   - Human factor modeling and analysis<br>\n   - Biological and healthcare systems</p>\n<p>Submission<br>\n==========<br>\nAuthors should prepare their papers in one column style<br>\n&lt;<a href=\"http://ceur-ws.org/Vol-XXX/samplestyles/\">http://ceur-ws.org/Vol-XXX/samplestyles/</a>&gt; of CEUR-WS. There are two<br>\ncategories of submissions:</p>\n<p>- Regular papers describing developed work with theoretical results (up<br>\n   to 15 pages)</p>\n<p>- Short papers on experience reports, tools or work in progress with<br>\n   preliminary results (up to 6 pages)</p>\n<p>Electronic submission is done through EasyChair<br>\n&lt;<a href=\"https://easychair.org/conferences/?conf=cicm2021\">https://easychair.org/conferences/?conf=cicm2021</a>&gt;. The submissions will be<br>\nreviewed by at least three PC members. At least one author of each accepted<br>\npaper is expected to attend FVPS and present her/his paper.</p>\n<p>Important Dates<br>\n===============</p>\n<p>- Full Paper Submission: June 11, 2021<br>\n   - Notification: July 12, 2021<br>\n   - Workshop: July 26 - 31, 2021<br>\n   - Camera Ready: August 13, 2021</p>\n<p>Program Chairs<br>\n==============</p>\n<p>- Sofiene Tahar , Concordia University, Montreal, QC, Canada<br>\n   - Osman Hasan, National University of Sciences and Technology (NUST),<br>\n   Pakistan</p>\n<p>- Adnan Rashid, National University of Sciences and Technology (NUST),<br>\n   Pakistan</p>\n<p>Program Committee<br>\n=================</p>\n<p>- Peter Csaba Ölveczky,  University of Oslo, Norway<br>\n   - Atif Mashkoor,  Institute for Software Systems Engineering, Johannes<br>\n   Kepler University, Linz, Austria</p>\n<p>- Waqar Ahmad, BlackBerry Limited, Canada<br>\n   - Pedro Ribeiro, University of York, UK</p>",
        "id": 241747312,
        "sender_full_name": "Email Gateway",
        "timestamp": 1623056572
    }
]