[
    {
        "content": "<p>From: Patrick Nicodemus &lt;<a href=\"mailto:gadget142@gmail.com\">gadget142@gmail.com</a>&gt;<br>\nThe equational fragment of first-order logic is well studied in automated<br>\ntheorem proving. I'm interested in what work has been done on \"generalized<br>\nalgebraic theories\" which is a kind of first-order equational fragment of<br>\ndependent type theory. This is known to be equivalent to a fragment of<br>\nmulti-sorted first order logic where you have a finite number of sorts A,<br>\nB, C, and functions p : B-&gt; A, q : C -&gt; A expressing how families of sets<br>\nB_a and C_a vary with a. A function f :\\prod_a : B_a x B_a -&gt; C_a is then<br>\nmodeled as a (partial) functional relation R \\subset B x B x C such that<br>\nR(b,b',c) -&gt; p(b)=p(b')=q(c). So it's basically multi-sorted equational<br>\nlogic with partial functions whose domains are also constrained by<br>\nequations. Can anyone send me resources on deciding equalities in this<br>\ntheory? Are there any existing plugins or tools that carry out these<br>\ntranslations into FOL automatically?</p>",
        "id": 538099719,
        "sender_full_name": "Email Gateway",
        "timestamp": 1757272699
    },
    {
        "content": "<p>From: Till Mossakowski &lt;<a href=\"mailto:till.mossakowski@ovgu.de\">till.mossakowski@ovgu.de</a>&gt;<br>\nSuch a logic has been developed by Horst Reichel in his book \"Initial <br>\ncomputability, algebraic specifications, and partial algebras\". A <br>\ntranslation to FOL has been implemented in Hets, see <a href=\"http://hets.eu\">http://hets.eu</a></p>\n<p>Am 07.09.25 um 21:17 schrieb Patrick Nicodemus:</p>\n<blockquote>\n<p>The equational fragment of first-order logic is well studied in <br>\nautomated theorem proving. I'm interested in what work has been done <br>\non \"generalized algebraic theories\" which is a kind of first-order <br>\nequational fragment of dependent type theory. This is known to be <br>\nequivalent to a fragment of multi-sorted first order logic where you <br>\nhave a finite number of sorts A, B, C, and functions p : B-&gt; A, q : C <br>\n-&gt; A expressing how families of sets B_a and C_a vary with a. A <br>\nfunction f :\\prod_a : B_a x B_a -&gt; C_a is then modeled as a (partial) <br>\nfunctional relation R \\subset B x B x C such that R(b,b',c) -&gt; <br>\np(b)=p(b')=q(c). So it's basically multi-sorted equational logic with <br>\npartial functions whose domains are also constrained by equations. Can <br>\nanyone send me resources on deciding equalities in this theory? Are <br>\nthere any existing plugins or tools that carry out these translations <br>\ninto FOL automatically?</p>\n</blockquote>",
        "id": 538442194,
        "sender_full_name": "Email Gateway",
        "timestamp": 1757425644
    }
]