[
    {
        "content": "<p>From: Tobias Nipkow &lt;<a href=\"mailto:nipkow@in.tum.de\">nipkow@in.tum.de</a>&gt;<br>\nSee <a href=\"https://www.mathjobs.org/jobs/list/20818\">https://www.mathjobs.org/jobs/list/20818</a></p>\n<p>The cluster of excellence*Hausdorff Center for Mathematics (HCM) *at the <br>\n*University of Bonn *brings together researchers in mathematics and its <br>\napplications. In this framework the center is looking forward to filling in the <br>\narea of theoretical mathematics</p>\n<p><em>a permanent W2-Professorship and</em></p>\n<p>*a temporary W2-Professorship for five years *</p>\n<p>*in the field of *</p>\n<p><em>formal mathematics and computer assisted theorem proving.</em>**</p>\n<p>* Concerning the temporary W2-Professorship for five years, *we are looking for <br>\nyoung promising researchers holding a doctoral degree, who are developing their <br>\nown research agenda and who have already demonstrated scientific excellence <br>\nandindependence by publications in the field of formal mathematics and computer <br>\nassisted theorem proving. The candidates are expected to contribute to our <br>\nteaching program in all phases. German language skills are not required. We seek <br>\ncandidates with an interdisciplinary profile and international research <br>\nexperience in the rapidly developing field of computer supported formalization <br>\nof mathematics and interactive as well as automated theorem proving at the <br>\ninterface between theoretical mathematics and computer science.</p>\n<p>*Concerning the permanent W2-Professorship, *we in addition expect that <br>\ncandidates have an already established international research profile <br>\ncharacterized by an outstanding scientific qualification and significant <br>\nexperience in advancing the field of formal mathematics and computer assisted <br>\ntheorem proving.</p>\n<p>The candidates hired on both positions will become members of the HCM and will <br>\nbe eligible to further scientific and financial support.</p>\n<p>The University of Bonn actively supports diversity and equal opportunities. <br>\nThe University of Bonn has been certified as a family-friendly university and <br>\noffers a dual career-service. Its aim is to increase the proportion of women in <br>\nthose fields in which women are underrepresented and to place a special focus on <br>\npromoting their careers. Therefore, the university specifically requests <br>\napplications from suitably qualified women. Applications will be handled in <br>\naccordance with the Equal Opportunities Act of North Rhine-Westphalia. <br>\nApplications from suitably qualified people with severe disabilities that have <br>\nalready been verified or from people with an equivalent status will be <br>\nparticularly welcomed.</p>\n<p>The general conditions of employment are according to § 36 of the Higher <br>\nEducation Act of North Rhine-Westphalia (Hochschulgesetz des Landes <br>\nNordrhein-Westfalen).</p>\n<p>If you want to know more about the financial benefits, dual career options or <br>\nfamily support options the HCM can offer, please, contact the managing director <br>\nDr. Sonja Dames (<a href=\"mailto:sonja.dames@hcm.uni-bonn.de\">sonja.dames@hcm.uni-bonn.de</a> &lt;mailto:<a href=\"mailto:sonja.dames@hcm.uni-bonn.de\">sonja.dames@hcm.uni-bonn.de</a>&gt;).</p>\n<p>Deadline for application is <em>15.11.2022</em>. Please, apply to the hiring committee <br>\n(<em>Hausdorff Center for Mathematics, Endenicher Allee 62, 53115 Bonn, Germany</em>) <br>\nusing our online application <a href=\"http://formwww.hcm.uni-bonn.de/IRU-FMCAP-application\">formwww.hcm.uni-bonn.de/IRU-FMCAP-application</a> <br>\n&lt;<a href=\"http://www.hcm.uni-bonn.de/IRU-FMCAP-application\">http://www.hcm.uni-bonn.de/IRU-FMCAP-application</a>&gt;.<br>\n<a href=\"/user_uploads/14278/57_K4bpafVf6gVlOZp7Ll3S5/smime.p7s\">smime.p7s</a></p>",
        "id": 302286947,
        "sender_full_name": "Email Gateway",
        "timestamp": 1664897280
    }
]