[
    {
        "content": "<p>From: \"\\\"Benz, Nathan (ARC-TI)\\\"\" &lt;<a href=\"mailto:cl-isabelle-users@lists.cam.ac.uk\">cl-isabelle-users@lists.cam.ac.uk</a>&gt;<br>\nThe NASA Formal Methods community invites you to submit a paper to:</p>\n<p>The 16th NASA Formal Methods Symposium (NFM 2024)</p>\n<p>June 4-6, 2024<br>\nMoffett Field, California</p>\n<p><a href=\"https://conf.researchr.org/home/nfm-2024\">https://conf.researchr.org/home/nfm-2024</a></p>\n<hr>\n<p>Important Dates:</p>\n<hr>\n<p>Abstract submission: December 1, 2023<br>\nFull paper submission: December 8, 2023<br>\nNotification: February 16, 2024<br>\nCamera-ready version: March 15, 2024</p>\n<hr>\n<p>Theme of the Symposium:</p>\n<hr>\n<p>The widespread use and increasing complexity of mission-critical and<br>\nsafety-critical systems at NASA and in the aerospace industry requires advanced<br>\ntechnologies to address their specification, design, verification, validation,<br>\nand certification processes. For example, there is an increasing need for<br>\nautonomous systems in deep space missions including NASA’s Moon to Mars<br>\nexploration plans. The NASA Formal Methods Symposium is a forum to foster<br>\ncollaboration between theoreticians and practitioners from NASA, other<br>\ngovernment agencies, academia, and industry, with the goal of identifying<br>\nchallenges and providing solutions towards achieving assurance for such<br>\ncritical systems. The focus of this symposium is on formal techniques for<br>\nsoftware and system assurance for applications in space, aviation, robotics,<br>\nand other NASA-relevant safety-critical systems. This year’s symposium extends<br>\nthe focus to safety assurance of machine learning enabled autonomous systems,<br>\nformal methods for digital transformation, and accessibility for new<br>\nindustries.</p>\n<hr>\n<p>Topics of Interest:</p>\n<hr>\n<p>Advances in Formal Methods</p>\n<ul>\n<li>Formal verification, model checking, and static analysis</li>\n<li>Interactive and automated theorem proving</li>\n<li>Program and specification synthesis, code transformation and generation</li>\n<li>Run-time verification and test case generation</li>\n<li>Techniques and algorithms for scaling formal methods</li>\n<li>Design for verification and correct-by-design techniques</li>\n<li>Requirements generation, specification, and validation</li>\n</ul>\n<p>Integration of Formal Methods</p>\n<ul>\n<li>Use of machine learning techniques in formal methods</li>\n<li>Integration of formal methods and software engineering</li>\n<li>Integration of diverse formal methods techniques</li>\n<li>Combination of formal methods with simulation and analysis techniques</li>\n</ul>\n<p>Formal Methods in Practice</p>\n<ul>\n<li>Experience reports of application of formal methods in industry</li>\n<li>Use of formal methods in education</li>\n<li>Applications of formal methods in:<ul>\n<li>concurrent and distributed systems</li>\n<li>fault-detection, diagnostics, and prognostics systems</li>\n<li>human-machine interaction analysis</li>\n</ul>\n</li>\n</ul>\n<p>Safety Assurance of Autonomous Systems</p>\n<ul>\n<li>Verification of machine learning (ML) enabled systems</li>\n<li>Runtime monitoring or model checking to ensure safe operation</li>\n<li>Formal specifications and modeling of ML enabled systems</li>\n<li>\n<p>Case-studies/experience reports exploring the application of formal methods<br>\n  in autonomous safety-critical, cyber-physical and hybrid systems</p>\n</li>\n<li>\n<p>Using formal evidence for certification of ML enabled systems</p>\n</li>\n</ul>\n<p>Formal Methods for Digital Transformation</p>\n<ul>\n<li>Applications related to Digital Twin &amp; Digital Thread</li>\n<li>Verification for integrated design and manufacturing</li>\n<li>AI digital assistants for system design</li>\n<li>Runtime monitoring for Smart Campus &amp; Smart Cities</li>\n</ul>\n<p>Accessibility of Formal Methods for New Industries</p>\n<ul>\n<li>\"New Space\" markets</li>\n<li>Advanced Air Mobility and Startup Aviation</li>\n<li>Formal Methods as a Service</li>\n</ul>\n<hr>\n<p>Submissions:</p>\n<hr>\n<p>There are two categories of submissions:</p>\n<ul>\n<li>\n<p>Regular Papers (15 pages including references), describing fully developed<br>\n  work and complete results</p>\n</li>\n<li>\n<p>Short Papers (6 pages including references), in one of the categories below:</p>\n<ul>\n<li>Tool papers describing novel and publicly available tools</li>\n<li>Case studies detailing applications of formal methods</li>\n<li>New emerging ideas in the topics of interest</li>\n</ul>\n</li>\n</ul>\n<p>All papers should be in English and describe original work that has not been<br>\npublished or submitted elsewhere. NFM24 will be a hybrid conference. Authors of<br>\naccepted papers are encouraged to present their work in person at the<br>\nconference.</p>\n<p>There will be a tool demonstration session at the conference, where tool<br>\ndevelopers get to showcase their tools interactively with the attendees. All<br>\ntool papers, under the short papers category, are required to participate in<br>\nthe tool demonstration session. Authors of regular papers are also welcome to<br>\nparticipate in the tool demonstration session to showcase their application.</p>\n<p>All submitters who are interested in participating in the tool demonstration<br>\nsession must include an additional appendix (maximum 4 pages and will not<br>\nappear in the proceedings) containing the description of the proposed demo and<br>\nthe URL to a screencast demonstrating the tool. Authors of all accepted papers<br>\nadditionally have an opportunity to present a poster.</p>\n<p>All submissions will be fully reviewed by members of the Program Committee.<br>\nAccepted regular and short papers will be published in the Formal Methods<br>\nsubline of Springer’s Lecture Notes in Computer Science (LNCS) and must use<br>\nLNCS style formatting described on<br>\n<a href=\"https://www.springer.com/gp/computer-science/lncs/conference-proceedings-guidelines\">https://www.springer.com/gp/computer-science/lncs/conference-proceedings-guidelines</a>.<br>\nPapers must be submitted in PDF format at the EasyChair submission site,<br>\n<a href=\"https://easychair.org/conferences/?conf=nfm2024\">https://easychair.org/conferences/?conf=nfm2024</a>.</p>\n<hr>\n<p>Location and Cost:</p>\n<hr>\n<p>The symposium will take place at the NASA Ames Conference Center,<br>\nMoffett Field, California, USA.</p>\n<p>There will be no registration fee charged to participants. All<br>\ninterested individuals, including non-US citizens, are welcome to<br>\nattend, listen to the talks, and participate in discussions. However,<br>\nall attendees must register.</p>\n<p>Nathan Benz<br>\nDivya Gopinath<br>\nNija Shi</p>\n<p>NFM '24 Chairs<br>\nnfm24-chairs@lists.nasa.gov&lt;mailto:<a href=\"mailto:nfm24-chairs@lists.nasa.gov\">nfm24-chairs@lists.nasa.gov</a>&gt;</p>",
        "id": 397179266,
        "sender_full_name": "Email Gateway",
        "timestamp": 1697575233
    }
]