[
    {
        "content": "<p>From: Tobias Nipkow &lt;<a href=\"mailto:nipkow@in.tum.de\">nipkow@in.tum.de</a>&gt;<br>\nFormalization of Hyper Hoare Logic: A Logic to (Dis-)Prove Program Hyperproperties</p>\n<p>Thibault Dardinier</p>\n<p>Hoare logics are proof systems that allow one to formally establish properties <br>\nof computer programs. Traditional Hoare logics prove properties of individual <br>\nprogram executions (so-called trace properties, such as functional correctness). <br>\nOn the one hand, Hoare logic has been generalized to prove properties of <br>\nmultiple executions of a program (so-called hyperproperties, such as determinism <br>\nor non-interference). These program logics prove the absence of (bad <br>\ncombinations of) executions. On the other hand, program logics similar to Hoare <br>\nlogic have been proposed to disprove program properties (e.g., Incorrectness <br>\nLogic [8]), by proving the existence of (bad combinations of) executions. All of <br>\nthese logics have in common that they specify program properties using <br>\nassertions over a fixed number of states, for instance, a single pre- and <br>\npost-state for functional properties or pairs of pre- and post-states for <br>\nnon-interference. In this entry, we formalize Hyper Hoare Logic, a <br>\ngeneralization of Hoare logic that lifts assertions to properties of arbitrary <br>\nsets of states. The resulting logic is simple yet expressive: its judgments can <br>\nexpress arbitrary trace- and hyperproperties over the terminating executions of <br>\na program. By allowing assertions to reason about sets of states, Hyper Hoare <br>\nLogic can reason about both the absence and the existence of (combinations of) <br>\nexecutions, and, thereby, supports both proving and disproving program <br>\n(hyper-)properties within the same logic. In fact, we prove that Hyper Hoare <br>\nLogic subsumes the properties handled by numerous existing correctness and <br>\nincorrectness logics, and can express hyperproperties that no existing Hoare <br>\nlogic can. We also prove that Hyper Hoare Logic is sound and complete.</p>\n<p><a href=\"https://www.isa-afp.org/entries/HyperHoareLogic.html\">https://www.isa-afp.org/entries/HyperHoareLogic.html</a></p>\n<p>Enjoy!</p>\n<p><a href=\"/user_uploads/14278/5oUsqXobtGYmVp7K2S7h-xvE/smime.p7s\">smime.p7s</a></p>",
        "id": 350663148,
        "sender_full_name": "Email Gateway",
        "timestamp": 1681789000
    }
]