[
    {
        "content": "<p>From: Timothy Bourke &lt;<a href=\"mailto:tim@tbrk.org\">tim@tbrk.org</a>&gt;<br>\n[ This message is intentionally written in French.<br>\nIt is a call for papers for the \"Francophone Days on Functional <br>\nLanguages\" to be held in February next year. We would love to receive <br>\narticles or tutorials on Isabelle or applications of Isabelle. <br>\nOriginal written submissions can be in English, but the presentation <br>\nor tutorial would have to be in French. ]</p>\n<ul>\n<li>Merci de faire circuler : premier appel à communications -<p>JFLA'2022</p>\n<p><a href=\"http://jfla.inria.fr/jfla2022.html\">http://jfla.inria.fr/jfla2022.html</a></p>\n<p>Journées Francophones des Langages Applicatifs</p>\n<p>2 février au 5 février 2022</p>\n<p>Domaine d'Essendiéras (Périgord)</p>\n</li>\n</ul>\n<p>Les 33-ièmes Journées Francophones des Langages Applicatifs (JFLA) se <br>\ntiendront dans le Périgord, à Saint Médard d’Excideuil, au coeur du <br>\nDomaine d'Essendiéras, du mercredi 2 février 2022 au samedi 5 février <br>\n2022.</p>\n<p>Les JFLA réunissent concepteurs, utilisateurs et théoriciens ; elles <br>\nont pour ambition de couvrir les domaines des langages applicatifs, de <br>\nla preuve formelle, de la vérification de programmes, et des objets <br>\nmathématiques qui sous-tendent ces outils. Ces domaines doivent être <br>\npris au sens large : nous souhaitons promouvoir les ponts entre les <br>\ndifférentes thématiques.</p>\n<ul>\n<li>\n<p>Langages fonctionnels et applicatifs : sémantique, compilation, <br>\n   optimisation, typage, mesures, extensions par d'autres paradigmes.</p>\n</li>\n<li>\n<p>Assistants de preuve : implémentation, nouvelles tactiques, <br>\n   développements présentant un intérêt technique ou méthodologique.</p>\n</li>\n<li>\n<p>Logique, correspondance de Curry-Howard, réalisabilité, extraction <br>\n   de programmes, modèles.</p>\n</li>\n<li>\n<p>Spécification, prototypage, développements formels d'algorithmes.</p>\n</li>\n<li>\n<p>Vérification de programmes ou de modèles, méthode déductive, <br>\n   interprétation abstraite, raffinement.</p>\n</li>\n<li>\n<p>Utilisation industrielle des langages fonctionnels et applicatifs, <br>\n   ou des méthodes issues des preuves formelles, outils pour le web.</p>\n</li>\n</ul>\n<p>Les articles soumis aux JFLA sont relus par au moins deux personnes <br>\ns'ils sont acceptés, trois personnes s'ils sont rejetés. Les critiques <br>\ndes relecteurs sont toujours bienveillantes et la plupart du temps <br>\nencourageantes et constructives, même en cas de rejet.</p>\n<p>Il n'y a donc pas de raison de ne pas soumettre aux JFLA !</p>\n<ul>\n<li>Dates importantes</li>\n</ul>\n<p>Soumission des résumés          1er octobre 2021<br>\nSoumission des articles         8 octobre 2021<br>\nNotification aux auteurs        9 novembre 2021<br>\nVersion finale                  7 décembre 2021<br>\nClôture des inscriptions        7 janvier 2022</p>\n<ul>\n<li>Soumissions</li>\n</ul>\n<p>Nous acceptons quatre types de soumissions :</p>\n<ul>\n<li>\n<p>Article de recherche de seize pages au plus (bibliographie incluse), <br>\n   portant sur des travaux originaux. Nous acceptons des travaux en <br>\n   cours, pour lesquels l'aspect recherche n'est pas entièrement <br>\n   finalisé. Nous encourageons aussi la soumission de \"perles\", ces <br>\n   articles présentant avec élégance un résultat connu sous un angle <br>\n   nouveau.</p>\n</li>\n<li>\n<p>Article court de huit pages au plus (bibliographie incluse) pour <br>\n   rechercher de l'aide pour résoudre un problème particulier ou pour <br>\n   reparler d'un papier déjà publié.</p>\n</li>\n<li>\n<p>Proposition de tutoriel d'une page exposant son intérêt et ses <br>\n   objectifs ainsi que l'environnement informatique nécessaire à sa <br>\n   réalisation.</p>\n</li>\n<li>\n<p>Proposition de démonstration d'un outil ou d'un prototype de deux <br>\n   pages décrivant pourquoi ce logiciel est intéressant ainsi que ses <br>\n   spécificités.</p>\n</li>\n</ul>\n<p>Dans tous les cas, la forme de l'article devra être soignée. Les <br>\narticles sélectionnés seront publiés dans les actes de la conférence, <br>\net les auteurs seront invités à faire une présentation lors des <br>\njournées, de vingt-cinq minutes pour les articles longs et de quinze <br>\nminutes pour les courts. Les tutoriels auront un créneau de vingt-cinq <br>\nminutes et les démonstrations d'outils ou de prototypes se verront <br>\nallouer quinze minutes.</p>\n<p>L'article peut être rédigé en anglais, auquel cas la présentation <br>\ndevra être effectuée en français. Néanmoins, dans le cas où il s'agit <br>\nd'une republication au format court d'un article déjà publié, la <br>\npublication doit être en français et la publication originale en <br>\nanglais.</p>\n<p>Le style LaTeX Easychair doit être respecté :<br>\n<a href=\"https://easychair.org/publications/for_authors\">https://easychair.org/publications/for_authors</a></p>\n<p>Les soumissions se font sur la page Easychair des JFLA :<br>\n<a href=\"https://easychair.org/conferences/?conf=jfla22\">https://easychair.org/conferences/?conf=jfla22</a><br>\n<a href=\"/user_uploads/14278/pN71lAx1Ms1GtC9OvlnfQAc3/signature.asc\">signature.asc</a></p>",
        "id": 245320069,
        "sender_full_name": "Email Gateway",
        "timestamp": 1625754167
    }
]