[
    {
        "content": "<p>From: Daniela Kaufmann &lt;<a href=\"mailto:daniela.kaufmann@tuwien.ac.at\">daniela.kaufmann@tuwien.ac.at</a>&gt;</p>\n<p>================================================================================<br>\n  Formal Methods in Computer-Aided Design (FMCAD) 2025 - Call for Papers<br>\n================================================================================</p>\n<p>FMCAD 2025 is the twenty-fifth edition in a series of conferences on the<br>\ntheory and<br>\napplications of formal methods in hardware and system verification. The<br>\nconference<br>\nencompasses a wide range of topics related to formal aspects of computer-aided<br>\nsystem<br>\ndesign, including verification, specification, synthesis, and testing and<br>\nprovides<br>\na leading forum to researchers in academia and industry for presenting and<br>\ndiscussing<br>\ngroundbreaking methods, technologies, theoretical results, and tools for<br>\nreasoning<br>\nformally about computing systems.</p>\n<h2>General Information</h2>\n<p>Conference Website: <a href=\"https://fmcad.org/FMCAD25/\">https://fmcad.org/FMCAD25/</a><br>\nConference Location: SRI Headquarters, Menlo Park, California, US<br>\nConference Dates: October 6 - October 10, 2025</p>\n<p>FMCAD 2025 includes the FMCAD Student Forum<br>\n(<a href=\"https://fmcad.org/FMCAD25/student_forum/\">https://fmcad.org/FMCAD25/student_forum/</a>)<br>\nand is co-located with VSTTE 2025.</p>\n<h2>Topics of Interest</h2>\n<p>FMCAD welcomes submission of papers reporting original research on advances in<br>\nall<br>\naspects of formal methods and their applications to computer-aided design.</p>\n<p>Topics of interest include (but are not limited to):</p>\n<ul>\n<li>\n<p>Model checking, theorem proving, equivalence checking, abstraction and<br>\nreduction,<br>\ncompositional methods, decision procedures at the bit- and word-level,<br>\nprobabilistic<br>\nmethods, combinations of deductive methods and decision procedures.</p>\n</li>\n<li>\n<p>Synthesis and compilation for computer system descriptions, modeling,<br>\nspecification,<br>\nand implementation languages, formal semantics of languages and their subsets,<br>\nmodel-based<br>\ndesign, design derivation and transformation, correct-by-construction methods.</p>\n</li>\n<li>\n<p>Application of formal and semi-formal methods to functional and non-<br>\nfunctional<br>\nspecification and validation of hardware and software, including timing and<br>\npower<br>\nmodeling, verification of computing systems on all levels of abstraction,<br>\nsystem-level<br>\ndesign and verification for embedded systems, cyber-physical systems,<br>\nautomotive<br>\nsystems and other safety-critical systems, hardware-software co-design and<br>\nverification,<br>\nand transaction-level verification.</p>\n</li>\n<li>\n<p>Experience with the application of formal and semi-formal methods to<br>\nindustrial-scale<br>\ndesigns; tools that represent formal verification enablement, introducenew<br>\nfeatures,<br>\nor substantially improve the automation of formal methods.</p>\n</li>\n<li>\n<p>Application of formal methods to verifying safety, connectivity and security<br>\nproperties<br>\nof networks, distributed systems, smart contracts, block chains, and IoT<br>\ndevices.</p>\n</li>\n<li>\n<p>Application of formal methods to the analysis of machine learning systems,<br>\nand<br>\napplications of machine learning to enhance formal methods techniques.</p>\n</li>\n</ul>\n<h2>Important Dates</h2>\n<ul>\n<li>Abstract Submission Deadline: April 20, 2025</li>\n<li>Paper Submission Deadline: April 27, 2025</li>\n<li>Author Response: June 17 - June 19, 2025</li>\n<li>Author Notification: July 1, 2025</li>\n</ul>\n<p>All deadlines are 11:59 pm AoE (Anywhere on Earth)</p>\n<h3>FMCAD/VSTTE Program Outline</h3>\n<ul>\n<li>Main VSTTE Day: October 6, 2025</li>\n<li>Joint FMCAD/VSTTE Tutorial Day: October 7, 2025</li>\n<li>Main FMCAD days: October 8 - October 10, 2025</li>\n</ul>\n<h2>Submission Guidelines</h2>\n<p>Submissions must be made electronically in PDF format via EasyChair:<br>\n<a href=\"https://easychair.org/conferences?conf=fmcad2025\">https://easychair.org/conferences?conf=fmcad2025</a></p>\n<p>Two categories of papers are invited: Regular papers, and Tool &amp; Case Study<br>\npapers.</p>\n<ul>\n<li>\n<p><em>Regular papers</em> are expected to offer novel foundational ideas, theoretical<br>\nresults,<br>\nor algorithmic improvements to existing methods, along with experimental<br>\nimpact validation<br>\nwhere applicable.</p>\n</li>\n<li>\n<p><em>Tool &amp; Case Study papers</em> are expected to report on the design,<br>\nimplementation<br>\nor use of verification (or related) technology in a practically relevant<br>\ncontext<br>\n(which need not be industrial), and its impact on design processes.</p>\n</li>\n</ul>\n<p>Both Regular and Tool &amp; Case Study papers must use the IEEE Transactions<br>\nformat on<br>\nletter-size paper with a 10-point font size; preferably, use the FMCAD<br>\ntemplate for<br>\npapers. Papers in both categories can be either 8 pages (long) or 4 pages<br>\n(short)<br>\nin length excluding references. Short papers that describe emerging results,<br>\npractical<br>\nexperiences, or original ideas that can be described succinctly are<br>\nencouraged. Authors<br>\nwill be required to select an appropriate paper category at abstract<br>\nsubmission time.<br>\nSubmissions may contain an optional appendix, which will not appear in the<br>\nfinal<br>\nversion of the paper. The reviewers should be able to assess the quality and<br>\nthe<br>\nrelevance of the results in the paper without reading the appendix.</p>\n<p>Submissions in all categories must contain original research that has not been<br>\npreviously<br>\npublished, nor is concurrently submitted for publication. Any partial overlap<br>\nwith<br>\npublished or concurrently submitted papers must be clearly indicated.</p>\n<p>FMCAD employs a rigorous peer-review process and each submission will be<br>\nreviewed<br>\nby at least four members of the program committee. The review process is<br>\nsingle-blind.</p>\n<p>The review process will incorporate a feedback and rebuttal period during<br>\nwhich authors<br>\nwill have the opportunity to formally respond to reviewer comments.</p>\n<p><strong>New - Artifact Evaluation:</strong> FMCAD 2025 introduces optional artifact<br>\nevaluation<br>\nto enhance transparency and the usability of research outcomes. Authors<br>\nreporting<br>\nexperimental results are strongly encouraged to publish their final data in a<br>\nlong-term<br>\nrepository (e.g. zenodo (<a href=\"https://zenodo.org\">https://zenodo.org</a>)). With artifacts serving as<br>\nsupplementary<br>\nevidence, high-quality artifacts can improve the likelihood of paper<br>\nacceptance.<br>\nArtifact evaluation will be integrated into the main review process, with one<br>\nselected<br>\nprogram committee member assessing the quality of the artifact alongside the<br>\npaper.<br>\nAccepted artifacts require a DOI and will be clearly identified in the<br>\npublished<br>\npaper. Details are available on the Artifacts Page<br>\n(<a href=\"https://fmcad.org/FMCAD25/cfa\">https://fmcad.org/FMCAD25/cfa</a>).</p>\n<p>Accepted papers are published by TU Wien Academic Press under a Creative<br>\nCommons<br>\nlicense (the authors retain the copyright) and distributed through the IEEE<br>\nXPlore<br>\ndigital library. IEEE CEDA is a technical co-sponsor of FMCAD. There are no<br>\npublication<br>\nfees. Authors of accepted contributions will be required to sign the FMCAD<br>\ncopyright<br>\ntransfer form found here: <a href=\"https://fmcad.or.at/pdf/copyright.pdf\">https://fmcad.or.at/pdf/copyright.pdf</a>.<br>\nFor each accepted paper, at least one unique author must register for the<br>\nconference.<br>\nMoreover, authors of accepted papers ensure that at least one of them will<br>\nattend<br>\nthe conference and present the work.</p>\n<h2>Student Forum</h2>\n<p>Continuing the tradition of the previous years, FMCAD 2025 will host a Student<br>\nForum<br>\nthat provides a platform for graduate students at any career stage to<br>\nintroduce their<br>\nresearch to the wider Formal Methods community, and solicit feedback.</p>\n<p>Submissions for the student forum must be short reports describing research<br>\nideas<br>\nor ongoing work that the student is currently pursuing, and must be within the<br>\nscope<br>\nof FMCAD. Work that has been partly published previously might be considered;<br>\nthe<br>\nnovel aspect to be addressed in future work must be clearly described in such<br>\ncases.</p>\n<p>All submissions will be reviewed by a selected group of FMCAD student forum<br>\ncommittee<br>\nmembers. Details are available on the Student Forum Page<br>\n(<a href=\"https://fmcad.org/FMCAD25/student_forum\">https://fmcad.org/FMCAD25/student_forum</a>).</p>\n<h2>FMCAD 2025 Committees</h2>\n<h3>Program Chair</h3>\n<p>Ahmed Irfan, SRI, CA, USA<br>\nDaniela Kaufmann, TU Wien, Austria</p>\n<h3>Local Chair</h3>\n<p>Stéphane Graham-Lengrand, SRI, CA, USA</p>\n<h3>Registration Chair</h3>\n<p>Jenny McNeill, SRI, CA, USA</p>\n<h3>Student Forum Chairs</h3>\n<p>Tanja Schindler, University of Basel, Switzerland<br>\nLee A. Barnett, AWS, CA, USA</p>\n<h3>Sponsorship Chair:</h3>\n<p>Alex Ozdemir, Stanford University, CA, USA</p>\n<h3>Publication Chair</h3>\n<p>Georg Weissenbacher, TU Wien, Austria</p>\n<h3>Web Chair</h3>\n<p>Thomas Hader, TU Wien, Austria</p>\n<h3>FMCAD Steering Committee</h3>\n<p>Clark Barrett, Stanford University, CA, USA<br>\nArmin Biere, University of Freiburg, Germany<br>\nRuzica Piskac, Yale University, USA<br>\nAnna Slobodova, ARM, USA<br>\nGeorg Weissenbacher, TU Wien, Austria</p>",
        "id": 494656528,
        "sender_full_name": "Email Gateway",
        "timestamp": 1737304631
    }
]