[
    {
        "content": "<p>From: Claude Marche &lt;<a href=\"mailto:Claude.Marche@inria.fr\">Claude.Marche@inria.fr</a>&gt;<br>\nTemporary engineer positions at Inria are available for the<br>\n``ProofInUse'' consortium.</p>\n<p>== ProofInUse in short ==</p>\n<p>The ProofInUse consortium is a laboratory for research and development<br>\nin the domain of high-assurance software. It is joint between several<br>\nacademic and industrial partners. The general objective of ProofInUse<br>\nis to provide software verification tools, based on mathematical<br>\nproof, to industry users.</p>\n<p>The objective of ProofInUse is to significantly increase the<br>\ncapabilities and performances of verification environments proposed or<br>\ninternally used by the partners. Beyond a common interest in formal<br>\nverification techniques, the members of ProofInUse share a common<br>\ninterest in the generic environment Why3 for deductive program<br>\nverification, developed in the Toccata research group. In particular,<br>\nProofInUse aims at integration of verification techniques at the<br>\nstate-of-the-art of academic research, via the Why3 environment.</p>\n<p>See also <a href=\"https://proofinuse.gitlabpages.inria.fr/\">https://proofinuse.gitlabpages.inria.fr/</a></p>\n<p>== Expectations from the candidates ==</p>\n<p>We expect some experience in the field of formal methods of software<br>\nengineering, in a general sense. The typical candidate would be<br>\nsomeone who recently defended a PhD in a related domain. Having a PhD<br>\nis not a mandatory requirement though.</p>\n<p>The research part of the job is significant, the work being expected<br>\nto lead to academic publications, as exemplified by the publications<br>\nof the former engineers of ProofInUse (see<br>\n<a href=\"https://proofinuse.gitlabpages.inria.fr/dissemination.html\">https://proofinuse.gitlabpages.inria.fr/dissemination.html</a>).  The<br>\ndevelopment activities include a participation to the development of<br>\nWhy3, for which we are interested in candidates with experience in<br>\nOCaml programming, or similar functional programming languages, and in<br>\nthe practice of shared development using git.</p>\n<p>Some skills in the use of a formal proof environment will be a plus.</p>\n<p>== How to apply</p>\n<p>The engineer positions should be filled as soon as possible.</p>\n<p>The primary site for the positions is</p>\n<p><a href=\"https://recrutement.inria.fr/public/classic/en/offres/2021-04144\">https://recrutement.inria.fr/public/classic/en/offres/2021-04144</a></p>\n<p>where you can apply with a CV and a motivation letter.</p>\n<p>Do not hesitate to contact me directly (<a href=\"mailto:Claude.Marche@inria.fr\">Claude.Marche@inria.fr</a>) for<br>\nmore information on the positions.</p>",
        "id": 258721955,
        "sender_full_name": "Email Gateway",
        "timestamp": 1634914078
    }
]