[
    {
        "content": "<p>From: Harsh Beohar &lt;<a href=\"mailto:cl-isabelle-users@lists.cam.ac.uk\">cl-isabelle-users@lists.cam.ac.uk</a>&gt;</p>\n<hr>\n<ul>\n<li>\n<p>PhD positions in Combinatorics, Random Graphs, Logic, Complexity, and<br>\nSemantics</p>\n</li>\n<li>\n<p>University of Sheffield, UK</p>\n</li>\n<li>Fully funded for 3.5 years for both UK Home and Overseas students</li>\n<li>Possible times to start: ASAP/Spring 2024</li>\n<li>Deadline: 17th September 2023</li>\n<li>Details:<br>\n<a href=\"https://www.jobs.ac.uk/job/DCG686/fully-funded-phd-positions-in-combinatorics-random-graphs-logic-complexity-and-semantics-at-university-of-sheffield\">https://www.jobs.ac.uk/job/DCG686/fully-funded-phd-positions-in-combinatorics-random-graphs-logic-complexity-and-semantics-at-university-of-sheffield</a></li>\n</ul>\n<hr>\n<p>Up to four fully funded research positions with the opportunity of<br>\nundertaking a PhD are available within the Foundation of Computation (FOX)<br>\nGroup, Department of Computer Science, at the University of Sheffield:<br>\n<a href=\"http://www.sheffield.ac.uk/dcs/research/groups/foundations-computation\">www.sheffield.ac.uk/dcs/research/groups/foundations-computation</a>.</p>\n<p>The FOX research group at Sheffield is growing rapidly. These posts provide<br>\nexcellent opportunities for graduate students (UK and overseas) to obtain a<br>\nPhD in any active research area of the group (see below the research<br>\ninterests of potential supervisors).</p>\n<p>The posts are fully funded for three and half years. Note that<br>\nexceptionally strong overseas candidates will be considered as well, with<br>\nfull cover of tuition fees.</p>\n<p>Dr. Charles Grellois is mainly interested in the verification of functional<br>\nprograms, would they be deterministic or probabilistic. He has worked on<br>\nhigher-order model-checking in the deterministic case, and on higher-order<br>\ntermination analysis in the probabilistic case. These approaches use<br>\ntechniques from linear logic and its models, category theory,<br>\n(intersection) type theory, tree automata theory, probabilistic semantics,<br>\nrealizability… Several interesting questions are still open so that several<br>\ndifferent PhD projects could be discussed on these topics; but he is also<br>\nopen to other research topics in this area, to be discussed with the<br>\nprospective student.</p>\n<p>Dr. Maksim Zhukovskii is interested in combinatorics, probability, logic,<br>\ncomputational and descriptive complexity. Currently Maksim is working on<br>\nvariety of topics including extremal combinatorics (Turan-type questions,<br>\nsaturation, colourings, etc), random graphs (thresholds, limiting<br>\ndistributions, logical limit laws, almost sure theories), average-case<br>\ncomplexity (canonical labelling of random graphs, search problems in random<br>\ngraphs, reconstruction problems), enumerative combinatorics (random regular<br>\ngraphs, degree sequences), algebraic combinatorics (Cayley graphs,<br>\nisomorphism problem for abelian groups, matroids), random walks, first<br>\norder logic and expressive power of its fragments, second order logic and<br>\nmodal logic. See <a href=\"http://scholar.google.com/citations?user=sd_xBDQAAAAJ\">scholar.google.com/citations?user=sd_xBDQAAAAJ</a> for the<br>\nlist of publications.</p>\n<p>Dr. Jonni Virtema is keen to supervise students in any area of his current<br>\nresearch, which relate to the interplay of logic and complexity theory.<br>\nCurrent topics include logics and complexity theory related to numerical<br>\ndata, and temporal logics designed to express so-called hyperproperties,<br>\nwhich are important in information flow and security. A further emerging<br>\ntopic is to study foundations of neural networks using the machinery of<br>\nlogics and complexity theory related to numerical data. See <a href=\"http://www.virtema.fi\">www.virtema.fi</a><br>\nfor further details.</p>\n<p>Dr. Harsh Beohar is broadly interested in comparative concurrency semantics<br>\nand in the interplay of category theory, logic, and semantics. Current<br>\ntopics include expressive modal logics, behavioural equivalence games,<br>\nsynthesising distinguishing/characteristic formulae all at the level of<br>\ncoalgebras. See <a href=\"http://dblp.org/pid/13/7482.html\">dblp.org/pid/13/7482.html</a> for an uptodate list of<br>\npublications.</p>",
        "id": 387448593,
        "sender_full_name": "Email Gateway",
        "timestamp": 1693074516
    }
]