[
    {
        "content": "<p>From: \"Donaldson, Alastair F\" &lt;<a href=\"mailto:alastair.donaldson@imperial.ac.uk\">alastair.donaldson@imperial.ac.uk</a>&gt;<br>\nDear all</p>\n<p>Please find below the Call for Workshops and Co-located Events for the POPL 2024 conference, which is also here:</p>\n<p><a href=\"https://popl24.sigplan.org/track/POPL-2024-workshops-and-co-located-events\">https://popl24.sigplan.org/track/POPL-2024-workshops-and-co-located-events</a></p>\n<p>We would be grateful if you could help distribute this call among your networks.</p>\n<p>Many thanks</p>\n<p>Alastair Donaldson and John Wickerson<br>\nPOPL 2024 Publicity Chairs</p>\n<p>Call for Workshops and Co-located Events</p>\n<p>POPL 2024</p>\n<p>51st ACM SIGPLAN-SIGACT Symposium on<br>\n      Principles of Programming Languages</p>\n<p>Sun 14 - Sat 20, January 2024<br>\n            London, United Kingdom</p>\n<p><a href=\"https://popl24.sigplan.org\">https://popl24.sigplan.org</a></p>\n<p>The 51st ACM SIGPLAN-SIGACT Symposium on Principles of Programming Languages (POPL 2024) will be held in London, United Kingdom</p>\n<p>POPL provides a forum for the discussion of fundamental principles and important innovations in the design, definition, analysis, transformation, implementation and verification of programming languages, programming systems, and programming abstractions.</p>\n<p>Events focusing on experimental and theoretical topics are welcome.</p>\n<p>Proposals are invited for workshops and other events to be co-located with POPL 2024. All co-located events are sponsored by SIGPLAN (<a href=\"http://acm.org/sigplan/\">http://acm.org/sigplan/</a>).</p>\n<p>Workshops should be more informal and focused than POPL itself, include sessions that enable interaction among the workshop attendees. The preference is for one-day workshops, but other schedules can also be considered.</p>\n<p>Submission details<br>\n==================</p>\n<p>Deadline for submission: 25 July 2023 Notification for acceptance: 1 August 2023</p>\n<p>A workshop proposal should provide the following information:</p>\n<ul>\n<li>Name of the workshop.</li>\n<li>Duration of the workshop.</li>\n<li>Whether the workshop will be Conference-approved or SIGPLAN-approved (see below).</li>\n<li>Organizers: names, affiliation, contact information, brief (100 words) biography.</li>\n<li>A short description (150-200 words) of the topic.</li>\n<li>Event format: workshop; type of submissions if any; review process; results dissemination.</li>\n<li>Expected attendance and target audience.</li>\n<li>Potential PC members - please do not contact them before the workshop is approved.</li>\n<li>History of the workshop.</li>\n<li>Plans for remote participation</li>\n</ul>\n<p>Proposals must be submitted in pdf form by email with the subject POPL 2024 Workshop Proposal: &lt;workshop name&gt;, to the workshop co-chairs: Anders Miltner (<a href=\"mailto:miltner@sfu.ca\">miltner@sfu.ca</a>) and Christoph Matheja (<a href=\"mailto:chmat@dtu.dk\">chmat@dtu.dk</a>).</p>\n<p>SIGPLAN Sponsorship<br>\n===================</p>\n<p>POPL Co-located Events are sponsored by SIGPLAN (<a href=\"http://sigplan.org/\">http://sigplan.org/</a>). There are two kinds of Co-located Events: Conference-approved (no proceedings) and SIGPLAN-approved (proceedings in the ACM Digital Library). See <a href=\"http://www.sigplan.org/Resources/Guidelines/Workshops/\">http://www.sigplan.org/Resources/Guidelines/Workshops/</a> for more information, including a full listing of prescriptions for Conference-approved and SIGPLAN-approved workshops.</p>\n<p>SIGPLAN-approved workshops must respect the SIGPLAN Diversity Policy. Proposals for SIGPLAN-approved workshops must additionally include the gender, country of affiliation, and professional status of potential PC members. See <a href=\"https://www.sigplan.org/Resources/Policies/Diversity/\">https://www.sigplan.org/Resources/Policies/Diversity/</a> for more details.</p>\n<p>Selection committee<br>\n===================</p>\n<p>All submissions will be evaluated by a committee comprising the following members of the POPL 2024 organizing committee, together with the members of the SIGPLAN executive committee.</p>\n<p>Workshops co-chairs: Anders Miltner (Simon Fraser University) and Christoph Matheja (Technical University of Denmark)</p>\n<p>General chair: Philippa Gardner (Imperial College London) Program chair: Derek Dreyer (MPI-SWS)</p>",
        "id": 364084421,
        "sender_full_name": "Email Gateway",
        "timestamp": 1686076392
    }
]