[
    {
        "content": "<p>From: Manuel Eberl &lt;<a href=\"mailto:manuel@pruvisto.org\">manuel@pruvisto.org</a>&gt;<br>\nMartingales</p>\n<p>by Ata Keskin</p>\n<p>In the scope of this project, we present a formalization of martingales <br>\nin arbitrary Banach spaces.</p>\n<p>The current formalization of conditional expectation in the Isabelle <br>\nlibrary is limited to real-valued functions. To overcome this <br>\nlimitation, we extend the construction of conditional expectation to <br>\ngeneral Banach spaces, employing an approach similar to the one <br>\ndescribed in \"Analysis in Banach Spaces Volume I\" by Hytönen et al. We <br>\nuse measure theoretic arguments to construct the conditional expectation <br>\nusing suitable limits of simple functions.</p>\n<p>Subsequently, we define stochastic processes and introduce the concepts <br>\nof adapted, progressively measurable and predictable processes using <br>\nsuitable locale definitions. […] Furthermore, we show that progressive <br>\nmeasurability and adaptedness are equivalent when the indexing set is <br>\ndiscrete. We pay special attention to predictable processes in <br>\ndiscrete-time, showing that is predictable if and only if is adapted.</p>\n<p>Moving forward, we rigorously define martingales, submartingales, and <br>\nsupermartingales, presenting their first consequences and corollaries. <br>\nDiscrete-time martingales are given special attention in the <br>\nformalization. In every step of our formalization, we make extensive use <br>\nof the powerful locale system of Isabelle.</p>\n<p>The formalization further contributes by generalizing concepts in <br>\nBochner integration by extending their application from the real numbers <br>\nto arbitrary Banach spaces equipped with a second-countable topology. <br>\nInduction schemes for integrable simple functions on Banach spaces are <br>\nintroduced, accommodating various scenarios with or without a real <br>\nvector ordering. Specifically, we formalize a powerful result called the <br>\n\"Averaging Theorem\" (Real and Functional Analysis, Serge Lang) which <br>\nallows us to show that densities are unique in Banach spaces.</p>\n<p>In depth information on the formalization and the proofs of the <br>\nindividual theorems can be found in the thesis linked below.</p>\n<p><a href=\"https://www.isa-afp.org/entries/Martingales.html\">https://www.isa-afp.org/entries/Martingales.html</a></p>\n<p>Enjoy,</p>\n<p>Manuel</p>",
        "id": 406184167,
        "sender_full_name": "Email Gateway",
        "timestamp": 1701822731
    }
]