[
    {
        "content": "<p>From: \"Eugene W. Stark\" &lt;<a href=\"mailto:isabelle-users@starkeffect.com\">isabelle-users@starkeffect.com</a>&gt;<br>\nI am observing that when a citation is made in a theory file (in a directory set up<br>\nfollowing the usual AFP organization, with a root.bib and a root.tex file in the \"document\"<br>\nsubdirectory); e.g. by</p>\n<p>\\&lt;^cite&gt;‹\"xxx\"›</p>\n<p>then if there is some issue with the BibTeX file (for example, there is no reference \"xxx\"),<br>\nthen an error is flagged in the JEdit window.  However, if one goes and corrects the BibTeX<br>\nfile (e.g. by adding the missing entry), the error message does not get reset, even if one<br>\ndoes \"Reload All\".  It is necessary to close JEdit and restart it in order to reset the error<br>\nmessage.</p>\n<p>I think this behavior probably was introduced with the introduction of \\&lt;^cite&gt;, so it<br>\nmight have already been in Isabelle2022.  However, I have not tried to edit BibTeX files<br>\nsince Isabelle2022 was released, so I didn't observe this until now.</p>",
        "id": 384287745,
        "sender_full_name": "Email Gateway",
        "timestamp": 1691852353
    },
    {
        "content": "<p>From: Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt;<br>\nYes, that is an accurate description of the situation in Isabelle2023. There <br>\nhave been may improvements concerning document preparation, e.g. the new <br>\n\"Document\" panel, but a few fine points are still unfinished.</p>\n<p>In particular, bib files are not treated properly within the PIDE document <br>\nmodel: this is what counts for Isabelle/jEdit.</p>\n<p>The underlying jEdit text editor has its own mechanisms for checking and <br>\nupdates of files, e.g. in SideKick, but that is of little relevance to <br>\nIsabelle/jEdit. In particular, loading or re-loading of buffers has no direct <br>\nimpact on the PIDE document model. (The idea is that it should not matter if a <br>\nPIDE file happens to be open or not, saved or unsaved etc.)</p>\n<p>So this is the pragmatic answer for Isabelle2023: after significant changes to <br>\nbib files, you need to restart the Prover IDE.</p>\n<p>Makarius</p>",
        "id": 390576174,
        "sender_full_name": "Email Gateway",
        "timestamp": 1694543882
    }
]