[
    {
        "content": "<p>From: Hans-Dieter Hiep &lt;<a href=\"mailto:cl-isabelle-users@lists.cam.ac.uk\">cl-isabelle-users@lists.cam.ac.uk</a>&gt;</p>\n<hr>\n<p>ICTAC 2024 - First Call for Papers<br>\n     21st International Colloquium on Theoretical Aspects of Computing<br>\n                    25-29 November 2024, Bangkok - Thailand<br>\n<a href=\"https://ictac2024.cs.ait.ac.th/\">https://ictac2024.cs.ait.ac.th/</a></p>\n<hr>\n<p>IMPORTANT DATES</p>\n<p>Abstract submission deadline: 14 June 2024 (AoE)<br>\nPaper submission deadline:    21 June 2024 (AoE)<br>\nNotification:                  1 September 2024 (AoE)<br>\nCamera ready:                 13 September 2024 (AoE)</p>\n<p>SCOPE</p>\n<p>The ICTAC conference series aims to bring together researchers and practitioners from academia, industry, and government to present research and exchange ideas and experiences within theoretical aspects of computing through methods and tools for system development. ICTAC also aims to promote research cooperation between developing and industrial countries.</p>\n<p>TOPICS</p>\n<p>The conference concerns all aspects of theoretical computer science, including, but not limited to:</p>\n<ul>\n<li>Formal languages and automata</li>\n<li>Semantics of programming languages</li>\n<li>Logic in computer science</li>\n<li>Lambda calculus, type theory, and category theory</li>\n<li>Domain-specific languages</li>\n<li>Theories of concurrency and mobility</li>\n<li>Theories of distributed computing</li>\n<li>Models of objects and components</li>\n<li>Coordination models</li>\n<li>Timed, hybrid, embedded, and cyber-physical systems</li>\n<li>Security and privacy</li>\n<li>Static analysis</li>\n<li>Software verification</li>\n<li>Software testing</li>\n<li>Program generation and transformation</li>\n<li>Model checking and theorem proving</li>\n<li>Theoretical aspects of quantum computing</li>\n<li>Theory and methods of trustworthy AI</li>\n<li>Applications and experiences</li>\n</ul>\n<p>SUBMISSIONS</p>\n<p>We solicit submissions, related to the topics of ICTAC, in the following categories:</p>\n<ul>\n<li>Full papers describing original research contributions;</li>\n<li>Short papers describing original work in progress, new ideas, and emerging challenges; and</li>\n<li>Tool papers describing tools supporting formal techniques for software modeling, system design, and verification.</li>\n</ul>\n<p>Full paper submissions must not exceed 16 pages (excluding a bibliography of a maximum of 2 pages). Short and tool papers should not exceed 8 pages.</p>\n<p>Submissions must not have been published or be under consideration for publication elsewhere. All submissions will be judged based on originality, contribution to the field, technical and presentation quality, and relevance to the conference's topics.</p>\n<p>All contributions to ICTAC 2024 have to be submitted electronically in PDF format via EasyChair:</p>\n<p><a href=\"https://easychair.org/conferences/?conf=ictac24\">https://easychair.org/conferences/?conf=ictac24</a></p>\n<p>Papers must be formatted according to the guidelines for Springer LNCS papers (see <a href=\"http://www.springer.com/lncs\">http://www.springer.com/lncs</a>), without modifications of margins and other space-saving measures. Authors should consult Springer's authors' instructions and use their proceedings templates, either for LaTeX or for Word, for the preparation of their papers. Springer encourages authors to include their ORCIDs in their papers.</p>\n<p>PUBLICATION</p>\n<p>All accepted papers in the above categories will appear in the proceedings of the conference that will be published as a volume in Springer's Lecture Notes in Computer Science (LNCS) series.</p>\n<p>All accepted papers must be presented at the conference. Their authors must be prepared to sign a copyright transfer statement. At least one author of each accepted paper must register for the conference by the early registration deadline, and present the paper.</p>\n<p>We plan to have a special issue for selected accepted papers from ICTAC 2024.</p>\n<hr>",
        "id": 420229060,
        "sender_full_name": "Email Gateway",
        "timestamp": 1707304500
    }
]