[
    {
        "content": "<p>From: \"Thiemann, René\" &lt;<a href=\"mailto:cl-isabelle-users@lists.cam.ac.uk\">cl-isabelle-users@lists.cam.ac.uk</a>&gt;<br>\nDear all,</p>\n<p>I’m happy to announce a new AFP entry:</p>\n<p>A Proof of Hilbert Basis Theorem and an Extension to Formal Power Series<br>\n  by Benjamin Puyobro, Benoît Ballenghien and Burkhart Wolff</p>\n<p>Abstract:</p>\n<p>The Hilbert Basis Theorem is enlisted in the extension of Wiedijk's catalogue<br>\n\"Formalizing 100 Theorems\", a well-known collection of challenge problems for<br>\nthe formalization of mathematics.</p>\n<p>In this paper, we present a formal proof of several versions of this theorem in<br>\nIsabelle/HOL. Hilbert's basis theorem asserts that every ideal of a polynomial<br>\nring over a commutative ring has a finite generating family (a finite basis in<br>\nHilbert's terminology). A prominent alternative formulation is: every polynomial<br>\nring over a Noetherian ring is also Noetherian.</p>\n<p>In more detail, the statement and our generalization can be presented as follows:</p>\n<ul>\n<li>\n<p>Hilbert's Basis Theorem. Let R[X] denote the ring of polynomials in the<br>\n  indeterminate X over the commutative ring R. Then R[X] is Noetherian if and <br>\n  only if R is.</p>\n</li>\n<li>\n<p>Corollary. R[X_1, ..., X_n] is Noetherian if and only if R is.</p>\n</li>\n<li>\n<p>Extension. If R is a Noetherian ring, then R[[X]] is a Noetherian ring, <br>\n  where R[[X]] denotes the formal power series over the ring R.</p>\n</li>\n</ul>\n<p>We also provide isomorphisms between the three types of polynomial rings defined<br>\nin HOL-Algebra. Together with the fact that the Noetherian property is preserved<br>\nby isomorphism, we get Hilbert's Basis Theorem for all three models. We believe<br>\nthat this technique has a wider potential of applications in the AFP library.</p>\n<p>For further details, have a look at:</p>\n<p><a href=\"https://www.isa-afp.org/entries/Hilbert_Basis.html\">https://www.isa-afp.org/entries/Hilbert_Basis.html</a></p>\n<p>Enjoy,<br>\nRené</p>",
        "id": 499174341,
        "sender_full_name": "Email Gateway",
        "timestamp": 1739349283
    }
]