[
    {
        "content": "<p>From: Violet Ka I Pun &lt;<a href=\"mailto:violetpun@gmail.com\">violetpun@gmail.com</a>&gt;<br>\n[apologies for cross-postings]</p>\n<p>==================================================</p>\n<p>FM 2023: 25th International Symposium on Formal Methods</p>\n<p>Lübeck, Germany, March 6-10, 2023<br>\n<a href=\"https://fm2023.isp.uni-luebeck.de/\">https://fm2023.isp.uni-luebeck.de/</a></p>\n<p>===  CALL FOR WORKSHOP &amp; TUTORIAL PROPOSALS  ===</p>\n<p>==================================================</p>\n<p>IMPORTANT DATES<br>\n================<br>\nSubmission of workshop proposals: June 10, 2022<br>\nNotification of success of proposals (workshop): June 24, 2022<br>\nSubmission of tutorial proposals: July 1, 2022<br>\nNotification of success of proposals (tutorial): July 15, 2022</p>\n<p>PROPOSALS<br>\n===========</p>\n<p>We are now inviting proposals for workshops, tutorials (and other<br>\nsimilar events) that will complement the main FM 2023 symposium. We<br>\nencourage a diversity of topics relating to different ways of<br>\ndeveloping and using formal methods. Due to the growing interest in AI<br>\nand machine learning-based software development, we particularly<br>\ninvite topics at the intersection of machine learning and formal<br>\nmethods.</p>\n<p>The general purpose of workshops and tutorials is to provide an<br>\ninformal setting for participants to discuss technical issues,<br>\nexchange research ideas and educational approaches, and to discuss<br>\nand/or demonstrate applications. These may be driven by fundamental<br>\nacademic interests, or by needs from specific application domains.</p>\n<p>A workshop is an event that involves an open call for contributions. A<br>\ntutorial is an event based entirely on invited talks by the organizers<br>\nor by invited speakers. Events that mix open and invited presentations<br>\nwill also be considered.</p>\n<p>Workshops and tutorials will take place on March 6th &amp; 10th, 2023,<br>\nflanking the main symposium. Each event (workshop or tutorial) should<br>\ntypically run for a half day or one day, but two-day events will also<br>\nbe considered. The FM 2023 organizing committee aims to contribute to<br>\nat least partial support for one invited speaker per event.</p>\n<p>==Submission Information==</p>\n<p>Researchers and practitioners wishing to organize a workshop or<br>\ntutorial are invited to submit proposals by e-mail to the Workshops &amp;<br>\nTutorials Chairs:</p>\n<p>=Tutorial chairs=</p>\n<ul>\n<li>Cesar Sanchez (<a href=\"mailto:cesar.sanchez@imdea.org\">cesar.sanchez@imdea.org</a>) and</li>\n<li>Martin Sachenbacher (<a href=\"mailto:sachenbacher@isp.uni-luebeck.de\">sachenbacher@isp.uni-luebeck.de</a>)</li>\n</ul>\n<p>=Workshop chairs=</p>\n<ul>\n<li>Esfandiar Mohammadi (<a href=\"mailto:esfandiar.mohammadi@uni-luebeck.de\">esfandiar.mohammadi@uni-luebeck.de</a>) and</li>\n<li>Volker Stolz (<a href=\"mailto:vsto@hvl.no\">vsto@hvl.no</a>)</li>\n</ul>\n<p>An event proposal should not exceed three pages and should include the<br>\nfollowing information:</p>\n<ul>\n<li>\n<p>Title and brief technical description of the event, specifying its<br>\ngoals and formal methods focus, and whether the event is a workshop,<br>\ntutorial, or any other kind of event.</p>\n</li>\n<li>\n<p>The names and contact information (web page, email address) of the<br>\norganizers. The organizers of a workshop will also be its Programme<br>\nCommittee (PC) chairs; in this case, the proposal may also list<br>\nprospective international PC members.</p>\n</li>\n<li>\n<p>Pointers to information about past editions of the event, if<br>\napplicable. Workshop proposals should specify whether it has taken<br>\nplace before; how often it has been co-located with FM or with other<br>\nconferences, and the number of participants in the most recent<br>\ninstallments.</p>\n</li>\n<li>\n<p>A discussion of the proposed format and agenda (for example: paper<br>\npresentations, tutorials, demo sessions, etc). The organizers are<br>\nencouraged to describe their vision for an online event, should the<br>\nneed occur in light of the current global pandemic crisis.</p>\n</li>\n<li>\n<p>The proposed duration: half or one day. Exceptionally, two-day<br>\nevents may be considered.</p>\n</li>\n<li>\n<p>Potential invited speaker(s).</p>\n</li>\n<li>\n<p>Workshop proposals should describe procedures for selecting papers<br>\nand participants, including a tentative timeline for submission and<br>\nnotification of acceptance, and plans for the publication of<br>\nproceedings, if any.</p>\n</li>\n</ul>\n<p>The organizers of the proposed events are expected to create and<br>\nmaintain a website for the event; handle paper selection, reviewing<br>\nand acceptance; draw up a program of talks; advertise their event<br>\nthough specialist mailing lists; prepare the informal pre-proceedings<br>\n(if applicable) in a timely fashion; and arrange any<br>\npost-proceedings. FM 2023 will provide the facilities and handle the<br>\nregistrations for the events.</p>",
        "id": 279666976,
        "sender_full_name": "Email Gateway",
        "timestamp": 1650540762
    }
]