[
    {
        "content": "<p>From: Tobias Nipkow &lt;<a href=\"mailto:nipkow@in.tum.de\">nipkow@in.tum.de</a>&gt;<br>\nVerifying a Decision Procedure for Pattern Completeness<br>\nRené Thiemann and Akihisa Yamada</p>\n<p>Pattern completeness is the property that the left-hand sides of a functional <br>\nprogram or term rewrite system cover all cases w.r.t. pattern matching. We <br>\nverify a recent (abstract) decision procedure for pattern completeness that <br>\ncovers the general case, i.e., in particular without the usual restriction of <br>\nleft-linearity. In two refinement steps, we further develop an executable <br>\nversion of that abstract algorithm. On our example suite, this verified <br>\nimplementation is faster than other implementations that are based on <br>\nalternative (unverified) approaches, including the complement algorithm, tree <br>\nautomata encodings, and even the pattern completeness check of the GHC Haskell <br>\ncompiler.</p>\n<p><a href=\"https://www.isa-afp.org/entries/Pattern_Completeness.html\">https://www.isa-afp.org/entries/Pattern_Completeness.html</a></p>\n<hr>\n<p>Sorted Terms<br>\nAkihisa Yamada and René Thiemann</p>\n<p>This entry provides a basic library for many-sorted terms and algebras. We view <br>\nsorted sets just as partial maps from elements to sorts, and define sorted set <br>\nof terms reusing the data type from the existing library of (unsorted) first <br>\norder terms. All the existing functionality, such as substitutions and contexts, <br>\ncan be reused without any modifications. We provide predicates stating what <br>\nsubstitutions or contexts are considered sorted, and prove facts that they <br>\npreserve sorts as expected.</p>\n<p><a href=\"https://www.isa-afp.org/entries/Sorted_Terms.html\">https://www.isa-afp.org/entries/Sorted_Terms.html</a></p>\n<p>Enjoy!</p>\n<p><a href=\"/user_uploads/14278/F-ge2Xlv71SQCMgiXQLnX-4O/smime.p7s\">smime.p7s</a></p>",
        "id": 442305128,
        "sender_full_name": "Email Gateway",
        "timestamp": 1717431991
    }
]