[
    {
        "content": "<p>From: \"\\\"Hammond, Aiden M. (ARC-TI)[KBR Wyle Services, LLC]\\\"\" &lt;<a href=\"mailto:cl-isabelle-users@lists.cam.ac.uk\">cl-isabelle-users@lists.cam.ac.uk</a>&gt;<br>\nCALL FOR IEEE SMC-IT/SCC 2025 SUBMISSIONS<br>\n<br>\n11th International Conference on Space Mission Challenges for Information Technology (SMC-IT)<br>\n16th International Conference on Space Computing (SCC)<br>\nJuly 28 – August 1, 2025<br>\nCalifornia Science Center - Los Angeles, California<br>\nSponsored by: IEEE Computer Society - Technical Committee on Software Engineering and Technical Committee on Computer Architecture<br>\n<br>\n<a href=\"https://2025.smcit-scc.space\">https://2025.smcit-scc.space</a><br>\n<br>\nImportant Dates:<br>\n• Deadline for full papers (SMC-IT and SCC) and SCC presentation-only abstracts: Feb 3, 2025<br>\n• Author acceptance notification: Mar 21, 2025<br>\n• Registration site open: Apr 4, 2025<br>\n• Final camera-ready versions papers deadline: May 30, 2025<br>\n• Final presentations deadline: June 27, 2025<br>\n<br>\nWe invite submissions for the IEEE International Conference on Space Mission Challenges for Information Technology (SMC-IT) and the IEEE Space Computing Conference (SCC). These conferences gather professionals, such as system designers, engineers, computer architects, scientists, practitioners, data scientists, and space explorers, who are committed to advancing information technology and improving the computational capabilities and dependability of space missions. These forums provide a valuable opportunity for in-depth technical dialogues covering various aspects of space mission hardware and software.<br>\n<br>\nSystems in all aspects of the space mission will be explored, including flight systems, ground systems, science data processing, engineering and development tools, operations, telecommunications, radiation-tolerant computing devices, reliable electronics, and space-qualifiable packaging technologies.<br>\nThe entire information systems lifecycle of the mission development will also be covered, such as conceptual design, engineering tools development, integration and test, operations, science analysis, and quality control.<br>\n<br>\nTopics of interest include (but are not limited to) space applications of the following:<br>\n<br>\nSMC-IT<br>\nRobotics, Cybersecurity, Networking, Memory and Storage, Advanced Ground Control, Advanced Modeling &amp; Digital Twins for Onboard Systems, Data Analytics and Big Data, Fault-Tolerant Processing, Trustable Intelligent/Autonomous Systems, Smart Instruments, Augmented Reality/Virtual Reality and HCI, Manufacturing and Assembly of Large Structures, Improved Operations, Software Reliability for Mission-Critical Applications and Safety of Life.<br>\n<br>\nSCC<br>\nHigh-Performance Onboard Computing, Components, Radiation, and Packaging, Computing Architectures, Flight Data Processing, Avionics Systems, Machine Learning/Neural Computing, Crew Interfaces, Extreme Environments Computing, Distributed Computing, Infusion and adoption of industry standards for space applications.<br>\n<br>\nSMC-IT/SCC Classified Session<br>\nA SMC-IT/SCC classified session will be held at The Aerospace Corporation, Friday, August 29, 2025 from 0800 to 1200 PDT. The theme of the session is “Unleashing Disruption and Transformation: Emerging Technologies in Space.” All attendees must possess a TS/SCI clearance and be a U.S. Citizen. Please send a message to: <a href=\"mailto:smc-it-ssc@aero.org\">smc-it-ssc@aero.org</a> for additional registration information.<br>\n<br>\nProcess and Format<br>\n• The SMC-IT/SCC 2025 Technical Committee is seeking two kinds of submissions at this time: full papers (BOTH SMC-IT AND SCC) and presentations (ONLY SCC).<br>\n• SMC-IT/SCC 2025 will use a single-pass, full-paper review process.<br>\n• The full paper is required and peer reviewed prior to deciding on acceptance for the conference, even if an abstract has been submitted.<br>\n• Full papers can be up to 10 pages, not including references. The paper template can be found on the SMC-IT/SCC 2025 website.<br>\n• All accepted papers will be published in the IEEE conference proceedings, indexed with the IEEE Xplore database. Note that IEEE has a “Podium and Publish” policy for conferences, which means that no manuscript will be published in IEEE Xplore without first being presented at the conference.<br>\n• Authors of SCC presentations without a corresponding paper need to submit a 1-page abstract, which will allow the conference organizers to determine if the proposed presentation is germane for the conference, determine which track/session the proposed presentation belongs, and ensure the author is in contact with the track/session chair for feedback prior to the final submission. All presentation-only abstract submissions must be submitted by the full paper deadline.<br>\n• All submissions are uploaded via EasyChair: <a href=\"https://easychair.org/conferences/?conf=smcitscc2025\">https://easychair.org/conferences/?conf=smcitscc2025</a><br>\n• Selected papers may be invited to appear in a special issue of a reputable journal. More details will be made available in the future.<br>\n<br>\nNote: It is not required to submit an abstract prior to the paper submission.<br>\n<br>\nCONFERENCE CHAIRS<br>\nGeneral Chair: Ivan Perez (KBR @ NASA ARC)<br>\nGeneral Co-Chair: Jim Butler (JPL)<br>\nProgram Chair (SMC-IT): Lukas Mandrake (JPL)<br>\nProgram Co-chair (SMC-IT): Jack Lightholder (JPL)<br>\nProgram Chair (SCC): David Rutishauser (NASA JSC)<br>\nProgram Co-Chair (SCC): Christopher Green (NASA GSFC)<br>\nSMC-IT/SCC Program Committee Members</p>",
        "id": 499907943,
        "sender_full_name": "Email Gateway",
        "timestamp": 1739620353
    }
]