[
    {
        "content": "<p>From: Violet Ka I Pun &lt;<a href=\"mailto:violetpun@gmail.com\">violetpun@gmail.com</a>&gt;<br>\nICE 2024<br>\n            17th Interaction and Concurrency Experience<br>\n                       June 21, 2024, Groningen<br>\n                Satellite workshop of DisCoTec 2024</p>\n<p><a href=\"https://www.discotec.org/2024/ice\">https://www.discotec.org/2024/ice</a></p>\n<p>Submission link:<br>\n<a href=\"https://ice24.hotcrp.com/\">https://ice24.hotcrp.com/</a></p>\n<p>The Interaction and Concurrency Experience (ICE) series of<br>\ninternational scientific meetings are a forum for computer science<br>\nresearchers with research interests in models, verification, tools,<br>\nand programming primitives for complex interactions.</p>\n<p>=== HIGHLIGHTS ===</p>\n<p>* Distinctive selection procedure<br>\n   * ICE welcomes full papers to be included in the proceedings<br>\n   * ICE also welcomes oral communications of already published or<br>\n     preliminary work</p>\n<p>* New this year: two-round paper submission.<br>\n   * Publication in EPTCS (to be confirmed)<br>\n   * Special issue in the Journal of Logical and Algebraic Methods in<br>\n     Programming (Elsevier) (to be confirmed)</p>\n<p>* Two invited speakers (to be confirmed)</p>\n<p>=== IMPORTANT DATES ===</p>\n<p>- March 27th, 2024           : Abstract submission deadline<br>\n   - April 3rd, 2024            : 1st paper submission deadline<br>\n   - April 12nd, 2024           : 2nd paper submission deadline (no abstract needed)<br>\n   - April 3rd -- May 1st, 2024 : Forum interaction, reviews, and PC discussion<br>\n   - May 8th, 2024              : Notification to authors<br>\n   - June 21st 2024             : Workshop in Groningen, The Netherlands<br>\n   - July 20th, 2024            : Camera-ready for post-proceedings<br>\n   - October, 2024 (tentative)  : Invitation to special issue</p>\n<p>All dates are in the anywhere on Earth time zone, and deadlines are firm.</p>\n<p>=== SCOPE ===</p>\n<p>The general scope of the workshop is interaction and concurrency,<br>\nbroadly construed. The workshop welcomes contributions spanning the<br>\nspectrum from theoretical models to practical implementations and<br>\nempirical studies. Topics of interest include (but are not limited<br>\nto):</p>\n<p>* Formal semantics<br>\n   * Process algebras and calculi<br>\n   * Models and languages<br>\n   * Protocols<br>\n   * Logics and types<br>\n   * Expressiveness<br>\n   * Model transformations<br>\n   * Tools, implementations, and experiments<br>\n   * Specification and verification<br>\n   * Coinductive techniques<br>\n   * Tools and techniques for automation<br>\n   * Synthesis techniques</p>\n<p>Prospective authors are welcome to contact the chairs for advice on<br>\nwhether their proposed submission is in scope.</p>\n<p>=== SELECTION PROCEDURE ===</p>\n<p>Since its first edition in 2008, the distinguishing feature of ICE has<br>\nbeen an innovative paper selection mechanism based on an interactive,<br>\nfriendly, and constructive discussion amongst authors and PC members<br>\nin an online forum.</p>\n<p>During the review phase, each submission is published in a dedicated<br>\ndiscussion forum. The discussion forum can be accessed by the authors<br>\nof the submission and by all PC members not in conflict with the<br>\nsubmission (the forum preserves anonymity). The forum is used by<br>\nreviewers to ask questions, clarifications, and modifications from the<br>\nauthors, allowing them better to explain and to improve all aspects of<br>\ntheir submission. The evaluation of the submission will take into<br>\naccount not only the reviews, but also the outcome of the discussion.</p>\n<p>As witnessed by the past editions of ICE, this procedure considerably<br>\nimproves the accuracy of the reviews, the fairness of the selection,<br>\nthe quality of camera-ready papers, and the discussion during the<br>\nworkshop.</p>\n<p>ICE adopts a light double-blind reviewing process, detailed below.</p>\n<p>This year, ICE implements a two-round paper submission procedure, <br>\nwith the understanding that all deadlines are now firm, and that <br>\npapers submitted during the second round will have less time for<br>\ndiscussion and feedback.</p>\n<p>=== SUBMISSION GUIDELINES ===</p>\n<p>Submissions must be made electronically in PDF format via hotcrp:</p>\n<p><a href=\"https://ice24.hotcrp.com/\">https://ice24.hotcrp.com/</a></p>\n<p>We invite two types of submissions:</p>\n<p>* Research papers: original contributions that will be published<br>\n     in the workshop post-proceedings. Research papers must not be<br>\n     simultaneously submitted to other conferences or workshops with<br>\n     refereed proceedings. Research papers should be 3-16 pages<br>\n     (references not included). Short research papers are<br>\n     welcome; for example a 5 page short paper fits this category<br>\n     perfectly. The submitted PDF can use any LaTeX style (but the<br>\n     post-proceedings will use the EPTCS style).</p>\n<p>* Oral communications: will be presented at the workshop, but will<br>\n     not appear in the post-proceedings. This type of contribution<br>\n     includes e.g. previously published contributions, preliminary<br>\n     work, and position papers. There is no strict page limit for<br>\n     this kind of submission but papers of 1-5 pages would be<br>\n     appreciated. For example, a one page summary of previously<br>\n     published work is welcome in this category.</p>\n<p>Authors of research papers must omit their names and institutions from<br>\nthe title page, they should refer to their other work in the third<br>\nperson and omit acknowledgements that could reveal their identity or<br>\naffiliation. The purpose is to avoid any bias based on authors’<br>\nidentity characteristics, such as gender, seniority, or nationality,<br>\nin the review process. Our goal is to facilitate an unbiased approach<br>\nto reviewing by supporting reviewers’ access to works that do not<br>\ncarry obvious references to the authors’ identities. As mentioned<br>\nabove, this is a lightweight double-blind process. Anonymization<br>\nshould not be a heavy burden for authors, and should not make papers<br>\nweaker or more difficult to review. Advertising the paper on alternate<br>\nforums (e.g., on a personal web-page, pre-print archive, email, talks,<br>\ndiscussions with colleagues) is permitted, and authors will not be<br>\npenalized by for such advertisement.</p>\n<p>Papers in the “Oral communications” category need not be<br>\nanonymized. For any questions concerning the double blind process,<br>\nfeel free to consult the ICEcreamers.</p>\n<p>We are keen to enhance the balanced, inclusive and diverse nature of<br>\nthe ICE community, and would particularly encourage female colleagues<br>\nand members of other underrepresented groups to submit their work.</p>\n<p>=== PUBLICATIONS ===</p>\n<p>Accepted research papers and communications must be presented at the<br>\nworkshop by one of the authors.</p>\n<p>Accepted research papers will be published after the workshop in<br>\nElectronic Proceedings in Theoretical Computer Science (to be confirmed).</p>\n<p>We plan to invite authors of selected papers and brief announcements<br>\nto submit their work in a special issue in the Journal of Logical and<br>\nAlgebraic Methods in Programming (Elsevier). Such contributions will<br>\nbe peer-reviewed according to the standard journal policy, but they<br>\nwill be handled in a shorter time than regular submissions. A list of<br>\npublished and in preparation special issues of previous ICE editions<br>\nis reported on the ICE website.</p>\n<p>=== ICECREAMERS (PC co-chairs) ===</p>\n<p>* Clément Aubert (Augusta University, USA) - <a href=\"mailto:aubert@math.cnrs.fr\">aubert@math.cnrs.fr</a><br>\n   * Cinzia Di Giusto (Université Côte d’Azur, CNRS, FR) - <a href=\"mailto:cinzia.di-giusto@unice.fr\">cinzia.di-giusto@unice.fr</a><br>\n   * Simon Fowler (University of Glasgow, GB-SCT) - <a href=\"mailto:simon.fowler@glasgow.ac.uk\">simon.fowler@glasgow.ac.uk</a><br>\n   * Violet Ka I Pun (Western Norway University of Applied Sciences, NO) - <a href=\"mailto:Violet.Ka.I.Pun@hvl.no\">Violet.Ka.I.Pun@hvl.no</a></p>\n<p>Use <a href=\"mailto:ice@framalistes.org\">ice@framalistes.org</a> to reach all the ICEcreamers at once.</p>\n<p>=== PROGRAM COMMITTEE ===</p>\n<p>* Matthew Alan Le Brun, University of Glasgow <br>\n   * Kirstin Peters, Augsburg University <br>\n   * Carla Ferreira, NOVA University Lisbon <br>\n   * Eva Graversen, University of Southern Denmark <br>\n   * Bas van den Heuvel, Karlsruhe University of Applied Sciences / University of Freiburg <br>\n   * Gerard Tabone, University of Malta <br>\n   * Ping Hou, University of Oxford <br>\n   * Sergueï Lenglet, Université de Lorraine - Université Sorbonne Paris-Nord <br>\n   * Emanuele D'Osualdo, Max Planck Institute for Software Systems <br>\n   * Seyed Hossein Haeri, IOG &amp; University of Bergen <br>\n   * Ivan Prokić, Faculty of Technical Sciences, University of Novi Sad <br>\n   * Luc Edixhoven, Open University of the Netherlands <br>\n   * Felix Stutz, Max Planck Institute for Software Systems<br>\n   * Lorenzo Gheri, University of Liverpool <br>\n   * Andreia Mordido, LASIGE, University of Lisbon </p>\n<p>=== STEERING COMMITTEE ===</p>\n<p>* Massimo Bartoletti (University of Cagliari, IT)<br>\n   * Ludovic Henrio (ENS Lyon, FR)<br>\n   * Sophia Knight (University of Minnesota Duluth, USA)<br>\n   * Ivan Lanese (University of Bologna, IT)<br>\n   * Alceste Scalas (Technical University of Denmark, DK)<br>\n   * Hugo Torres Vieira (Evidence Srl, IT)</p>\n<p>=== MORE INFORMATION ===</p>\n<p>For additional information, please contact the ICEcreamers at<br>\n<a href=\"mailto:ice@framalistes.org\">ice@framalistes.org</a><br>\nor visit<br>\n<a href=\"https://www.discotec.org/2024/ice\">https://www.discotec.org/2024/ice</a></p>",
        "id": 412807922,
        "sender_full_name": "Email Gateway",
        "timestamp": 1705232503
    }
]