[
    {
        "content": "<p>From: Alain Kägi &lt;<a href=\"mailto:cl-isabelle-users@lists.cam.ac.uk\">cl-isabelle-users@lists.cam.ac.uk</a>&gt;<br>\nIs it the expectation that each user install their own writable copy of the<br>\nArchive of Formal Proofs?</p>\n<p>I have installed AFP in a system-owned directory (<code>/opt</code>) retaining the<br>\noriginal file ownerships and permissions. Bottom line, I don't have write<br>\npermission to the AFP directory. Unfortunately, with this setup, building<br>\nAutoCorres2 fails with <code>permission denied</code> (command: <code>isabelle build -D\n&lt;path-to-AFP&gt;/AutoCorres2</code>). The <code>CTranslationSetup</code> theory wants to write<br>\n<code>$AFP/AutoCorres2/c-parser/StrictC.lex.sml</code> (command <code>mllex</code> on line 536)<br>\nand <code>$AFP/AutoCorres2/c-parser/StrictC.grm.sig</code> &amp;<br>\n<code>$AFP/AutoCorres2/c-parser/StrictC.grm.sml</code> (command <code>mlyacc</code> on line 537).</p>\n<p>I can grant write permissions to these files, but that does not seem an<br>\nideal solution.</p>\n<p>I'm using Isabelle2025 and afp-2025-07-24.</p>\n<p>Thanks for your attention,<br>\nAlain</p>",
        "id": 530982830,
        "sender_full_name": "Email Gateway",
        "timestamp": 1753553682
    },
    {
        "content": "<p>From: Gerwin Klein &lt;<a href=\"mailto:cl-isabelle-users@lists.cam.ac.uk\">cl-isabelle-users@lists.cam.ac.uk</a>&gt;<br>\nHi Alain,</p>\n<p>you only need write permission in AutoCorres2 to build these the first time (it’s just lex/yacc). Once they exist, everything should be read only. So you could build once, adjust access rights, and then should be Ok for a site installation of this specific entry.</p>\n<p>Most entries will be read-only, but the AFP in general does not place any restrictions on what entries might generate or write, so other entries might similar things. I’d recommend a per-user installation if you want to make sure you’re not hitting any such cases.</p>\n<p>Cheers,<br>\nGerwin</p>\n<p>On 27 Jul 2025, at 04:14, Alain Kägi (via cl-isabelle-users Mailing List) [cl-isabelle-users-bounces@lists.cam.ac.uk] &lt;<a href=\"mailto:forwarded_for@cse.unsw.edu.au\">forwarded_for@cse.unsw.edu.au</a>&gt; wrote:</p>\n<p>Is it the expectation that each user install their own writable copy of the Archive of Formal Proofs?</p>\n<p>I have installed AFP in a system-owned directory (<code>/opt</code>) retaining the original file ownerships and permissions. Bottom line, I don't have write permission to the AFP directory. Unfortunately, with this setup, building AutoCorres2 fails with <code>permission denied</code> (command: <code>isabelle build -D &lt;path-to-AFP&gt;/AutoCorres2</code>). The <code>CTranslationSetup</code> theory wants to write <code>$AFP/AutoCorres2/c-parser/StrictC.lex.sml</code> (command <code>mllex</code> on line 536) and <code>$AFP/AutoCorres2/c-parser/StrictC.grm.sig</code> &amp; <code>$AFP/AutoCorres2/c-parser/StrictC.grm.sml</code> (command <code>mlyacc</code> on line 537).</p>\n<p>I can grant write permissions to these files, but that does not seem an ideal solution.</p>\n<p>I'm using Isabelle2025 and afp-2025-07-24.</p>\n<p>Thanks for your attention,<br>\nAlain</p>\n<p>Confidential communication - This email and any files transmitted with it are confidential and are intended solely for the addressee. If you are not the intended recipient, please be advised that you have received this email in error and that any use, dissemination, forwarding, printing, or copying of this email and any file attachments is strictly prohibited. If you have received this email in error, please notify me immediately by return email and destroy this email.</p>",
        "id": 531227212,
        "sender_full_name": "Email Gateway",
        "timestamp": 1753656486
    }
]