[
    {
        "content": "<p>From: Andrei Popescu &lt;<a href=\"mailto:andrei.h.popescu@gmail.com\">andrei.h.popescu@gmail.com</a>&gt;<br>\nThe Department of Mathematics of Vrije Universiteit Amsterdam welcomes<br>\napplications for a fully-funded, 4-year PhD position in Number Theory<br>\nand Formalization.</p>\n<p>The preferred starting date is in the period 1 May - 1 September 2022.</p>\n<p>The candidate will conduct research on Sander Dahmen's NWO-funded<br>\nproject \"Formalizing Diophantine algorithms\". This amounts to both<br>\ndeveloping and formalizing (with a proof assistant such as Lean or<br>\nCoq) number theory necessary for solving Diophantine problems. The<br>\nfocus will be on effective/algorithmic number theory, but more \"pure\"<br>\nresults will (necessarily) also play an important role. We note that<br>\nin this project most of the time will likely be spent on actual<br>\nformalization work and that the proof assistant to be used will<br>\nprobably be Lean (but that is open for discussion). The position also<br>\ncontains a small teaching component.</p>\n<p>The research will be embedded in the Algebra and Number Theory group<br>\nof the Mathematics Department and in particular connects to the<br>\nCAN-endowed chair \"Automated verification of mathematical proof\" held<br>\nby Assia Mahboubi. Within the Faculty of Science there will also be<br>\nclose collaboration with (Theoretical) Computer Science, especially<br>\nthe group of Jasmin Blanchette.</p>\n<p>Applications from all groups currently under-represented in academic<br>\nposts are particularly encouraged. We are working to improve the<br>\npresent gender balance within the department, and particularly welcome<br>\napplications from women.</p>\n<p>More details at<br>\n<a href=\"https://workingat.vu.nl/ad/phd-position-number-theory-and-formalization/70lg5t\">https://workingat.vu.nl/ad/phd-position-number-theory-and-formalization/70lg5t</a></p>",
        "id": 274022614,
        "sender_full_name": "Email Gateway",
        "timestamp": 1646334494
    }
]