[
    {
        "content": "<p>From: Tobias Nipkow &lt;<a href=\"mailto:nipkow@in.tum.de\">nipkow@in.tum.de</a>&gt;<br>\nFirst-Order Rewriting<br>\nRené Thiemann, Christian Sternagel, Christina Kirk, Martin Avanzini, Bertram <br>\nFelgenhauer, Julian Nagele, Thomas Sternagel, Sarah Winkler and Akihisa Yamada</p>\n<p>This entry, derived from the Isabelle Formalization of Rewriting (IsaFoR), <br>\nprovides a formalized foundation for first-order term rewriting. This serves as <br>\nthe basis for the certifier CeTA, which is generated from IsaFoR and verifies <br>\ntermination, confluence, and complexity proofs for term rewrite systems (TRSs). <br>\nThis formalization covers fundamental results for term rewriting, as presented <br>\nin the foundational textbooks by Baader and Nipkow and TeReSe. These include:</p>\n<ul>\n<li>Various types of rewrite steps, such as root, ground, parallel, and multi-steps.</li>\n<li>Special cases of TRSs, such as linear and left-linear TRSs.</li>\n<li>A definition of critical pairs and key results, including the critical pair lemma.</li>\n<li>Orthogonality, notably that weak orthogonality implies confluence.</li>\n<li>Executable versions of relevant definitions, such as parallel and multi-step <br>\nrewriting.</li>\n</ul>\n<p><a href=\"https://www.isa-afp.org/entries/First_Order_Rewriting.html\">https://www.isa-afp.org/entries/First_Order_Rewriting.html</a></p>\n<p>Proof Terms for Term Rewriting<br>\nChristina Kirk</p>\n<p>Proof terms are first-order terms that represent reductions in term rewriting. <br>\nThey were initially introduced in TeReSe by van Oostrom and de Vrijer to study <br>\nequivalences of reductions in left-linear rewrite systems. This entry formalizes <br>\nproof terms for multi-steps in first-order term rewrite systems. We define <br>\nsimple proof terms (i.e., without a composition operator) and establish the <br>\ncorrespondence to multi-steps: each proof term represents a multi-step with the <br>\nsame source and target, and every multi-step can be expressed as a proof term. <br>\nThe formalization moreover includes operations on proof terms, such as <br>\nresiduals, join, and deletion and a method for labeling proof term sources to <br>\nidentify overlaps between two proof terms.<br>\nThis formalization is part of the Isabelle Formalization of Rewriting (IsaFoR) <br>\nand is an essential component of several formalized confluence and commutation <br>\nresults involving multi-steps.</p>\n<p><a href=\"https://www.isa-afp.org/entries/Proof_Terms_Term_Rewriting.html\">https://www.isa-afp.org/entries/Proof_Terms_Term_Rewriting.html</a></p>\n<p>Enjoy!</p>\n<p><a href=\"/user_uploads/14278/4yiLc9U-7YXC8Y9iMrYhLt-3/smime.p7s\">smime.p7s</a></p>",
        "id": 511937536,
        "sender_full_name": "Email Gateway",
        "timestamp": 1744574114
    }
]