[
    {
        "content": "<p>From: Ningning Xie &lt;<a href=\"mailto:xnningxie@gmail.com\">xnningxie@gmail.com</a>&gt;<br>\nACM SIGPLAN Programming Languages Mentoring Workshop (PLMW) at ICFP 24,<br>\nMilan, Italy</p>\n<p>Workshop: Monday, September 2, 2024<br>\nWebsite: <a href=\"https://icfp24.sigplan.org/home/PLMW-ICFP-2024\">https://icfp24.sigplan.org/home/PLMW-ICFP-2024</a></p>\n<p>PLMW is a workshop co-located with ICFP 2024 (the International Conference<br>\non Functional Programming) in Milan, Italy, from September 2-7.</p>\n<p>The purpose of this mentoring workshop is to encourage graduate students<br>\nand senior undergraduate students to pursue careers in programming language<br>\nresearch. This workshop will bring together world leaders in programming<br>\nlanguages research and teaching from academia and industry to help students<br>\nimagine how they might contribute to our research community. Topics will<br>\nrange from the abstract (e.g., what is PL research and how does one become<br>\ninvolved in it) to the concrete (e.g., how to navigate an academic<br>\nconference, how to pick a research area) as well as technical talks on<br>\ncutting-edge topics.</p>\n<p>We especially encourage women and underrepresented minority students, and<br>\npeople with disabilities to attend PLMW.</p>\n<p>This workshop is part of the activities surrounding ICFP, and takes place<br>\nthe day before the main conference. One goal of the workshop is to make the<br>\nICFP conference more accessible to newcomers. We hope that participants<br>\nwill stay through the entire conference.</p>\n<p>Note that ICFP and PLMW are planned to be largely in-person events. While<br>\nwe recognize that travel to conferences is not easy for everyone, we do<br>\nhope you will be able to join us in person to get the most out of the<br>\nconference and its community-building aspects.</p>\n<p>A number of sponsors have generously donated scholarship funds for<br>\nqualified students to attend PLMW. These scholarships can cover expenses<br>\n(airfare, hotel, and registration fees) for attendance at both the workshop<br>\nand the ICFP conference.</p>\n<p>Students attending this year will get one year free student membership of<br>\nSIGPLAN, unless they prefer to opt out during their application.</p>\n<p>The workshop registration is open to all. Students with alternative sources<br>\nof funding are welcome as well.</p>\n<p>—--------------------------------------------------------------</p>\n<p>APPLICATION FOR PLMW TRAVEL FUNDING</p>\n<p>For full consideration for scholarship funding, please apply at the link<br>\nbelow by June 21, AoE. We will notify accepted attendees in a rolling<br>\nfashion until all funding is committed.</p>\n<p>The application can be accessed at the following URL  (Apply by June 21,<br>\n2024 AOE for full consideration!):<br>\n<a href=\"https://forms.gle/vC6udnMWRvvAczPR6\">https://forms.gle/vC6udnMWRvvAczPR6</a></p>",
        "id": 440568899,
        "sender_full_name": "Email Gateway",
        "timestamp": 1716580373
    }
]