[
    {
        "content": "<p>From: Claude Marche &lt;<a href=\"mailto:Claude.Marche@inria.fr\">Claude.Marche@inria.fr</a>&gt;<br>\nHello to all,</p>\n<p>A temporary engineer position at Inria is available in the context of<br>\nthe ``Decysif'' collaborative project. The main topic of work is<br>\nthe formal verification of Rust programs using the Creusot environment.</p>\n<p>Do not hesitate to forward this announce to anybody possibly interested</p>\n<p>== The Decysif project ==</p>\n<p>Decysif (<a href=\"https://decysif.fr/\">https://decysif.fr/</a>) is a collaborative project joining the<br>\nToccata research team at Inria Saclay, the LMF laboratory of<br>\nUniversity Paris-Saclay, and the private companies AdaCore, OCamlPro<br>\nand TrustInSoft in Paris.  The general objective of Decysif is to<br>\napply formal verification techniques and tools to the development of<br>\nsoftware that is critical for safety and security.</p>\n<p>While the Decysif project targets programs written in Ada, C, C++ and<br>\nRust, the proposed engineer position is focused on the verification of<br>\nRust programs, and specifically using the Creusot environment<br>\n(<a href=\"https://github.com/xldenis/creusot\">https://github.com/xldenis/creusot</a>). In direct collaboration with the<br>\nWhy3 developers at Toccata and the research engineers at the<br>\nindustrial partners, the person recruited will have to work on the<br>\nmaturation of Creusot. Creusot is a prototype coming from a doctoral<br>\nthesis and must be improved to be able to be applied to industrial<br>\ncase studies. The objectives concern, among other things, the<br>\nextension of the supported Rust fragment, the need to complete<br>\nspecifications of Rust libraries, the improvement of the usability of<br>\nthe graphical user interface, the increase in the rate of proof<br>\nautomation, to set up methods to help proof (such as the generation of<br>\ncounterexamples in case of proof failure), to strengthen the<br>\nrobustness and reproducibility of proofs.</p>\n<p>== Expectations from the candidates ==</p>\n<p>We seek candidates with as much experience and skills as possible<br>\nin several domains including: development using the OCaml language;<br>\ndevelopment using the Rust language; techniques for evaluation,<br>\ncompilation and/or transformation of programs; formal methods for<br>\nsoftware engineering; formal logics; static analysis of programs;<br>\ncomputer-assisted theorem proving; use of formal proof environments.</p>\n<p>We expect some experience in the field of formal methods of software<br>\nengineering in a general sense. The typical candidate would be someone<br>\nwho recently defended a master's thesis or a PhD in a related domain.</p>\n<p>The research part of the job is significant, the work is expected<br>\nto lead to academic publications.  The development activities include<br>\na participation in the development of Why3, for which we are<br>\ninterested in candidates with experience in OCaml programming, or<br>\nsimilar functional programming languages, and in the practice of<br>\nshared development using git.</p>\n<p>Some skills in the use of a formal proof environment will be a plus.</p>\n<p>== How to apply</p>\n<p>The engineer position should be filled as soon as possible.</p>\n<p>The primary site for the position is</p>\n<p><a href=\"https://recrutement.inria.fr/public/classic/en/offres/2024-07180\">https://recrutement.inria.fr/public/classic/en/offres/2024-07180</a></p>\n<p>where you can apply with a CV and a motivation letter.</p>\n<p>Do not hesitate to contact us directly (<a href=\"mailto:Claude.Marche@inria.fr\">Claude.Marche@inria.fr</a>,<br>\n<a href=\"mailto:Jacques-Henri.Jourdan@cnrs.fr\">Jacques-Henri.Jourdan@cnrs.fr</a>) for more information on the position.</p>",
        "id": 423367974,
        "sender_full_name": "Email Gateway",
        "timestamp": 1708943921
    }
]