[
    {
        "content": "<p>From: Andrei Popescu &lt;<a href=\"mailto:andrei.h.popescu@gmail.com\">andrei.h.popescu@gmail.com</a>&gt;<br>\nCertified Programs and Proofs (CPP) is an international conference on<br>\npractical and theoretical topics in all areas that consider formal<br>\nverification and certification as an essential paradigm for their<br>\nwork. CPP spans areas of computer science, mathematics, logic, and<br>\neducation.</p>\n<p>CPP 2022 (<a href=\"https://popl22.sigplan.org/home/CPP-2022\">https://popl22.sigplan.org/home/CPP-2022</a>) will be held on<br>\n16-18 January 2022 and will be co-located with POPL 2022 in<br>\nPhiladelphia, Pennsylvania, United States. CPP 2022 is sponsored by<br>\nACM SIGPLAN, in cooperation with ACM SIGLOG.</p>\n<p>CPP 2022 will welcome contributions from all members of the community.<br>\nThe CPP 2022 organizers will strive to enable both in-person and<br>\nremote participation, in cooperation with the POPL 2022 organizers.</p>\n<p>IMPORTANT DATES</p>\n<ul>\n<li>Abstract Submission Deadline: 16 September 2021 at 23:59 AoE (UTC-12h)</li>\n<li>Paper Submission Deadline: 22 September 2021 at 23:59 AoE (UTC-12h)</li>\n<li>Notification (tentative): 22 November 2021</li>\n<li>Camera Ready Deadline (tentative): 12 December 2021</li>\n<li>Conference: 16-18 January 2022</li>\n</ul>\n<p>Deadlines expire at the end of the day, anywhere on earth. Abstract<br>\nand submission deadlines are strict and there will be no extensions.</p>\n<p>DISTINGUISHED PAPER AWARDS</p>\n<p>Around 10% of the accepted papers at CPP 2022 will be designated as<br>\nDistinguished Papers. This award highlights papers that the CPP<br>\nprogram committee thinks should be read by a broad audience due to<br>\ntheir relevance, originality, significance and clarity.</p>\n<p>TOPICS OF INTEREST</p>\n<p>We welcome submissions in research areas related to formal<br>\ncertification of programs and proofs. The following is a<br>\nnon-exhaustive list of topics of interest to CPP:</p>\n<ul>\n<li>\n<p>certified or certifying programming, compilation, linking, OS<br>\nkernels, runtime systems, security monitors, and hardware;</p>\n</li>\n<li>\n<p>certified mathematical libraries and mathematical theorems;</p>\n</li>\n<li>\n<p>proof assistants (e.g, ACL2, Agda, Coq, Dafny, F*, HOL4, HOL Light,<br>\nIdris, Isabelle, Lean, Mizar, Nuprl, PVS, etc);</p>\n</li>\n<li>\n<p>new languages and tools for certified programming;</p>\n</li>\n<li>program analysis, program verification, and program synthesis;</li>\n<li>program logics, type systems, and semantics for certified code;</li>\n<li>logics for certifying concurrent and distributed systems;</li>\n<li>\n<p>mechanized metatheory, formalized programming language semantics,<br>\nand logical frameworks;</p>\n</li>\n<li>\n<p>higher-order logics, dependent type theory, proof theory, logical<br>\nsystems, separation logics, and logics for security;</p>\n</li>\n<li>\n<p>verification of correctness and security properties;</p>\n</li>\n<li>formally verified blockchains and smart contracts;</li>\n<li>\n<p>certificates for decision procedures, including linear algebra,<br>\npolynomial systems, SAT, SMT, and unification in algebras of interest;</p>\n</li>\n<li>\n<p>certificates for semi-decision procedures, including equality,<br>\nfirst-order logic, and higher-order unification;</p>\n</li>\n<li>\n<p>certificates for program termination;</p>\n</li>\n<li>formal models of computation;</li>\n<li>mechanized (un)decidability and computational complexity proofs;</li>\n<li>formally certified methods for induction and coinduction;</li>\n<li>integration of interactive and automated provers;</li>\n<li>logical foundations of proof assistants;</li>\n<li>applications of AI and machine learning to formal certification;</li>\n<li>user interfaces for proof assistants and theorem provers;</li>\n<li>teaching mathematics and computer science with proof assistants.</li>\n</ul>\n<p>SUBMISSION GUIDELINES</p>\n<p>Prior to the paper submission deadline, the authors should upload<br>\ntheir anonymized paper in PDF format through the HotCRP system at</p>\n<p><a href=\"https://cpp2022.hotcrp.com\">https://cpp2022.hotcrp.com</a></p>\n<p>The submissions must be written in English and provide sufficient<br>\ndetail to allow the program committee to assess the merits of the<br>\ncontribution. They must be formatted following the ACM SIGPLAN<br>\nProceedings format using the acmart style with the sigplan option,<br>\nwhich provides a two-column style, using 10 point font for the main<br>\ntext, and a header for double blind review submission, i.e.,</p>\n<p>\\documentclass[sigplan,10pt,anonymous,review]{acmart}\\settopmatter{printfolios=true,printccs=false,printacmref=false}</p>\n<p>The submitted papers should not exceed 12 pages, including tables and<br>\nfigures, but excluding bibliography and clearly marked appendices. The<br>\npapers should be self-contained without the appendices. Shorter papers<br>\nare welcome and will be given equal consideration. Submissions not<br>\nconforming to the requirements concerning format and maximum length<br>\nmay be rejected without further consideration.</p>\n<p>CPP 2022 will employ a lightweight double-blind reviewing process. To<br>\nfacilitate this, the submissions must adhere to two rules:<br>\n(1) author names and institutions must be omitted, and<br>\n(2) references to authors’ own related work should be in the third<br>\nperson (e.g., not \"We build on our previous work ...\" but rather \"We<br>\nbuild on the work of ...\").</p>\n<p>The purpose of this process is to help the PC and external reviewers<br>\ncome to an initial judgment about the paper without bias, not to make<br>\nit impossible for them to discover the authors if they were to try.<br>\nNothing should be done in the name of anonymity that weakens the<br>\nsubmission or makes the job of reviewing it more difficult. In<br>\nparticular, important background references should not be omitted or<br>\nanonymized. In addition, authors are free to disseminate their ideas<br>\nor draft versions of their papers as usual. For example, authors may<br>\npost drafts of their papers on the web or give talks on their research<br>\nideas. POPL has answers to frequently asked questions addressing many<br>\ncommon concerns:<br>\n<a href=\"https://popl20.sigplan.org/track/POPL-2020-Research-Papers#Submission-and-Reviewing-FAQ\">https://popl20.sigplan.org/track/POPL-2020-Research-Papers#Submission-and-Reviewing-FAQ</a></p>\n<p>We strongly encourage the authors to provide any supplementary<br>\nmaterial that supports the claims made in the paper, such as proof<br>\nscripts or experimental data. This material must be uploaded at<br>\nsubmission time, as an archive, not via a URL. Two forms of<br>\nsupplementary material may be submitted:<br>\n(1) Anonymous supplementary material is made available to the<br>\nreviewers before they submit their first-draft reviews.<br>\n(2) Non-anonymous supplementary material is made available to the<br>\nreviewers after they have submitted their first-draft reviews and have<br>\nlearned the identity of the authors.</p>\n<p>Please use anonymous supplementary material whenever possible, so that<br>\nit can be taken into account from the beginning of the reviewing<br>\nprocess.</p>\n<p>The submitted papers must adhere to the SIGPLAN Republication Policy<br>\n(<a href=\"https://www.sigplan.org/Resources/Policies/Republication/\">https://www.sigplan.org/Resources/Policies/Republication/</a>) and the<br>\nACM Policy on Plagiarism<br>\n(<a href=\"https://www.acm.org/publications/policies/plagiarism\">https://www.acm.org/publications/policies/plagiarism</a>). Concurrent<br>\nsubmissions to other conferences, journals, workshops with<br>\nproceedings, or similar forums of publication are not allowed. The PC<br>\nchairs should be informed of closely related work submitted to a<br>\nconference or journal in advance of submission. One author of each<br>\naccepted paper is expected to present it at the (possibly virtual)<br>\nconference.</p>\n<p>PUBLICATION, COPYRIGHT AND OPEN ACCESS</p>\n<p>The CPP 2022 proceedings will be published by the ACM, and authors of<br>\naccepted papers will be required to choose one of the following<br>\npublication options:<br>\n(1) Author retains copyright of the work and grants ACM a<br>\nnon-exclusive permission-to-publish license and, optionally, licenses<br>\nthe work under a Creative Commons license.<br>\n(2) Author retains copyright of the work and grants ACM an exclusive<br>\npermission-to-publish license.<br>\n(3) Author transfers copyright of the work to ACM.</p>\n<p>For authors who can afford it, we recommend option (1), which will<br>\nmake the paper Gold Open Access, and also encourage such authors to<br>\nlicense their work under the CC-BY license. ACM will charge you an<br>\narticle processing fee for this option (currently, US$700), which you<br>\nhave to pay directly with the ACM.</p>\n<p>For everyone else, we recommend option (2), which is free and allows<br>\nyou to achieve Green Open Access, by uploading a preprint of your<br>\npaper to a repository that guarantees permanent archival such as arXiv<br>\nor HAL. This is anyway a good idea for timely dissemination even if<br>\nyou chose option 1. Ensuring timely dissemination is particularly<br>\nimportant for this edition, since, because of the very tight schedule,<br>\nthe official proceedings might not be available in time for CPP.</p>\n<p>The official CPP 2022 proceedings will also be available via SIGPLAN<br>\nOpenTOC (<a href=\"http://www.sigplan.org/OpenTOC/#cpp\">http://www.sigplan.org/OpenTOC/#cpp</a>).</p>\n<p>For ACM’s take on this, see their Copyright Policy<br>\n(<a href=\"http://www.acm.org/publications/policies/copyright-policy\">http://www.acm.org/publications/policies/copyright-policy</a>) and Author<br>\nRights (<a href=\"http://authors.acm.org/main.html\">http://authors.acm.org/main.html</a>).</p>\n<p>PROGRAM COMMITTEE</p>\n<p>Andrei Popescu, University of Sheffield, United Kingdom (co-chair)<br>\nSteve Zdancewic, University of Pennsylvania, United States (co-chair)<br>\nMohammad Abdulaziz, TU München, Germany<br>\nMauricio Ayala-Rincón, Universidade de Brasília, Brazil<br>\nAndrej Bauer, University of Ljubljana, Slovenia<br>\nThomas Bauereiss, University of Cambridge, United Kingdom<br>\nYves Bertot, Inria and Université Cote d'Azur, France<br>\nLars Birkedal, Aarhus University, Denmark<br>\nSylvie Boldo, Inria and Université Paris-Saclay, France<br>\nQinxiang Cao, Shanghai Jiao Tong University, China<br>\nÉvelyne Contejean, Laboratoire Méthodes Formelles, CNRS, France<br>\nBenjamin Delaware, Purdue University, United States<br>\nSimon Foster, University of York, United Kingdom<br>\nAlwyn Goodloe, NASA Langley Research Center, United States<br>\nArmaël Guéneau, Aarhus University, Denmark<br>\nJohn Harrison, Amazon Web Services, United States<br>\nJoe Hendrix, Galois, Inc, United States<br>\nAquinas Hobor, National University of Singapore, Singapore<br>\nRalf Jung, MPI-SWS, Germany<br>\nCezary Kaliszyk, University of Innsbruck, Austria<br>\nJeehoon Kang, KAIST, South Korea<br>\nHongjin Liang, Nanjing University, China<br>\nGregory Malecha, BedRock Systems, Inc, United States<br>\nAnders Mörtberg, Stockholm University, Sweden<br>\nToby Murray, University of Melbourne, Australia<br>\nZoe Paraskevopoulou , Northeastern University, United States<br>\nBrigitte Pientka, McGill University, Canada<br>\nAseem Rastogi, Microsoft Research, India<br>\nBas Spitters, Aarhus University, Denmark<br>\nKathrin Stark, Princeton University, United States<br>\nHira Taqdees Syeda, Chalmers University of Technology, Swede<br>\n[message truncated]</p>",
        "id": 242558843,
        "sender_full_name": "Email Gateway",
        "timestamp": 1623654108
    },
    {
        "content": "<p>From: Andrei Popescu &lt;<a href=\"mailto:andrei.h.popescu@gmail.com\">andrei.h.popescu@gmail.com</a>&gt;<br>\n<strong>* Call for Participation </strong>*<br>\n<strong>* Certified Programs and Proofs (CPP) 2022 </strong>*</p>\n<ul>\n<li>Early registration deadline: 3 January 2022</li>\n<li>Getting a visa: <a href=\"https://popl22.sigplan.org/attending/visa-information\">https://popl22.sigplan.org/attending/visa-information</a></li>\n<li>Registration: <a href=\"https://popl22.sigplan.org/attending/registration\">https://popl22.sigplan.org/attending/registration</a></li>\n<li>Further reduced student participation fee: see below</li>\n<li>Accommodation: <a href=\"https://popl22.sigplan.org/venue/POPL-2022-venue\">https://popl22.sigplan.org/venue/POPL-2022-venue</a></li>\n</ul>\n<p>Certified Programs and Proofs (CPP) is an international conference on<br>\npractical and theoretical topics in all areas that consider formal<br>\nverification and certification as an essential paradigm for their<br>\nwork. CPP spans areas of computer science, mathematics, logic, and<br>\neducation.</p>\n<p>CPP 2022 (<a href=\"https://popl22.sigplan.org/home/CPP-2022\">https://popl22.sigplan.org/home/CPP-2022</a>) will be held on<br>\n17-18 January 2022 and will be co-located with POPL 2022. CPP 2022 is<br>\nsponsored by ACM SIGPLAN, in cooperation with ACM SIGLOG, and<br>\nsupported by a diverse set of industrial sponsors.</p>\n<p>Similarly to other events collocated with POPL 2022, CPP will take<br>\nplace as an in-person event at the Westin Philadelphia (99 South 17th<br>\nStreet at Liberty Place, 19103 Philadelphia), and will require<br>\nattendees to provide proof of vaccination (details will be available<br>\nsoon). Authors who are unable to attend CPP in person will be able to<br>\npresent remotely. All talks will be recorded, and all recordings will<br>\nbe available either as a livestream or soon afterwards.</p>\n<p>For more information about this edition and the CPP series, please<br>\nvisit <a href=\"https://popl22.sigplan.org/home/CPP-2022\">https://popl22.sigplan.org/home/CPP-2022</a></p>\n<h3>Invited talks</h3>\n<ul>\n<li>\n<p>June Andronick (UNSW Sydney). The seL4 verification: the art and<br>\ncraft of proof and the reality of commercial support</p>\n</li>\n<li>\n<p>Andrew W. Appel (Princeton). Coq’s vibrant ecosystem for<br>\nverification engineering</p>\n</li>\n<li>\n<p>Cesar Munoz (Currently at AWS, Formerly at NASA, USA). Structural<br>\nEmbeddings Revisited</p>\n</li>\n</ul>\n<h3>Accepted papers</h3>\n<p>The list of accepted papers is available at<br>\n<a href=\"https://popl22.sigplan.org/home/CPP-2022#event-overview\">https://popl22.sigplan.org/home/CPP-2022#event-overview</a></p>\n<h3>Subsidized student registration</h3>\n<p>To facilitate in-person participation of undergraduate and graduate<br>\nstudents who require financial assistance, CPP 2022 offers the<br>\nopportunity to register at a special reduced rate, determined on a<br>\ncase-by-case basis, and implemented using a special-purpose<br>\nregistration code on POPL's registration website. Students wishing to<br>\napply for such support may do so by sending an email to the CPP conference<br>\nco-chairs (Beringer and Krebbers, see below for their email)<br>\npreferably by December 24, 2021, with a brief description of their<br>\nsituation. Notifications will be sent out at most one week later;<br>\nhence, students who cannot be supported will still have the<br>\nopportunity to register at the publicly available reduced rate, which<br>\nis available until January 3rd. Applications arriving after December<br>\n24th will be considered only in exceptional cases. Students who<br>\nalready receive registration support for PLMW or are supported by<br>\nSIGPLAN PAC are not eligible.</p>\n<p>CPP's student support is made possible by our generous industrial supporters:<br>\n<a href=\"https://popl22.sigplan.org/home/CPP-2022\">https://popl22.sigplan.org/home/CPP-2022</a></p>\n<h3>Contact</h3>\n<p>For any questions please contact the chairs:<br>\nAndrei Popescu &lt;<a href=\"mailto:a.popescu@sheffield.ac.uk\">a.popescu@sheffield.ac.uk</a>&gt; (PC co-chair)<br>\nSteve Zdancewic &lt;<a href=\"mailto:stevez@seas.upenn.edu\">stevez@seas.upenn.edu</a>&gt; (PC co-chair)<br>\nLennart Beringer &lt;<a href=\"mailto:eberinge@cs.princeton.edu\">eberinge@cs.princeton.edu</a>&gt; (conference co-chair)<br>\nRobbert Krebbers &lt;<a href=\"mailto:mail@robbertkrebbers.nl\">mail@robbertkrebbers.nl</a>&gt; (conference co-chair)</p>",
        "id": 264281157,
        "sender_full_name": "Email Gateway",
        "timestamp": 1639045601
    }
]