[
    {
        "content": "<p>From: Benedikt Ahrens &lt;<a href=\"mailto:benedikt.ahrens@gmail.com\">benedikt.ahrens@gmail.com</a>&gt;<br>\nDear All,</p>\n<p>A job opening for a \"Researcher (in) Formal Verification\" is being <br>\nadvertised at Hensoldt Cyber GmbH at the outskirts of Munich, Germany.</p>\n<p>If you would like to contribute to making software and hardware more <br>\nsecure, this job might be for you!</p>\n<p>The job ad (reproduced below), with information on how to apply, is <br>\nlocated at<br>\n<a href=\"https://hensoldt-cyber.com/job-offers/#job-549910\">https://hensoldt-cyber.com/job-offers/#job-549910</a>.</p>\n<p>The ad mentions an official contact email address. Additionally, please <br>\ndon't hesitate to get in touch with me with any informal inquiries.</p>\n<p>All the best,<br>\nBenedikt</p>\n<p>HENSOLDT Cyber develops embedded IT products that meet the highest <br>\nsecurity requirements. It integrates an invulnerable operating system <br>\nwith security-hardened hardware to build the most secure product on the <br>\nglobal IT market. The company combines more than 50 years of domain <br>\nexperience with world-class expertise in hardware and software design to <br>\nachieve global leadership.</p>\n<p>We are buidling up a new research team, which is working on cutting-edge <br>\nprojects targeting the aspects formal verification, operating system <br>\ndesign and cryptography with the focus on secure embedded systems. If <br>\nyou have a strong interest and/or background in secure operating system <br>\ndevelopment, we would like to get in touch with you.</p>\n<p>Tasks<br>\n=====</p>\n<ul>\n<li>\n<p>Research on formal verification of software, with a focus on deductive <br>\nverification</p>\n</li>\n<li>\n<p>Design new tools and methods to make verification possible in new <br>\nareas, or extend and improve existing tools to reduce verification effort</p>\n</li>\n<li>\n<p>Actively participate in international and national funded research and <br>\ncustomer projects</p>\n</li>\n<li>\n<p>Contribute to research communities and efforts, including publishing <br>\nin top conferences and relevant journals</p>\n</li>\n</ul>\n<p>Requirements<br>\n============</p>\n<ul>\n<li>PhD in Computer Science, Mathematics or other comparable subject</li>\n<li>Demonstrable experience in theorem proving (e.g. Coq, Isabelle, Agda)</li>\n<li>\n<p>Strong publication record and demonstrated research capability (e.g. <br>\nobtained grants, patent submissions, etc.)</p>\n</li>\n<li>\n<p>Prior experience in software verification is a plus</p>\n</li>\n<li>Experience in hardware verification is a plus</li>\n<li>Experience in cryptography is a plus</li>\n<li>Experience in C/C++ programming would be an advantage</li>\n<li>\n<p>Proficiency in English (both written and spoken) and interest to work <br>\nin a truly diverse cultural environment</p>\n</li>\n<li>\n<p>Excellent communication skills, teamwork spirit, initiative and <br>\nautonomous working are required</p>\n</li>\n</ul>\n<p>We are not only offering flexible and mobile working, but the <br>\nopportunity to be involved in the development of cutting-edge security <br>\nproducts in an international and innovative environment.</p>\n<p>Did we spark your interest? Then we are looking forward to your <br>\napplication. If you have any questions on the vacancy please don't <br>\nhesitate to contact us via mail (<a href=\"mailto:hr-cyber@hensoldt-cyber.com\">hr-cyber@hensoldt-cyber.com</a>).</p>",
        "id": 241514576,
        "sender_full_name": "Email Gateway",
        "timestamp": 1622801219
    }
]