[
    {
        "content": "<p>From: Gidon Ernst &lt;<a href=\"mailto:gidon.ernst@unimelb.edu.au\">gidon.ernst@unimelb.edu.au</a>&gt;<br>\nHi José,</p>\n<p>indeed, judging the solutions in those competitions was always a tremendous effort.<br>\nThe reason why at these events humans had to be involved in the judging was the diversity of tools and the fact that specifications were given in natural language.</p>\n<p>Your idea is quite different and very intriguing! I hope it will be realized eventually :)</p>\n<p>Best,<br>\n  Gidon</p>",
        "id": 294746695,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661193760
    },
    {
        "content": "<p>From: Dominique Unruh &lt;<a href=\"mailto:unruh@ut.ee\">unruh@ut.ee</a>&gt;<br>\nInstead of judging by proof by runtime (which does not seem like a very<br>\nuseful criterion) or by beauty (which needs big human effort), an option<br>\nwould be percentage of completion. By giving out several problems of<br>\ndiffering hardness one could make sure that basically no-one will get 100%<br>\nof the solutions. (And even for a given problem one might have different<br>\noptions. E.g., prove this for integers vs. for any ring. Or prove this with<br>\nthe following additional simplifying assumption vs. prove it without<br>\nassumption, etc.)</p>\n<p>Then checking can be automated. (And to look for cheaters, it will not be<br>\nenough to manually scan the source for for \"sorry\". Instead, the only<br>\nreliable way as far as I know is to extract the proof term and replay it in<br>\na separate instance of Isabelle. But the infrastructure for that is mostly<br>\nthere, so it's mainly a question of filling in some \"plumbing\".)</p>\n<p>Best wishes,<br>\nDominique.</p>",
        "id": 294746712,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661193771
    },
    {
        "content": "<p>From: Simon Wimmer &lt;<a href=\"mailto:wimmersimon@gmail.com\">wimmersimon@gmail.com</a>&gt;<br>\nDear all,</p>\n<p>currently we use the following scheme. Each sub-task is worth a certain<br>\nnumber of points. We first rank by highest total score, and then lowest sum<br>\nof submission time stamps to break the ties.</p>\n<p>Simon</p>",
        "id": 294746723,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661193777
    },
    {
        "content": "<p>From: mailing-list anonymous &lt;<a href=\"mailto:mailing.list.anonymous@gmail.com\">mailing.list.anonymous@gmail.com</a>&gt;<br>\nDear All,</p>\n<p>I would like to make several comments with regard to the proposal by José<br>\nManuel Rodriguez Caballero (as someone who participated in olympiads while<br>\nstudying at secondary school).</p>\n<p>Of course, the olympiads in informatics can hardly be described as<br>\nolympiads that test the participants on their knowledge of the syntax of a<br>\nparticular programming language. The main challenge is the design of<br>\nalgorithms and not their implementation. The participants are allowed to<br>\nselect a programming language. While the choice is relatively narrow (C++,<br>\nPascal and Java), they seem to be working on expanding this choice (until<br>\nrecently the participants were allowed to use only C, C++ and Pascal).</p>\n<p>While Isabelle is one of the most popular proof assistants, it is not the<br>\nonly available proof assistant. I believe that Coq is equivalently popular<br>\nand has nearly identical functionality (for example, there are more<br>\nquestions about Coq on Stack Overflow than about Isabelle). Of course,<br>\nthere are other well-known systems for proof verification.</p>\n<p>Personally, I prefer Isabelle and I would like to see it succeed. However,<br>\nif one was to organise an international olympiad that allows its<br>\nparticipants to use Isabelle, in my opinion, it would need to be an<br>\nolympiad in the proof verification/logic/formal methods and not an olympiad<br>\n\"in Isabelle\". From the start, it should allow the participants to use<br>\neither Isabelle or Coq. Also, of course, the tasks should reflect that the<br>\nparticipants are being tested on their knowledge of the methods that are<br>\ncommonly used for the formalisation of mathematics or formal proof of<br>\ncomputer programs and not the knowledge of the 'advanced features' of a<br>\ngiven proof assistant. Thus, the organisers would have to carefully select<br>\nthe subsets of the standard libraries that one is allowed to use during the<br>\nolympiad.</p>\n<p>Also, personally, in my view, participation over the internet should not be<br>\nallowed, because it favours cheating. Being able to claim that one has a<br>\nprize in an olympiad in formal verification would provide an enormous<br>\ncompetitive advantage when one is applying to universities (and beyond).<br>\nThus, cheating must be eliminated at all costs. It may be best (for the<br>\nsake of humanity) not to organise such an olympiad at all, rather than<br>\nallowing the participation over the internet. Also, of course, there should<br>\nbe different olympiads for secondary school students and undergraduate<br>\nstudents.</p>\n<p>Thank you</p>",
        "id": 294746741,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661193783
    },
    {
        "content": "<p>From: Simon Wimmer &lt;<a href=\"mailto:wimmersimon@gmail.com\">wimmersimon@gmail.com</a>&gt;<br>\nDear all,</p>\n<p>for our system, we foresee to also get other theorem provers on board.<br>\nFor each theorem prover, one needs to find a volunteer who is willing to<br>\nimplement a prover backend,<br>\nand who is willing to formulate the tasks for the theorem prover.</p>\n<p>As for most programming competitions, our main goal is to spark motivation.<br>\nFor this purpose, in my opinion, the<br>\nonly way is to host the competition online, as only then everyone has the<br>\npossibility to participate.</p>\n<p>I agree that if you want to hand out an important prize, you will always<br>\nneed to make sure that<br>\nthe person you give the prize to will be the one who actually solved the<br>\nproblems. However,<br>\nI believe this is already ten steps ahead of where we stand now.</p>\n<p>Simon</p>",
        "id": 294746763,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661193794
    },
    {
        "content": "<p>From: José Manuel Rodriguez Caballero &lt;<a href=\"mailto:josephcmac@gmail.com\">josephcmac@gmail.com</a>&gt;<br>\nJust to point out that Contests using Isabelle do not need to be restricted<br>\nto mathematics: they can be about any subject, e.g, chemistry, physics,<br>\nbiology, and even philosophy. The only requirement is to use axioms. The<br>\nfact that the solutions can be automatically checked allow massive<br>\nparticipation from several countries via email. Internet is a new paradigm<br>\nfor Contests.</p>\n<p>A similar massive educational-scientific project are the games about<br>\nquantum mechanics, in order to develop the quantum intuition in people<br>\nwhich are not quantum physicists :<br>\n<a href=\"https://www.youtube.com/watch?v=vkVnnN0MjIE\">https://www.youtube.com/watch?v=vkVnnN0MjIE</a></p>\n<div class=\"youtube-video message_inline_image\"><a data-id=\"vkVnnN0MjIE\" href=\"https://www.youtube.com/watch?v=vkVnnN0MjIE\"><img src=\"https://uploads.zulipusercontent.net/023cd0b8a89ca7712806651f3573c9c90c191b07/68747470733a2f2f692e7974696d672e636f6d2f76692f766b566e6e4e304d6a49452f64656661756c742e6a7067\"></a></div><p>José M.</p>",
        "id": 294746764,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661193795
    },
    {
        "content": "<p>From: José Manuel Rodriguez Caballero &lt;<a href=\"mailto:josephcmac@gmail.com\">josephcmac@gmail.com</a>&gt;<br>\nHi Gidon,</p>\n<p>Interesting Proving Contests in your links, thank you ! Nevertheless, I<br>\ntook a look at the Geographical distribution of the participants (page 3 in<br>\nthe following link):<br>\n<a href=\"http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.362.2877&amp;rep=rep1&amp;type=pdf\">http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.362.2877&amp;rep=rep1&amp;type=pdf</a></p>\n<p>I think that it is important to open a competition for millions of<br>\nparticipants at the same time, including participants from less<br>\neconomically developed countries. This is the reason why I suggested a<br>\nsoftware in order to do the ordering of the solutions in virtue of the<br>\nrunning time: human cannot handle such a huge data.</p>\n<p>In the same way that alphabetization was extended from an elite to the<br>\nwhole world, proof assistants are a second alphabetization that the world<br>\nneed in order to get update: <a href=\"https://www.youtube.com/watch?v=7Pq-S557XQU\">https://www.youtube.com/watch?v=7Pq-S557XQU</a></p>\n<div class=\"youtube-video message_inline_image\"><a data-id=\"7Pq-S557XQU\" href=\"https://www.youtube.com/watch?v=7Pq-S557XQU\"><img src=\"https://uploads.zulipusercontent.net/19be74c52dab1603aa725aa3af2c98d5b037813a/68747470733a2f2f692e7974696d672e636f6d2f76692f3750712d533535375851552f64656661756c742e6a7067\"></a></div><p>Kind Regards,<br>\nJosé Manuel Rodriguez Caballero</p>\n<p>El mar., 6 nov. 2018 a las 21:26, Gidon Ernst (&lt;<a href=\"mailto:gidon.ernst@unimelb.edu.au\">gidon.ernst@unimelb.edu.au</a>&gt;)<br>\nescribió:</p>",
        "id": 294747607,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661194155
    },
    {
        "content": "<p>From: Peter Lammich &lt;<a href=\"mailto:lammich@in.tum.de\">lammich@in.tum.de</a>&gt;<br>\nHi Jose  </p>\n<p>Considering ranking of the solutions by running time: I am not convinced that<br>\nthis is a good measure for ranking formal proofs ... it's indeed a practical<br>\none that is simple to automate, but it surely does not discriminate good from<br>\nbad proofs ... I even fear that optimizing a proof for running time may make<br>\nit harder to read and less elegant. Are there other criteria to rank proofs<br>\nthat can be checked automatically? Size of the thy file isn't a good one, too,<br>\nI fear.  </p>\n<p>Peter</p>",
        "id": 294747614,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661194158
    },
    {
        "content": "<p>From: Gidon Ernst &lt;<a href=\"mailto:gidon.ernst@unimelb.edu.au\">gidon.ernst@unimelb.edu.au</a>&gt;<br>\nHi all,<br>\ntwo similar competitions come to mind:</p>\n<p>1st and 2nd VSComp, see<br>\nThe 1st verified software competition: Experience report, FM2011<br>\nThe 2nd verified software competition: Experience report, COMPARE 2012</p>\n<p>VerifyThis (yearly at ETAPS)<br>\n<a href=\"http://www.pm.inf.ethz.ch/research/verifythis.html\">http://www.pm.inf.ethz.ch/research/verifythis.html</a><br>\nThis year, the Isabelle Team from TUM took the gold medal :)<br>\nHuisman, Klebanov, Monahan: On the organisation of program verification competitions, COMPARE 2012<br>\nthe yearly competition reports, and the STTT 17(6) special issue: <a href=\"https://link.springer.com/journal/10009/17/6/page/1\">https://link.springer.com/journal/10009/17/6/page/1</a></p>\n<p>Hope you find this information useful :)</p>\n<p>Best,<br>\n  Gidon</p>\n<p>Nice project. My idea of an International Olympiad in Isabelle are a little<br>\nbit different. Indeed, I can summarize my vision as follows:</p>\n<p>1) There will be some publicity about the International Olympiad some<br>\nmonths before its date. The publicity should be mainly addressed to<br>\nundergraduate and high school students. People interested in the Olympiad<br>\nshould summit their email addresses in a website. People working with<br>\nIsabelle in an official research project, e.g., a Master, a PhD, a<br>\nprofessor or a professional programmer, are not allowed to apply in order<br>\nto guarantee more space for beginners.</p>\n<p>2) The day of the Olympiad, a thy-file with a theorem followed by sorry<br>\nwill be sent to each one of the email addresses.</p>\n<p>3) People can submit their solutions until 6 hours after their received the<br>\nemail  with the problem (5 hours to solve the problem and 1 hour to make a<br>\nbreak, I guess). Solutions sent after the deadline will be automatically<br>\nignored.</p>\n<p>4) An automatic system (software) will discriminate the invalid solutions,<br>\ne.g., using sorry somewhere, from the valid solutions. After that, it will<br>\nmake an ordering according to the running time of each valid solution.</p>\n<p>5) Finally, an email with the ranking of his/her solution will be<br>\nautomatically sent to each participant. The participants having ranking 1,<br>\n2, 3 will receive a prize.</p>\n<p>When I think about such an international project, I am mainly concerned<br>\nwith people living in economically less developed countries. The idea is<br>\nthat a person from such countries, having the dream of winning an<br>\nInternational Olympiad in Isabelle will have a motivation to improve<br>\nhimself/herself in this field. Of course, classification by countries<br>\nshould be avoided and people from highly developed countries should be<br>\nallowed to participate as well.</p>\n<p>This is just a dream, I have not enough free time to do something about it.<br>\nMy inspiration are the IOI: <a href=\"https://ioinformatics.org/\">https://ioinformatics.org/</a></p>\n<p>Kind Regards,<br>\nJosé M.</p>",
        "id": 294747630,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661194168
    }
]