[
    {
        "content": "<p>From: Talia Ringer &lt;<a href=\"mailto:tringer@cs.washington.edu\">tringer@cs.washington.edu</a>&gt;<br>\nIn the United States, the most recent murders of Black people at the hands<br>\nof police have prompted international protest that has itself been met with<br>\nfurther police brutality—the latest manifestation of a centuries-old<br>\nhistory of violence and oppression. We in the global programming languages<br>\ncommunity acknowledge that every institution in our society is built on a<br>\nfoundation of white supremacy—and our academic systems and research<br>\nindustry are no exception. We have the strongest moral imperative to act<br>\nnot just in this particular moment of political turmoil and uncertainty,<br>\nbut in lasting, sustainable ways to permanently transform our institutions<br>\nagainst the systemic racism from which they benefit and which they<br>\nperpetuate.<br>\nJoin Us: Register Here &lt;<a href=\"https://shutdown-pl.com/\">https://shutdown-pl.com/</a>&gt;</p>\n<p>On this <em>Wednesday, June 10, 10:00 am - 3:00 pm PDT</em>, we join in the<br>\nmovement to #ShutdownSTEM &lt;<a href=\"https://www.shutdownstem.com/\">https://www.shutdownstem.com/</a>&gt; for a global<br>\n#Strike4BlackLives &lt;<a href=\"https://twitter.com/hashtag/Strike4BlackLives\">https://twitter.com/hashtag/Strike4BlackLives</a>&gt;. We call<br>\non anyone in the global programming languages community to come listen,<br>\nwork, and plan to actively reject racism from the systems we create and the<br>\nsystems within which we exist. We know that one day of action is not<br>\nenough: our goal is to both achieve small immediate change, and to<br>\nfacilitate the planning of broader systemic change across the world of<br>\nprogramming languages research.</p>\n<p>We will be holding a virtual day of conversation and focused group action.<br>\nWe encourage you to attend for all or most of the day, but we will be happy<br>\nto welcome you if you can only be there some of the time. Our schedule<br>\n(subject to change at the desire of participants):</p>\n<p>10:00 - 10:30 PDT: Introduction, opening, setting intentions<br>\n10:45 - 12:00 PDT: Break into smaller self-determined groups<br>\n12:30 -  1:00 PDT: Progress check-in, discussion<br>\n1:15  -  2:30 PDT: Second round of focused small group work<br>\n2:30  -  3:00 PDT: Closing discussion</p>\n<p>We want to note: both of the organizers of #ShutdownPL (Talia and Kenny)<br>\nare white, and we do not want to demand labor of Black voices on a day that<br>\nis focused on sustainable allyship. However, the last thing we want is a<br>\nday of non-Black researchers speaking for and taking actions on the behalf<br>\nof Black researchers without their input. Accordingly, we will ensure all<br>\nour commitments to act begin from a place of listening to the Black<br>\ncommunity within and beyond programming languages research.</p>\n<p>Looking forward to seeing you there,</p>\n<p>Kenny Foner &lt;<a href=\"https://very.science/\">https://very.science/</a>&gt;, Talia Ringer<br>\n&lt;<a href=\"https://tlringer.github.io/\">https://tlringer.github.io/</a>&gt;, et. al.</p>",
        "id": 294829646,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661246025
    }
]