[
    {
        "content": "<p>From: Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt;<br>\nOn 06/02/17 00:38, Alexander Hicks wrote:</p>\n<blockquote>\n<p>Attached is a short guide intended to introduce Isabelle to mathematicians<br>\nor more generally people with a mathematical rather than computer science<br>\nbackground.</p>\n</blockquote>\n<p>I always find it interesting to see how mathematicians understand our<br>\nproof system. It definitely influences its future evolution.</p>\n<blockquote>\n<p>I think we would also both be fine with someone building on top of this<br>\nif they wish, we still have the tex file.</p>\n</blockquote>\n<p>Just looking at the PDF it was obvious to me that this is an informal<br>\n(La)TeX document, the way how mathematicians like to do it.</p>\n<p>Did you know that Isabelle is first and foremost a formal document<br>\npreparation system, with LaTeX merely as backend for low-level<br>\ntypesetting? See the explanation of \"isabelle mkroot -d\" in the \"system\"<br>\nmanual.</p>\n<p>Using Isabelle sources for a document like yours makes it easy to quote<br>\nformal pieces. either checked or unchecked (e.g. via the @{text} and<br>\n@{theory_text} antiquotations). It also makes it easier to keep the<br>\ndocument up-to-date wrt. inevitable changes of Isabelle.</p>\n<p>Makarius</p>",
        "id": 294705388,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661180475
    },
    {
        "content": "<p>From: Alexander Hicks &lt;<a href=\"mailto:alexanderlhicks@gmail.com\">alexanderlhicks@gmail.com</a>&gt;<br>\nHello everyone,</p>\n<p>Attached is a short guide intended to introduce Isabelle to mathematicians<br>\nor more generally people with a mathematical rather than computer science<br>\nbackground. The guide was written by myself (Alexander Hicks) and José<br>\nSiqueira (CC'd). Both of us completed an MASt in Mathematics at Cambridge<br>\nand worked with Isabelle over the summer at the Cambridge Computer<br>\nLaboratory. We decided to write this guide as the existing content we found<br>\nwas mostly written by and geared towards computer scientists.<br>\nI've attached a pdf copy of the guide, I've also uploaded it to a github<br>\npage: <a href=\"https://github.com/alexanderlhicks/IsabelleGuide\">https://github.com/alexanderlhicks/IsabelleGuide</a> so there is a<br>\npermanent link to it. Feel free to host it and distribute it as you like.<br>\nHopefully so of you will find it useful or interesting.<br>\nNote that neither José or I are currently (or will be in the near future)<br>\ndoing work related to Isabelle so there are no current plans to keep this<br>\nupdated with new Isabelle releases and so on. If you find mistakes or have<br>\ncomments, we will both be happy to amend the current version as time allows<br>\n(so it could take a while). I think we would also both be fine with someone<br>\nbuilding on top of this if they wish, we still have the tex file.</p>\n<p>Cheers,<br>\nAlex<br>\n<a href=\"/user_uploads/14278/v89NDdI8zX71HtHSFQco4PS6/Isabelle_Guide.pdf\">Isabelle_Guide.pdf</a></p>",
        "id": 294706276,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661180730
    }
]