[
    {
        "content": "<p>From: Walther Neuper &lt;<a href=\"mailto:wneuper@ist.tugraz.at\">wneuper@ist.tugraz.at</a>&gt;<br>\ndeadline 1st May, 2013</p>\n<hr>\n<p>LAST CALL FOR ABSTRACTS</p>\n<hr>\n<p>Proving in Mathematics Education<br>\n                      at University and at School<br>\n                  ====================================<br>\n                      Minisymposion at CSASC 2013<br>\n                             9-13 June 2013<br>\n                            Koper,  Slovenia<br>\n<a href=\"http://conferences2.imfm.si/conferenceDisplay.py?ovw=True&amp;confId=14\">http://conferences2.imfm.si/conferenceDisplay.py?ovw=True&amp;confId=14</a></p>\n<hr>\n<p>Computer Theorem Proving (TP) is reliably grounded on formal calculus<br>\n— whereas proof is not taught as a formal calculus in general academic<br>\neducation. Rather, students adopt the habits of their academic<br>\nenvironment and copy the way of proving from their academic teachers.<br>\nEvidently this results in a lack of confidence for most students and<br>\nin a lack of control of what they are doing. High-school seems<br>\naffected by these academic traditions such, that proof is considered<br>\ntoo comprehensive for most students in spite of curricula containing<br>\nmathematical proof.</p>\n<p>The Minisymposion presents experiences from courses supported by TP<br>\ntechnology at academia and at high-school throughout Europe. A major<br>\npoint of discussion will be the issue to narrow the gap between<br>\nhigh-school math and academic math in Science, Technology and<br>\nEngineering education. In particular, the (planned/envisioned) use of<br>\nexisting TP software systems in an educational setting or concrete<br>\nplans for (future/desired) educational TP software systems should be<br>\ndemonstrated with the aim to get a common view on the requirements for<br>\nsuch systems that would make them widely accepted teaching tools.</p>\n<p>This minisymposion is motivated by the hope that bottom-up approaches<br>\nin local cooperation might be more successful than pretentious<br>\ntop-down approaches to the sensible, but important topic. For<br>\npreparing discussions we invite submission of abstracts (up to 500<br>\nwords \\approx 1 page) on topics including, but not limited to:</p>\n<ul>\n<li>\n<p>Demonstration of tools supporting proofs and using TP technology,<br>\n   i.e. tools which generate assumptions, which interactively or<br>\n   automatically perform proofs, which systematically generate proof<br>\n   obligations, which use TP for checking user input, etc.<br>\n   (... called \"TP-based\" software in the sequel)</p>\n</li>\n<li>\n<p>Experiences from academic courses of various kinds using TP-based<br>\n   software --- probably including feature requests for future<br>\n   development of such software</p>\n</li>\n<li>\n<p>Applications of mathematics and mathematical activities which might<br>\n   specifically take advantage from support by TP-based software</p>\n</li>\n<li>\n<p>Mathematical concepts and (TP-based) technology specifically<br>\n   relevant for software support for teaching and learning to prove</p>\n</li>\n<li>\n<p>Experiences from initiatives and activities filling the gap between<br>\n   school and university --- and their relation to TP-based technology.</p>\n</li>\n</ul>\n<p>Important Dates:</p>\n<hr>\n<p>1st May, 2013:      deadline for abstract submission<br>\n            (via CSASC registration system)<br>\n9th - 13th June, 2013:  conference in Koper</p>\n<p>Program Committee</p>\n<hr>\n<p>Roman Hašek, University of South Bohemia<br>\nZlatan Magajna, University of Ljubljana<br>\nWalther Neuper, Graz University of Technology<br>\nPavel Pech, University of South Bohemia<br>\nJordi Saludes, University Polytechnica of Catalonia<br>\nDušan Vallo, University of Nitra, Slovakia<br>\nWolfgang Windsteiger, University of Linz</p>",
        "id": 294240439,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660906743
    }
]