[
    {
        "content": "<p>From: Tobias Nipkow &lt;<a href=\"mailto:nipkow@in.tum.de\">nipkow@in.tum.de</a>&gt;<br>\nThere are two nicely modular new entries by Christian Sternagel and René<br>\nThiemann from Innsbruck:</p>\n<p>Abstract Rewriting</p>\n<p>We present an Isabelle formalization of abstract rewriting (see, e.g.,<br>\nthe book by Baader and Nipkow). First, we define standard relations like<br>\njoinability, meetability, conversion, etc. Then, we formalize important<br>\nproperties of abstract rewrite systems, e.g., confluence and strong<br>\nnormalization. Our main concern is on strong normalization, since this<br>\nformalization is the basis of CeTA (which is mainly about strong<br>\nnormalization of term rewrite systems). Hence lemmas involving strong<br>\nnormalization constitute by far the biggest part of this theory. One of<br>\nthose is Newman's lemma.<br>\n<a href=\"http://afp.sourceforge.net/entries/Abstract-Rewriting.shtml\">http://afp.sourceforge.net/entries/Abstract-Rewriting.shtml</a></p>\n<p>Executable Matrix Operations on Matrices of Arbitrary Dimensions</p>\n<p>We provide the operations of matrix addition, multiplication,<br>\ntransposition, and matrix comparisons as executable functions over<br>\nordered semirings. Moreover, it is proven that strongly normalizing<br>\n(monotone) orders can be lifted to strongly normalizing (monotone)<br>\norders over matrices. We further show that the standard semirings over<br>\nthe naturals, integers, and rationals, as well as the arctic semirings<br>\nsatisfy the axioms that are required by our matrix theory. Our<br>\nformalization is part of the CeTA system which contains several<br>\ntermination techniques. The provided theories have been essential to<br>\nformalize matrix-interpretations and arctic interpretations.<br>\n<a href=\"http://afp.sourceforge.net/entries/Matrix.shtml\">http://afp.sourceforge.net/entries/Matrix.shtml</a></p>\n<p>Enjoy!</p>",
        "id": 294110544,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660836681
    }
]