[
    {
        "content": "<p>From: Jasmin Blanchette &lt;<a href=\"mailto:jasmin.blanchette@inria.fr\">jasmin.blanchette@inria.fr</a>&gt;</p>\n<hr>\n<p>ADG 2018 <br>\n12th International Conference on Automated Deduction in Geometry<br>\n        Nanning, China, September 11-14, 2018<br>\n<a href=\"http://adg2018.cc4cm.org/\">http://adg2018.cc4cm.org/</a> </p>\n<p>In Memory of Wen-tsün Wu</p>\n<hr>\n<p>CALL FOR PAPERS：ADG 2018</p>\n<p>About ADG<br>\n=========<br>\n ADG is a forum dedicated to the exchange of ideas and views, to the <br>\n presentation of research results and progress, and to the demonstration <br>\n of software tools on the intersection between geometry, computation, <br>\n and automated reasoning. ADG organizes a workshop every two years. <br>\n The previous editions were held in Strasbourg (France) 2016, Coimbra <br>\n (Portugal) 2014, Edinburgh (UK) 2012, Munich (Germany) 2010, Shanghai <br>\n (China) 2008, Pontevedra (Spain) 2006, Gainesville (USA) 2004, Linz <br>\n (Austria) 2002, Zurich (Switzerland) 2000, Beijing (China) 1998, and <br>\n Toulouse (France) 1996.</p>\n<p>The twelfth conference ADG 2018 will take place in Nanning, China, from<br>\n September 11 to September 14, 2018, in memory of Wen-tsün Wu, founder <br>\n of the Chinese school of mathematics mechanization. </p>\n<p>Aim and Scope <br>\n============= <br>\n ADG 2018 aims at gathering researchers, engineers, and others interested<br>\n in exploring methods for automated reasoning and symbolic computation in <br>\n geometry, to discuss theoretical and practical challenges, and to present <br>\n recent research progress and results dedicated (not exhausted) in </p>\n<p>- polynomial algebra, invariant and coordinate-free methods, probabilistic, <br>\n    synthetic, and logic approaches, techniques for automated geometric <br>\n    reasoning from discrete mathematics, combinatorics, and numerics;</p>\n<p>- symbolic and numeric methods for geometric computation, geometric constraint <br>\n    solving, automated generation/reasoning and manipulation with diagrams;</p>\n<p>- design and implementation of geometry software, special-purpose tools, <br>\n    automated theorem provers, experimental studies;</p>\n<p>- applications of ADG to mechanics, geometric modeling, CAGD/CAD, computer <br>\n    vision, robotics, and education.</p>\n<p>Important Dates <br>\n=============== </p>\n<p>- Deadline for extended abstract/full paper submission    May 25, 2018 <br>\n  - Notification on all papers                    July 15, 2018 <br>\n  - Camera-ready submission                    July 31, 2018 <br>\n  - Early registration deadline                    August 1, 2018 <br>\n  - Conference taking place                    September 11-14, 2018 </p>\n<p>Submission Guideline <br>\n====================<br>\n Original research papers in English, including experimental work and <br>\n work in progress, are welcome. The following two types of submissions<br>\n are invited:</p>\n<p>(1) Full paper: maximum 20 pages<br>\n (2) Extended abstract addressing the following aspects explicitly:</p>\n<p>- Problem: what is the problem/question/objective?<br>\n     - Motivation: why do we work on the problem and what is the importance?<br>\n     - State of the art: what has been done already on the problem?<br>\n     - Contribution: what is the main original contribution?<br>\n     - Main idea: what is the main idea underlying the contribution?</p>\n<p>Submissions should follow the standard Springer LNCS Proceedings format. <br>\n Electronic submission as PDF is required via EasyChair at </p>\n<p><a href=\"http://www.easychair.org/conferences/?conf=adg2018\">http://www.easychair.org/conferences/?conf=adg2018</a>. </p>\n<p>If you have any problem with the submission of your paper, or questions <br>\n concerning ADG 2018 or EasyChair, please contact <a href=\"mailto:chenxiaoyu@buaa.edu.cn\">chenxiaoyu@buaa.edu.cn</a>. <br>\n At least one author of each accepted submission must register at ADG 2018. </p>\n<p>Refereeing and Publication<br>\n==========================<br>\n The submitted contributions will be subject to a summary review by the Program <br>\n Committee, bearing in mind that this first review is mainly for presentation, <br>\n NOT for publication. Digital publication of the full papers/extended abstracts<br>\n accepted for presentation will be available at the conference. The authors of the <br>\n full papers/extended abstracts accepted for presentation at the conference will be <br>\n invited to submit their full and/or revised papers for publication in a formal <br>\n proceedings of ADG 2018 after the conference. The full papers (submitted after the <br>\n conference) will be formally reviewed by PC members and external referees. All <br>\n participants are encouraged to bring along posters on their work (irrespective<br>\n of whether it was presented at the conference or not) for display during ADG 2018.</p>\n<p>The accepted full papers will be published as a special issue of some journal or <br>\n in the Springer Lecture Notes in Artificial Intelligence (LNAI) series or Lecture <br>\n Notes in Computer Science (LNCS) series. The proceedings of ADG 1996, ADG 1998, <br>\n ADG 2000, ADG 2002, ADG 2004, ADG 2006, ADG 2010, ADG 2012, and ADG 2014 appeared<br>\n as LNAI 1360, LNAI 1669, LNAI 2061, LNAI 2930, LNAI 3763, LNAI 4869, LNCS 6877,<br>\n LNAI 7993, and LNAI 9201, respectively.    </p>\n<p>Invited Speakers <br>\n================</p>\n<ul>\n<li>Jacques Fleuriot (University of Edinburgh, UK)</li>\n<li>Xiao-Shan Gao (Chinese Academy of Sciences, China)</li>\n<li>Pascal Schreck (University of Strasbourg, France)</li>\n<li>Chuanming Zong (Tianjin University, China)</li>\n</ul>\n<p>Organization <br>\n============</p>\n<p>General Chair</p>\n<ul>\n<li>Dongming Wang (Beihang University and Guangxi University for Nationalities, China)</li>\n</ul>\n<p>Program Committee</p>\n<ul>\n<li>\n<p>Hongbo Li (Chinese Academy of Sciences, China), Chair </p>\n</li>\n<li>\n<p>Francisco Botana (University of Vigo, Spain)</p>\n</li>\n<li>Falai Chen (University of Science and Technology of China, China)</li>\n<li>Xiaoyu Chen (Beihang University, China)</li>\n<li>Yong Feng (Chinese Academy of Sciences, China)</li>\n<li>Lei Huang (Chinese Academy of Sciences, China)</li>\n<li>Hoon Hong (North Carolina State University, USA)</li>\n<li>Tetsuo Ida (University of Tsukuba, Japan)</li>\n<li>Predrag Janičić (University of Belgrade, Serbia)</li>\n<li>Na Lei (Dalian University of Technology, China)</li>\n<li>Zhuojun Liu (Chinese Academy of Sciences, China)</li>\n<li>Julien Narboux (University of Strasbourg, France)</li>\n<li>Pedro Quaresma (University of Coimbra, Portugal)</li>\n<li>Tomás Recio (University of Cantabria, Spain)</li>\n<li>Ileana Streinu (Smith College, USA)</li>\n<li>Thomas Sturm (CNRS, France)</li>\n<li>Dingkang Wang (Chinese Academy of Sciences, China)</li>\n<li>Chee K. Yap (New York University, USA)</li>\n</ul>\n<p>Local Arrangements</p>\n<ul>\n<li>Xiaoyu Chen (Beihang University, China)</li>\n<li>Jing Yang (Guangxi University for Nationalities, China)</li>\n</ul>\n<p>Publicity and Webmaster</p>\n<ul>\n<li>Fadoua Ghourabi (Ochanomizu University, Japan)</li>\n</ul>\n<p>More Information about ADG 2018 can be found at: <a href=\"http://adg2018.cc4cm.org/\">http://adg2018.cc4cm.org/</a>.</p>",
        "id": 294724417,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661185958
    }
]