[
    {
        "content": "<p>From: Amy Felty &lt;<a href=\"mailto:afelty@eecs.uottawa.ca\">afelty@eecs.uottawa.ca</a>&gt;<br>\nSecond Call for Papers<br>\n                  LFMTP 2014: 9th International Workshop on<br>\n         Logical Frameworks and Meta-languages: Theory and Practice<br>\n                               Vienna, Austria<br>\n                                July 17, 2014<br>\n<a href=\"http://complogic.cs.mcgill.ca/lfmtp14/\">http://complogic.cs.mcgill.ca/lfmtp14/</a></p>\n<p>Affiliated with CSL-LICS 2014 and IJCAR 2014 and held as part of the<br>\nFederated Logic Conference (FLoC) and the Vienna Summer of Logic<br>\n(VSL), <a href=\"http://vsl2014.at\">http://vsl2014.at</a></p>\n<p>IMPORTANT DATES<br>\nPaper Submission:   May 2<br>\nNotification:   June 3<br>\nFinal papers due:   June 19<br>\nWorkshop:   July 17</p>\n<p>INVITED SPEAKERS:<br>\n   Jesper Bengtson (IT University of Copenhagen)<br>\n   Edwin Brady (University of St. Andrews)<br>\n   Gopalan Nadathur (University of Minnesota)</p>\n<p>DESCRIPTION: Logical frameworks and meta-languages form a common<br>\nsubstrate for representing, implementing, and reasoning about a wide<br>\nvariety of deductive systems of interest in logic and computer<br>\nscience. Their design and implementation on the one hand and their use<br>\nin reasoning tasks ranging from the correctness of software to the<br>\nproperties of formal computational systems on the other hand have been<br>\nthe focus of considerable research over the last two decades. This<br>\nworkshop will bring together designers, implementers, and<br>\npractitioners to discuss various aspects impinging on the structure<br>\nand utility of logical frameworks, including the treatment of variable<br>\nbinding, inductive and co-inductive reasoning techniques and the<br>\nexpressivity and lucidity of the reasoning process.</p>\n<p>TOPICS: LFMTP 2014 will provide researchers a forum to present<br>\nstate-of-the-art techniques and discuss progress in areas such as the<br>\nfollowing:</p>\n<ul>\n<li>\n<p>Encoding and reasoning about the meta-theory of programming<br>\n   languages and related formally specified systems.</p>\n</li>\n<li>\n<p>Theoretical and practical issues concerning the treatment of<br>\n   variable binding, especially the representation of, and reasoning<br>\n   about, datatypes defined from binding signatures.</p>\n</li>\n<li>\n<p>Logical treatments of inductive and co-inductive definitions and<br>\n   associated reasoning techniques.</p>\n</li>\n<li>\n<p>New theory contributions: canonical and substructural frameworks,<br>\n   contextual frameworks, proof-theoretic foundations supporting binders,<br>\n   functional programming over logical frameworks, homotopy type theory.</p>\n</li>\n<li>\n<p>Applications of logical frameworks, e.g., in proof-carrying<br>\n   architectures such as proof-carrying authorization.</p>\n</li>\n<li>\n<p>Techniques for programming with binders in functional programming<br>\n   languages such as Haskell, OCaml, or Agda and logic programming<br>\n   languages such as lambda Prolog or Alpha-Prolog.<br>\n   with encoding programming languages theory will be particularly<br>\n   welcome.</p>\n</li>\n</ul>\n<p>SUBMISSIONS: In addition to regular papers, we also solicit \"work in<br>\nprogress\" reports, in a broad sense. Those do not need to report<br>\noriginal or fully polished research results, but should be interesting<br>\nfor the community at large.</p>\n<p>Submitted papers should be in PDF, formatted using the ACM SIGPLAN<br>\nstyle guidelines<br>\n(<a href=\"http://www.acm.org/sigs/publications/proceedings-templates\">http://www.acm.org/sigs/publications/proceedings-templates</a>). The<br>\nlength is restricted to 8 pages, except for \"work in progress\" papers,<br>\nwhich are restricted to 4 pages.  Submission is via EasyChair<br>\n(<a href=\"https://www.easychair.org/conferences/?conf=lfmtp2014\">https://www.easychair.org/conferences/?conf=lfmtp2014</a>).</p>\n<p>Authors of accepted papers are expected to present their paper at the<br>\nworkshop.</p>\n<p>PROCEEDINGS: Accepted regular papers will be included in the<br>\nproceedings, which will be published in the ACM International<br>\nConference Proceedings Series, available in the ACM Digital<br>\nLibrary. Authors are encouraged to publish auxiliary material with<br>\ntheir paper (technical appendixes, source code, scripts, test data,<br>\netc.).</p>\n<p>PROGRAM COMMITTEE:<br>\n   Andreas Abel (Gothenburg University)<br>\n   Kaustuv Chaudhuri (Inria)<br>\n   Adam Chlipala (MIT)<br>\n   Amy Felty, Co-Chair (University of Ottawa)<br>\n   Elsa Gunter (University of Illinois, Urbana - Champaign)<br>\n   Luigi Liquori (Inria)<br>\n   Marino Miculan (University of Udine)<br>\n   Brigitte Pientka, Co-Chair (McGill University)<br>\n   Jorge Luis Sacchini (CMU Quatar)<br>\n   Alwen Tiu (Nanyang Technological University)</p>",
        "id": 294275277,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660918566
    }
]