[
    {
        "content": "<p>From: José Manuel Rodriguez Caballero &lt;<a href=\"mailto:josephcmac@gmail.com\">josephcmac@gmail.com</a>&gt;<br>\nJust a little remark about the importance of abstraction (with respect to<br>\nthe mathematical structure).</p>\n<p>The main lesson of quantum physics is that nature is finite at its most<br>\nelementary level, with the only exception of the complex numbers in the<br>\nsuperpositions... Nevertheless, Felix Lev thinks that this is not an<br>\nexception, but just an approximation. According to Lev, the complex numbers<br>\nmay be substituted in the future by a finite field F_q, where q is some<br>\nhuge prime power, which will be determined in an experimental way, i.e.,<br>\nthe prime power q will be a fundamental constant of the universe in the<br>\nsame sense than the speed of light c or the universal gravitational<br>\nconstant. Reference: Lev, Felix M. \"Quantum theory and Galois fields.\"<br>\n*International<br>\nJournal of Modern Physics B* 20.11n13 (2006): 1761-1777.<br>\n<a href=\"https://www.worldscientific.com/doi/abs/10.1142/S0217979206034273?journalCode=ijmpb\">https://www.worldscientific.com/doi/abs/10.1142/S0217979206034273?journalCode=ijmpb</a></p>\n<p>So, a way to be prepared for a possible change in the formulation of<br>\nquantum mechanics is to develop a theory in Isabelle which contains both,<br>\nthe quantum mechanics formulated with complex numbers (the traditional<br>\nquantum mechanics) and this new proposal of quantum mechanics over a finite<br>\nfield, as particular cases, i.e., making abstraction with respect to the<br>\nfield as it is done in Abstract Algebra. The following preprint contains a<br>\ndescription of the quantum computation over finite fields: James, Roshan<br>\nP., Gerardo Ortiz, and Amr Sabry. \"Quantum computing over finite<br>\nfields.\" *arXiv<br>\npreprint arXiv:1101.3764*(2011). <a href=\"https://arxiv.org/abs/1101.3764\">https://arxiv.org/abs/1101.3764</a></p>\n<p>Maybe, when trying to build the first practical quantum computer, the<br>\ntheory of quantum mechanics over F_q will begin to play a significative<br>\nrole. Of course, the use of complex vector spaces is fine according to the<br>\nstate of the art in quantum mechanics, but quantum physics is continuously<br>\ndeveloping...</p>\n<p>Kind Regards,<br>\nJosé Manuel Rodriguez Caballero</p>",
        "id": 294746913,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661193858
    }
]