[
    {
        "content": "<p>From: <a href=\"mailto:avantssar@resin.csoft.net\">avantssar@resin.csoft.net</a><br>\n(Apologies if you receive this announcement multiple times)</p>\n<p>(NEW: LNCS publication)</p>\n<p>CALL FOR PAPERS<br>\n================</p>\n<p>ARSPA-WITS'09</p>\n<p>Joint Workshop on<br>\nAutomated Reasoning for Security Protocol Analysis <br>\nand<br>\nIssues in the Theory of Security</p>\n<p><a href=\"http://www.avantssar.eu/arspa-wits09/\">http://www.avantssar.eu/arspa-wits09/</a></p>\n<p>March 28-29, 2009<br>\nYork, UK</p>\n<p>Affiliated with ETAPS 2009</p>\n<p>IMPORTANT DATES<br>\n================</p>\n<p>Papers due:   January  09 <br>\nNotification: February 06<br>\nFinal papers: April    10 </p>\n<p>SCOPE<br>\n======</p>\n<p>The aim of the joint workshop ARSPA-WITS'09 is to provide a forum for<br>\ncontinued activity in different areas of computer security, bringing<br>\ncomputer security researchers in closer contact with the ETAPS<br>\ncommunity and giving ETAPS attendees an opportunity to talk to experts<br>\nin computer security, on the one hand, and contribute to bridging the<br>\ngap between logical methods and computer security foundations, on the<br>\nother.</p>\n<p>We are interested both in new results in theories of computer security<br>\nand also in more exploratory presentations that examine open questions<br>\nand raise fundamental concerns about existing theories, as well as in<br>\nnew results on developing and applying automated reasoning techniques<br>\nand tools for the formal specification and analysis of security<br>\nprotocols. We thus solicit submissions of papers both on mature work<br>\nand on work in progress.</p>\n<p>Possible topics include, but are not limited to:</p>\n<p>Automated reasoning techniques, Composition issues, Formal<br>\nspecification, Foundations of verification, Information flow analysis,<br>\nLanguage-based security, Logic-based design, Program transformation,<br>\nSecurity models, Static analysis, Statistical methods, Tools, Trust<br>\nmanagement</p>\n<p>for</p>\n<p>Access and resource usage control, Authentication, Availability and<br>\ndenial of service, Covert channels, Confidentiality, Integrity and<br>\nprivacy, Intrusion detection, Malicious code, Mobile code, Mutual<br>\ndistrust, Privacy, Security policies, Security protocols</p>\n<p>ARSPA is a series of workshops on Automated Reasoning for Security<br>\nProtocol Analysis, bringing together researchers and practitioners<br>\nfrom both the security and the formal methods communities, from<br>\nacademia and industry, who are working on developing and applying<br>\nautomated reasoning techniques and tools for the formal specification<br>\nand analysis of security protocols. The first two ARSPA workshops were<br>\nheld as satellite events of the 2nd International Joint Conference on<br>\nAutomated Reasoning (IJCAR'04) and of the 32nd International<br>\nColloquium on Automata, Languages and Programming (ICALP'05),<br>\nrespectively. ARSPA then joined forces with the workshop FCS<br>\n(Foundations of Computer Security): FCS-ARSPA'06 was affiliated with<br>\nLICS'06, in the context of FLoC'06, and FCS-ARSPA'07 was affiliated<br>\nwith LICS'07 and ICALP'07.</p>\n<p>WITS is the official annual workshop organised by the IFIP WG 1.7 on<br>\n\"Theoretical Foundations of Security Analysis and Design\", established<br>\nto promote the investigation on the theoretical foundations of<br>\nsecurity, discovering and promoting new areas of application of<br>\ntheoretical techniques in computer security and supporting the<br>\nsystematic use of formal techniques in the development of security<br>\nrelated applications. This is the ninth meeting in the series.  In<br>\n2008, ARSPA and WITS joined with the workshop on Foundations of<br>\nComputer Security FCS for a joint workshop FCS-ARSPA-WITS'08<br>\nassociated with LICS 2008 and CSF 21.</p>\n<p>SUBMISSION AND PUBLICATION<br>\n===========================</p>\n<p>All submissions will be peer-reviewed. Authors of accepted papers must<br>\nguarantee that their paper will be presented at the workshop.</p>\n<p>The post-proceedings of the workshop will be published in the Springer<br>\nLecture Notes in Computer Science (LNCS) series.</p>\n<p>To preserve ARSPA-WITS's tradition of being an open forum, authors may<br>\ndecide whether they would like a revised version of a paper to appear<br>\nin the post-proceedings. <br>\nAuthors should clearly state at time of submission whether a paper is<br>\nintended for presentation only or also for publication: this should be<br>\nstated at the end of the abstract of the paper. <br>\nPapers for presentation only may substantially overlap other (cited)<br>\nwork of the authors.  This choice will not affect the selection<br>\nprocedure in any other way.</p>\n<p>Submissions should be at most 15 pages (a4paper, 11pt), including<br>\nreferences, written in the style of LNCS (<a href=\"http://www.springer.com/lncs\">www.springer.com/lncs</a>).<br>\nSubmissions that are clearly too long may be rejected immediately.<br>\nAdditional material intended for the referees but not for publication<br>\nin the final version - for example details of proofs - may be placed<br>\nin a clearly marked appendix that is not included in the page limit.</p>\n<p>Authors are invited to submit their papers electronically, as portable<br>\ndocument format (pdf) or postscript (ps); please, do not send files<br>\nformatted for work processing packages (e.g., Microsoft Word or<br>\nWordperfect files).</p>\n<p>The only mechanism for paper submissions is via the electronic<br>\nsubmission web-site powered by easychair:</p>\n<p><a href=\"http://www.easychair.org/conferences/?conf=arspawits09\">http://www.easychair.org/conferences/?conf=arspawits09</a></p>\n<p>Please, follow the instructions given there.</p>\n<p>PROGRAM COMMITTEE<br>\n===================</p>\n<p>Lujo Bauer (CMU, USA)<br>\nLuca Compagna (SAP Research, France)<br>\nVeronique Cortier (LORIA INRIA-Lorraine, France)<br>\nPierpaolo Degano (Universita<code> di Pisa, Italy; co-chair)\nSandro Etalle (Technical University of Eindhoven, The Netherlands)\nRiccardo Focardi (Universita</code> di Venezia, Italy)<br>\nDieter Gollman (Technische Universitaet Hamburg-Harburg, Germany)<br>\nRoberto Gorrieri (Universita<code> di Bologna, Italy)\nJoshua Guttman (MITRE, USA)\nJerry den Hartog (Technical University of Eindhoven, The Netherlands)\nJan Juerjens (The Open University, UK)\nGavin Lowe (Oxford University, UK)\nCatherine Meadows (Naval Research Laboratory, USA)\nJonathan Millen (MITRE, USA)\nSebastian Moedersheim (IBM Zurich Research Lab, Switzerland)\nMark Ryan (University of Birmingham, UK)\nLuca Vigano</code> (Universita` di Verona, Italy; co-chair)</p>\n<p>ADDITIONAL INFORMATION<br>\n=======================</p>\n<p>The workshop is supported by the projects AVANTSSAR, REGIS and<br>\nSENSORIA.</p>",
        "id": 294068149,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660826187
    }
]