[
    {
        "content": "<p>From: Philippas Tsigas &lt;<a href=\"mailto:tsigas@cs.chalmers.se\">tsigas@cs.chalmers.se</a>&gt;<br>\nPhD Positions<br>\n                Division of Computing Science,<br>\n               Chalmers University of Technology</p>\n<p><a href=\"http://chalmersnyheter.chalmers.se/chalmers03/english/eng_vacanciesarticle.jsp?article=8730\">http://chalmersnyheter.chalmers.se/chalmers03/english/eng_vacanciesarticle.jsp?article=8730</a></p>\n<p>The Division has about 80 researchers, half being faculty members<br>\nand half PhD students. Our focus is on algorithms, bioinformatics,<br>\ndistributed systems and computing, functional programming, formal methods,<br>\ninteraction design, language technology, language based security, parallel<br>\nand high performance computing, programming logic and type theory, but<br>\nresearch is not restricted to these topics.</p>\n<p>For more information, see<br>\n<a href=\"http://www.chalmers.se/cse/EN/research/research-groups\">http://www.chalmers.se/cse/EN/research/research-groups</a></p>\n<p>Knowledge of Swedish is not a prerequisite for application. English is our<br>\nworking language for research. Both Swedish and English are used in<br>\nundergraduate courses. Half of our researchers and PhD students are native<br>\nSwedes; the rest come from more than 20 different countries.</p>\n<p>Applicants must have a very good undergraduate degree in Computing Science<br>\nor in a related subject with a strong Computing Science component. They<br>\nmust also have a strong, documented interest in doing research.</p>\n<p>You may even apply if you have not yet completed your degree, but expect<br>\nto do so by   1 September 2007.</p>\n<p>We particularly encourage applicants with interests in:</p>\n<ul>\n<li>applying techniques from functional programming to develop novel methods<br>\nof hardware design and verification. For more information on this point<br>\ncontact Mary Sheeran (ms(at)cs.chalmers.se);</li>\n<li>automated theorem proving, SAT-solving, and functional programming. For<br>\nmore information on this point see<br>\n<a href=\"http://www.cs.chalmers.se/~koen/folkung/\">http://www.cs.chalmers.se/~koen/folkung/</a>, or contact Koen Claessen<br>\n(koen(at)chalmers.se);</li>\n<li>distributed algorithms for providing coordination services to networked<br>\nor multiprocessor applications. For more information on this point see the<br>\nwebapages of the group Distributed Computing and Systems<br>\n<a href=\"http://www.cs.chalmers.se/~dcs/\">http://www.cs.chalmers.se/~dcs/</a> or contact Marina Papatriantafilou<br>\n(ptrianta(at)cs.chalmers.se);</li>\n<li>program analysis for software engineering. For more information on this<br>\npoint see the webpage of the group Software Methodologies and Systems<br>\n(<a href=\"http://sms.cs.chalmers.se\">http://sms.cs.chalmers.se</a>, \"Open Positions\") or contact Sibylle Schupp<br>\n(&lt;lastname&gt;@cs.chalmers.se).</li>\n</ul>\n<p>The department especially welcomes female applicants.</p>\n<p>How to apply</p>\n<hr>\n<p>The full application should contain<br>\n1.  A letter of application, listing specific research interests<br>\n2.  A curriculum vitae<br>\n3.  Attested copies of degrees and other certificates<br>\n4.  Copies of relevant work, for example dissertations or<br>\n      articles, that you have authored or co-authored<br>\n5.  Letters of recommendation from your teachers or employers</p>\n<p>*** You MUST include or e-mail Letters of Recommendation:<br>\n     we typically get over 100 apps, and it is<br>\n     simply not feasible for us to request individual letters ***</p>\n<p>The job reference number is: 2007/30. The last date for your full<br>\napplication to arrive is March 9, 2007</p>\n<p>Send your application electronically in PDF files or by paper-mail to<br>\nRegistrator, Chalmers University of Technology, Se-412 96 Göteborg, Sweden.<br>\nPhone: +4631 772 1000,                                                    <br>\n                                                            Fax: +4631 772<br>\n4922,                                                                     <br>\n                                   E-mail: registrator(at)adm.chalmers.se</p>\n<p>If you need more information regarding PhD studies at the division please<br>\ncontact Philippas Tsigas (tsigas(at)cs.chalmers.se).</p>\n<p>You will know the result of your application by 30 May 2007.<br>\nUnion representatives: SACO Jan Lindér, TCO Monica Orrbacke, SEKO Ralf<br>\nBerndtsson</p>",
        "id": 294046493,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660817509
    }
]