[
    {
        "content": "<p>From: \"Eugene W. Stark\" &lt;<a href=\"mailto:isabelle-users@starkeffect.com\">isabelle-users@starkeffect.com</a>&gt;<br>\nIsabelle2016-RC2 has a new (and annoying) behavior that I don't believe<br>\nI have noticed in previous versions.  Under Ubuntu, I have the window manager<br>\nset to \"focus follows mouse\".  But JEdit no longer honors this, in the situation<br>\nwhere I click in the Sidekick panel, then move the mouse to the main edit<br>\nwindow, the focus remains in the Sidekick panel and if I start to type my<br>\ntypein goes into the Sidekick filter textbox.  To be able to type in the<br>\nmain window, I have to explicitly click on it to change the focus.</p>\n<p>- Gene Stark</p>",
        "id": 294663833,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661170941
    },
    {
        "content": "<p>From: Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt;<br>\nWhich version of Ubuntu is this precisely?  An which window manager?</p>\n<p>Makarius</p>",
        "id": 294663855,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661170946
    },
    {
        "content": "<p>From: \"Eugene W. Stark\" &lt;<a href=\"mailto:isabelle-users@starkeffect.com\">isabelle-users@starkeffect.com</a>&gt;<br>\nUbuntu 14.04 LTS, using Unity.  I can dig up the precise settings,<br>\nif you tell me what you want and where to look for it among the<br>\nvarious settings, \"tweak tools\", and configuration files.</p>\n<p>- Gene Stark</p>",
        "id": 294663874,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661170953
    },
    {
        "content": "<p>From: Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt;<br>\nI have now installed Ubuntu 14.04 LTS with Unity and Unity Tweak Tool to <br>\nenable \"Mouse\" focus.</p>\n<p>It basically appears to work as I would expect, both in Isabelle2015 and <br>\nIsabelle2016-RC2, when moving between the outer windows (called \"frames\" <br>\nin Java terminology).  Within a window, focus follows clicks as usual in <br>\nSwing, but there are slight differences demending on the look-and-feel, <br>\ne.g. highlighting of buttons as the mouse moves.</p>\n<p>I don't think that Java Swing actually supports focus follows mouse <br>\n<em>within</em> its own windows.  In which combination of versions and <br>\nlook-and-feels did you see this working?</p>\n<p>Makarius</p>",
        "id": 294664000,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661171009
    },
    {
        "content": "<p>From: \"Eugene W. Stark\" &lt;<a href=\"mailto:isabelle-users@starkeffect.com\">isabelle-users@starkeffect.com</a>&gt;<br>\nOK, I just re-tried Isabelle2015 and the behavior seems to be the same<br>\n(though I don't like it).  I apologize for \"shooting from the lip\" and<br>\ncosting you the time and effort.  Basically when I downloaded and started<br>\nusing Isabelle2016-RC2 I somehow became aware very quickly of this behavior,<br>\nwhich had not bothered me before, so I presumed that it was new.<br>\nApparently it is not.</p>\n<p>- Gene Stark</p>",
        "id": 294664021,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661171021
    }
]