[
    {
        "content": "<p>From: Amy Felty &lt;<a href=\"mailto:afelty@site.uOttawa.ca\">afelty@site.uOttawa.ca</a>&gt;<br>\nFinal Call for Papers<br>\nITP 2012: 3rd International Conference on Interactive Theorem Proving</p>\n<p>13-16 August 2012, Princeton, New Jersey, USA<br>\n<a href=\"http://itp2012.cs.princeton.edu/\">http://itp2012.cs.princeton.edu/</a></p>\n<p>ITP is the premier international conference for researchers from all<br>\nareas of interactive theorem proving and its applications. The<br>\ninaugural meeting of ITP was held in July 2010 in Edinburgh, Scotland,<br>\nas part of the Federated Logic Conference (FLoC), and the second<br>\nmeeting took place in Nijmegen, The Netherlands, in August 2011.  ITP<br>\n2012 will take place in Princeton, New Jersey, USA on 13-16 August<br>\n2012 with two workshops preceding the main conference: The Isabelle<br>\nWorkshop 2012 (organized by Tobias Nipkow, Larry Paulson, and Makarius<br>\nWenzel) and the 4th Coq Workshop (organized by Adam Chlipala).  ITP is<br>\nthe evolution of the TPHOLs conference series to the broad field of<br>\ninteractive theorem proving. TPHOLs meetings took place every year<br>\nfrom 1988 until 2009.</p>\n<p>The program committee welcomes submissions on all aspects of<br>\ninteractive theorem proving and its applications.  Examples of typical<br>\ntopics include formal aspects of hardware or software (specification,<br>\nverification, semantics, synthesis, refinement, compilation, etc.);<br>\nformalization of significant bodies of mathematics; advances in<br>\ntheorem prover technology (automation, decision procedures, induction,<br>\ncombinations of systems and tools, etc.); industrial applications of<br>\ntheorem proving; other topics including those relating to user<br>\ninterfaces, education, comparisons of systems, and mechanizable<br>\nlogics; and concise and elegant worked examples (\"Proof Pearls\").</p>\n<p>Submission details:</p>\n<p>All papers must be submitted electronically, via EasyChair:<br>\n<a href=\"https://www.easychair.org/conferences/?conf=itp2012\">https://www.easychair.org/conferences/?conf=itp2012</a></p>\n<p>Papers may be no longer than 16 pages and are to be submitted in PDF<br>\nusing the Springer LNCS format.  Instructions and style files may be<br>\nfound by going to <a href=\"http://www.springer.com/computer/lncs/lncs+authors\">http://www.springer.com/computer/lncs/lncs+authors</a><br>\nand downloading the files llncs2e.zip and typeinst.zip.  Submissions<br>\nmust describe original unpublished work not submitted for publication<br>\nelsewhere, presented in a way that users of other systems can<br>\nunderstand.  The proceedings will be published as a volume in the<br>\nSpringer Lecture Notes in Computer Science series and will be<br>\navailable to participants at the conference.</p>\n<p>In addition to regular submissions, described above, there will be a<br>\n\"rough diamonds\" section.  Rough diamond submissions are limited to<br>\nsix pages and may consist of an extended abstract.  They will be<br>\nrefereed and are expected to present innovative and promising ideas,<br>\npossibly in an early form and without supporting evidence.  Accepted<br>\ndiamonds will be published in the main proceedings, and will be<br>\npresented as short talks.</p>\n<p>Both regular and rough diamond submissions require an abstract of 70<br>\nto 150 words to be submitted electronically at the above address one<br>\nweek before the full submission.  All submissions must be written in<br>\nEnglish.  Submissions are expected to be accompanied by verifiable<br>\nevidence of a suitable implementation, such as the source files of a<br>\nformalization for the proof assistant used.  The submission page<br>\ncontains a corresponding file upload function.  Authors who have<br>\nstrong reasons (e.g. of commercial/legal nature) for violating this<br>\npolicy should contact the PC chairs in advance. At the time of<br>\nabstract submission, proof assistants and other tools necessary for<br>\nevaluating the submission should be indicated using the Keywords<br>\nsection of the web interface.</p>\n<p>Authors of accepted papers are expected to present their papers at the<br>\nconference, and will be required to sign copyright release forms.</p>\n<p>Important dates:</p>\n<p>Abstract submission deadline:           6 February 2012<br>\nPaper submission deadline:              13 February 2012<br>\nNotification of paper decisions:        13 April 2012<br>\nFinal versions due from authors:        5 May 2012<br>\nPre-conference workshops:               12 August 2012<br>\nConference dates:                       13-16 August 2012</p>\n<p>Web page: <a href=\"http://itp2012.cs.princeton.edu/\">http://itp2012.cs.princeton.edu/</a></p>\n<p>Invited Speakers:<br>\nGilles Barthe (IMDEA, Spain)<br>\nLawrence Paulson (Univ. of Cambridge, UK)<br>\nAndre Platzer (Carnegie Mellon Univ., USA)</p>\n<p>Invited Tutorial:<br>\nAndrew Gacek (Rockwell Collins, USA)</p>\n<p>General Co-Chairs:<br>\nAndrew Appel (Princeton Univ., USA)<br>\nLennart Beringer (Princeton Univ., USA)</p>\n<p>Program Co-Chairs:<br>\nLennart Beringer (Princeton Univ., USA)<br>\nAmy Felty (Univ. of Ottawa, Canada)</p>\n<p>Program Committee:<br>\nAndreas Abel (LMU Munich, Germany)<br>\nNick Benton (Microsoft Research Cambridge, UK)<br>\nStefan Berghofer (secunet Security Networks AG, Germany)<br>\nLennart Beringer (Co-Chair, Princeton Univ., USA)<br>\nYves Bertot (INRIA Sophia-Antipolis, France)<br>\nAdam Chlipala (MIT, USA)<br>\nEwen Denney (NASA, USA)<br>\nPeter Dybjer (Chalmers Univ. of Technology, Sweden)<br>\nAmy Felty (Co-Chair, Univ. of Ottawa, Canada)<br>\nHerman Geuvers (Radboud Univ. Nijmegen, The Netherlands)<br>\nGeorges Gonthier (Microsoft Research Cambridge, UK)<br>\nJim Grundy (Intel Corp., USA)<br>\nElsa Gunter (Univ. Illinois at Urbana-Champaign, USA)<br>\nHugo Herbelin (INRIA Roquencourt-Paris, France)<br>\nJoe Hurd (Galois, Inc., USA)<br>\nReiner Hähnle (Chalmers Univ. of Technology, Sweden)<br>\nMatt Kaufmann (Univ. of Texas at Austin, USA)<br>\nGerwin Klein (NICTA, Australia)<br>\nAssia Mahboubi (INRIA Saclay, France)<br>\nConor McBride (Univ. of Strathclyde, UK)<br>\nAlberto Momigliano (Univ. of Milan, Italy)<br>\nMagnus O. Myreen (Univ. of Cambridge, UK)<br>\nTobias Nipkow (TU Munich, Germany)<br>\nSam Owre (SRI, USA)<br>\nChristine Paulin-Mohring (Univ. Paris-Sud, France)<br>\nDavid Pichardie (INRIA Rennes, France)<br>\nBrigitte Pientka (McGill Univ., Canada)<br>\nRandy Pollack (Harvard Univ., USA)<br>\nJulien Schmaltz (Open Univ. of the Netherlands, The Netherlands)<br>\nBas Spitters (Radboud Univ. Nijmegen, The Netherlands)<br>\nSofiene Tahar (Concordia Univ., Canada)<br>\nMakarius Wenzel (Univ. Paris-Sud, France)</p>",
        "id": 294150158,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660849018
    }
]