[
    {
        "content": "<p>From: José Manuel Rodriguez Caballero &lt;<a href=\"mailto:josephcmac@gmail.com\">josephcmac@gmail.com</a>&gt;<br>\nI learned Isabelle, Coq and UniMath without professor, just from the<br>\nmanuals and I did not studied computer science neither (just pure<br>\nmathematics).</p>\n<p>The following points are key advices for an hypothetical beginner in<br>\nIsabelle according to my personal experience (the learning process varies<br>\nfrom person to person):</p>\n<p>(1) Look at easy examples and try to prove similar theorems by yourself.<br>\nYou could look at my implementations (I regular update my repertory), which<br>\nare nice from a pedagogical point of view:<br>\n<a href=\"https://github.com/josephcmac/Folklore-and-miscellaneous-results-in-number-theory\">https://github.com/josephcmac/Folklore-and-miscellaneous-results-in-number-theory</a></p>\n<p>(2) Read the manual only when you need it and do not read it as a novel:<br>\npractice in Isabelle is more important than theory.</p>\n<p>(3) Do not look at the proof state, just focus on your Isar code.</p>\n<p>(4) Break your main theorem into several lemmas (having lower complexity<br>\nthan your original theorem) and put sorry in each one. Then, prove your<br>\ntheorem assuming that the lemmas are true. After that, repeat the same<br>\nprocess to each one of your lemmas.</p>\n<p>(5) Drink as much coffee as you medical doctor allows you. Sleep 20 minutes<br>\nafter drinking the coffee and before beginning to write in Isabelle. This<br>\nwill amplify your focus (there are scientific evidence of coffee naps):<br>\n<a href=\"https://blog.bulletproof.com/coffee-naps-bulletproof-power-nap/\">https://blog.bulletproof.com/coffee-naps-bulletproof-power-nap/</a></p>\n<p>(6) Do one activity at time (the human brain is not multitask). Do lo<br>\nlisten music while you are coding.</p>\n<p>Well, I hope that these advices will help people. Isabelle as easy learn as<br>\npossible, what is hard is mathematics itself, and of course, its formal<br>\nverification in Isabelle.</p>\n<p>Kind Regards,<br>\nJose M.</p>",
        "id": 294740237,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661191255
    }
]