[
    {
        "content": "<p>From: Lutz Schröder &lt;<a href=\"mailto:lutz.schroeder@cs.fau.de\">lutz.schroeder@cs.fau.de</a>&gt;<br>\n[The RTG includes PhD topics that may be of interest to readers of the <br>\nIsabelle mailing list, with Stefan Milius and Lutz Schröder as possible <br>\nPhD advisers.]</p>\n<p>The Department of Computer Science and the School of Law at FAU invite <br>\napplications for</p>\n<p>10 PhD positions (m/f/d)<br>\n(salary level 13 TV-L) in Computer Science (full time) and Law (part <br>\ntime, 75%)</p>\n<p>and</p>\n<p>1 postdoctoral position at the School of Law (m/f/d)<br>\n(salary level 13 TV-L, full time)</p>\n<p>within the Research Training Group 2475 \"Cybercrime and Forensic <br>\nComputing\" funded by the German Research Foundation (DFG) commencing on <br>\nOctober 1, 2019.</p>\n<p>The Research Training Group aims to systematically analyse research <br>\nquestions arising from the interaction between computer science and <br>\ncriminal law. The principal investigators of this project offer <br>\nexpertise in the following areas:</p>\n<p>o Computer security, digital forensic science<br>\no Criminal law, criminal procedure, criminology<br>\no Theoretical computer science (logic, semantics, automata)<br>\no Pattern recognition, image processing, image forensics<br>\no Cryptography<br>\no Hardware-software-co-design</p>\n<p>More information about possible research topics can be found at <br>\n<a href=\"https://cybercrime.fau.de\">https://cybercrime.fau.de</a></p>\n<p>Applicants should have an excellent academic record, hold an MSc, LL.M. <br>\nor an equivalent university degree in computer science, law or related <br>\ndisciplines, and have the goal to finish a PhD degree within three <br>\nyears. Applicants for the postdoctoral position should hold a PhD in law.</p>\n<p>FAU aims to increase the number of women in scientific positions. Female <br>\ncandidates are therefore particularly encouraged to apply. In case of <br>\nequal qualifications, candidates with disabilities will take precedence.</p>\n<p>Please submit your complete application documents by 12.6.2019 to <br>\n<a href=\"mailto:cybercrime-applications@fau.de\">cybercrime-applications@fau.de</a>. Please mention in your application at <br>\nleast two research areas from the above list which you are specifically <br>\ninterested in. Interviews will commence between 3.7.2019 and 12.7.2019 <br>\nin Erlangen. Further inquiries can be directed to Felix Freiling <br>\n(<a href=\"mailto:felix.freiling@fau.de\">felix.freiling@fau.de</a>) regarding positions in computer science and Hans <br>\nKudlich (<a href=\"mailto:hans.kudlich@fau.de\">hans.kudlich@fau.de</a>) regarding positions in law.</p>",
        "id": 294757272,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661198051
    }
]