[
    {
        "content": "<p>From:  Lennart Beringer &lt;<a href=\"mailto:eberinge@CS.Princeton.EDU\">eberinge@CS.Princeton.EDU</a>&gt;<br>\nITP 2012: Third Conference on Interactive Theorem Proving</p>\n<p>Princeton, NJ, August 13 - 16, 2012</p>\n<p>Conference home page: <a href=\"http://itp2012.cs.princeton.edu\">itp2012.cs.princeton.edu</a></p>\n<p>Final call for workshop proposals</p>\n<p>Submission deadline: December 5th, 2012</p>\n<p>The ITP conference series</p>\n<hr>\n<p>The ITP conference series is concerned with all topics related to<br>\nInteractive Theorem Proving, ranging from theoretical foundations to<br>\nimplementation aspects and applications in program verification,<br>\nsecurity, and formalization of mathematics.</p>\n<p>The third ITP conference, ITP 2012, will be held at Princeton<br>\nUniversity, between August 13th and August 16th, 2012.</p>\n<p>Scope and organization of workshops</p>\n<hr>\n<p>Similar to previous iterations of the conference, researchers and<br>\npractitioners are invited to submit proposals for colocated workshops<br>\non topics relating to interactive theorem proving. Workshops can<br>\ntarget the ITP community in general, focus on a particular ITP system,<br>\nor highlight more specific issues or recent developments. Proposals<br>\nfor in-depth tutorials or tool introductions are also welcome.</p>\n<p>All colocated events will precede the main conference, and will be<br>\nheld on university premises. Conference facilities (meeting rooms,<br>\nstandard technical equipment) are offered free of charge to the<br>\norganizers; workshop-only attendees will enjoy a significantly reduced<br>\nregistration fee. Participants will be able to choose between hotel<br>\naccommodation or accommodation in university dormitories, both in<br>\nwalking distance to the conference venue.</p>\n<p>Detailed organizational matters such as paper submission and review<br>\nprocess, or publication of proceedings, are up to the organizers of<br>\nindividual workshops. All accepted workshops will be expected to have<br>\nthe programme ready by July 1st 2012.</p>\n<p>Format of proposals</p>\n<hr>\n<p>Proposals for workshops should contain at least the following pieces<br>\nof information.</p>\n<ul>\n<li>name and contact details of the main organizer(s)</li>\n<li>names of additional organizers (optional)</li>\n<li>\n<p>title and organizational style of workshop (tutorial, public<br>\n   workshop, project workshop, etc)</p>\n</li>\n<li>\n<p>preferred length of workshop (half day, full day etc)</p>\n</li>\n<li>estimated number of attendees</li>\n<li>short (up to 1 page) description of topic</li>\n<li>(if applicable) pointers to previous editions of the workshop, or<br>\n   to similar events</li>\n</ul>\n<p>Submission and notification details</p>\n<hr>\n<p>Proposals are invited to be submitted by email to<br>\n<a href=\"mailto:itp2012@easychair.org\">itp2012@easychair.org</a>, no later than December 5th, 2011.</p>\n<p>The workshop selection committee consists of the ITP chairs</p>\n<p>Andrew Appel, Princeton University<br>\n    Lennart Beringer, Princeton University<br>\n    Amy Felty, University of Ottawa.</p>\n<p>Selected workshops will be notified by January 9th, 2012.</p>",
        "id": 294148520,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660848426
    }
]