[
    {
        "content": "<p>From: Lutz Schroeder &lt;<a href=\"mailto:Lutz.Schroeder@dfki.de\">Lutz.Schroeder@dfki.de</a>&gt;<br>\n[Thanks for distributing the call for papers below.]</p>\n<p>[- Please note submission <br>\ndeadline January 4 2011 -]</p>\n<hr>\n<p>CMCS 2012 second call for papers</p>\n<hr>\n<p>The 11th International Workshop on Coalgebraic Methods in Computer Science<br>\n                31 March - 1 April 2012, Tallinn, Estonia<br>\n                       (co-located with ETAPS 2012)<br>\n<a href=\"http://www.coalg.org/cmcs12\">www.coalg.org/cmcs12</a></p>\n<p><strong>* Proceedings to be published in Springer LNCS </strong>*</p>\n<p>Aims and scope</p>\n<hr>\n<p>In more than a decade of research, it has been established that a wide<br>\nvariety of state-based dynamical systems, like transition systems,<br>\nautomata (including weighted and probabilistic variants), Markov<br>\nchains, and game-based systems, can be treated uniformly as<br>\ncoalgebras. Coalgebra has developed into a field of its own interest<br>\npresenting a deep mathematical foundation, a growing field of<br>\napplications, and interactions with various other fields such as<br>\nreactive and interactive system theory, object-oriented and concurrent<br>\nprogramming, formal system specification, modal and description<br>\nlogics, artificial intelligence, dynamical systems, control systems,<br>\ncategory theory, algebra, analysis, etc. The aim of the CMCS workshop<br>\nseries is to bring together researchers with a common interest in the<br>\ntheory of coalgebras, their logics, and their applications.</p>\n<p>The topics of the workshop include, but are not limited to:</p>\n<p>* the theory of coalgebras (including set theoretic and categorical<br>\n     approaches);</p>\n<p>* coalgebras as computational and semantic models (for programming<br>\n     languages, dynamical systems, etc.);</p>\n<p>* coalgebras in (functional, object-oriented, concurrent) programming;<br>\n   * coalgebras and data types;<br>\n   * (coinductive) definition and proof principles for coalgebras (with<br>\n     bisimulations or invariants);</p>\n<p>* coalgebras and algebras;<br>\n   * coalgebraic specification and verification;<br>\n   * coalgebras and (modal) logic;<br>\n   * coalgebra and control theory (notably of discrete event and hybrid<br>\n     systems).</p>\n<p>Keynote Speaker</p>\n<hr>\n<p>Samson Abramsky, Oxford University, UK</p>\n<p>Invited Speakers</p>\n<hr>\n<p>Marcello Bonsangue,  Leiden University, The Netherlands<br>\nPawel Sobocinski, University of Southampton, UK</p>\n<p>Submissions</p>\n<hr>\n<p>Submission is electronic via the easychair system at</p>\n<p><a href=\"http://www.easychair.org/conferences/?conf=cmcs2012\">http://www.easychair.org/conferences/?conf=cmcs2012</a></p>\n<p>following the submission guidelines below. We solicit two types of<br>\ncontributions:</p>\n<p>(a) Regular papers to be evaluated by the PC for publication in the<br>\nproceedings:</p>\n<p>They must have a length no greater than 20 pages, formatted in LNCS<br>\n  style (<a href=\"http://www.springer.de/comp/lncs/authors.html\">http://www.springer.de/comp/lncs/authors.html</a>).  They must<br>\n  contain original contributions, be clearly written, and include<br>\n  appropriate reference to and comparison with related work.<br>\n(b) Short contributions:</p>\n<p>These will not be published in the proceedings but will be bundled in<br>\n  a technical report. They should be no more than two pages in LNCS<br>\n  format and may describe work in progress, summarise work submitted to<br>\n  a conference or workshop elsewhere, or in some other way appeal to<br>\n  the CMCS audience.</p>\n<p>Proceedings Publication</p>\n<hr>\n<p>The proceedings of CMCS 2012 will be published in Springer Lecture<br>\nNotes in Computer Science. The final proceedings will be published<br>\npost-conference and feature revised versions of the accepted regular<br>\npapers. Preliminary proceedings will be made available at the<br>\nconference in electronic form.</p>\n<p>Depending on the number and quality of submissions, we will consider<br>\npublishing extended and revised papers as a journal special issue,<br>\nsubject to the usual reviewing procedure. Previous special issues of<br>\nCMCS have appeared in high-ranking journals including Information and<br>\nComputation and Theoretical Computer Science.</p>\n<p>Important dates ---------------</p>\n<p>( for regular papers )</p>\n<ul>\n<li>4 January 2012: submission deadline (strict)</li>\n<li>3 February 2012: author notification</li>\n<li>7 February 2012: final version</li>\n</ul>\n<p>( for short contributions )</p>\n<ul>\n<li>27 February 2012: submission deadline (strict)</li>\n<li>6 March 2010: author notification</li>\n</ul>\n<p>( workshop )</p>\n<ul>\n<li>31 March - 1 April 2012</li>\n</ul>\n<p>Programme Committee</p>\n<hr>\n<p>Luis Barbosa, University of Minho, Braga, Portugal<br>\nFilippo Bonchi, LIP ENS-Lyon, France<br>\nJosee Desharnais, Université Laval, Canada<br>\nMai Gehrke, Radboud University Nijmegen, The Netherlands<br>\nH. Peter Gumm, University of Marburg, Germany<br>\nIchiro Hasuo, University of Tokyo, Japan<br>\nPatricia Johann, University of Strathclyde, Glasgow, Scotland, UK<br>\nEkaterina Komendantskaya, University of Dundee, Scotland, UK<br>\nDexter Kozen, Cornell University, Ithaca, NY, USA<br>\nDorel Lucanu,  Alexandru Ioan Cuza University, Iasi, Romania<br>\nStefan Milius, Technical University of Braunschweig, Germany<br>\nLarry Moss, Indiana University, Bloomington, USA<br>\nPrakash Panangaden, McGill University, Montreal, Canada<br>\nDirk Pattinson, Imperial College London, UK (co-chair)<br>\nDusko Pavlovic, Royal Holloway, London, UK<br>\nDaniela Petrisan, University of Leicester, UK<br>\nGrigore Rosu, University of Illinois at Urbana-Champaign, USA<br>\nJan Rutten, CWI and Radboud University Nijmegen, The Netherlands<br>\nLuigi Santocanale, University of Provence, Marseille, France<br>\nLutz Schröder, DFKI GmbH, Bremen, Germany (co-chair)<br>\nAlexandra Silva, CWI, Amsterdam, The Netherlands<br>\nAna Sokolova, University of Salzburg, Austria<br>\nSam Staton, University of Cambridge, UK<br>\nYde Venema, University of Amsterdam, The Netherlands</p>\n<p>Steering Committee</p>\n<hr>\n<p>Jiri Adamek, Technical University of Braunschweig, Germany<br>\nCorina Cirstea, University of Southampton, UK<br>\nH. Peter Gumm (chair), University of Marburg, Germany<br>\nBart Jacobs, Radboud University Nijmegen, The Netherlands<br>\nAlexander Kurz, University of Leicester, UK<br>\nMarina Lenisa, University of Udine, Italy<br>\nUgo Montanari, University of Pisa, Italy<br>\nLarry Moss, Indiana University, Bloomington, USA<br>\nDirk Pattinson, Imperial College London, UK<br>\nJohn Power, University of Bath, UK<br>\nHorst Reichel, Technical University of Dresden, Germany<br>\nJan Rutten, CWI and Radboud University Nijmegen, The Netherlands<br>\nLutz Schröder, DFKI GmbH and University of Bremen, Germany<br>\n.</p>",
        "id": 294146822,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660847813
    }
]