[
    {
        "content": "<p>From: Manfred Kerber &lt;<a href=\"mailto:mnfrd.krbr@gmail.com\">mnfrd.krbr@gmail.com</a>&gt;<br>\n[This is a shortened CFP, the full one is available at<br>\n<a href=\"http://www.cs.bham.ac.uk/~mmk/events/mcs15/]\">http://www.cs.bham.ac.uk/~mmk/events/mcs15/]</a></p>\n<p>Call for Papers for a Special Issue of<br>\n                        Mathematics in Computer Science<br>\n                      on Intelligent Computer Mathematics</p>\n<p>Guest Editor: Manfred Kerber</p>\n<p>Following the very successful Eighth International Conference on<br>\nIntelligent Computer Mathematics in Washington, D.C., in July 2015, we<br>\ninvite submissions to a special issue of Mathematics in Computer<br>\nScience. We solicit for any high-quality original research paper that<br>\nsubstantially extends ideas and topics presented at CICM2015 or is related<br>\nto corresponding topics. Potential contributors may contact the guest<br>\neditor to discuss the suitability of topics and papers.</p>\n<p>Typical relevant topics are related to the integration of symbolic<br>\ncomputation and mechanized reasoning, mathematical knowledge management,<br>\nand digital mathematical libraries.</p>\n<p>Typically a description of a project, a system, or a data collection would<br>\nnot be substantial enough for inclusion in the special issue (unless very<br>\nwell-established). However, we explicitly solicit for insightful surveys<br>\nwith prospects, visions, and open problems and directions for future<br>\nresearch and development. It is also encouraged that such surveys are<br>\nwritten jointly by authors who have worked on different projects, systems,<br>\nor data collections.</p>\n<p>Submission Guidelines</p>\n<p>Submission is via EasyChair,<br>\n<a href=\"https://easychair.org/conferences/?conf=mcscicm2015\">https://easychair.org/conferences/?conf=mcscicm2015</a>. If accepted LaTeX<br>\nsources must be provided. While there is no strict page limit, papers would<br>\ntypically be 20-30 pages long. If a contribution is an extension of a<br>\npreviously published paper, e.g., at CICM 2015, then the extension must be<br>\nsubstantial. All submitted papers will be refereed according to the usual<br>\nMCS<br>\nrefereeing process.</p>\n<p>Important Dates</p>\n<p>Submission deadline:                  18 December 2015<br>\nNotification of acceptance/rejection: 28 February 2016<br>\nSubmission of revised versions:       31 March 2016<br>\nDelivery of camera-ready copies:      30 April 2016<br>\nPublication of special issue:         August/September 2016</p>\n<p>[There is some flexibility with the deadline. You can contact the guest<br>\n editor about that at M.Kerber@cs.bham.ac.uk]</p>",
        "id": 294660580,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661169763
    }
]