[
    {
        "content": "<p>From: Stephan Merz &lt;<a href=\"mailto:Stephan.Merz@loria.fr\">Stephan.Merz@loria.fr</a>&gt;<br>\nResearch team: Tools for Proofs, MSR-INRIA Joint Centre</p>\n<p>The Microsoft Research-INRIA Joint Centre is offering a 2-year<br>\nposition for a post-doctoral researcher to work on a proof development<br>\nenvironment for TLA+ in the Tools for Proofs project-team (see<br>\n<a href=\"http://www.msr-inria.inria.fr\">http://www.msr-inria.inria.fr</a>).</p>\n<p>Research Context</p>\n<p>TLA+ is a language for formal specifications and proofs designed by<br>\nLeslie Lamport.  It is based on first-order logic, set theory,<br>\ntemporal logic, and a module system.  While the specification part of<br>\nTLA+ has existed for several years, the proof language is more recent,<br>\nand we want to develop tools for writing and checking proofs.</p>\n<p>Our development environment for TLA+ proofs will have the following<br>\nstructure: TLA+ source files will be translated to low-level proofs<br>\nthat will be checked by Isabelle.  These will include calls to the<br>\nZenon automatic theorem prover to fill in the \"trivial\" details<br>\nomitted from proofs at the TLA+ level.  Within the Isabelle framework<br>\nwe will have an axiomatization of TLA+ (Isabelle/TLA+).  Isabelle will<br>\nprovide high assurance by checking all the proofs provided by the<br>\nuser or by Zenon.  As the user writes and modifies the TLA+ source<br>\ncode, a proof manager will keep track of which parts of the proofs<br>\nneed to be modified and re-checked by Isabelle.  The proof manager<br>\nwill also support direct interaction from the user with Isabelle when<br>\nneeded.</p>\n<p>Description of the activity of the post-doc</p>\n<p>The task devoted to the post-doc will be to develop the tools that<br>\nmake up the TLA+ development environment: the translator to Isabelle,<br>\nthe Zenon-Isabelle interface, and the proof manager.  He will also<br>\ncomplete the development of the TLA+ theory in the Isabelle framework<br>\n(Isabelle/TLA+), which is currently incomplete.</p>\n<p>Skills and profile of the candidate</p>\n<p>We are looking for a candidate with skills in some or all of the<br>\nfollowing subjects: parsing and compilation, logic and set theory,<br>\nIsabelle, OCaml, Eclipse and Java.  Moreover, the applicant must have<br>\na good command of the English language.</p>\n<p>Location</p>\n<p>The Microsoft Research-INRIA Joint Centre is located on the Campus of<br>\nINRIA Futurs, in South part of Paris, near the Le-Guichet RER<br>\nstation. The Tools for Proofs project-team is composed of Damien<br>\nDoligez, Leslie Lamport and Stephan Merz.</p>\n<p>Contact</p>\n<p>Candidates should send a resume to Damien Doligez<br>\n&lt;<a href=\"mailto:damien.doligez@inria.fr\">damien.doligez@inria.fr</a>&gt;<br>\n<a href=\"/user_uploads/14278/vcFwW8ezlfLTjIck8JScyTL1/Stephan.Merz.vcf\">Stephan.Merz.vcf</a></p>",
        "id": 294046850,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660817641
    }
]