[
    {
        "content": "<p>From: Claudio Sacerdoti Coen &lt;<a href=\"mailto:claudio.sacerdoticoen@unibo.it\">claudio.sacerdoticoen@unibo.it</a>&gt;<br>\nDear Colleagues,<br>\nwe would like to announce a few changes to the LFMTP 2020 workshop,<br>\nthat is scheduled to take place on 29th June 2020, co-located with FSCD<br>\nand IJCAR this year. </p>\n<p>1) LFMTP 2020 will follow FSCD-IJCAR lead to move to an online-only<br>\nformat for this year. </p>\n<p>2) We will now require only a 2-page abstract submission, instead of a<br>\nfull paper. The abstracts will go through a quick informal review.<br>\nAccepted abstracts will be invited for presentation at the workshop.<br>\nAfter the workshop, authors will be invited to submit the full versions<br>\nof their submissions for the post proceedings, which will undergo a<br>\nproper review.</p>\n<p>3) The submission deadline is now extended to 18 May 2020.</p>\n<p>The amended call for papers can be found below.</p>\n<p>Regards,<br>\nClaudio Sacerdoti-Coen and Alwen Tiu<br>\nLFMTP PC Chairs</p>\n<p>====================================</p>\n<p>CALL FOR PAPERS</p>\n<p>Logical Frameworks and Meta-Languages: Theory and Practice <br>\nLFMTP 2020</p>\n<p>Paris, France<br>\n29 June 2020</p>\n<p>Affiliated with FSCD 2020 and IJCAR 2020</p>\n<p><a href=\"https://lfmtp.org/workshops/2020/\">https://lfmtp.org/workshops/2020/</a></p>\n<p>Submission deadline: 18 May 2020</p>\n<p>ABOUT LFMTP</p>\n<p>Logical frameworks and meta-languages form a common substrate for<br>\nrepresenting, implementing and reasoning about a wide variety of<br>\ndeductive systems of interest in logic and computer science. Their<br>\ndesign, implementation and their use in reasoning tasks, ranging from<br>\nthe correctness of software to the properties of formal systems, have<br>\nbeen the focus of considerable research over the last two decades. This<br>\nworkshop will bring together designers, implementors and practitioners<br>\nto discuss various aspects impinging on the structure and utility of<br>\nlogical frameworks, including the treatment of variable binding,<br>\ninductive and co-inductive reasoning techniques and the expressiveness<br>\nand lucidity of the reasoning process.</p>\n<p>LFMTP 2020 will provide researchers a forum to present state-of-the-art <br>\ntechniques and discuss progress in areas such as the following:</p>\n<ul>\n<li>\n<p>Encoding and reasoning about the meta-theory of programming<br>\nlanguages, process calculi and related formally specified systems.</p>\n</li>\n<li>\n<p>Formalisation of model-theoretic and proof-theoretic semantics of<br>\nlogics.</p>\n</li>\n<li>\n<p>Theoretical and practical issues concerning the treatment of variable<br>\nbinding, especially the representation of, and reasoning about,<br>\ndatatypes defined from binding signatures.</p>\n</li>\n<li>\n<p>Logical treatments of inductive and co-inductive definitions and<br>\nassociated reasoning techniques, including inductive types of higher<br>\ndimension in homotopy type theory.</p>\n</li>\n<li>\n<p>Graphical languages for building proofs and their applications in<br>\ngeometry, equational reasoning and category theory.</p>\n</li>\n<li>\n<p>New theory contributions: canonical and substructural frameworks,<br>\ncontextual frameworks, proof-theoretic foundations supporting binders,<br>\nfunctional programming over logical frameworks, homotopy and cubical<br>\ntype theory.</p>\n</li>\n<li>\n<p>Applications of logical frameworks: proof-carrying architectures,<br>\nproof exchange and transformation, program refactoring, etc.</p>\n</li>\n<li>\n<p>Techniques for programming with binders in functional programming<br>\nlanguages such as Haskell, OCaml or Agda, and logic programming<br>\nlanguages such as lambda Prolog or Alpha-Prolog.</p>\n</li>\n<li>\n<p>Design and implementation of systems and tools related to meta-<br>\nlanguages and logical frameworks</p>\n</li>\n</ul>\n<p>IMPORTANT DATES</p>\n<p>All deadlines are established as the end of day (23:59) AoE.</p>\n<ul>\n<li>Submission deadline:          18 May 2020 </li>\n<li>Notification to authors:       1 June 2020 </li>\n<li>Workshop:                     29 June  2020</li>\n</ul>\n<p>SUBMISSION INFORMATION</p>\n<p>We solicit submissions of long abstracts describing original research<br>\nresults or descriptions of work in progress. The topics of the<br>\nsubmissions should be of interest to the LFMTP community at large. </p>\n<p>Submitted papers should be in PDF, formatted using the EPTCS LaTeX<br>\nstyle. The length is restricted to 2 pages.</p>\n<p>Submission is via EasyChair: <br>\n<a href=\"https://easychair.org/my/conference?conf=lfmtp2020\">https://easychair.org/my/conference?conf=lfmtp2020</a> </p>\n<p>All submissions will undergo a light peer-review process and the<br>\nauthors of those accepted will be invited to present their papers at<br>\nthe workshop.</p>\n<p>POST-PROCEEDINGS</p>\n<p>After the workshop we will publish post-proceedings in the Electronic<br>\nProceedings in Theoretical Computer Science (EPTCS) series. </p>\n<p>Authors of accepted abstracts will be invited to submit the full<br>\nversions of their papers for publication in the post-proceedings,<br>\nsubject to another round of review. </p>\n<p>PROGRAM COMMITTEE</p>\n<p>David Baelde, LSV, ENS Paris-Saclay &amp; Inria Paris<br>\nFrédéric Blanqui, INRIA<br>\nAlberto Ciaffaglione, University of Udine<br>\nDennis Müller, Friedrich-Alexander-University Erlangen-Nürnberg<br>\nMichael Norrish, Data61<br>\nCarlos Olarte, Universidade Federal do Rio Grande do Norde<br>\nClaudio Sacerdoti Coen, University of Bologna (PC Co-Chair)<br>\nUlrich Schöpp, fortiss GmbH<br>\nAlwen Tiu, Australian National University (PC Co-Chair)<br>\nTjark Weber, Uppsala University</p>",
        "id": 294827266,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661245059
    }
]