[
    {
        "content": "<p>From: Ulrich Berger &lt;<a href=\"mailto:U.Berger@swansea.ac.uk\">U.Berger@swansea.ac.uk</a>&gt;<br>\nBecause of late advertisement of the final call for contributions,<br>\nthe deadline for Russell'08 has been extended until Friday 7 March 2008.</p>\n<p>Final call for contributed talks and participation</p>\n<p>Russell'08</p>\n<p>Proof Theory meets Type Theory</p>\n<p>A \"Small Workshop\" of the European TYPES Project</p>\n<p>Swansea, Wales, 15-16 March 2008</p>\n<p><a href=\"http://cs.swan.ac.uk/~csetzer/russell08/index.html\">http://cs.swan.ac.uk/~csetzer/russell08/index.html</a></p>\n<p>In 1908 the British Philosopher and Mathematician Bertrand Russell,<br>\nwho was born and died in Wales, published the article \"Mathematical<br>\nLogic as based on the Theory of Types\" which contained a first matured<br>\nexposition of Type Theory.  In the same year, Ernst Zermelo's<br>\n\"Untersuchungen ueber die Grundlagen der Mengenlehre I\" introduced the<br>\nbasis of current axiomatic set theory as an alternative approach to<br>\nthe foundations of Mathematics.  A central theme of Proof Theory is to<br>\ncompare these different foundations.  Proof Theory uses as its main<br>\ntool ordinal notation systems, the basis of which was laid by Oswald<br>\nVeblen in his paper \"Continuous Increasing Functions of Finite and<br>\nTransfinite Ordinals\", again in 1908.</p>\n<p>A century later, Proof Theory and Type Theory are flourishing more<br>\nthan ever before, and their manifold interconnections are driving<br>\nimportant developments in Mathematics and Computer Science.</p>\n<p>At this workshop we meet and discuss cutting edge research at the<br>\ninterface of Proof Theory and Type Theory.</p>\n<p>Topics of interest include, but are not limited to:</p>\n<p>- Proof Theory of Type Theory<br>\n    - Relationship between Type Theory and Set Theory<br>\n    - Program extraction from proofs<br>\n    - Normalisation and Cut-elimination<br>\n    - New approaches to ordinal analysis<br>\n    - Universes and reflection principles<br>\n    - Equality in Type Theory<br>\n    - Philosophical and historical aspects<br>\n      of Proof Theory and Type Theory</p>\n<p>Invited Speakers:<br>\n         Erik Palmgren<br>\n         Wolfram Pohlers<br>\n         Michael Rathjen</p>\n<p>Participation and Contributed Talks:</p>\n<p>Please send an email to Anton Setzer (<a href=\"mailto:a.g.setzer@swansea.ac.uk\">a.g.setzer@swansea.ac.uk</a>)<br>\n   as soon as possible, but no later than the 7 March 2008.<br>\n   We will need an abstract as well, which will be published on the<br>\n   web site.<br>\n   There will be a fee (20 £) for coffee breaks and other expenses<br>\n   related to this workshop.</p>",
        "id": 294058814,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660822703
    }
]