[
    {
        "content": "<p>From: \"CRACIUN F.\" &lt;<a href=\"mailto:florin.craciun@durham.ac.uk\">florin.craciun@durham.ac.uk</a>&gt;<br>\nTASE 2009 - CALL FOR PARTICIPATION</p>\n<hr>\n<ul>\n<li>3rd IEEE International Symposium on</li>\n<li>Theoretical Aspects of Software Engineering</li>\n<li>(TASE 2009)</li>\n<li>29-31 July 2009, Tianjin, China</li>\n<li>\n<p><a href=\"http://www.dur.ac.uk/ieee.tase2009\">http://www.dur.ac.uk/ieee.tase2009</a>\n*</p>\n</li>\n<li>\n<p>Early Registration Deadline : 18 June 2009</p>\n</li>\n<li>For more information email: <a href=\"mailto:IEEE.TASE2009@durham.ac.uk\">IEEE.TASE2009@durham.ac.uk</a><br>\n<strong><strong><em><strong><em><strong><em><strong><em><strong><em><strong><em><strong><em>=</em></strong></em></strong></em></strong></em></strong></em></strong></em></strong></em></strong></strong><strong>*</strong><strong>*</strong>*</li>\n</ul>\n<p>TASE 2009 Invited Speakers<br>\n==========================</p>\n<p>Kim G. Larsen, Aalborg University, Denmark</p>\n<p>Zhong Shao, Yale University, USA</p>\n<p>Jin-Song Dong, National University of Singapore</p>\n<p>TASE 2009 Programme<br>\n====================</p>\n<p>Day 1: 29 July 2009</p>\n<hr>\n<p>Invited Talk:</p>\n<p>Verification and Performance Analysis of Embedded Systems<br>\nKim G. Larsen (Aalborg University)</p>\n<p>Session 1 : Real-Time and Embedded Systems</p>\n<p>Improving Responsiveness of Hard Real-Time Embedded Systems<br>\nHugh Anderson (Wellington Institute of Technology) and Siau-Cheng KHOO (National University of Singapore)  </p>\n<p>Environmental Simulation of Real-Time Systems with Nested Interrupts<br>\nGuoqiang Li (Shanghai Jiao Tong University), Shoji Yuen (Nagoya University) and Masakazu Adachi (Toyota Central R&amp;D Labs. INC.). </p>\n<p>Semantics for Communicating Actors with Interdependent Real-Time Deadlines<br>\nIstv¨¢n Knoll (Aalborg University), Anders P. Ravn (Aalborg University) and Arne Skou (Aalborg University). </p>\n<p>An Efficient Algorithm for Finding Empty Space for Reconfigurable Systems<br>\nZhenhua Duan (Xidian University) and Yan Xiao (Xidian University). </p>\n<p>Session 2 : Semantics</p>\n<p>State Visibility and Communication in Unifying Theories of Programming<br>\nAndrew Butterfield (Trinity College Dublin), Pawel Gancarski (Trinity College Dublin) and Jim Woodcock (University of York). </p>\n<p>Semantics of Metamodels in UML<br>\nLijun Shan (National University of Defence Technology) and Hong Zhu (Oxford Brookes University). </p>\n<p>Refinement Algebra with Explicit Probabilism<br>\nTahiry Rabehaja (UNU/IIST) and Jeffrey Sanders (UNU/IIST). </p>\n<p>Session 3 : Model Checking</p>\n<p>Environment Abstraction with State Clustering and Parameter Truncating<br>\nHong Pan (Institute of Software, Chinese Academy of Sciences), Yi Lv (Institute of Software, Chinese Academy of Sciences)  and Huimin Lin (Institute of Software, Chinese Academy of Sciences). </p>\n<p>Verification of Population Ring Protocols in PAT<br>\nYang Liu (National University of Singapore), Jun Pang (University of Luxembourg), Jun Sun (National University of Singapore) and Jianhua Zhao (Nanjing University). </p>\n<p>Bounded Model Checking of ACTL Formulae<br>\nWei Chen (Institute of Software, Chinese Academy of Sciences) and Wenhui Zhang (Institute of Software, Chinese Academy of Sciences). </p>\n<p>Day 2, 30 July 2009</p>\n<hr>\n<p>Invited Talk:</p>\n<p>Modular Development of Certified System Software<br>\nZhong Shao (Yale University)  </p>\n<p>Session 4: Specification and Security</p>\n<p>Coarse Grained Retrenchment and the Mondex Denial of Service Attacks<br>\nRichard Banach (Manchester University). </p>\n<p>Specifying and Enforcing Constraints of Artifact Life Cycles<br>\nXiangpeng Zhao (Peking University), Jianwen Su (University of California at Santa Barbara), Hongli Yang (Beijing University of Technology) and Zongyan Qiu (Peking University). </p>\n<p>Consistency Checking for LSC Specifications<br>\nHai-Feng Guo (University of Nebraska at Omaha), Wen Zheng (University of Nebraska at Omaha) and Mahadevan Subramaniam (University of Nebraska at Omaha). </p>\n<p>Integrating Specification and Programs for System Modeling and Verification<br>\nJun Sun (National University of Singapore), Yang Liu (National University of Singapore), Jin Song Dong (National University of Singapore) and Chunqing Chen (National University of Singapore). </p>\n<p>Session 5 : Software Testing I</p>\n<p>A Framework and  Language Support for Automatic Dynamic Testing of Workflow Management Systems<br>\nGwan-Hwan Hwang (National Taiwan Normal University), Che-Sheng Lin (National Taiwan Normal University), Li-Te Tsao (National Taiwan Normal University), Kuei-Huan Chen (National Taiwan Normal University) and Yan-You Li (National Taiwan Normal University). </p>\n<p>Fault-based Test Case Generation for Component Connectors<br>\nBernhard Aichernig (Graz University of Technology), Farhad Arbab (CWI), Lacramioara Astefanoaei (CWI), Frank de Boer (CWI), Meng Sun (CWI) and Jan Rutten (CWI). </p>\n<p>Test Data Generation for Derived Types in C Program<br>\nZheng Wang (East China Normal University), Xiao Yu (East China Normal University), Tao Sun (East China Normal University), Geguang Pu (East China Normal University) and Zuohua Ding (Zhejiang Sci-Tech University). </p>\n<p>Session 6 : Software Models</p>\n<p>Program Repair as Sound Optimization of Broken Programs <br>\nBernd Fischer (University of Southampton), Ando Saabas (Tallinn University of Technology) and Tarmo Uustalu (Tallinn University of Technology). </p>\n<p>Modeling Web Applications and Generating Tests: A Combination and Interactions-guided Approach <br>\nBo Song (Shanghai University) and Huaikou Miao (Shanghai University). </p>\n<p>Merging of Use Case Models: Semantic Foundations  <br>\nStephen Barrett (Concordia University), Daniel Sinnig (Concordia University), Patrice Chalin (Concordia University) and Greg Butler (Concordia University). </p>\n<p>Day 3, 31 July 2009</p>\n<hr>\n<p>Invited Tutorial:</p>\n<p>Towards Expressive Specification and Efficient Model Checking<br>\nJin Song Dong (National University of Singapore)</p>\n<p>Session 7 : Verification</p>\n<p>Verifying Semistructured Data Normalization using SWRL<br>\nYuan Fang Li (University of Queensland), Jing Sun (University of Auckland), Gillian Dobbie (University of Auckland), Scott Uk-Jin Lee (University of Auckland)  and Hai H. Wang (Aston University). </p>\n<p>Verifying Self-stabilizing Population Protocols with Coq<br>\nYuxin Deng (Shanghai Jiao Tong University) and Jean-fran?ois Monin (Universit¨¦ de Grenoble 1).</p>\n<p>The Logical Approach to Low-level Stack Reasoning<br>\nXinyu Jiang (University of Science and Technology of China), Yu Guo (University of Science and Technology of China) and Yiyun Chen (University of Science and Technology of China). </p>\n<p>Constructing Program Invariants via Solving QBF<br>\nShikun Chen (National University of Defence Technology), Zhoujun Li (Beihang University) and Mengjun Li (National University of Defence Technology). </p>\n<p>Session 8 : Concurrency </p>\n<p>Using Architectural Constraints for Deadlock-Freedom of Component Systems with Multiway Cooperation<br>\nMoritz Martens (University of Mannheim) and Mila Majster-Cederbaum (University of Mannheim). </p>\n<p>Formal Reasoning about Concurrent Assembly Code with Reentrant Locks<br>\nMing Fu (University of Science and Technology of China), Yu Zhang (University of Science and Technology of China) and Yong Li (University of Science and Technology of China). </p>\n<p>Algorithms for Computing Weak Bisimulation Equivalence<br>\nWeisong Li (Institute of Software, Chinese Academy of Sciences). </p>\n<p>Session 9 : Software Testing II</p>\n<p>Interpreting a Successful Testing Process: Risk and Actual Coverage<br>\nMarielle Stoelinga (University of Twente) and Mark Timmer (University of Twente). </p>\n<p>Automated Test Case Generation based on Coverage Analysis<br>\nTim A. Majchrzak (University of Muenster) and Herbert Kuchen (University of Muenster). </p>\n<p>Exploring Topological Structure of Boolean Expressions for Test Data Selection<br>\nLian Yu (Peking University), Wei Zhao (IBM China Research Lab), Xiangdong Fan (Peking University) and Jun Zhu (IBM China Research Lab). </p>\n<p>On Testing 1-Safe Petri Nets<br>\nGuy-Vincent Jourdan (University of Ottawa) and Gregor von Bochmann (University of Ottawa). </p>\n<p>The programme also include two poster sessions, comprising<br>\nof 23 selected poster presentations. This list of posters can <br>\nbe found at <a href=\"http://www.dur.ac.uk/ieee.tase2009/\">http://www.dur.ac.uk/ieee.tase2009/</a></p>",
        "id": 294078477,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660829844
    }
]