[
    {
        "content": "<p>From: Einar Broch Johnsen &lt;<a href=\"mailto:einarj@ifi.uio.no\">einarj@ifi.uio.no</a>&gt;<br>\n========================================================<br>\nOslo: PhD Position in Formal Methods for Sensor Networks<br>\n========================================================</p>\n<p>1 PhD position available at the Interventional Centre at<br>\nRikshospitalet and the Department of Informatics, University of Oslo<br>\nwithin the research project: </p>\n<p>CONNECT: Active Behavioral Interfaces for Seamless Network Integration</p>\n<p>The main objective of the CONNECT project is to develop a framework<br>\nfor the modeling and analysis of heterogeneous networks in which<br>\ndevices may connect seamlessly in a semantically meaningful way. The<br>\nproject involves an extended case study of biomedical sensor networks<br>\nfor patient monitoring.  More information on the CONNECT project can<br>\nbe found at the following webpage:</p>\n<p><a href=\"http://www.ifi.uio.no/forskning/grupper/pma/connect\">http://www.ifi.uio.no/forskning/grupper/pma/connect</a></p>\n<p>The candidate is expected to work on the design and application of<br>\nbehavioral interfaces as a construct for seamless adaptation in<br>\nheterogeneous networks.  The candidate will collaborate closely with<br>\nthe staff at the Interventional Centre at Rikshospitalet in the<br>\ndevelopment of a case study on heterogeneous nets for patient<br>\nmonitoring.  The candidate is also expected to participate in the<br>\ndevelopment of a formal model for active behavioral interfaces and on<br>\ntechniques for validating objects with respect to active behavioral<br>\ninterfaces, in collaboration with researchers at the Department of<br>\nInformatics.</p>\n<p>The candidate should have a background in either software engineering,<br>\nconcurrency, and formal methods, or in signal processing and sensor<br>\nnetworks, and will be expected to acquire knowledge in the other<br>\ndiscipline. The PhD candidate should have at least a master degree in<br>\ncomputer science.</p>\n<p>Terms of employment</p>\n<hr>\n<p>The position is available for 3 years from August 1, 2007, or as soon<br>\nas possible after this date.</p>\n<p>Pay grade:   43-48 (NOK 325800 - 355200) <br>\n           (Norwegian LTR scale, depending on qualifications)</p>\n<p>Further details</p>\n<hr>\n<p>For further information, please contact</p>\n<p>Professor Ilangko Balasingham, email: <a href=\"mailto:ilangkob@ulrik.uio.no\">ilangkob@ulrik.uio.no</a>, <br>\nassociate professor Einar Broch Johnsen, email: <a href=\"mailto:einarj@ifi.uio.no\">einarj@ifi.uio.no</a>, or <br>\nprofessor Olaf Owe, email: <a href=\"mailto:olaf@ifi.uio.no\">olaf@ifi.uio.no</a></p>\n<p>How to apply</p>\n<hr>\n<p>Applications must include complete information about education at both<br>\nbachelor and master level, and documented scientific experience. All<br>\nemployees must satisfy the entrance requirements for the doctoral<br>\ndegree programme at the Faculty of Mathematics and Natural Sciences.<br>\nWomen are especially encouraged to apply.</p>\n<p>To apply, please send a statement of your interest, together with<br>\ncurriculum vitae, and complete information about your education (both<br>\nbachelor and master level) with transcripts of grades, job experience,<br>\nscientific publications, and at least two academic references (name,<br>\nemail, and phone no), and possibly a list of publications to</p>\n<p>University of Oslo, Faculty of Mathematics and Natural Sciences<br>\natt. Grete Andresen  (ref 07/5502)<br>\nPO Box 1032 Blindern,<br>\nNO-0315 Oslo, NORWAY</p>\n<p>Applications may also be submitted electronically to<br>\nEinar Broch Johnsen, email: <a href=\"mailto:einarj@ifi.uio.no\">einarj@ifi.uio.no</a></p>\n<p>Deadline for applications:  June 1, 2007</p>\n<p>The formal announcement of the position is available from </p>\n<p><a href=\"http://heim.ifi.uio.no/~einarj/ConnectStip2.pdf\">http://heim.ifi.uio.no/~einarj/ConnectStip2.pdf</a></p>\n<p>Application papers will not be returned, with the exception of<br>\noriginal publications.</p>",
        "id": 294048965,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660818535
    }
]