[
    {
        "content": "<p>From: Sergey Berezin &lt;<a href=\"mailto:Sergey.Berezin@synopsys.com\">Sergey.Berezin@synopsys.com</a>&gt;<br>\nWoody Bledsoe Student Travel Award: Call for Nominations</p>\n<p>IJCAR'06       <a href=\"http://ijcar06.uni-koblenz.de/\">http://ijcar06.uni-koblenz.de/</a></p>\n<p>Peter Baumgartner<br>\n(On behalf of the CADE Inc. Board of Trustees)</p>\n<p>The Woody Bledsoe Student Travel Award was created to honor the memory<br>\nof Woody Bledsoe, for his contributions to mathematics, artificial<br>\nintelligence, and automated theorem proving, and for his dedication to<br>\nstudents.</p>\n<p>The award is intended to enable selected students to attend the<br>\nInternational Conference on Automated Deduction (CADE) or the<br>\nInternational Joint Conference on Automated Reasoning (IJCAR),<br>\nwhichever is scheduled for the year, by covering much of their<br>\nexpenses.</p>\n<p>In 2006, IJCAR will take place from August 17 through 20, in Seattle,<br>\nUSA, as part of the Federated Logic Conference (FLoC). <br>\nFor further information see <a href=\"http://ijcar06.uni-koblenz.de/\">http://ijcar06.uni-koblenz.de/</a> .</p>\n<p>The winners will be reimbursed (up to some maximum amount to be<br>\ndetermined, usually around US$ 500 - US$ 750) for their conference<br>\nregistration, transportation, and accomodation expenses. Preference<br>\nwill be given to students who will play an active role in the<br>\nconference, including satellite workshops, and do not have alternative<br>\nfunding. However, also students in other situations are very much<br>\nencouraged to apply.  A nomination consists of a recommendation letter<br>\nof up to 300 words from the student's supervisor. Nominations for<br>\nIJCAR 2006 should be sent by e-mail to Peter Baumgartner<br>\n(<a href=\"mailto:Peter.Baumgartner@nicta.com.au\">Peter.Baumgartner@nicta.com.au</a>).<br>\nNominations must arrive no later than</p>\n<p>June 15, 2006</p>\n<p>and the winners will be notified by June 30 (the early registration<br>\ndeadline for FLoC'06 is July 10). The awards will be presented at<br>\nIJCAR; in case a winner does not attend, the chairs and trustees may<br>\ntransfer the award to another nominee or give no award.</p>",
        "id": 293911118,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660747443
    }
]