[
    {
        "content": "<p>From: Tom Ridge &lt;<a href=\"mailto:tjr22@cam.ac.uk\">tjr22@cam.ac.uk</a>&gt;<br>\nDear All,</p>\n<p>Larry Paulson's project to integrate external provers (vampire, E, <br>\nspass) with Isabelle is in a usable state in the current development <br>\nversions. In tests, it seems to work pretty well. It's performance far <br>\nsurpasses auto, force, and blast in my opinion (at least for the goals <br>\nI've looked at).</p>\n<p>At the moment, one gives a command, ProofGeneral.call_atp, which returns <br>\n  with the goals that are proved. Unfortunately, this does not progress <br>\nthe proof :(</p>\n<p>What would be truly useful (for me, and I presume others) is a way to <br>\ncall the external prover as a tactic, e.g.</p>\n<p>apply(vampire add: lemma1 lemma2 ...)</p>\n<p>Ideally this should operate on the current goal, not on all goals (i.e. <br>\nforce rather than auto), and use only the lemmas supplied (not all the <br>\nlibrary lemmas, which is what happens currently- maybe this could be and <br>\noption to the apply call).</p>\n<p>Unfortunately, my understanding of Isabelle is not sufficient to allow <br>\nme to code this interface myself. But surely there is someone who could <br>\ndo this? I feel it would have significant benefits for the entire community.</p>\n<p>Is there someone who could do this?</p>\n<p>Thanks</p>\n<p>Tom</p>",
        "id": 294046152,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660817360
    },
    {
        "content": "<p>From: Lawrence Paulson &lt;<a href=\"mailto:lp15@cam.ac.uk\">lp15@cam.ac.uk</a>&gt;<br>\nThanks for your message. As you know, this work is still in progress,  <br>\nand the tool only delivers advice. At present, you can use it to find  <br>\nout which of the 6000+ theorems known to Isabelle are sufficient to  <br>\nprove your subgoal.</p>\n<ul>\n<li>\n<p>The most important task (undertaken by Kong Woei Susanto) is to  <br>\nport Joe Hurd's metis prover to Isabelle. Then the tool will be able  <br>\nto display an appropriate series of calls to metis, for proving the  <br>\nsubgoal within Isabelle. I hope this will be finished in a month or two.</p>\n</li>\n<li>\n<p>We also need a button in Proof General so that users don't have to  <br>\ntype \"ProofGeneral.call_atp\". I don't know when that will be ready.</p>\n</li>\n<li>\n<p>Much other tuning will also be necessary, e.g. for issues like  <br>\nwhether to work on just the first subgoal, or whether to accept hints  <br>\nfrom the user about which lemmas to use.</p>\n</li>\n</ul>\n<p>An oracle that simply accepts the output of an automatic theorem  <br>\nprover would be risky, due to the complexity of the system and the  <br>\ninformation loss in the translations. Proof reconstruction catches  <br>\nany such errors, and also eliminates the need to run expensive ATP  <br>\ncalls repeatedly. Even so, Jia Meng has written oracle-based methods  <br>\nsuch as you describe.</p>\n<p>We are already working on these things, but there are the CADE  <br>\ndeadlines too, and I don't know how to make things happen any faster.</p>\n<p>More details on the linkup are here: &lt;<a href=\"http://www.cl.cam.ac.uk/\">http://www.cl.cam.ac.uk/</a> <br>\nresearch/hvg/Isabelle/atp-linkup.html&gt;</p>\n<p>Larry</p>",
        "id": 294046215,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660817392
    },
    {
        "content": "<p>From: Tom Ridge &lt;<a href=\"mailto:tjr22@cam.ac.uk\">tjr22@cam.ac.uk</a>&gt;<br>\nDear All,</p>\n<p>I received this from Jia, which seems to fit the bill.</p>\n<p>Thanks</p>\n<p>Tom</p>",
        "id": 294046376,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660817440
    },
    {
        "content": "<p>From: Lawrence Paulson &lt;<a href=\"mailto:lp15@cam.ac.uk\">lp15@cam.ac.uk</a>&gt;<br>\nThis command has recently been renamed to sledgehammer, which is more  <br>\nevocative.</p>\n<p>With recent versions of PG, invoke with Isabelle &gt; Commands &gt;  <br>\nsledgehammer.</p>\n<p>Larry</p>",
        "id": 294049455,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660818778
    },
    {
        "content": "<p>From: Till Mossakowski &lt;<a href=\"mailto:Till.Mossakowski@dfki.de\">Till.Mossakowski@dfki.de</a>&gt;<br>\nWith the following script:</p>\n<p>theory Scratch<br>\nimports Main<br>\nbegin<br>\ntheorem test : \"A--&gt;A\"<br>\nproof -<br>\nProofGeneral.call_atp</p>\n<p>I get the follwowing response:<br>\n*** Outer syntax error: end of input expected,<br>\n*** but long identifier \"ProofGeneral.call_atp\" was found</p>\n<p>I am using Isabelle_May_21_2007.<br>\nWhat goes wrong?</p>\n<p>Till Mossakowski</p>\n<p>Lawrence Paulson schrieb:</p>",
        "id": 294049472,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660818785
    }
]