[
    {
        "content": "<p>From: Joachim Breitner &lt;<a href=\"mailto:breitner@kit.edu\">breitner@kit.edu</a>&gt;<br>\nHi,</p>\n<p>I might have the opportunity to offer a workshop of 2 days to motivated<br>\nand gifted highschool students aged 15-18, and I’m considering to<br>\nbringing the joy of the world’s most geekiest computer game, i.e.<br>\ninteractive theorem proving, to them.</p>\n<p>Clearly, it is a challenge to simplify and reduce the task enough so<br>\nthat they can get something done in two days, and both the area (“just”<br>\npredicate logic? something with naturals? geometry?) and the tools<br>\n(Isabelle? Agda? Brunhilde (<em>g</em>)? something specialized?) need to be<br>\nchosen well.</p>\n<p>Has anyone here attempted something of that kind before?</p>\n<p>Do you know of theorem provers tailored to, or at lest suitable for,<br>\nhighschool students? Possibly some where you can build (simple) proofs<br>\nby dragging and dropping boxes somehow?</p>\n<p>Thanks,<br>\nJoachim<br>\n<a href=\"/user_uploads/14278/jE4K7O7hvAWQyp4Xsj3mL9So/signature.asc\">signature.asc</a></p>",
        "id": 294643926,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661163249
    },
    {
        "content": "<p>From: \"Elsa L. Gunter\" &lt;<a href=\"mailto:egunter@illinois.edu\">egunter@illinois.edu</a>&gt;<br>\nDear Joachim,<br>\n   You might take a look at Tarski's World, which has been used <br>\nsuccessfully for a similar audience.  It gives an introduction to <br>\nfirst-order logic.  It might give you some ideas how to organize things.<br>\n---Elsa</p>",
        "id": 294643944,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661163259
    },
    {
        "content": "<p>From: Larry Paulson &lt;<a href=\"mailto:lp15@cam.ac.uk\">lp15@cam.ac.uk</a>&gt;<br>\nIn my opinion, pure predicate logic will come across as boring and dry. The most understandable problems would be puzzles in propositional logic, for which SAT solvers are much more appropriate than any interactive tool.</p>\n<p>I suggest something from recreational mathematics, such as Fibonacci numbers and basic facts about them. If these students are familiar with induction, then you could prove some simple facts about the Fibonacci numbers. Possible alternatives include the GCD function and Ackermann’s function.</p>\n<p>An alternative might be to teach a tiny bit of functional programming, along with proofs.</p>\n<p>In both cases, you may be able to get away with equational logic, especially through the magic of assumes/shows.</p>\n<p>Larry Paulson</p>",
        "id": 294643965,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661163267
    }
]