[
    {
        "content": "<p>From: <a href=\"mailto:ailab@leary.csoft.net\">ailab@leary.csoft.net</a></p>\n<hr>\n<p>By popular request, the submission deadline<br>\nis extended to April 10, 2008</p>\n<hr>\n<p>CALL FOR PAPERS<br>\n===============</p>\n<p>FCS-ARSPA-WITS'08</p>\n<p>Joint Workshop on<br>\nFoundations of Computer Security,<br>\nAutomated Reasoning for Security Protocol Analysis, and<br>\nIssues in the Theory of Security</p>\n<p><a href=\"http://profs.sci.univr.it/~vigano/fcs-arspa-wits08/\">http://profs.sci.univr.it/~vigano/fcs-arspa-wits08/</a></p>\n<p>June 21-22, 2008<br>\nPittsburgh, PA, USA</p>\n<p>Affiliated with LICS 2008 and CSF 21</p>\n<p>IMPORTANT DATES<br>\n===============</p>\n<p>Papers due:   April 10 (was: March 30)<br>\nNotification: May 16<br>\nFinal papers: June 01</p>\n<p>SCOPE<br>\n=====</p>\n<p>The aim of the joint workshop FCS-ARSPA-WITS'08 is to provide a forum<br>\nfor continued activity in different areas of computer security,<br>\nbringing computer security researchers in closer contact with the LICS<br>\ncommunity and giving LICS attendees an opportunity to talk to experts<br>\nin computer security, on the one hand, and contribute to bridging the<br>\ngap between logical methods and computer security foundations, on the<br>\nother.</p>\n<p>We are interested both in new results in theories of computer security<br>\nand also in more exploratory presentations that examine open questions<br>\nand raise fundamental concerns about existing theories, as well as in<br>\nnew results on developing and applying automated reasoning techniques<br>\nand tools for the formal specification and analysis of security<br>\nprotocols. We thus solicit submissions of papers both on mature work<br>\nand on work in progress.</p>\n<p>Possible topics include, but are not limited to:</p>\n<p>Automated reasoning techniques, Composition issues, Formal<br>\nspecification, Foundations of verification, Information flow analysis,<br>\nLanguage-based security, Logic-based design, Program transformation,<br>\nSecurity models, Static analysis, Statistical methods, Tools, Trust<br>\nmanagement</p>\n<p>for</p>\n<p>Access and resource usage control, Authentication, Availability and<br>\ndenial of service, Covert channels, Confidentiality, Integrity and<br>\nprivacy, Intrusion detection, Malicious code, Mobile code, Mutual<br>\ndistrust, Privacy, Security policies, Security protocols</p>\n<p>WITS is the official annual workshop organised by the IFIP WG 1.7 on<br>\n\"Theoretical Foundations of Security Analysis and Design\", established<br>\nto promote the investigation on the theoretical foundations of<br>\nsecurity, discovering and promoting new areas of application of<br>\ntheoretical techniques in computer security and supporting the<br>\nsystematic use of formal techniques in the development of security<br>\nrelated applications. This is the eighth meeting in the series.</p>\n<p>The workshop FCS continues a tradition, initiated with the Workshops<br>\non Formal Methods and Security Protocols (FMSP) in 1998 and 1999, then<br>\nwith the Workshop on Formal Methods and Computer Security (FMCS) in<br>\n2000, and finally with the LICS satellite Workshop on Foundations of<br>\nComputer Security (FCS) in 2002 through 2005, of bringing together<br>\nformal methods and the security community.</p>\n<p>ARSPA is a series of workshops on Automated Reasoning for Security<br>\nProtocol Analysis, bringing together researchers and practitioners<br>\nfrom both the security and the formal methods communities, from<br>\nacademia and industry, who are working on developing and applying<br>\nautomated reasoning techniques and tools for the formal specification<br>\nand analysis of security protocols. The first two ARSPA workshops were<br>\nheld as satellite events of the 2nd International Joint Conference on<br>\nAutomated Reasoning (IJCAR'04) and of the 32nd International<br>\nColloquium on Automata, Languages and Programming (ICALP'05),<br>\nrespectively.</p>\n<p>FCS and ARSPA have been joining forces since 2006: FCS-ARSPA'06 was<br>\naffiliated with LICS'06, in the context of FLoC'06, and FCS-ARSPA'07<br>\nwas affiliated with LICS'07 and ICALP'07.</p>\n<p>SUBMISSION<br>\n==========</p>\n<p>All submissions will be peer-reviewed. Authors of accepted papers must<br>\nguarantee that their paper will be presented at the workshop.</p>\n<p>Submissions should be at most 15 pages (a4paper, 11pt), including<br>\nreferences.  The cover page should include title, names of authors,<br>\nco-ordinates of the corresponding author, an abstract, and a list of<br>\nkeywords. Submissions that are clearly too long may be rejected<br>\nimmediately.  Additional material intended for the referees but not<br>\nfor publication in the final version - for example details of proofs -<br>\nmay be placed in a clearly marked appendix that is not included in the<br>\npage limit.</p>\n<p>Authors are invited to submit their papers electronically, as portable<br>\ndocument format (pdf) or postscript (ps); please, do not send files<br>\nformatted for work processing packages (e.g., Microsoft Word or<br>\nWordperfect files).</p>\n<p>Submission instructions will be published shortly on the workshop's<br>\nwebpage.</p>\n<p>PUBLICATION<br>\n===========</p>\n<p>Informal proceedings will be made available in electronic format and<br>\nthey will be distributed to all participants of the workshop.</p>\n<p>Moreover, workshop participants will be invited to submit full<br>\nversions of their papers to a special issue of the Journal of<br>\nAutomated Reasoning, which will be open also to non-participants, in<br>\nall cases with fresh reviewing.</p>\n<p>PROGRAM COMMITTEE<br>\n=================</p>\n<p>Alessandro Aldini (Universita<code> di Urbino, Italy)\nAlessandro Armando (Universita</code> di Genova, Italy)<br>\nMichael Backes (Universitaet des Saarlandes, Germany)<br>\nLujo Bauer (CMU, USA; co-chair)<br>\nVeronique Cortier (LORIA INRIA-Lorraine, France)<br>\nCas Cremers (ETH Zurich, Switzerland)<br>\nPierpaolo Degano (Universita<code> di Pisa, Italy)\nSandro Etalle (T. University of Eindhoven, The Netherlands; co-chair)\nRiccardo Focardi (Universita</code> di Venezia, Italy)<br>\nDieter Gollman (Technische Universitaet Hamburg-Harburg, Germany)<br>\nJerry den Hartog (T. University of Eindhoven, The Netherlands; co-chair)<br>\nJan Juerjens (The Open University, UK)<br>\nRalf Kuesters (Universitaet Trier, Germany)<br>\nGavin Lowe (Oxford University, UK)<br>\nCatherine Meadows (Naval Research Laboratory, USA)<br>\nSebastian Moedersheim (IBM Zurich Research Lab, Switzerland)<br>\nMark Ryan (University of Birmingham, UK)<br>\nLuca Vigano<code> (Universita</code> di Verona, Italy; co-chair)<br>\nSteve Zdancewic (University of Pennsylvania, USA)</p>",
        "id": 294059003,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660822801
    }
]