[
    {
        "content": "<p>From: René Thiemann &lt;<a href=\"mailto:rene.thiemann@uibk.ac.at\">rene.thiemann@uibk.ac.at</a>&gt;<br>\nDear all,</p>\n<p>we just spent one hour to detect why a singleton entry in the AFP compiled successfully, <br>\nwhereas just adding this entry within a larger development resulted in an error.</p>\n<p>The problem would have been easy to detect, provided there would have been any warning message<br>\nthat there are two theories called \"Auxiliary\" where silently only the one theory is kept. <br>\nHowever, starting isabelle build -v ... just complained about some unknown facts, which at least <br>\nto us did not at all point to real error of the name clash.<br>\n(We imported none of the \"Auxiliary\"-theories directly)</p>\n<p>In order to ease such debugging in the future, we would appreciate any integration of warning messages<br>\nin the case of name clashes of theories.</p>\n<p>Kind regards,<br>\nChris and René</p>",
        "id": 294269262,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660916648
    },
    {
        "content": "<p>From: Andreas Lochbihler &lt;<a href=\"mailto:andreas.lochbihler@inf.ethz.ch\">andreas.lochbihler@inf.ethz.ch</a>&gt;<br>\nSeconded. I also ran into this problem a few times.</p>\n<p>Andreas</p>",
        "id": 294269280,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660916655
    },
    {
        "content": "<p>From: Lawrence Paulson &lt;<a href=\"mailto:lp15@cam.ac.uk\">lp15@cam.ac.uk</a>&gt;<br>\nThe theory loader indeed doesn’t cope with this situation very well. The namespace for theory names is completely global. The only sure remedy for the moment is to avoid generic theory names, and Auxiliary is a perfect example.</p>\n<p>Larry Paulson</p>",
        "id": 294269300,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660916661
    },
    {
        "content": "<p>From: Peter Lammich &lt;<a href=\"mailto:lammich@in.tum.de\">lammich@in.tum.de</a>&gt;</p>\n<blockquote>\n<p>Seconded. I also ran into this problem a few times.</p>\n<p>Me too.</p>\n</blockquote>\n<p>For me, its an indication that Isabelle's simple name-space model is not<br>\nadequate for programming in the large, but it is exactly that what we do<br>\nin some of our developments, depending on &gt;10 AFP-entries.</p>",
        "id": 294269312,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660916667
    },
    {
        "content": "<p>From: René Thiemann &lt;<a href=\"mailto:rene.thiemann@uibk.ac.at\">rene.thiemann@uibk.ac.at</a>&gt;</p>\n<blockquote>\n<blockquote>\n<p>Seconded. I also ran into this problem a few times.</p>\n<p>Me too.</p>\n</blockquote>\n</blockquote>\n<p>Thanks for your agreements.</p>\n<blockquote>\n<p>For me, its an indication that Isabelle's simple name-space model is not<br>\nadequate for programming in the large, but it is exactly that what we do<br>\nin some of our developments, depending on &gt;10 AFP-entries.</p>\n</blockquote>\n<p>Indeed, a more structured name-space model would of course be most welcome,<br>\nbut I imagine this would be a larger effort than just a adding a warning message.</p>\n<p>Kind regards,<br>\nRené</p>\n<p>PS: We are currently depending on 14 AFP-entries.</p>",
        "id": 294269345,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660916679
    },
    {
        "content": "<p>From: Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt;<br>\n\"Auxiliary\" is indeed a bad name, although a slight improvement over the <br>\n\"Aux\" that was there before, which causes strange effects on Windows that <br>\nare worth a long carnival session.  (As everybody knows, \"AUX\", \"COM\", <br>\n\"PRN\" are special, and neither case nor file extensions count here.)</p>\n<p>Actual theory names are indeed global, but we have to cope with some odd <br>\nfeature add-ons for many years, which pretend that theories do have some <br>\nqualification (via directory structure), although they don't.  This <br>\nmismatch causes many problems.</p>\n<p>Mizar and Wikipedia are large projects that cope with a flat name space, <br>\nbut we are computer-scientists so structured names appear more natural. <br>\nI am actually making concrete moves towards properly qualified theory <br>\nnames since 10 years, although that is often forgotten and sometimes hard <br>\nto believe. (Many recent tools will break when the theory name space <br>\nitself becomes qualified.  Moreover we have more than one place to look: <br>\nthe theory loader for TTY or Proof General is different from batch build, <br>\nand that is also different from interactive PIDE.)</p>\n<p>I have now made one round of looking, if it is feasible to make more <br>\nchecks, without getting the theory name space really right.  Some minor <br>\nimprovements might emerge for the coming release, but bigger steps<br>\nare still unclear.</p>\n<p>Makarius</p>",
        "id": 294270416,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660917023
    }
]