[
    {
        "content": "<p>From: Ken Kubota &lt;<a href=\"mailto:mail@kenkubota.de\">mail@kenkubota.de</a>&gt;<br>\nDear Members of the Research Community,</p>\n<p>For the purpose of implementing Peter B. Andrews' logic Q0 as presented in his <br>\nstandard work on higher-order logic titled \"An Introduction to Mathematical <br>\nLogic and Type Theory: To Truth Through Proof\" within the Isabelle proof <br>\nassistant software, I am looking for experts who are familiar with Isabelle and <br>\nwho would be interested in this project.</p>\n<p>The higher-order logic Q0 has an extremely high level of <br>\nformalization/mechanization (the rules applied in each single step are <br>\nexplicitly specified [cf. Andrews, 2002, pp. 215 ff.]), and virtually all of <br>\nmathematics is reduced to formal logic according to Russell's and Whitehead's <br>\nidea of logicism. The universality of Q0 as a foundation of mathematics is <br>\npreserved by its independence of philosophical assumptions such as the semantic <br>\napproach of model theory, as the single rule of inference (substitution, from <br>\nwhich the rule of modus ponens is derived) is a purely syntactical rule. <br>\nTechnically, Q0 is typed lambda calculus in the form of a simple type theory <br>\n(i.e., without type variables) and an axiomatic (Hilbert-style) deductive <br>\nsystem with identity (equality) as the main notion, hence an improved <br>\nformulation of Church's type theory [Church, 1940; cf. Andrews, 2006], which is <br>\nknown for its \"precise formulation of the syntax\" [Paulson, 1989, p. 5]. <br>\nFeaturing lambda calculus with the single variable binder lambda and \"only four <br>\nseparate kinds of primitive terms: variables, constants, function applications <br>\nand [lambda]-abstractions\" [Gordon, 2000, p. 179], Q0 requires only two basic <br>\ntypes (individuals and truth values) and only two basic constants <br>\n(identity/equality and its counterpart, description) in order to obtain <br>\ndefinability of all of the propositional connectives, as well as all of the <br>\nquantifiers (universal, existential and uniqueness quantifier) and provability <br>\nof elementary logic on the basis of only five logical axioms, and formalized <br>\nnumber theory (with a non-logical axiom of infinity), thus reducing the <br>\nlanguage of formal logic and mathematics to a minimal set of basic notions.</p>\n<p>The general intent is to obtain a system with the highest level of <br>\nformalization and accuracy and with the expressiveness required for <br>\nformalization (of most or all) of mathematics such that the mathematician, <br>\nlogician or philosopher can easily work with it whilst avoiding the burden of <br>\ntechnical details (i.e., software configuration or programming languages) <br>\nwithout compromising logical necessity or otherwise weakening logical rigor.</p>\n<p>The implementation of Q0 should be exactly as specified in [Andrews, 2002, pp. <br>\n210-215] (as a Hilbert-style system). A short description is available online <br>\nat [Andrews, 2006]:<br>\n<a href=\"http://plato.stanford.edu/entries/type-theory-church/#ForBasEqu\">http://plato.stanford.edu/entries/type-theory-church/#ForBasEqu</a></p>\n<p>According to a recent e-mail by Lawrence C. Paulson, an implementation of Q0 as <br>\na Hilbert-style system (as a special case within natural deduction) in Isabelle <br>\nshould be possible.</p>\n<p>The paper \"A Formulation of the Simple Theory of Types (for Isabelle)\" by <br>\nPaulson, in which Q0 is mentioned (\"Andrews [1] presents a formulation based on <br>\nequality.\" [Paulson, 1989, p. 14]) and in which simple type theory is <br>\nimplemented, but as a natural deduction system, may serve as a basis.</p>\n<p>If you would like to find out more about this project, please contact me via my <br>\nwebsite (see below).</p>\n<p>Ken Kubota</p>\n<p>References</p>\n<p>Andrews, Peter B. (2002), An Introduction to Mathematical Logic and Type <br>\nTheory: To Truth Through Proof. Second edition. Dordrecht / Boston / London: <br>\nKluwer Academic Publishers. ISBN 1-4020-0763-9. DOI: 10.1007/978-94-015-9934-4.</p>\n<p>Andrews, Peter B. (2006), \"Church's Type Theory\". In: Stanford Encyclopedia of <br>\nPhilosophy. Ed. by Edward N. Zalta. Available online at <br>\n<a href=\"http://plato.stanford.edu/entries/type-theory-church/\">http://plato.stanford.edu/entries/type-theory-church/</a> (July 25, 2015).</p>\n<p>Church, Alonzo (1940), \"A Formulation of the Simple Theory of Types\". In: <br>\nJournal of Symbolic Logic 5, pp. 56-68.</p>\n<p>Gordon, Mike (2000), \"From LCF to HOL: A Short History\". In: Proof, Language, <br>\nand Interaction. Ed. by Gordon Plotkin, Colin Stirling, and Mads Tofte. <br>\nCambridge, MA et al.: MIT Press, pp. 169-185.</p>\n<p>Paulson, Lawrence C. (1989), \"A Formulation of the Simple Theory of Types (for <br>\nIsabelle)\". Available online at <br>\n<a href=\"https://www.cl.cam.ac.uk/techreports/UCAM-CL-TR-175.pdf\">https://www.cl.cam.ac.uk/techreports/UCAM-CL-TR-175.pdf</a> (July 25, 2015).</p>\n<hr>\n<p>Ken Kubota<br>\ndoi: 10.4444/100<br>\n<a href=\"http://dx.doi.org/10.4444/100\">http://dx.doi.org/10.4444/100</a></p>",
        "id": 294648063,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661164931
    },
    {
        "content": "<p>From: Ramana Kumar &lt;<a href=\"mailto:rk436@cam.ac.uk\">rk436@cam.ac.uk</a>&gt;<br>\nPlease forgive me because I have not fully understood the motivations<br>\nbehind this project, and I do not want to criticise it unfairly. But I do<br>\nwant to make an observation.</p>\n<p>As I understand it, Q0 is in some sense equivalent to the \"HOL\" that is<br>\nalready formalised in Isabelle (i.e., Isabelle/HOL), and almost all of the<br>\nvirtues of Q0 mentioned in your email apply also to that formalisation.<br>\nIndeed there already exists substantial formalisations of mathematics and<br>\ncomputer science in Isabelle/HOL.</p>\n<p>Furthermore, there are already several variations of theorem provers<br>\nimplementing a roughly equivalent logic. The ones I can name off the top of<br>\nmy head include: Isabelle/HOL, HOL4, HOL Light, ProofPower/HOL, HOL Zero,<br>\nand Mosquito. The OpenTheory project could be considered another variation,<br>\nor as a step towards unification: it defines a standard library and an<br>\ninterface format aimed at sharing formal developments between all these<br>\nvariations of HOL.</p>\n<p>There may be very good reasons to implement Q0 following Andrews's<br>\noriginal, historical and elegant, approach. But if there happen not to be<br>\nany motivations beyond increasing the proliferation of implementations of<br>\nHOL, I would be wary of doing it.</p>",
        "id": 294648101,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661164949
    }
]