[
    {
        "content": "<p>From: José Manuel Rodriguez Caballero &lt;<a href=\"mailto:josephcmac@gmail.com\">josephcmac@gmail.com</a>&gt;<br>\nDear Manuel,<br>\n  Thank you by your reference. After looking for \"Corrigendum\" in Elsevier<br>\nwebsite, I found the following mathematical paper with an gap:</p>\n<p>Pelantová, E., and Š. Starosta. \"On Brlek-Reutenauer conjecture.\"<br>\nTheoretical Computer Science 41.412 (2011): 5649-5655.</p>\n<p>the correction is here:<br>\n<a href=\"https://www.sciencedirect.com/science/article/pii/S0304397512008237\">https://www.sciencedirect.com/science/article/pii/S0304397512008237</a></p>\n<p>Nevertheless, this mistake was not found using a proof assistant, so it do<br>\nnot count. By the way, S. Brlek and C. Reutenauer were my research advisor<br>\nduring my Master degree. The complete list of Corrigendum is here:<br>\n<a href=\"https://www.sciencedirect.com/search/advanced?qs=Corrigendum&amp;origin=article&amp;zone=qSearch\">https://www.sciencedirect.com/search/advanced?qs=Corrigendum&amp;origin=article&amp;zone=qSearch</a></p>\n<p>Another interesting source of gaps is Solomon Lefschetz' first<br>\ncomprehensive treatise on topology, a highly influential book in which he<br>\ncoined the term \"algebraic topology,\" hardly contains one completely<br>\ncorrect proof. It was rumored that it had been written during one of<br>\nLefschetz' sabbaticals ... when his students did not have the opportunity<br>\nto revise it. He was a genius, but legend had it that he never wrote a<br>\ncorrect proof or stated an incorrect theorem.</p>\n<p>In the case of journals for high school and undergraduate students like The<br>\nMathematical Gazette or American Mathematical Monthly, it is important to<br>\nnotice the mistakes and to inform to the editor in order to contribute to<br>\nthe education of the new generations.</p>\n<p>Kind Regards,<br>\nJose M.</p>\n<p>Message: 2</p>",
        "id": 294737183,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661190215
    }
]