[
    {
        "content": "<p>From: John Munroe &lt;<a href=\"mailto:munddr@gmail.com\">munddr@gmail.com</a>&gt;<br>\nHi,</p>\n<p>I have a general theorem proving/logic question: does it make sense to<br>\nhave a proof obligation that checks for unprovability? For example,<br>\nthe proof obligation may require that a particular sentence, like \"f =<br>\ng\" to be unprovable from a theory T, i.e. \"T |+ f = g\". Checking for<br>\nunprovability is undecidable, right? If such a constraint is<br>\nimpractical, then is there a more practical formulation for checking<br>\nthe same/similar property?</p>\n<p>Thanks a lot<br>\nJohn</p>",
        "id": 294133150,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660843531
    },
    {
        "content": "<p>From: <a href=\"mailto:Mark.Janney@gdc4s.com\">Mark.Janney@gdc4s.com</a><br>\nYou could try to exhibit a model of T in which 'f = g' holds and then<br>\nexhibit another model of T in which 'f = g' does not hold.  That's how<br>\nthe 'parallel postulate' of Euclidian geometry was shown to be<br>\nunprovable from the other axioms.</p>",
        "id": 294133178,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660843541
    },
    {
        "content": "<p>From: John Thingstad &lt;<a href=\"mailto:jpthing@online.no\">jpthing@online.no</a>&gt;<br>\nYes it makes sense.. In stead of me going into detail I suggest you read<br>\nthe short document the link points to.</p>\n<p><a href=\"http://www.cs.umd.edu/~gasarch/largeramsey/bovINTRO.pdf\">www.cs.umd.edu/~gasarch/largeramsey/bovINTRO.pdf</a></p>",
        "id": 294133201,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660843547
    },
    {
        "content": "<p>From: Timothy McKenzie &lt;<a href=\"mailto:tjm1983@gmail.com\">tjm1983@gmail.com</a>&gt;<br>\nI'm currently doing this in Isabelle.  The way I've chosen to do <br>\nit is using locales.  I have a locale for (Tarski's axioms of) the <br>\nabsolute plane.  I've proven that the real Cartesian plane is an <br>\ninstance of this locale and that it also satisfies Tarski's <br>\nversion of \"Euclid's axiom\".</p>\n<p>I've now defined a model of the hyperbolic plane, and I'm in the <br>\nprocess of proving that it's also an instance of my absolute plane <br>\nlocale.  Then I'll need to prove that it doesn't satisfy Euclid's <br>\naxiom.</p>\n<p>Only my work on the hyperbolic plane is necessary to establish <br>\nthat Euclid's axiom is unprovable in Tarski's theory of the <br>\nabsolute plane, but my work on the Cartesian plane establishes <br>\nthat the negation of Euclid's axiom is also unprovable from that <br>\ntheory.</p>\n<p>In all of this, I have to rely on the assumption that Isabelle/HOL <br>\nis consistent, but I guess all work in Isabelle/HOL makes that <br>\nassumption.</p>\n<p>Tim<br>\n&lt;&gt;&lt;<br>\n<a href=\"/user_uploads/14278/9KWqIm0w0zVKJ9s-n8CnO2fb/signature.asc\">signature.asc</a></p>",
        "id": 294133208,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660843550
    },
    {
        "content": "<p>From: John Munroe &lt;<a href=\"mailto:munddr@gmail.com\">munddr@gmail.com</a>&gt;<br>\nI see. Do you know where I can find the proof that shows that it's unprovable?</p>\n<p>Thanks<br>\nJohn</p>",
        "id": 294133228,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660843557
    },
    {
        "content": "<p>From: Timothy McKenzie &lt;<a href=\"mailto:tjm1983@gmail.com\">tjm1983@gmail.com</a>&gt;<br>\nI'm not sure exactly what you're looking for.  Are you after the <br>\nproof that Euclid's axiom is unprovable from Tarski's other axioms <br>\nof the plane?  This is surprisingly difficult to find.</p>\n<p>The version of Tarski's axioms I'm using is from Metamathematische <br>\nMethoden in der Geometrie by Schwabhäuser, Szmielew, and Tarski <br>\n(which is made slightly more difficult by the fact that I don't <br>\nspeak German --- not yet, anyway).  I'm told that the first <br>\npublished version of Tarski's axioms was in The Axiomatic Method <br>\n(1959); from memory it was the second paper.</p>\n<p>The following paper in The Axiomatic Method was Some <br>\nMetamathematical Problems Concerning Elementary Hyperbolic <br>\nGeometry, by Szmielew.  She used a modified version of Tarski's <br>\naxioms, where Euclid's axiom was replaced with a hyperbolic axiom, <br>\nstronger than the negation of Euclid's axiom.  Her theorem 2.15 <br>\nstates that a system is a model of these axioms of hyperbolic <br>\nspace if and only if it's isomorphic with the Klein space of <br>\nappropriate dimension.</p>\n<p>Unfortunately for me, her proof begins by asserting that it's <br>\n\"well known\" that the Klein space satisfies the hyperbolic version <br>\nof Tarski's axioms.  It's a little difficult to see how it could <br>\nalready be well known as soon as the axioms were first published.  <br>\n(The proof goes on to show in more detail that every model of the <br>\nhyperbolic version of Tarski's axioms must be isomorphic to the <br>\nKlein space, which isn't the direction I need.)</p>\n<p>Other publications (including Metamathematische Methoden in der <br>\nGeometrie) that state the result I want, or something closely <br>\nrelated, generally refer the reader to Szmielew's paper for the <br>\n\"proof\", which is frustrating.</p>\n<p>Szmielew did partly make up for it, though.  The book I'm finding <br>\nmost useful in formalizing this independence result is Foundations <br>\nof Geometry by Borsuk &amp; Szmielew (which I am grateful was <br>\ntranslated into English from the original Polish).  It uses a <br>\ndifferent set of axioms from Tarski's, but they're similar enough <br>\nto be helpful. The book describes the Klein-Beltrami model of the <br>\nhyperbolic plane, starting on page 245, and then checks that it <br>\nsatisfies their axioms, starting on page 250.</p>\n<p>In the process of formalizing the independence result in Isabelle, <br>\nI've found a few errors in Borsuk &amp; Szmielew, but I guess this is <br>\nlikely in any similar publication.</p>\n<p>The Klein-Beltrami model of the hyperbolic plane is by no means <br>\nthe only one.  It's useful to me because it preserves betweenness, <br>\nwhich is one of the primitive relations in Tarksi's axioms.  If <br>\nyou're using a different set of axioms, another model might be <br>\nmore useful.</p>\n<p>Tim<br>\n&lt;&gt;&lt;<br>\n<a href=\"/user_uploads/14278/I0-Gn2XDvJIyrD4lciOL3xJq/signature.asc\">signature.asc</a></p>",
        "id": 294133247,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660843562
    }
]