[
    {
        "content": "<p>From: Tobias Nipkow &lt;<a href=\"mailto:nipkow@in.tum.de\">nipkow@in.tum.de</a>&gt;</p>\n<hr>\n<p>Call for Organisers - ICTAC 2014<br>\n   International Colloquium on Theoretical Aspects of Computing (ICTAC)<br>\n<a href=\"http://www.ictac.net/\">http://www.ictac.net/</a></p>\n<hr>\n<p>Background and Objectives</p>\n<p>The International Colloquium on Theoretical Aspects of Computing<br>\n(ICTAC) was founded in 2004 by the International Institute for<br>\nSoftware Technology of the United Nations University (UNU-IIST).<br>\nThe aim of the colloquium is to bring together practitioners and<br>\nresearchers from academia, industry and government to present<br>\nresearch results, and exchange experience, ideas, and solutions for<br>\ntheir problems in theoretical aspects of computing. Beyond these<br>\nscholarly goals, another main purpose of the conference is to<br>\npromote cooperation in research and education between participants<br>\nand their institutions, from developing and industrial countries.</p>\n<p>The event takes place every year in a developing country. Each<br>\nconference attracts between 50 and 100 participants from all over<br>\nthe world. We now invite proposals from any group or institution<br>\nwishing to host this event. The priority is for the event to be<br>\nlocated in a developing country. It usually combines a regular<br>\nscientific conference with related activities such as tutorials and<br>\na summer school. Innovation in the format and content is<br>\nencouraged.</p>\n<p>Proposals will be evaluated by the ICTAC steering committee.</p>\n<hr>\n<p>Proposal Format and Submission</p>\n<p>Proposals should be no more than four pages in length and should contain:</p>\n<p>* Brief description of why the event is of interest to the proposer.<br>\n      * Vision for the event, including its aims, the expected format and scale.<br>\n      * A description of the relevant qualifications and experience of the<br>\nproposers, especially regarding conference organisation logistics.</p>\n<p>* A description of the facilities that will be available for the event and<br>\nto support the organizers.</p>\n<p>* The contact information of the proposed organising committee.<br>\nPlease send your proposal (in PDF format) and any enquiries to <a href=\"mailto:ictac@cs.york.ac.uk\">ictac@cs.york.ac.uk</a>.</p>\n<hr>\n<p>Important Dates</p>\n<p>Submission of proposals: 11 January, 2013       <br>\nNotification of results: 28 February, 2013</p>\n<hr>\n<p>Steering Committee</p>\n<p>Ana Cavalcanti, UK<br>\nJohn Fitzgerald, UK<br>\nMartin Leucker, Germany<br>\nZhiming Liu, Macao<br>\nTobias Nipkow, Germany<br>\nAugusto Sampaio, Brazil<br>\nNatarajan Shankar, USA</p>\n<hr>",
        "id": 294225212,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660899621
    }
]