[
    {
        "content": "<p>From: <a href=\"mailto:Michael.Norrish@data61.csiro.au\">Michael.Norrish@data61.csiro.au</a><br>\n================================================================================<br>\nCALL FOR PARTICIPATION</p>\n<p>The 9th International Summer School on Information Security and Protection</p>\n<p>The Australian National University, Canberra</p>\n<p>9 July - 13 July, 2018</p>\n<p><a href=\"https://cs.anu.edu.au/cybersec/issisp2018/\">https://cs.anu.edu.au/cybersec/issisp2018/</a></p>\n<p>mailto:<a href=\"mailto:issisp18@anu.edu.au\">issisp18@anu.edu.au</a></p>\n<p>================================================================================</p>\n<p>Scope<br>\n=====</p>\n<p>There is an increasing need for Software Security and Protection due to the<br>\ngrowing sensitivity of user data coupled with the ubiquitous nature of<br>\ncomputing systems ranging from tiny embedded devices to powerful data centres.</p>\n<p>The International Summer School on Information Security and Protection<br>\n(ISSISP) highlights this need by bringing internationally renowned speakers<br>\nfrom diverse fields in Computer Science such as Software Engineering, Formal<br>\nMethods, Computer Architecture, Operating Systems, and Programming Languages.</p>\n<p>In particular, topics to be covered include vulnerability detection and<br>\nanalysis, software forensics, and information flow control. The summer school<br>\ncaters towards students and professionals from academia, government, and<br>\nindustry. Courses will include both lectures and hands-on sessions.</p>\n<p>Tutorials<br>\n=========</p>\n<p>Building Security In: Programming Language-Based Techniques for Ensuring<br>\nSoftware Security, Professor Mike Hicks, University of Maryland, USA</p>\n<p>Vulnerability Analysis with S2E, Dr Vitaly Chipounov, co-founder and chief<br>\narchitect at Cyberhaven, Switzerland</p>\n<p>Symbolic Execution for Vulnerability Detection and Repair, Professor Abhik<br>\nRoychoudhury, National University of Singapore</p>\n<p>Type Sanitisation and Object Integrity for C++, Professor Mathias Payer,<br>\nPurdue University, USA</p>\n<p>Low-Level Systems Security, Professor Emery Berger, University of<br>\nMassachusetts at Amherst, USA</p>\n<p>Forensics of Cyber Attacks, Professor Xiangyu Zhang, Purdue University, USA</p>\n<p>Binary Lifting with McSema, Peter Goodman, Trail of Bits</p>\n<p>Introduction to Software Protection and Obfuscation, Professor Christian<br>\nCollberg, University of Arizona, USA</p>\n<p>Advanced Protections Against Deobfuscation and Tampering, Professor Bjorn De<br>\nSutter, Ghent University, Belgium</p>\n<p>VM-Based Software Protection, Professor Jack Davidson, University of Virginia,<br>\nUSA</p>\n<p>Industrial Challenges in Software Security and Protection, Yuan Xiang Gu,<br>\nIrdeto, China</p>\n<p>Keynote Speakers<br>\n================</p>\n<p>Defences Against Microarchitectural Attacks, Professor Gernot Heiser,<br>\nUniversity of New South Wales, Australia</p>\n<p>Microarchitectural Attacks, Dr. Yuval Yarom, University of Adelaide, Australia</p>\n<p>Oracle Parfait — The Flavour of Real World Vulnerability Detection,<br>\nDr. Cristina Cifuentes, Oracle Labs, Australia</p>\n<p>Attending<br>\n=========</p>\n<p>ISSISP is open to students, academics, and professionals from academia,<br>\ngovernment, and industry. The number of attendee places is strictly limited.<br>\nProspective attendees should submit an expression of interest at<br>\n<a href=\"https://goo.gl/forms/aO06Y5L4jGdPMZHI3\">https://goo.gl/forms/aO06Y5L4jGdPMZHI3</a>. Expressions of interest will be<br>\nreviewed starting <strong>Friday 11 May</strong>. For full consideration please submit an<br>\nexpression of interest prior to this date. Successful applicants will be<br>\nnotified from <strong>Friday 18 May</strong>, after which places will be filled on a<br>\nfirst-come first-served basis.  Please contact &lt;mailto:<a href=\"mailto:issisp18@anu.edu.au\">issisp18@anu.edu.au</a>&gt;<br>\nwith any specific questions regarding registration.</p>\n<p>Successful applicants will receive a link to the payment website to confirm<br>\ntheir registration.</p>\n<p>Registration costs vary by attendee classification (student/academic/industry)<br>\nand by choice of optional single/twin share accommodation. The registration<br>\nfee covers lunches, coffee breaks, and the social event and dinner.</p>\n<p>Posters<br>\n=======</p>\n<p>We invite all ISSISP attendees to submit their innovative ideas and ongoing<br>\nwork in the area of information security and protection for presentation at<br>\nthe School in the form of a poster.  At least one poster author must register<br>\nto attend ISSISP. Topics of interest include, but are not limited to:</p>\n<ul>\n<li>Applications of cryptography</li>\n<li>Cloud security</li>\n<li>Combating software and hardware privacy</li>\n<li>Computer forensics</li>\n<li>Cyber attack and defence strategies</li>\n<li>Formal methods in security</li>\n<li>Language-based security</li>\n<li>Mobile and system security</li>\n<li>Network security</li>\n<li>Reverse engineering, vulnerability analysis and malware analysis</li>\n<li>Side channel attacks</li>\n</ul>\n<p>Prizes will be awarded for best posters!</p>\n<p>Venue<br>\n=====</p>\n<p>ISSISP'18 will be held at University House on the grounds of the Australian<br>\nNational University in Canberra, the nation's capital. It is well-served by<br>\ndomestic flights from the major Australian airports, and internationally from<br>\nNew Zealand, Singapore, and Qatar. Canberra is a 3-hour drive from Sydney, and<br>\nalso reachable by train and bus services from Sydney and Melbourne.</p>\n<p>Organisers<br>\n==========</p>\n<p>Tony Hosking, ANU / Data61<br>\nSteve Blackburn, ANU<br>\nAdrian Herrera, DST Group<br>\nShane Magrath, DST Group</p>\n<p>Scientific Advisory Board<br>\n=========================</p>\n<p>Christian Collberg, University of Arizona<br>\nJack Davidson, University of Virginia<br>\nBjorn De Sutter, Ghent University<br>\nRoberto Giacobazzi, Universitá di Verona<br>\nYuan Xiang Gu, Irdeto<br>\nArun Lakhotia, University of Lousiana</p>",
        "id": 294731947,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661188389
    }
]