[
    {
        "content": "<p>From: Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt;<br>\nOn Wed, 13 Jun 2012, Steve Wong wrote:</p>\n<blockquote>\n<p>Just a quick question: how come Isabelle keeps a distinction between <br>\nfree and schematic variables?</p>\n</blockquote>\n<p>Free means \"fixed\" and schematic \"arbitrary\".  In informal mathematics you <br>\nsay \"let x be arbitrary, but fixed\".  Which means it is first made a local <br>\nfree/fixed thing, and in the result it can then be arbitrary.</p>\n<p>In the Isar proof language you write down fixed things, and get <br>\npotentially arbitrary results from it.  The free vs. schematic marker <br>\nimplements that idea formally in the underlying logical framework.</p>\n<blockquote>\n<p>It seems that free variables in a goal are converted to schematic <br>\nanyway, so what are the benefits of keeping them distinct?</p>\n</blockquote>\n<p>When you say \"in a goal\", you mean the so-called \"eigen context\" of a <br>\nstatement, e.g.</p>\n<p>theorem fixes x :: 'a shows \"x = x\" ..</p>\n<p>Here 'a and x are fixed, and in the result everything is then schematic, <br>\nat least in this example.  In general, the context can still keep other <br>\nthings fixed (say via 'locale' or 'context' or within a nested proof).</p>\n<p>In fact, a mixture of fixed and schematic variables characterizes genuine <br>\nlocality in Isabelle, as opposed to the old scheme from the 1980/1990-ies <br>\nwhere everything was either free or schematic.</p>\n<p>Makarius</p>",
        "id": 294162904,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660853806
    },
    {
        "content": "<p>From: Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt;<br>\nBoth free and schematic variables belong to Isabelle/Pure, just like bound <br>\nvariables via !!x or %x.  You could argue if Isabelle/HOL has actually <br>\nvariables on its own -- it just re-uses many things from Pure directly, <br>\nincluding the type system, for example.</p>\n<p>Makarius</p>",
        "id": 294162917,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660853812
    },
    {
        "content": "<p>From: Steve Wong &lt;<a href=\"mailto:s.wong.731@gmail.com\">s.wong.731@gmail.com</a>&gt;<br>\nHi,</p>\n<p>Just a quick question: how come Isabelle keeps a distinction between free<br>\nand schematic variables? It seems that free variables in a goal are<br>\nconverted to schematic anyway, so what are the benefits of keeping them<br>\ndistinct?</p>\n<p>Cheers<br>\nSteve</p>",
        "id": 294163712,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660854192
    },
    {
        "content": "<p>From: Ramana Kumar &lt;<a href=\"mailto:rk436@cam.ac.uk\">rk436@cam.ac.uk</a>&gt;<br>\nHow would you propose to fuse the concepts?<br>\nDo you mean Isabelle/HOL should use free variables wherever it<br>\ncurrently uses schematic variables, or schematic variables wherever it<br>\ncurrently uses free, or should use something different for both?<br>\nThinking about that question might make it more obvious why there are<br>\ntwo kinds of \"free\" variable.</p>\n<p>(I'm looking forward to an expert's answer, though: as I understand<br>\nit, the distinction is fundamentally unavoidable because one kind of<br>\nvariable is in the object-logic syntax and the other is a meta-logic<br>\nvariable. But I may be wrong about this.)</p>",
        "id": 294163732,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660854204
    },
    {
        "content": "<p>From: Lawrence Paulson &lt;<a href=\"mailto:lp15@cam.ac.uk\">lp15@cam.ac.uk</a>&gt;<br>\nThe distinction is useful in the course of a proof. Free variables typically represent fixed parameters of the statement being proved. Schematic variables represent unknown quantities such as existential witnesses, where any single value might be supplied. If such a quantity is ?n, a natural number, then replacing ?n by 0 would be appropriate in a proof. However, if the statement being proved involves a natural number n as a parameter, it would not be acceptable to replace n by 0 and prove the much simpler statement resulting from that substitution.</p>\n<p>Once the theorem has been proved, making all variables schematic makes it possible to apply the theorem for arbitrary values of n (which will now be ?n).</p>\n<p>Larry Paulson</p>",
        "id": 294163761,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660854216
    },
    {
        "content": "<p>From: Ramana Kumar &lt;<a href=\"mailto:rk436@cam.ac.uk\">rk436@cam.ac.uk</a>&gt;<br>\nCould I summarise the difference between free and schematic variables like<br>\nthis:</p>\n<p>Free variables came from the statement you want to prove, whereas schematic<br>\nvariables came from other facts that are already known to be true.</p>\n<p>(Thus, free variables must be fixed during a proof, they cannot be<br>\ninstantiated. Because they were never instantiated, they can become<br>\narbitrary after the proof is completed. Schematic variables can be<br>\ninstantiated at any time, because they came from some proof in which they<br>\nwere originally treated as fixed.)</p>",
        "id": 294216763,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660895299
    }
]