[
    {
        "content": "<p>From: José Manuel Rodriguez Caballero &lt;<a href=\"mailto:josephcmac@gmail.com\">josephcmac@gmail.com</a>&gt;<br>\nLibraries related to the subject of the ABC conjecture will be<br>\nindispensable for the development of contemporary mathematics, because of<br>\nthe complexity of the candidates for new proofs. Indeed, I read in a recent<br>\narticle:</p>\n<p>Two mathematicians [Peter Scholze and Jakob Stix] have found what they say</p>\n<blockquote>\n<p>is a hole at the heart of a proof that has convulsed the</p>\n</blockquote>\n<p>mathematics community for nearly six years [...] Shinichi Mochizuki</p>\n<blockquote>\n<p>maintains that his proof is not flawed despite the assertions of Jakob Stix<br>\nand Peter Scholze that they’ve discovered a “serious, unfixable gap.”</p>\n</blockquote>\n<p>Reference (Titans of Mathematics Clash Over Epic Proof of ABC Conjecture,<br>\nby Klaus Kremmerz, Quanta Magazine):<br>\n<a href=\"https://www.quantamagazine.org/titans-of-mathematics-clash-over-epic-proof-of-abc-conjecture-20180920/\">https://www.quantamagazine.org/titans-of-mathematics-clash-over-epic-proof-of-abc-conjecture-20180920/</a></p>\n<p>Kind Regards,<br>\nJose M.</p>",
        "id": 294743057,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661192323
    },
    {
        "content": "<p>From: Tobias Nipkow &lt;<a href=\"mailto:nipkow@in.tum.de\">nipkow@in.tum.de</a>&gt;<br>\nBack in December 2017, Peter Scholze (for the first time, I believe) publicly <br>\npinpoints what he believes is a flaw in Mochizuki's proof. He concludes with <br>\nthis remark:</p>\n<p>\"One final point: I get very annoyed by all references to computer-verification <br>\n(that came up not on this blog, but elsewhere on the internet in discussions of <br>\nMochizuki’s work). The computer will not be able to make sense of this step <br>\neither. The comparison to the Kepler conjecture, say, is entirely misguided: In <br>\nthat case, the general strategy was clear, but it was unclear whether every <br>\nsingle case had been taken care of. Here, there is no case at all, just the <br>\nclaim “And now the result follows”.\"</p>\n<p><a href=\"https://galoisrepresentations.wordpress.com/2017/12/17/the-abc-conjecture-has-still-not-been-proved/?psincomments#comment-4619\">https://galoisrepresentations.wordpress.com/2017/12/17/the-abc-conjecture-has-still-not-been-proved/?psincomments#comment-4619</a></p>\n<p>Tobias<br>\n<a href=\"/user_uploads/14278/xC_EsudofLOeA4jfBLPk_ZQ-/smime.p7s\">smime.p7s</a></p>",
        "id": 294743083,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661192336
    },
    {
        "content": "<p>From: José Manuel Rodriguez Caballero &lt;<a href=\"mailto:josephcmac@gmail.com\">josephcmac@gmail.com</a>&gt;<br>\nScholze's claim</p>\n<p>\"I get very annoyed by all references to computer-verification [...] The<br>\ncomputer will not be able to make sense of this step either\"</p>\n<p>is not the conclusion of a long theoretical research about proof-assistants<br>\n(this is not his field), but just a personal prejudice against<br>\ncomputer-verified mathematics. Of course, the computer will not make sense<br>\nof a mistake, making sense of a mistake is a subjective feeling. Indeed,<br>\nVoevodsky said:</p>\n<p>\"Each time when I feel myself drifting away thinking about why it is so, I<br>\nstop myself, why I not actually check what is actually true and what is<br>\nnot\"</p>\n<p>Reference to Voevodsky's quotation, min 18 in the lecture:<br>\n<a href=\"https://www.math.ias.edu/vladimir/sites/math.ias.edu.vladimir/files/VTS_01_4.mp4\">https://www.math.ias.edu/vladimir/sites/math.ias.edu.vladimir/files/VTS_01_4.mp4</a></p>\n<p>What the computer will do is to show the first line where the mistake<br>\noccurs and that is an objective fact. Without proof assistants, the<br>\nultimately reference for truth in mathematics is authority and I am skeptic<br>\nof scientific authority  since I read the  following quotation from Lord<br>\nKelvin (who was  President of the Royal Society of England): Heavier than<br>\nair flying machines are impossible. Reference to the quotation:<br>\n<a href=\"https://www.nasa.gov/audience/formedia/speeches/fg_kitty_hawk_12.17.03.html\">https://www.nasa.gov/audience/formedia/speeches/fg_kitty_hawk_12.17.03.html</a></p>\n<p>Kind Regards,<br>\nJose M.</p>",
        "id": 294743196,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661192379
    },
    {
        "content": "<p>From: Tobias Nipkow &lt;<a href=\"mailto:nipkow@in.tum.de\">nipkow@in.tum.de</a>&gt;<br>\nPeter Scholze is simply very realistic wrt the pitiful state of today's proof <br>\nassitants in the face of a proof like Mochizuki's. Anybody who thinks that we <br>\ncould have contributed one iota to spotting the mistake (or providing the proof, <br>\nin case there is no mistake), lives in dreamland.</p>\n<p>Tobias<br>\n<a href=\"/user_uploads/14278/kR9bbZysAlv1wF5Uam_Bk5kO/smime.p7s\">smime.p7s</a></p>",
        "id": 294743224,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661192391
    },
    {
        "content": "<p>From: José Manuel Rodriguez Caballero &lt;<a href=\"mailto:josephcmac@gmail.com\">josephcmac@gmail.com</a>&gt;<br>\nScholze’s claim gives rise to the following interesting question (I am open-minded for the three possible answers):<br>\nIs the main obstacle of today proof assistants a technological problem of the software itself, a theoretical problem related to the type theory or a lack of libraries related to this subject?</p>\n<p>In the case of Isabelle/HOL I guess that it is the third option, although I am not an expert in the subject and I may change my opinion after learning more about it.</p>\n<p>Kind Regards,<br>\nJosé M.</p>",
        "id": 294743243,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661192397
    },
    {
        "content": "<p>From: Ching-Tsun Chou &lt;<a href=\"mailto:chingtsun.chou@gmail.com\">chingtsun.chou@gmail.com</a>&gt;<br>\nYou may find this article interesting:</p>\n<p><a href=\"https://www.quantamagazine.org/titans-of-mathematics-clash-over-epic-proof-of-abc-conjecture-20180920/\">https://www.quantamagazine.org/titans-of-mathematics-clash-over-epic-proof-of-abc-conjecture-20180920/</a></p>",
        "id": 294743317,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661192406
    },
    {
        "content": "<p>From: Manuel Eberl &lt;<a href=\"mailto:eberlm@in.tum.de\">eberlm@in.tum.de</a>&gt;<br>\nI would like to counteract the negativity in this thread a little bit by<br>\ninterjecting that theorem provers in general and Isabelle in particular<br>\n/have/ been used successfully for research mathematics, big and small.<br>\nAnd problems in proofs (even published and peer-reviewed ones!) have<br>\nbeen found in the process.</p>\n<p>Of course, these were mostly cases where the proofs in question were<br>\nfairly straightforward to formalise and did not require too much<br>\n\"non-basic\" material. For instance, my BSc thesis in mathematics – which<br>\nwas a formalisation of a recent small result in social choice theory –<br>\nis, of course, in no way comparable to the ABC conjecture, but it is<br>\nresearch mathematics nonetheless, and so I do think the situation is not<br>\nquite as hopeless as this thread may suggest.</p>\n<p>With the ABC conjecture and things like that, I think the main problem<br>\nis, as you also suspected, the lack of \"libraries\". Most modern<br>\nmathematics (especially the really big results like the ABC conjecture<br>\nor Fermat's Last Theorem) build on a huge tower of other mathematics. As<br>\na \"pen-and-paper\" mathematician, you can basically use any theory<br>\ndeveloped by another person as long as it's published and not obviously<br>\nwrong. You don't have to fully understand their proof, you can just use<br>\nthe result.</p>\n<p>When you want to do the same thing In a theorem prover, in all<br>\nlikelihood, you will have to formalise the entire thing yourself. And<br>\neverything it depends on. And so on. That, I think, is the biggest<br>\nproblem about what makes formalising \"real\" modern mathematics so<br>\ndifficult. Another thing is that once you formalise something, you have<br>\nto make lots of technical decisions about how to formulate it precisely<br>\nand they can all come back at you and make your life difficult. In<br>\npen-and-paper mathematics, it is easier to argue such technical issues<br>\naway informally and focus on the essence of the proof, trusting that the<br>\nreader will still know what you mean.</p>\n<p>Another problem (especially in the long run) is that, for the most part,<br>\nthere is only one mathematics, but there are many different theorem<br>\nprovers and you cannot easily exchange results between them.</p>\n<p>In any case, something as massive as the ABC conjecture proof will<br>\npresent a formidable challenge to anyone who wants to even begin to<br>\nunderstand it. I would guess that even writing things out on paper in<br>\nBourbakian rigour is probably almost impossible, and that is before any<br>\ntheorem-proving software even gets involved.</p>\n<p>Manuel<br>\n<a href=\"/user_uploads/14278/gmGMvvmqR9FV2G0IHVFugb2S/pEpkey.asc\">pEpkey.asc</a></p>",
        "id": 294743327,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661192409
    },
    {
        "content": "<p>From: \"Eugene W. Stark\" &lt;<a href=\"mailto:isabelle-users@starkeffect.com\">isabelle-users@starkeffect.com</a>&gt;<br>\nMathematics is the one area of human endeavor in which the concept of an<br>\nabsolute truth potentially has some meaning.  Whether or not a mathematical<br>\nresult is accepted as true ought not to be dependent on a clash of egos,<br>\npersonalities, and reputations.  It should be the responsibility of the<br>\nproposer of a theorem to address all reasonable challenges to its veracity,<br>\nnot to simply argue by blatant assertion that it is fact and that those who<br>\nsay otherwise have simply not managed to think deeply enough about it to see<br>\nthe light.  Formally checkable proofs and proof assistants hold the promise<br>\nof finally expurgating the social dynamic from mathematical truth; thereby<br>\nclearly illuminating the distinction between mathematics and the \"subjective\"<br>\nsciences.</p>",
        "id": 294743343,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661192415
    },
    {
        "content": "<p>From: José Manuel Rodriguez Caballero &lt;<a href=\"mailto:josephcmac@gmail.com\">josephcmac@gmail.com</a>&gt;<br>\nManuel wrote:<br>\n“As<br>\na \"pen-and-paper\" mathematician, you can basically use any theory<br>\ndeveloped by another person as long as it's published and not obviously<br>\nwrong. You don't have to fully understand their proof, you can just use<br>\nthe result”</p>\n<p>So, assuming some non-controversial theorems as true, using the key word “sorry”, Isabelle could be used in order to do research in any branch of mathematics. Sincerely, I do not see any other obstacle in order to justify Scholze's claim:</p>\n<blockquote>\n<blockquote>\n<p>\"I get very annoyed by all references to computer-verification [...] The<br>\ncomputer will not be able to make sense of this step either\"</p>\n</blockquote>\n</blockquote>\n<p>I guess that, following the “sorry” approach, this controversy could be ended in one year, rather than the 6 years and even today we do not know the answer.</p>\n<p>Kind Regards,<br>\nJosé M.</p>",
        "id": 294743448,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661192466
    },
    {
        "content": "<p>From: Manuel Eberl &lt;<a href=\"mailto:eberlm@in.tum.de\">eberlm@in.tum.de</a>&gt;<br>\nOn 23/09/2018 23:19, José Manuel Rodriguez Caballero wrote:</p>\n<blockquote>\n<p>So, assuming some non-controversial theorems as true, using the key word “sorry”, Isabelle could be used in order to do research in any branch of mathematics. Sincerely, I do not see any other obstacle in order to justify Scholze's claim:</p>\n</blockquote>\n<p>I guess it's not quite that easy. It's not just the proofs, one also has<br>\nto state these theorems formally (and be extremely certain about getting<br>\nthat right when a 'sorry' is involved), and one needs to define all the<br>\nrequired constants and concepts. That alone can be an immense amount of<br>\nwork.</p>\n<p>And even then, the ‘new’ material with this particular proof is so<br>\nimmense that it is probably almost infeasible. Even if one were to find<br>\na problem with the proof, it would then be quite unclear whether it is<br>\nan issue of the original proof or one of the formalisation, i.e. if the<br>\nperson formalising it just misunderstood something.</p>\n<p>In any case I think w.r.t. the ABC conjecture, Scholze is certainly<br>\ncorrect in saying that computer verification is the wrong thing to look<br>\nat at the moment. I interpret what he said as saying that no one could<br>\npossibly formalise a proof that they don't understand even informally,<br>\nand that seems to be the case with the ABC conjecture at the moment.<br>\nMathematicians looked at it and found a step that they don't understand,<br>\nand until that is resolved and every step of the proof is<br>\nwell-understood, computer verification makes no sense at all.</p>\n<p>Of course, even when all of that is resolved, it still seems that a<br>\nverification is completely feasible simply because there is so much<br>\nmaterial.</p>\n<blockquote>\n<p>I guess that, following the “sorry” approach, this controversy could be ended in one year, rather than the 6 years and even today we do not know the answer.</p>\n</blockquote>\n<p>I doubt that. I highly doubt that, even with this approach, a<br>\nformalisation of any proof of that size is feasible within a year.<br>\nPerhaps you think one should tackle this particularly controversial<br>\naspect alone and ‘sorry’ everything before it?</p>\n<p>Well, as I said above, if a problem /is/ found, the controversy will<br>\nthen be whether it's a genuine problem or whether it can be fixed<br>\nsomehow. Or if perhaps there is some mistake in the formalisation to<br>\nbegin with. And if no problem is found, one will have to worry about<br>\nwhether the statement that was proven is really what is required: Are<br>\nall the involved definitions correct? Are the assumptions perhaps<br>\nvacuous due to some mistake in how they were written down? And even<br>\nthen, one still relies on a huge tower of sorries in front of it.</p>\n<p>Manuel<br>\n<a href=\"/user_uploads/14278/GIhgjVbfWegegPRbes5pNO4h/pEpkey.asc\">pEpkey.asc</a></p>",
        "id": 294743704,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661192575
    },
    {
        "content": "<p>From: \"Dr A. Koutsoukou-Argyraki\" &lt;<a href=\"mailto:ak2110@cam.ac.uk\">ak2110@cam.ac.uk</a>&gt;<br>\njust adding two points supporting what Manuel just wrote:</p>\n<p>1) In praxis, it is very easy to end up proving something wrong with a <br>\nproof assistant by assuming a false statement. One can convince <br>\nthemselves of this by making up any trivial example. Now imagine how <br>\ndangerous this becomes in a much more sophisticated setting where<br>\na very subtle mistake can go unnoticed and lead one to assume a false <br>\nstatement.<br>\nThat is to say, a proof assistant is not completely immune to errors by <br>\n\"human\" mathematicians and one should be extremely responsible and <br>\ncareful with assumptions -even more so in the \"sorrys\" approach that <br>\nJosé suggests. Regarding the ABC conjecture, the level of difficulty is <br>\nsuch that the risk increases a lot.</p>\n<p>2) When a step in a proof is unclear from the point of view of informal <br>\nmathematics, as is the case for the suggested proof of the ABC <br>\nconjecture, a proof assistant will not always<br>\ngive a definitive answer, i.e. :  If it happens that a counterexample  <br>\nis found,<br>\nthe step (and thus the proof) is of course wrong. If no counterexample <br>\nis found, nor a proof is given by automation, the step may or may not be <br>\nwrong.<br>\nAnd we cannot expect that a formal proof can necessarily be discovered <br>\nwhere an informal one is missing.</p>\n<p>Best,<br>\nAngeliki</p>",
        "id": 294743717,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661192582
    }
]