[
    {
        "content": "<p>From: Valeria de Paiva &lt;<a href=\"mailto:valeria.depaiva@gmail.com\">valeria.depaiva@gmail.com</a>&gt;<br>\nDear colleagues,</p>\n<p>The deadline for the submission of papers to the special issue of<br>\nInformation and Computation on Intuitionistic Modal Logics and<br>\nApplications is fast approaching (31st May).</p>\n<p>Please see the CFP below, and forward it to other interested colleagues. If<br>\nyou'd like to submit a paper, but don't think you can make the deadline,<br>\nplease write to us with your title and preliminary abstract and we can have<br>\n(some!)  flexibility.</p>\n<p>Best regards,<br>\n Brigitte &amp; Valeria</p>\n<hr>\n<p>Call for Papers</p>\n<p>Special Issue of Information and Computation on<br>\nIntuitionistic Modal Logics and Applications (IMLA)</p>\n<p>Guest Editors: Valeria de Paiva, Brigitte  Pientka and Aleks Nanevski</p>\n<p>Submission deadline: 31. May, 2009</p>\n<p>Constructive modal logics and type theories are of increasing<br>\nfoundational and practical relevance in computer science. Applications are<br>\nin type disciplines for programming languages, and meta-logics for reasoning<br>\nabout a variety of computational phenomena.<br>\nTheoretical and methodological issues center around the question of how the<br>\nproof-theoretic strengths of constructive logics can best be combined with<br>\nthe model-theoretic strengths of modal logics. Practical issues center<br>\naround the question of which modal connectives with associated laws or proof<br>\nrules capture computational phenomena accurately and at the right level of<br>\nabstraction and how to implement these efficiently.</p>\n<p>There have been a series of   LICS-affiliated workshops devoted to the<br>\ntheme. The first one was held as part of FLoC1999, Trento, Italy, the second<br>\nwas part  of FLoC2002, Copenhagen, Denmark, the third was associated with<br>\nLiCS2005, Chicago, USA and the last one was associated with LICS 2008 in<br>\nPittsburgh, PA, USA. Two special issues of journals on the theme have<br>\nalready appeared,  a Mathematical Structures in Computer Science volume<br>\nedited by Matt Fairtlough, Michael Mendler and Eugenio Moggi (Modalities in<br>\ntype theory) in 2001, and a special<br>\nissue of  the Journal of Logic and Computation  in 2004<br>\n(Intuitionistic Modal Logics and Application, eds. Valeria de Paiva, R. Gore<br>\nad M. Mendler).</p>\n<p>We are hereby soliciting papers for a further special volume<br>\n of Information and Computation, devoted to Intuitionistic Modal<br>\nLogics and Applications. We hope to cover the novel applications<br>\npresented in the last two workshops, especially applications to<br>\ncomputer security, automated deduction and  computational linguistics, but<br>\nalso to include work not presented at the workshops. The proposed timeline<br>\n of events is as follows:</p>\n<ul>\n<li>\n<p>Papers (preferably under 20 pages long) should be submitted by 31st May<br>\n 2009</p>\n</li>\n<li>\n<p>Reviews will be provided until the end of August 2009 and the volume<br>\nshould be ready by the end of the Fall.</p>\n</li>\n</ul>\n<p>Topics  of interest include, but are not limited to:</p>\n<ul>\n<li>applications of intuitionistic necessity and possibility</li>\n<li>monads and strong monads</li>\n<li>constructive belief logics and type theories</li>\n<li>\n<p>applications of constructive modal logic and modal type theory to formal<br>\nverification, foundations of security, abstract interpretation, and program<br>\nanalysis and optimization</p>\n</li>\n<li>\n<p>modal types for integration of inductive and co-inductive types,<br>\nhigher-order abstract syntax, strong functional programming</p>\n</li>\n<li>\n<p>models of constructive modal logics such as algebraic, categorical,<br>\nKripke, topological, and realizability interpretations</p>\n</li>\n<li>\n<p>notions of proof for constructive modal logics</p>\n</li>\n<li>extraction of constraints or programs from modal proofs</li>\n<li>proof search methods for constructive modal logics and their<br>\nimplementations.</li>\n</ul>\n<p>Please contact one of the editors (Valeria de Paiva<br>\n<a href=\"mailto:valeria@cuill.com\">valeria@cuill.com</a> or  Brigitte Pientka <a href=\"mailto:bpientka@cs.mcgill.ca\">bpientka@cs.mcgill.ca</a>) if<br>\nyou're not sure that your paper is within the scope of this special<br>\nvolume. Submissions should be 10 to 20  pages  long and sent in<br>\nPostScript or PDF format to one of the editors, before the 31st<br>\nMay 2009.</p>",
        "id": 294077749,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660829541
    }
]