[
    {
        "content": "<p>From: David Greenaway &lt;<a href=\"mailto:david.greenaway@nicta.com.au\">david.greenaway@nicta.com.au</a>&gt;<br>\n[[ Originally posted to the Isabelle 2013-1 RC1 issue tracker. Re-posting<br>\nto Isabelle-users by request of Makarius. ]]</p>\n<p>Hi all,</p>\n<p>In Isabelle/jEdit, when \"Auto Sledgehammer\" is enabled, typing:</p>\n<p>lemma \"2 + 2 = (4::nat)\"</p>\n<p>quickly gives a proof in the output window:</p>\n<p>Auto Sledgehammer (\"e\") found a proof: by (metis numeral_Bit0).</p>\n<p>However, the (marginally) more complex lemma:</p>\n<p>lemma \"length xs &gt; 0 ⟹ hd (rev xs) = last  xs\"</p>\n<p>fails to provide any automatic sledgehammer results, despite the fact<br>\nthat it can be solved quickly by explicitly writing:</p>\n<p>sledgehammer [provers=e,timeout=1.0]</p>\n<p>which gives the results:</p>\n<p>\"e\": Try this: by (metis hd_rev length_0_conv less_numeral_extra(3)) (11 ms).</p>\n<p>Is this expected behaviour (for example, because the latter does time<br>\nslicing which enables it to find proofs that the former does not), or<br>\ncould there be a deeper problem here?</p>\n<p>(Isabelle 2013-RC1, running under 64-bit Ubuntu 13.04, with Unity.)</p>\n<p>Thanks so much,<br>\nDavid</p>\n<hr>\n<p>The information in this e-mail may be confidential and subject to legal professional privilege and/or copyright. National ICT Australia Limited accepts no liability for any damage caused by this email or its attachments.</p>",
        "id": 294253372,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660911641
    },
    {
        "content": "<p>From: Jasmin Blanchette &lt;<a href=\"mailto:jasmin.blanchette@gmail.com\">jasmin.blanchette@gmail.com</a>&gt;<br>\nHi David,</p>\n<p>Thanks for the report. I was able to reproduce what you describe on my machine with Isabelle2013-RC1. Doubling the timeout to 4 s doesn't seem to help. Hence this would suggest it has something to do with the slicing or the otherwise reduced nature of Auto Sledgehammer.</p>\n<p>However, with the current repository version (fcb7bbbe3799), it finds the proof as expected, even with the lower, default timeout (2 s). In addition, with the current \"isabelle-release\" version (782e430e6a83), which includes several Sledgehammer-related changes by both Makarius and myself that could make a difference here, it also works as expected. So I would simply recommend that you give it a try in the RC2 once it is available to confirm that the problem is gone for you too.</p>\n<p>Cheers,</p>\n<p>Jasmin</p>",
        "id": 294253497,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660911692
    }
]