[
    {
        "content": "<p>From: Tobias Nipkow &lt;<a href=\"mailto:nipkow@in.tum.de\">nipkow@in.tum.de</a>&gt;<br>\nBy \"library\" he meant the Archive of Formal Proofs www.afp.sf.<br>\nWe actively encourage the submission of small self-contained results to<br>\nthe AFP.</p>\n<p>Tobias</p>\n<p>Tim McKenzie schrieb:</p>",
        "id": 294079248,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660830113
    },
    {
        "content": "<p>From: Tobias Nipkow &lt;<a href=\"mailto:nipkow@in.tum.de\">nipkow@in.tum.de</a>&gt;<br>\nSorry, I meant <a href=\"http://afp.sf.net\">afp.sf.net</a>.</p>\n<p>Tobias</p>\n<p>Tim McKenzie schrieb:</p>",
        "id": 294079503,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660830179
    },
    {
        "content": "<p>From: Tim McKenzie &lt;<a href=\"mailto:tjm1983@gmail.com\">tjm1983@gmail.com</a>&gt;<br>\nThanks for that link.</p>\n<p>Tim<br>\n&lt;&gt;&lt;</p>\n<p>On Sunday 05 July 2009 02:15:23 Tobias Nipkow wrote:<br>\n<a href=\"/user_uploads/14278/-7_nrlVUPyU1YXs6iCpQJtjd/signature.asc\">signature.asc</a></p>",
        "id": 294079888,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660830302
    },
    {
        "content": "<p>From: grechukbogdan &lt;<a href=\"mailto:grechukbogdan@yandex.ru\">grechukbogdan@yandex.ru</a>&gt;<br>\nDear members of Isabelle users,</p>\n<p>Previous week I have sent you my formalization of some theorems about convex functions. I have received a huge amount of very useful feedback, for which I really thankful.</p>\n<p>The main information I received is that some convex analysis (mostly about convex sets, not convex functions) are formalizing in Isabelle now, and my definitions are not exactly match yours. As a result, although many my theorems are new, it is not obvious how to add them to the library.</p>\n<p>During last three days, I completely  rewrote my theory. I have installed new version of Isabelle, import Convexity_Euclidean_Space.thy, and rewrote my theory based on the definitions and lemmas from that site. All my lemmas which were duplicated are removed from the theory. It was not easy, because I needed properties of convex functions real -&gt; real, and you results were proved for functions real^n -&gt; real, so I needed to play a lot with transformation real^1 to real and back through \"vec1\".<br>\nAs a result, I have done this, but I had no time even to start of polishing my proofs. I have received huge amount of valuable suggestions how to make the proofs more readable, but I had no time to apply them. And my academic visit to Edinburgh is finishing today. I am sorry for this.</p>\n<p>The new file is attached. The detailed description is presented below.</p>\n<p>Sincerely,<br>\nBogdan Grechuk.</p>\n<p><strong>*</strong><strong>*</strong>* Updated Description of Convexity.thy <strong>*</strong>**</p>\n<p>First, I proved some simple properties of convex interval on real line, based on general properties of convex sets, proved in Convexity_Euclidean_Space.thy.</p>\n<p>Then I introduced a notion of nondecreasing function (the only definition in the theory now), and prove that differentiable function is non-decreasing if and only if its derivative is non-negative.</p>\n<p>After this preparation, I started to play with convex functions from real to real. First, I proved that f(g(x)) is convex if f() convex and g() linear, or if f() convex increasing and g() convex, and that the global maximum of convex function on [a, b] is f(a) or f(b). Then I proved some properties of convex functions connected with derivatives. Namely, I proved that graph of convex function is above all the tangents, and used this fact to prove that if the first derivative of convex function at some point is 0, that this point is a global minimum. Then I proved that (twice) differentiable function is convex on an interval if and only if its first derivative is non-decreasing on this interval, and also if and only if its second derivative is non-negative.</p>\n<p>Clearly, these theorems provide a powerful tool of proving convexity of different functions. As an example, I used them to prove that -ln(x) is a convex function on (0, infty).</p>\n<p>Finally, I use this to prove the generalized (weighted) version of famous Geometric-Arithmetic Mean Inequality, namely that alpha_1 * x_1 + ... + alpha_k x_k &gt;= x_1^alpha_1 * ... * x_k^alpha_k whenever alpha_i&gt;=0 and sum of alpha_i = 1. I hope may be this version is new. It reduces to usual Geometric-Arithmetic Mean Inequality when alpha_1 = ... = alpha_k = 1/k, but this particular case was already proved in the library.</p>\n<hr>\n<p><a href=\"/user_uploads/14278/Zyv5jSu7T7wiweezmWSpaMy9/Convexity.thy\">Convexity.thy</a></p>",
        "id": 294080193,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660830394
    },
    {
        "content": "<p>From: Tim McKenzie &lt;<a href=\"mailto:tjm1983@gmail.com\">tjm1983@gmail.com</a>&gt;<br>\nOn Thursday 02 July 2009 22:40:20 grechukbogdan wrote:<br>\nI was looking for this in the library recently, but I couldn't <br>\nfind it.  Where is it?  (In the end, all I needed was the case <br>\nk=2, so it didn't take me long to prove what I needed.)</p>\n<p>Tim<br>\n&lt;&gt;&lt;<br>\n<a href=\"/user_uploads/14278/ysYRxhoqtSW9agt2K-pQ4N_Y/signature.asc\">signature.asc</a></p>",
        "id": 294080965,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660830664
    }
]