[
    {
        "content": "<p>From: John Munroe &lt;<a href=\"mailto:munddr@gmail.com\">munddr@gmail.com</a>&gt;<br>\nHi,</p>\n<p>I have a rather naive question about the use of terminology. AFAIK,<br>\ntactics are implemented in the meta-level and the meta-level language<br>\nin Isabelle is Pure. So is it correct to say that \"tactics are written<br>\nin Pure\"?</p>\n<p>Thanks</p>\n<p>John</p>",
        "id": 294221076,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660897529
    },
    {
        "content": "<p>From: Christian Sternagel &lt;<a href=\"mailto:c-sterna@jaist.ac.jp\">c-sterna@jaist.ac.jp</a>&gt;<br>\nI think there is one more level: the ML level. You can do things on the <br>\nML level that you cannot do inside Pure or any object logic. Tactics are <br>\nimplemented on the ML level. Maybe there is no clear-cut border between <br>\nPure and the ML level. But I rather think about the former as a formal <br>\nlogic and the latter as a programming language (which it is).</p>\n<p>To be a bit more precise (I hope). Everything origins from the ML level, <br>\nsince it is implemented in the programming language ML, but the part <br>\nwhich I would call Pure (concerned with the implementation of a minimal <br>\nhigher-order logic that serves as logical framework for arbitrary object <br>\nlogics) is not whole of ML, but just some specific types and functions <br>\nthat serve as an interface.</p>\n<p>Hence when you do anything in Pure it corresponds to some function call <br>\nin ML and when you call ML functions from the specific interface it <br>\ncorresponds to some manipulation of Pure terms (which might or might not <br>\nbe expressible in the logic itself). But there is definitely a large <br>\nspace of ML functions that is not related to Pure.</p>\n<p>Hope this makes any sense.</p>\n<p>cheers</p>\n<p>chris</p>",
        "id": 294221086,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660897535
    },
    {
        "content": "<p>From: Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt;<br>\nSee also this thread:<br>\n<a href=\"https://lists.cam.ac.uk/mailman/htdig/cl-isabelle-users/2012-April/msg00066.html\">https://lists.cam.ac.uk/mailman/htdig/cl-isabelle-users/2012-April/msg00066.html</a></p>\n<p>Saying \"ML level\" suggests that it is somehow below other things, but it <br>\nis in fact intertwined in a more sophisticated manner.  This explains the <br>\npreferred terminolgy \"Isabelle/ML\", \"Isabelle/Isar\" etc. without any <br>\nleveling.</p>\n<p>Makarius</p>",
        "id": 294223469,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660898719
    }
]