[
    {
        "content": "<p>From: Johannes Faber &lt;<a href=\"mailto:johannesfaber@gmx.de\">johannesfaber@gmx.de</a>&gt;<br>\nHi all,</p>\n<p>I currently work on implementing a sequent-style proof calculus over  <br>\ndynamic logic. To this end, I have given Isabelle a try (which I  <br>\nhaven't used much before) and extended LK0.thy from the Sequents logic  <br>\nwith my proof rules. This seems to work until I run into problems with  <br>\na symbolic execution rule, where every symbol in a predicate needs to  <br>\nbe replaced by a new symbol.</p>\n<p>The rule is of the shape</p>\n<p>|- p[v0/v'] --&gt; q[v0/v]<br>\n-----------------------,<br>\n|- [p]q</p>\n<p>where p[v0/v'] denotes the replacement of every primed symbol in p by  <br>\na fresh symbol v0 (and similarly for q). This is not a problem as long  <br>\nas only a single symbol is to be substituted -- but I need to replace  <br>\nall primed symbols in v'. Is something like this possible with Isabelle?</p>\n<p>Second, I have a more general question: it seems that the Sequents  <br>\ntheory of Isabelle isn't used much and that the main work is on  <br>\nIsabelle/HOL. Does it nevertheless make sense to use the Sequents  <br>\ntheory of Isabelle as a basis for a sequent-style calculus, or is  <br>\nIsabelle not the right choice for such a calculus?</p>\n<p>I have already asked Makarius about this, who pointed me to this  <br>\nmailing list.</p>\n<p>Many thanks for any help!</p>\n<p>Johannes<br>\n<a href=\"/user_uploads/14278/3-Mm3tSaNN2cF26puWryce3A/smime.p7s\">smime.p7s</a></p>",
        "id": 294142339,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660846292
    },
    {
        "content": "<p>From: Lawrence Paulson &lt;<a href=\"mailto:lp15@cam.ac.uk\">lp15@cam.ac.uk</a>&gt;<br>\nI hesitate to call anything impossible, because there are various ways to attach code to a theory. However, this kind of systematic renaming of non-variable symbols isn't directly supported by Isabelle's logical framework.</p>\n<p>As for your second question, certainly most development focuses on Isabelle/HOL, but much of it involves strengthening the framework in general, which benefits all logics. We have retained a lot of ancient developments, such as CCL, and I would be very surprised if we got rid of the Sequents theory. Whether there exists an alternative out there I couldn't say. There are of course ready-made implementations of dynamic logic, <a href=\"http://www.key-project.org/\">http://www.key-project.org/</a> for example.</p>\n<p>Larry Paulson</p>",
        "id": 294142381,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660846310
    }
]