[
    {
        "content": "<p>From: Mikhail Chekhov &lt;<a href=\"mailto:mikhail.chekhov.w@gmail.com\">mikhail.chekhov.w@gmail.com</a>&gt;<br>\nDear Joshua Chen/All,</p>\n<p>This post is a reply to Joshua Chen’s comment in the following thread:<br>\n<a href=\"https://lists.cam.ac.uk/pipermail/cl-isabelle-users/2020-May/msg00075.html\">https://lists.cam.ac.uk/pipermail/cl-isabelle-users/2020-May/msg00075.html</a>.<br>\nHowever, I believe, it is best provided as an explicit thread, as it is<br>\nconcerned exclusively with <a href=\"https://bitbucket.org/cezaryka/tyset/src\">https://bitbucket.org/cezaryka/tyset/src</a> and not<br>\nthe main topic of my previous question.</p>\n<p>Firstly, thank you for letting me know about this development. It is very<br>\nuseful to know about it.</p>\n<p>In this context, I have to mention that I have started a couple of personal<br>\napplied formalization projects around “ZFC in HOL”. However, I kept<br>\nencountering and trying to solve some of the more fundamental limitations<br>\nrelated to the interplay of logic/type theory/set theory and the existing<br>\n‘tools’ infrastructure for Isabelle/HOL (e.g., see<br>\n<a href=\"https://lists.cam.ac.uk/pipermail/cl-isabelle-users/2020-April/msg00071.html\">https://lists.cam.ac.uk/pipermail/cl-isabelle-users/2020-April/msg00071.html</a><br>\nand<br>\n<a href=\"https://lists.cam.ac.uk/pipermail/cl-isabelle-users/2020-April/msg00117.html\">https://lists.cam.ac.uk/pipermail/cl-isabelle-users/2020-April/msg00117.html</a>,<br>\nbut there are many other issues). Also, I have an ever-growing desire to be<br>\nable to consider larger and larger entities without sacrificing convenience<br>\n(e.g. in “ZFC in HOL” one needs to deal with “V set set”, “V set” and V if<br>\none is to provide a notion similar to that of a conglomerate and operations<br>\non conglomerates).</p>\n<p>Having had a brief revision of the content of the repository, I am<br>\nconverging on the conclusion that this development makes an attempt to<br>\naddress many of the problems that I am struggling with at the moment (and<br>\nmore) in a structured manner and with much support. It does feel that,<br>\neventually, it will make my current efforts in “ZFC in HOL” redundant (in<br>\nfact, some of the theories I developed for “ZFC in HOL” are almost in 1-1<br>\ncorrespondence from the perspective of the content with what can be found<br>\nin <a href=\"https://bitbucket.org/cezaryka/tyset/src\">https://bitbucket.org/cezaryka/tyset/src</a>). Therefore, I have several<br>\nquestions:</p>\n<ol>\n<li>\n<p>Would you consider contributions to the project from external entities,<br>\nsuch as myself? If so, what kind of workflow would you expect/prefer? Would<br>\nyou agree to share your own plans for this development?</p>\n</li>\n<li>\n<p>If I understand correctly, at the moment, there is no license attached<br>\nto the repository. To the best of my knowledge, this means that<br>\nnon-contributors can not legally redistribute any part of the content of<br>\nthe repository. Is this intended? Would you consider distributing the<br>\ncontent under an open-source license in the future? If so, when do you<br>\nanticipate to do so?</p>\n</li>\n<li>\n<p>Regretfully, I was not able to build the content associated with either<br>\nmaster or dev. I tried both the latest Isabelle-dev and Isabelle2020 stable<br>\nrelease (the first error that appears is “exception FAIL NONE raised (line<br>\n161 of \"General/scan.ML\")” in String.thy in the first local_setup block).<br>\nPerhaps, I am not using the needed version of Isabelle? Otherwise, unless<br>\nthe cause is apparent, I am sure I will be able to figure it out on my own:<br>\nthere is no need to worry on my behalf (my time spent looking at the<br>\ncontent can still be measured in minutes at the time of writing this email).</p>\n</li>\n<li>\n<p>Naturally, the development introduces a number of new axioms in addition<br>\nto the axioms of HOL. I am curious if anything can be said with confidence<br>\nabout the consistency of the new system.</p>\n</li>\n<li>\n<p>I liked the idea of the notion of an object provided in the repository.<br>\nHowever, it seems that there are two independent theories: Object.thy and<br>\nObject_Old.thy. Does this mean that the notion of the object, as specified<br>\nin Object_Old.thy, will be abandoned in favor of another entirely different<br>\nimplementation (as opposed to extended/built upon into what is shown at the<br>\nbeginning of Object.thy) that is not yet available?</p>\n</li>\n</ol>\n<p>Kind Regards,<br>\nMikhail Chekhov</p>",
        "id": 294829333,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661245878
    }
]