[
    {
        "content": "<p>From: \"Aaron W. Hsu\" &lt;<a href=\"mailto:arcfide@sacrideo.us\">arcfide@sacrideo.us</a>&gt;<br>\nHas anyone previously made an attempt to port or support the Isabelle <br>\nTheorem prover on *BSD, particularly OpenBSD?</p>",
        "id": 294156819,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660851548
    },
    {
        "content": "<p>From: Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt;<br>\nLast year I've seen a BSD user in France, and he actually managed to run <br>\nIsabelle after installing the Linux binary compatibility package for it. <br>\nThe script lib/isabelle-platform already takes care of it in the sense <br>\nthat any *BSD will be coerced into x86-linux.  You will also have to <br>\ninstall GNU bash.</p>\n<p>The JVM is another issue -- I have not tried nor seen it recently, but it <br>\nmight work as well, once sufficiently many Linux shared libraries are <br>\ninstalled on BSD.</p>\n<p>Makarius</p>",
        "id": 294156901,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660851573
    },
    {
        "content": "<p>From: \"Aaron W. Hsu\" &lt;<a href=\"mailto:arcfide@sacrideo.us\">arcfide@sacrideo.us</a>&gt;<br>\nAh, I see, yes, on OpenBSD I use AMD64, which does not have support for <br>\nLinux compatibility. Thank you for the report.</p>",
        "id": 294157008,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660851610
    },
    {
        "content": "<p>From: Timothy Bourke &lt;<a href=\"mailto:tim@tbrk.org\">tim@tbrk.org</a>&gt;<br>\nOtherwise, there are FreeBSD ports of Poly/ML and Isabelle (2009.2):<br>\n<a href=\"http://www.freshports.org/lang/polyml\">http://www.freshports.org/lang/polyml</a><br>\n<a href=\"http://www.freshports.org/math/isabelle\">http://www.freshports.org/math/isabelle</a></p>\n<p>The patches therein may be helpful in building Isabelle on OpenBSD; or<br>\nthe current maintainer may already know how to solve some BSD issues.</p>\n<p>The trickiest step is usually to get Poly/ML working.</p>\n<p>Tim.<br>\n<a href=\"/user_uploads/14278/qhyCpI6RFScvAtIhcxceUroy/signature.asc\">signature.asc</a></p>",
        "id": 294157168,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660851680
    },
    {
        "content": "<p>From: Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt;<br>\nHere is the famous quote from the Isabelle download and installation page:</p>\n<p>Warning: Pre-packaged versions of Isabelle, Poly/ML, and Proof General<br>\n   floating through the Net as deb, rpm, port etc. are usually incomplete<br>\n   and outdated!</p>\n<p>With the following empiric proof for this general statement against <br>\nhomegrown packages:<br>\n<a href=\"http://www.freebsd.org/cgi/cvsweb.cgi/ports/lang/polyml/Makefile?rev=1.14;content-type=text%2Fplain\">http://www.freebsd.org/cgi/cvsweb.cgi/ports/lang/polyml/Makefile?rev=1.14;content-type=text%2Fplain</a></p>\n<p>The file was started in 2005, last updated in 2010, and the underlying <br>\nPoly/ML version seems to be 5.4.0, but the current stable one is 5.4.1. It <br>\nalso seems to lack support for libgmp (nice to have) and libsha1 (quite <br>\nimportant).</p>\n<p>This is just the bottom of the problem.  All the add-ons components for <br>\nthe full system integration of the Isabelle bundle are still missing, see <br>\nalso <a href=\"http://isabelle.in.tum.de/website-Isabelle2012-RC2/dist/\">http://isabelle.in.tum.de/website-Isabelle2012-RC2/dist/</a></p>\n<p>Makarius</p>",
        "id": 294157286,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660851733
    },
    {
        "content": "<p>From: \"Aaron W.  Hsu\" &lt;<a href=\"mailto:arcfide@sacrideo.us\">arcfide@sacrideo.us</a>&gt;<br>\nMakarius wrote:</p>\n<p>What would it take to get OpenBSD supported as one of the platforms? I am <br>\nnot currently using it because I do not have some of the applications, such <br>\nas Isabelle that my current research requires, but I would like to move back <br>\nto OpenBSD if I could.  I would be willing to work on the porting efforts if <br>\nsomeone could point me to some information on what is normally required to <br>\nbuild an Isabelle bundle.</p>\n<p>Looking at Poly/ML, I note that it appears to want static address ranges for <br>\na database, which, if I am reading correctly, could require some work, since <br>\nOpenBSD uses randomized memory allocation.  On the other hand, so do many of <br>\nthe Linux systems out there today, so I suspect that I am misunderstanding <br>\nsome of the Poly/ML porting guidelines. </p>\n<p>I will probably not start on a port right away, but if there is interest, I <br>\nwill definitely add it to my list.</p>",
        "id": 294157302,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660851738
    },
    {
        "content": "<p>From: Timothy Bourke &lt;<a href=\"mailto:tim@tbrk.org\">tim@tbrk.org</a>&gt;<br>\nAgreed! Personally, I saw the light many months ago, switched to<br>\nLinux, and now download my packages directly from the Isabelle site<br>\nlike a good proof assistant assistant ;-)</p>\n<p>In fact, your earlier sage advice about packaging was instrumental in<br>\nmy conversion.</p>\n<p>But for those yet to reach this point, source ports, despite their<br>\nshortcomings, at least provide a starting point for getting things<br>\nworking.</p>\n<p>In my opinion, a reasonable compromise may be to port Poly/ML and to<br>\ndownload the Isabelle source directly.</p>\n<p>Tim.<br>\n<a href=\"/user_uploads/14278/A4q2X_u58H6-mfX74Z4NOzTm/signature.asc\">signature.asc</a></p>",
        "id": 294157321,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660851745
    },
    {
        "content": "<p>From: Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt;<br>\nThis used to be the classic way until 2007 or 2008.  Then more and more add-on <br>\ntools were made available by default.  Isabelle2012 already approximates some <br>\nkind of operating system distribution for logic-based tools, with SPASS, E, Z3 <br>\netc.</p>\n<p>I've also taken away the freedom to choose a JVM -- a particular version is <br>\nbundled by default.  This investment of 150 MB extra disk space solves a lot of <br>\nproblems of everybody.  E.g. I've first had both Java 6 and Java 7 as an option <br>\nfor Isabelle2012, but after some months a few dropouts in jEdit on Java 7 <br>\n(update 4) were discovered, so it is back to the 1.6 now. For the next release <br>\nafter Isabelle2012, another JVM will be taken on board, independently of any <br>\nother JVMs that might be installed elsewhere.</p>\n<p>For Windows I also bundle a full Cygwin installation at merely 99 MB. That's a <br>\nreal bargain compared to the logic image sizes:</p>\n<p>HOL 32bit: 140 MB<br>\n   HOL 64bit: 280 MB</p>\n<p>That is the default heap environment that the user needs to download <br>\n(compressed) and unpack -- as part of the main bundle.  It takes in the range <br>\nof minutes to do so.</p>\n<p>Since the coming Poly/ML release is anticipated to be very fast in building HOL <br>\nand producing the image -- and when we've finally abolished the dependency of <br>\n\"make\" in the build process -- the logic images could be built on the spot <br>\nafter download.</p>\n<p>Makarius</p>",
        "id": 294157340,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660851757
    },
    {
        "content": "<p>From: David Matthews &lt;<a href=\"mailto:dm@prolingua.co.uk\">dm@prolingua.co.uk</a>&gt;<br>\nPlease ignore the old \"Porting\" document.  I hadn't realised it was <br>\nstill on the website.  I'll get rid of it since Poly/ML has not used <br>\nstatic address ranges since version 5.0 many years ago.</p>\n<p>It's very likely that the Poly/ML tar-ball will compile and install on <br>\nOpenBSD with at most some minor tweaks.  I've just compiled the SVN <br>\nversion on FreeBSD and just had to add an include file that it required.</p>\n<p>David</p>",
        "id": 294157357,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660851767
    }
]