[
    {
        "content": "<p>From: mailing-list anonymous &lt;<a href=\"mailto:mailing.list.anonymous@gmail.com\">mailing.list.anonymous@gmail.com</a>&gt;<br>\nDear All,</p>\n<p>I would like to thank everyone who replied to the previous thread that I<br>\nstarted both in private and in public (<br>\n<a href=\"https://lists.cam.ac.uk/pipermail/cl-isabelle-users/2019-December/msg00010.html\">https://lists.cam.ac.uk/pipermail/cl-isabelle-users/2019-December/msg00010.html</a>).<br>\nI realized that, perhaps, it was, indeed, wrong of me (purely from the<br>\nperspective of the lack of social awareness) to post using an anonymous<br>\nemail address on this list. Most certainly, I did not mean to offend<br>\nanyone. Moreover, I never intended to become an oddity for which exceptions<br>\nhave to be made. When I registered this email address, I was still under<br>\nthe impression that the Isabelle project is significantly bigger than it<br>\nappeared to be. At the time I thought that just like almost any other<br>\nscience/mathematics forum this mailing list would be inhabited by other<br>\nregular anonymous/pseudonymous posters. However, by now, I understood that<br>\nthere exists a culture that is based on personal acquaintance and, as such,<br>\nanonymous posts are an uncommon occurrence.</p>\n<p>I still do not consider it to be an option to post under my real name<br>\nbecause I believe that such posts could have a negative and long-lasting<br>\neffect on my career and personal life. Nevertheless, I will cease to post<br>\non this list from this email address. If I will ever feel a great need to<br>\nask something on the list, most likely, I will do so under a human<br>\npseudonym, as suggested by several regular users of the list, including<br>\nMakarius Wenzel. It is not unlikely that this email address will be<br>\nderegistered in the near future.</p>\n<p>Thank you</p>",
        "id": 294767126,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661202480
    },
    {
        "content": "<p>From: \"Klein, Gerwin (Data61, Kensington NSW)\" &lt;<a href=\"mailto:Gerwin.Klein@data61.csiro.au\">Gerwin.Klein@data61.csiro.au</a>&gt;</p>\n<blockquote>\n<p>On 5 Dec 2019, at 10:53, mailing-list anonymous &lt;<a href=\"mailto:mailing.list.anonymous@gmail.com\">mailing.list.anonymous@gmail.com</a>&gt; wrote:<br>\n[..]<br>\nI still do not consider it to be an option to post under my real name<br>\nbecause I believe that such posts could have a negative and long-lasting<br>\neffect on my career and personal life. Nevertheless, I will cease to post<br>\non this list from this email address. If I will ever feel a great need to<br>\nask something on the list, most likely, I will do so under a human<br>\npseudonym, as suggested by several regular users of the list, including<br>\nMakarius Wenzel. <br>\n[..]</p>\n</blockquote>\n<p>The pseudonym seems to be a way everyone can live with, and I hope we can welcome you back in new form. The only objection anyone has raised (that I’m aware of) was the anonymous form, never against your person or contributions.</p>\n<p>Cheers,<br>\nGerwin</p>",
        "id": 294767211,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661202502
    },
    {
        "content": "<p>From: Yakoub Nemouchi &lt;<a href=\"mailto:y.nemouchi@gmail.com\">y.nemouchi@gmail.com</a>&gt;<br>\nShould I infer from those conclusions that: society of 2019 fears<br>\nmanagement and try to hide behind pseudonyms to not affect their personal<br>\ncareer!<br>\nIt is a very interesting side effect!</p>\n<p>Does this mean that in 2019, if someone publicly try to reason about a<br>\nproblem, even if it is a very technical problem, and his reasoning is<br>\n\"wrong\" or \"not complete\" he is severely punished by the management<br>\nstrategies of 2019?<br>\nNamely, managers do not believe anymore that \"Any human has the ability to<br>\nlearn and move forward!\" ?<br>\nDoes this mean, if someone uses his brain to reason publicly about<br>\nsomething in 2019, even if it is a very technical thingy, he is punished<br>\nfor that?<br>\nI am interested by this side effect! And I will take those conclusions<br>\nseriously!</p>\n<p>Note the very technical content of this mailing list, which I assumed to<br>\nimmune the users from the recent management strategies(which I do not agree<br>\nwith in most cases, since it contradicts the definition of experimental<br>\nscience most of the time)!</p>\n<p>(Nothing against anonymous here! I had this conclusion 1 and half year ago,<br>\nthat recent management strategies will lead to a cataclysm in academia, and<br>\nthere we are!)</p>\n<p>Best wishes,</p>\n<p>Yakoub.</p>",
        "id": 294767218,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661202505
    }
]