[
    {
        "content": "<p>From: Gottfried Barrow &lt;<a href=\"mailto:gottfried.barrow@gmx.com\">gottfried.barrow@gmx.com</a>&gt;<br>\nI have a theorem that I want to test with Sledgehammer and Nitpick by <br>\ncalling isabelle from the command line.</p>\n<p>For the Sledgehammer test, it's in a theory like this:</p>\n<p>theory z0<br>\nimports z0i<br>\nbegin<br>\nsledgehammer_params[verbose=true,isar_proof=true,timeout=10000000000,provers=\"<br>\n   smt e spass z3_tptp z3<br>\n   \"]<br>\ntheorem really_important_result_neg: \"~(the Riemann conjecture is true)\"<br>\n   apply(auto)<br>\n   sledgehammer<br>\n   oops<br>\nend</p>\n<p>Is there a way to do this so that I get to see the Sledgehammer output?</p>\n<p>I've broken a theory with 4 different tests into 4 different theories <br>\nwith one test each using Sledgehammer or Nitpick.</p>\n<p>If they're all in one theory, then I have to run them sequentially. If I <br>\nhave 4 different theories, and I want to run them all at the same time, <br>\nthen I have to have 5 jEdit views open.</p>\n<p>I probably don't want to be running 4 tests at the same time, but <br>\nthere's a good chance I at least want to run 2 at a time. Tests being <br>\nwhat they are, I want to terminate them sometimes. Starting and <br>\nterminating processes can mess up the one jEdit session that's managing <br>\nall the views.</p>\n<p>I could start up a completely independent jEdit session, other than <br>\nthey're not completely independent because they'll use the same home <br>\nfolder. Well, I could set the environment so they use different home <br>\nfolders.</p>\n<p>Anyway, what I really want to do is run them all from the command line. <br>\nIf I'm testing the negation of a theorem that's been proved, then I'm <br>\nnot expecting Sledgehammer to prove the negation. I could start a test <br>\nin a console window with an 8 hour timeout, and then work in jEdit <br>\nindependently, where I tend to start and shutdown jEdit quite a bit.</p>\n<p>I looked at \"isabelle tty\" briefly, but that didn't look like the <br>\nsolution, though it may be. I searched in the Sledgehammer manual on <br>\n\"command\", and I didn't find anything.</p>\n<p>Thanks,<br>\nGB</p>",
        "id": 294217488,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660895683
    },
    {
        "content": "<p>From: Gottfried Barrow &lt;<a href=\"mailto:gottfried.barrow@gmx.com\">gottfried.barrow@gmx.com</a>&gt;<br>\nBeing able to run Sledgehammer and Nitpick from batch/bash files would <br>\ncreate lots of convenient possibilities.</p>\n<p>It's not just about testing what you've proved. If had a new theorem I <br>\nwas about to start working on, then I could run a 30 second Sledgehammer <br>\nand Nitpick test on both the theorem and its negation, which would be <br>\nthe 4 tests. I could then start 1 or 2 longer tests before starting my <br>\nattempt to prove the theorem.</p>\n<p>It would also conveniently allow me to run two different groups of <br>\nprovers independently on the same theorem in different console windows, <br>\nthe two groups being the local provers and the remote provers. It's good <br>\nto get Sledgehammer to terminate normally, but you don't know when the <br>\nremote provers are going to timeout.</p>\n<p>I'm about to start an overnight experiment with the timeout set to 4 <br>\nhours, but I want predictability, so I'm not going to put any of the <br>\nremote provers in. I'd need to have two independent jEdit sessions <br>\nrunning, like I talk about below, to not end up with a situation where <br>\nthe remote provers never come back, and Sledgehammer is still running 8 <br>\nhours later.</p>\n<p>Regards,<br>\nGB</p>",
        "id": 294217504,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660895695
    },
    {
        "content": "<p>From: Jasmin Blanchette &lt;<a href=\"mailto:jasmin.blanchette@gmail.com\">jasmin.blanchette@gmail.com</a>&gt;<br>\nHi Gottfried,</p>\n<p>The \"system.pdf\" manual explains how to process Isabelle theories on the command line. I never remember the exact syntaxes and have to look it up each time, but look for the \"isabelle usedir\" tool. (There might be other tools as well.) This is nothing specific to Sledgehammer.</p>\n<p>Regards,</p>\n<p>Jasmin</p>",
        "id": 294217633,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660895763
    },
    {
        "content": "<p>From: Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt;<br>\nLong-running IDE sessions do not make much sense.  The tty or unattended <br>\nbatch script are the right approach for that.</p>\n<p>You need to take care that Isabelle/Scala/jEdit present a Unicode <br>\nrendering of the prover sources to you, so copy-paste into a plain <br>\n\"isabelle tty\" session will not work.  You can use \"Reload with Encoding\" <br>\nin jEdit to use UTF8 instead of the default UTF8-Isabelle -- it will <br>\nreveal the true form of the prover in put sources that can then be copied <br>\ninto the raw process.  The latter might still cause additional problems on <br>\nWindows.  It might require some experimentation with the Cygwin-Terminal <br>\nto see how it works.</p>\n<p>Makarius</p>",
        "id": 294217750,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660895824
    },
    {
        "content": "<p>From: Gottfried Barrow &lt;<a href=\"mailto:gottfried.barrow@gmx.com\">gottfried.barrow@gmx.com</a>&gt;<br>\n(I sent this email in earlier today, but it never showed up on the list. <br>\nThe other had an attached zip file containing my experiment files, so <br>\nthat might have been why it got rejected.)</p>\n<p>I tried that, but I'm doing something in a theory that you wouldn't <br>\nnormally do, which is leaving a sledgehammer command under a theorem, <br>\nand wanting usedir to give me sledgehammer feedback like I get in jEdit. <br>\nThis would probably be a feature request, which I'm sure you don't have <br>\ntime for.</p>\n<p>I'll try using i3p: <a href=\"http://pu.inf.uni-tuebingen.de/i3p/\">http://pu.inf.uni-tuebingen.de/i3p/</a></p>\n<p>If I start sledgehammer in jEdit with a long timeout, I have to be <br>\ncareful not to disturb jEdit by scrolling around. Otherwise, it'll start <br>\nsledgehammer again, new prover processes will get started, and old <br>\nprover processes won't get terminated.</p>\n<p>Here are some details if you have time. I can get a decent solution with <br>\neither i3p, Proof General, or jEdit. All of them have some GUI overhead, <br>\nand overhead from having multiple sessions running, but that's the cost <br>\nof doing business. Part of the solution is to run these tests on a <br>\ndifferent computer.</p>\n<p>DETAILS</p>\n<p>If I use \"usedir\" on a theory which has a sledgehammer command in it, an <br>\neprover.exe process gets started (sometimes) that never gets terminated, <br>\nand usedir gives some warning messages even though it finishes building <br>\nthe HTML, GraphBrowser.jar, and session.graph in the browser_info folder.</p>\n<p>Further experimenting, I find out that what happens is not always the <br>\nsame. I'm using sledgehammer in a way it's not meant to be used, so <br>\nwhat's happening is meaningless to some degree.</p>\n<p>With five provers in, I get five warning messages like on the second <br>\nline below:</p>\n<p>Building z0 ...<br>\nsh: <br>\n/cygdrive/e/Isabelle2012/contrib/exec_process-1.0/x86-cygwin/exec_process: <br>\nBad address</p>\n<p>I take two provers out, and an exec_process.exe process gets started <br>\nwhich never gets terminated. With sledgehammer only running \"e\" and <br>\n\"spass\", an \"eprover.exe\" process gets started that never gets terminated.</p>\n<p>With no sledgehammer command in, usedir work as expected.</p>\n<p>Here is the theory with sledgehammer:</p>\n<p>theory z0<br>\nimports z0i<br>\nbegin<br>\nsledgehammer_params[verbose=true,isar_proof=false,timeout=120,provers=\"<br>\n   z3 e spass z3_tptp cvc3<br>\n   \"]<br>\ntheorem emS_is_unique_Sn:<br>\n   \"~(\\&lt;forall&gt;u. (\\&lt;forall&gt;x. x nIN u) \\&lt;longrightarrow&gt; u = emS)\"<br>\n   apply(auto)<br>\n   sledgehammer<br>\n   oops<br>\nend</p>\n<p>Here is the file it imports:</p>\n<p>theory z0i<br>\nimports Main<br>\nbegin<br>\ntypedecl --\"The primitive set type: everything is a set.\"<br>\n   sT<br>\nconsts --\"Set membership predicate: to be axiomatized by subsequent axioms.\"<br>\n   inS::\"sT \\&lt;Rightarrow&gt; sT \\&lt;Rightarrow&gt; bool\" (infixl \"IN\" 55)<br>\nabbreviation<br>\n   ninS::\"sT \\&lt;Rightarrow&gt; sT \\&lt;Rightarrow&gt; bool\" (infixl \"nIN\" 55) <br>\nwhere \"x nIN y == \\&lt;not&gt;(x IN y)\"<br>\nconsts --\"The empty set: naively named as a constant.\"<br>\n   emS::sT<br>\naxiomatization --\"Axiom of existence: the empty set is empty.\" where<br>\n   eeA:\"\\&lt;forall&gt;x. \\&lt;not&gt;(x IN emS)\"<br>\naxiomatization --\"Axiom of extention: set equality.\" where<br>\n   exA: \"\\&lt;forall&gt;u. \\&lt;forall&gt;v. (\\&lt;forall&gt;x. x IN u <br>\n\\&lt;longleftrightarrow&gt; x IN v) \\&lt;longrightarrow&gt; u = v\"<br>\ntheorem emS_is_unique --\"The empty set is unique.\":<br>\n   \"\\&lt;forall&gt;u. (\\&lt;forall&gt;x. x nIN u) \\&lt;longrightarrow&gt; u = emS\"<br>\n   by (metis eeA exA)<br>\nend</p>\n<p>Here is ROOT.ML</p>\n<p>(*<br>\n   no_document use_thy \"ThisTheory\";<br>\n   use_thy \"ThatTheory\";<br>\n*)<br>\nuse_thy \"z0\";</p>\n<p>Here is the usedir command:</p>\n<p>isabelle usedir -b HOL z0</p>\n<p>Here are my usedir etc/settings</p>\n<p>ISABELLE_USEDIR_OPTIONS=\"-i true -g true -M max -p 1 -q 2 -v true <br>\n-V outline=/proof,/ML\"</p>\n<p>Regards,<br>\nGB</p>",
        "id": 294217765,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660895838
    },
    {
        "content": "<p>From: Gottfried Barrow &lt;<a href=\"mailto:gottfried.barrow@gmx.com\">gottfried.barrow@gmx.com</a>&gt;<br>\nOkay. I'll keep that in mind, though it's not obvious to me right now <br>\nhow I'm supposed to use that information to create a batch/bash file to <br>\nautomate everything.</p>\n<p>My idea right now is to use i3p. I used it a little in the past, and it <br>\nseems to be more of a light weight IDE. I can call it directly with a <br>\nbatch file, unlike Proof General under Cygwin. I would have to manually <br>\nstart the proving with i3p, but that's okay.</p>\n<p>If I really get serious about testing theorems then I'll set up a true <br>\nLinux install on a quad core desktop that I'm not using.</p>\n<p>Thanks,<br>\nGB</p>",
        "id": 294217780,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660895849
    },
    {
        "content": "<p>From: Gottfried Barrow &lt;<a href=\"mailto:gottfried.barrow@gmx.com\">gottfried.barrow@gmx.com</a>&gt;<br>\nI think using a second session of jEdit with the environment set to a <br>\ndifferent home folder is the best solution for what I'm trying to do. <br>\nRunning things with a batch file sounds good as an idea, but there's a <br>\nlot of interaction between jEdit and Sledgehammer that would be hard to <br>\nduplicate.</p>\n<p>The main way I keep in control is by entering \"sledgehammer\" when I want <br>\nit to start, and otherwise, making sure the \"sledgehammer\" command isn't <br>\nin the file. Sledgehammer is very eager to start running.</p>\n<p>I have to make sure \"sledgehammer\" isn't in before trying to edit the <br>\nfile in any way. If I try to edit the timeout value with \"sledgehammer\" <br>\nin, it'll jump down to the sledgehammer step after a single keystroke.</p>\n<p>Also, if I delete \"sledgehammer\" while the provers are still running, it <br>\nseems to be good at shutting them down. I'll see a process such as <br>\n\"eprover.exe\" taking up 25% of the CPU processing, and when I delete <br>\n\"sledgehammer\", it'll kill the process.</p>\n<p>I start a second copy of jEdit with a different home folder, so it <br>\ndoesn't write over my main jEdit settings, and then I split the screen <br>\nvertically four or more times with \"View / Splitting / Split <br>\nVertically\". I haven't gotten to the point where I try to run <br>\nsledgehammer in 4 files and nitpick in 2 files all at the same time. <br>\nThat will require 7 split windows.</p>\n<p>I haven't figured out how independent the continuous prover allows <br>\nsledgehammer to be when running in two different files. I might need to <br>\nstart up 3 or more copies of jEdit</p>\n<p>I'm trying to see if I can compile the prover satallax for Cygwin.</p>\n<p>Regards,<br>\nGB</p>",
        "id": 294217795,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660895860
    },
    {
        "content": "<p>From: Gottfried Barrow &lt;<a href=\"mailto:gottfried.barrow@gmx.com\">gottfried.barrow@gmx.com</a>&gt;<br>\nJens,</p>\n<p>At least with Windows, installing Java is near effortless. In trying to <br>\nget Suse, Fedora, and Ubuntu going under VirtualBox, I thought I was <br>\ngoing to have to install Java, and it's not effortless because Sun Java <br>\nis never part of the install these days, and they replace Sun Java with <br>\nopenSDK Java.\n*\nJAVA INCLUDED WITH BOTH CYGWIN &amp; LINUX*</p>\n<p>Last year I ran Isabelle2011 under Ubuntu, and I had to install Sun Java <br>\nto do it, which sudo makes reasonably easy, but you have to hunt down a <br>\nsite for sudo to get it from, and such a site is never going to be an <br>\nofficial download site, so installing Sun Java on Linux can become a <br>\nsecurity risk.</p>\n<p>Somewhere in the process of installing Linux distributions this year, <br>\nthe thought occurred to me, \"Hmmm, I wonder if Makarius put the JVM <br>\nruntime under contrib for the linux distribution.\" I opened up <br>\nIsabelle2012_bundle_x86_64-linux.tar.gz, and there I saw the folder <br>\njdk-6u31_x86_64-linux. Thanks Makarius for no installation necessary on <br>\nthe big components, like Cygwin and Java, which the user used to have to <br>\nintall, Cygwin not being straightforward at all, and Sun Java on Linux <br>\nnot being straightforward.</p>\n<p>One thing that used to concern me was Java constantly updating itself. <br>\nI'd think, \"I better keep these old Windows Java install files because a <br>\nJava update could break Isabelle.\" Now the Java runtime version gets <br>\nfixed for a particular version of Isabelle.</p>\n<p><em>NORTON QUIT DELETING ISABELLE.EXE</em></p>\n<p>The thread \"Windows Command Line 2012\" brought my attention back to <br>\n\"Isabelle.exe\" which is now run to start Isabelle.</p>\n<p>I thought maybe I had messed up my Isabelle2012 install, so I <br>\nreinstalled it again, and found out that Norton now finds \"Isabelle.exe\" <br>\nacceptable.</p>\n<p>One of Norton's scan methods is \"reputation\". So if Norton thinks a <br>\nprogram is acting suspicious, and the program has no reputation because <br>\nit's a new release, then it quarantines the program. Norton File Insight <br>\nnow tells me about \"Isabelle.exe\":</p>\n<p>1) Very Few Users: Fewer than 5 users in the Norton Community have used <br>\nthis file.<br>\n2) Mature: This file was released 1 month ago.<br>\n3) Good: Norton has given this file a favorable ratting.</p>\n<p>At the time Norton was deleting Isabelle.exe, the rating was \"unknown\" <br>\nbecause Norton knew nothing about the \"Isabelle.exe\".</p>\n<p><em>OTHER ANTIVIRUS INFORMATION</em></p>\n<p>I could use free antivirus software, but Norton has protected me for <br>\nseveral years, so I go to a local chain store and pay $40 for a 3 <br>\ncomputer license of Norton 360 instead of paying $59 or $89 on their <br>\nsite. Plus, I think they have one of the better firewalls.</p>\n<p>Developers playing tricks to get Linux/Unix programs to run on Windows <br>\ntake a chance on getting them blocked by antivirus programs. I've never <br>\nhad Norton ever complain about Cygwin, but it's a native or semi-native <br>\napplication of Windows, based on what I know about it.</p>\n<p>The \"alt_ergo\" executable \"alt-ergo-0.94-mingw.exe\" got rejected by <br>\nNorton, so minGW executables can get the reject.</p>\n<p>A couple of months ago, Norton deleted the install file for the Coq beta <br>\nversion, which I was trying to use in conjunction with a type theory <br>\nbook. I unquarantined the Coq installer and installed it, then when <br>\nexperimenting with it, I selected \"compile\" from some menu and Norton <br>\nshut down the compile executable and deleted it. I figured I didn't need <br>\nto be doing taht anyway, so I uninstalled Coq, to wait for another day.</p>\n<p>Anyway, a person intent on using a program can tell the antivirus <br>\nprogram to unblock it, but people trying out a new program will reject <br>\nit if it ends up being too much trouble.</p>\n<p><em>COMPILING PROVERS FOR CYGWIN and E's SLOW STARTUP</em></p>\n<p>The reason I reinstalled Isabelle2012 was because I had been seeing <br>\neprover.exe show up as a process, but then it stopped showing up.</p>\n<p>It turns out that eprover.exe takes a little over 35 seconds to start up <br>\non Cygwin. I had switched to using a timeout of 30 seconds, and I had <br>\ninstalled gcc and OCaml for Cygwin, so I thought I might have messed up <br>\nthe Cygwin under the contrib folder, but that wasn't the case</p>\n<p>I successfully compiled leo2, satallax, why3, and alt-ergo for Cygwin.</p>\n<p>Leo2 built with no hassles. I had problems with the first try of <br>\nsatallax, but I retried with new, untarred sources, and it magically <br>\nbuilt per the instructions.</p>\n<p>For alt-ergo, I had to build why3. Why3 got some kind of error at the <br>\nend, but a \"make install\" still seemed to make it work good enough.</p>\n<p>There's a minGW exe for alt-ergo, but I rebuilt it because when I run <br>\nalt-ergo with the minGW exe, I get this error:</p>\n<p>\"alt_ergo\": A prover error occurred:<br>\n    Unknown input format: tff1</p>\n<p>To build a Cygwin binary for alt-ergo, I had to build \"ocamlgraph\", and <br>\nthe key to success there was not building the GUI, and to get the <br>\ncorrect make file, I had to uninstall the GTK library that was causing <br>\nproblems.</p>\n<p>I get the same error with the Cygwin binary, so after reading the <br>\ndescription of alt-ergo, I assume alt-ergo does some specialized proving.</p>\n<p><em>VAMPIRE 0.6 FOR CYGWIN, INSTALLING LINUX TO GET VAMPIRE</em></p>\n<p>Trying to run Vampire for Cygwin, I get this error:</p>\n<p>\"vampire\": A prover error occurred:<br>\n     User error: forced_options is not a valid option</p>\n<p>The Cygwin version is 0.6, and I assume the Linux version is 1.8.</p>\n<p>The latest version of Vampire is the local prover that I can't on <br>\nCygwin. It seems a shame to have to have to install Linux to get it, <br>\nwhen I have all the other local provers, but Vampire appears to be one <br>\nof the best for first-order logic:</p>\n<p><a href=\"http://www.cs.miami.edu/~tptp/CASC/J6/WWWFiles/DivisionSummary1.html\">http://www.cs.miami.edu/~tptp/CASC/J6/WWWFiles/DivisionSummary1.html</a> <br>\n&lt;<a href=\"http://www.cs.miami.edu/%7Etptp/CASC/J6/WWWFiles/DivisionSummary1.html\">http://www.cs.miami.edu/%7Etptp/CASC/J6/WWWFiles/DivisionSummary1.html</a>&gt;</p>\n<p>I got that link off of the satallax web page:</p>\n<p><a href=\"http://www.ps.uni-saarland.de/~cebrown/satallax/\">http://www.ps.uni-saarland.de/~cebrown/satallax/</a> <br>\n&lt;<a href=\"http://www.ps.uni-saarland.de/%7Ecebrown/satallax/\">http://www.ps.uni-saarland.de/%7Ecebrown/satallax/</a>&gt;</p>\n<p>Satallax seems to be at a distinct disadvantage when competing in prover <br>\ncompetitions with Sledgehammer, considering that Sledgehammer uses <br>\nSatallax, in addition to many other provers.</p>\n<p><em>CREATING 10 FILES TO TEST ONE THEOREM</em></p>\n<p>I finish up my \"the user reports back from the field on using <br>\nSledgehammer and Nitpick to test theorems\".</p>\n<p>First, when using Sledgehammer and Nitpick in jEdit, where <br>\n\"sledgehammer\" (or nitpick) is the only proof command in a file, it <br>\nhelps to know that there are only three states:</p>\n<p>1) Sledgehammer is running because a \"sledgehammer\" command exists in <br>\nthe file, and Sledgehammer hasn't finished.</p>\n<p>2) Sledgehammer has finished running, the results are in the output <br>\npanel, and nothing has been done to the jEdit session to make <br>\nSledgehammer start over, where Sledgehammer starting over will erase the <br>\nold results. \"Anything\" could be editing the file in any way, or working <br>\nin another file that's also visible in the same jEdit process. The <br>\nsafest way to keep Sledgehammer from starting over is to only scroll <br>\nthrough the Sledgehammer results until you know you don't want them <br>\nanymore. That can be a problem when Sledgehammer is constantly updating <br>\nits results, but I foresee only running Sledgehammer for hours and hours <br>\nwhen no results are being found.</p>\n<p>3) Sledgehammer is prevented from running because a \"sledgehammer\" <br>\ncommand doesn't exist in the file, where deleting a \"sledgehammer\" <br>\ncommand will cause the continuous prover to terminate the prover <br>\nprocesses that are running. (Deleting running sledgehammer commands <br>\nbefore closing a file or closing jEdit is the best thing to do.)</p>\n<p>There are commands in the Sledgehammer manual, such as \"sledgehammer <br>\nrunning_provers\", but that doesn't apply to jEdit that I can tell. If I <br>\ntry to run such a command, sledgehammer immediately starts over. I <br>\nactually use this eagerness of sledgehammer to start as a way to use it <br>\nlike a batch file.</p>\n<p>Okay, so to test one theorem and its negation, I create 10 different <br>\nfiles that all import their own copy of the main THY file.  These 10 <br>\nfiles get loaded into 10 different jEdit sessions, where I use the <br>\nswitch \"-j -settings=/.isabelle/%ISAVERSION%/jedit%1\" to tell jEdit <br>\nwhere to store the settings, which require me to copy my main home jEdit <br>\nfolder to 10 different folders, such as <br>\n/users/me/.isabelle/Isabelle2012/jedit1.</p>\n<p>I break the test out into 10 files because I want to learn how the <br>\ndifferent provers work, want to close jEdit for provers which have <br>\nfinished, and I want to terminate and start provers without causing <br>\nother provers to start over.</p>\n<p>Right now, I'm grouping them like this:</p>\n<p>(<em>1 e spass_new remote_vampire remote_e_sine remote_iprover_eq</em>)<br>\n   (*2 z3_tptp spass metis vampire remote_e_tofof remote_iprover <br>\nremote_snark*)<br>\n   (<em>3 z3 yices cvc3 smt alt_ergo remote_waldmeister</em>)<br>\n   (<em>4 satallax leo2</em>)<br>\n   (*5 remote_leo2 remote_satallax remote_e remote_z3_tptp remote_cvc3 <br>\nremote_z3*)</p>\n<p>Groups 1 and 2 are first-order provers, and I break them up because \"e\" <br>\nis going to run as long as I let it.</p>\n<p>Group 3 is mainly the SMT provers.</p>\n<p>Group 4 is the higher-order provers, and they'll run as long as I let <br>\nthem. Group 5 is the remote duplicates.</p>\n<p>My WinEdt script can create some or all of the 10 files, and then for <br>\neach file created, it calls a new process of jEdit using a corresponding <br>\nsettings folder. Sledgehammer and nitpick start automatically if a <br>\n\"sledgehammer\" or \"nitpick\" command is in the file. I arrange the 10 <br>\nwindows where I want them, and jEdit will remember the settings.</p>\n<p>I set the default for both Sledgehammer and Nitpick at 48 hours. The <br>\nidea is that I can always terminate by deleting the sledgehammer or <br>\nnitpick command, but it will always take me, say, 10 minutes to pick up <br>\nwhere a test left off if it finished after 10 minutes.</p>\n<p>Not knowing how the provers work, I assume the first x minutes for a <br>\nprover is always the same. So a prover run for 1 hour twice is only a 1 <br>\nhour test, where a 2 hour test has done something different the second <br>\nhour than the first.</p>\n<p>As it turns out, m<br>\n[message truncated]</p>",
        "id": 294218262,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660896071
    }
]