[
    {
        "content": "<p>From: Lennart Beringer &lt;<a href=\"mailto:eberinge@cs.princeton.edu\">eberinge@cs.princeton.edu</a>&gt;<br>\nApplications are now invited for participation in the</p>\n<p>Third DeepSpec Summer School (DSSS'20)<br>\n         New Haven, CT, July 13-24, 2020<br>\n<a href=\"https://deepspec.org/event/dsss20\">https://deepspec.org/event/dsss20</a></p>\n<p>Overview</p>\n<hr>\n<p>Can critical systems be built according to functionally precise<br>\nspecifications of of their constituent components (processor,<br>\noperating system, crypto library,..) and development tools (compilers,<br>\nsynthesis tools)? This may seem a pipe dream, but the past decade has<br>\nseen remarkable advances in the technology required to realize it. The<br>\nDeepSpec summer school will provide students with knowledge and<br>\nexperience necessary for understanding the state of the art and for<br>\ncontributing to ongoing research efforts, based on the interactive<br>\nproof assistant Coq. The school is supported by generous funding from<br>\nthe National Science Foundation.</p>\n<p>DSSS'20 will consist of two parts with the first week being devoted to<br>\nintroductory topics and the second week covering current research<br>\nefforts.</p>\n<p>July 13-15 (Mon-Wed)    Coq intensive; CertiKOS design &amp; spec<br>\nJuly 16-17 (Thu-Fri)    Fundamental proof techniques and project overviews<br>\nJuly 20-24 (week 2)     Advanced topics in system verification</p>\n<ul>\n<li>\n<p>Week 1 begins with a Coq Intensive, introducing our favorite proof<br>\n  assistant (used in almost all other lectures), with no assumption of<br>\n  formal-methods experience.  A mix of lecturers (who will also<br>\n  present research lectures later in the program) will cover this<br>\n  material.</p>\n</li>\n<li>\n<p>For participants who already know the Coq Intensive material, we<br>\n  will offer a Week 1 parallel track taught by Zhong Shao, on the<br>\n  CertiKOS operating-system framework, focused on the compositional<br>\n  specification and implementation of C modules, setting up to learn<br>\n  how to prove these modules in Week 2.</p>\n</li>\n<li>\n<p>Week 1 ends with lectures by Andrew Appel, on verified functional<br>\n  algorithms; and Joe Tassarotti, on theory and computer-systems<br>\n  applications of the Iris verification framework for concurrency.</p>\n</li>\n<li>\n<p>Week 2 includes lectures by Adam Chlipala, on connecting proofs of<br>\n  hardware and software components for embedded systems; Benjamin<br>\n  Pierce, on random testing and an application to web servers; Zhong<br>\n  Shao, on operating-system verification; Matthieu Sozeau, on the<br>\n  MetaCoq framework and (as a representative of the Coq team at Inria)<br>\n  recent improvements in and latest roadmap for Coq; Stephanie<br>\n  Weirich, on verifying functional algorithms written in Haskell; and<br>\n  Steve Zdancewic, on the Interaction Trees formalism and its<br>\n  applications to compilers and testing.</p>\n</li>\n<li>\n<p>There will be ample opportunity for self-study/homework, student<br>\n  presentations, and other activities.</p>\n</li>\n</ul>\n<p>Prerequisites</p>\n<hr>\n<p>DSSS'20 is aimed at a wide range of participants, including graduate<br>\nstudents, academics, and industrial engineers and researchers.</p>\n<p>The Coq proof assistant will serve as a lingua franca for all the<br>\nlectures. Participants who are not familiar with Coq at the level of<br>\nSoftware Foundations (Volume 1) should plan on attending the Coq<br>\nIntensive. Participants unfamiliar with volumes 2 and 3 may benefit<br>\nfrom attending the last 3 days of week 1.</p>\n<p>Participants of DSSS'17 and DSSS'18 are likely to be admitted for<br>\nparticipation in week 2 only.</p>\n<p>Application and participation</p>\n<hr>\n<p>Participation in DSSS'20 is by invitation only, based on an<br>\napplication process that is open to anybody. To apply, please fill<br>\nthis application form</p>\n<p><a href=\"https://cvent.me/xqlq0G\">https://cvent.me/xqlq0G</a></p>\n<p>preferably no later than March 27, 2020. Accepted participants will be<br>\nnotified shortly thereafter, and will be invited to confirm their<br>\nparticipation by registering.</p>\n<p>Thanks to the generosity of NSF, we will be able to provide<br>\nsubstantial financial assistance to all participants. We will not<br>\ncharge a registration fee, and will offer free dorm accommodation on<br>\nthe campus of Yale University. In addition, we expect to<br>\nsubsidize travel expenses for the majority of participants, based on<br>\ntheir geographic origin, qualification, and financial needs. To help<br>\nus allocating these funds, the application form includes the option to<br>\nenter estimated travel costs etc.</p>\n<p>Late applications will be handled on a case-by-case basis.  </p>\n<p>For additional information on the DeepSpec project, please see<br>\n<a href=\"https://deepspec.org\">https://deepspec.org</a></p>",
        "id": 294822615,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661242892
    }
]