[
    {
        "content": "<p>From: Matthew Fernandez &lt;<a href=\"mailto:matthew.fernandez@nicta.com.au\">matthew.fernandez@nicta.com.au</a>&gt;<br>\nHi,</p>\n<p>Isabelle/jEdit has an option to configure the number of threads in use for parallel proofs:<br>\n   Plugins &gt; Plugin options &gt; Isabelle &gt; General &gt; Parallel processing &gt; Threads</p>\n<p>By default, this is set to 0 which indicates the \"hardware max.\" I find on machines with hyperthreading, this means the<br>\nnumber of physical cores, not the number of logical hardware threads. E.g. on a machine I have here with 2 hyperthreaded<br>\ncores, Isabelle/jEdit appears to use 2 threads when I would prefer 4. I realise I can set this manually, but I was<br>\nwondering if the default behaviour is deliberate? Perhaps the assumption is that the shared resources on the cores are<br>\nkept busy enough by Isabelle that the extra threads won't help. I'm just asking out of curiosity, more than anything<br>\nelse. The host environment is 64-bit Linux by the way.</p>\n<p>Thanks,<br>\nMatt</p>\n<hr>\n<p>The information in this e-mail may be confidential and subject to legal professional privilege and/or copyright. National ICT Australia Limited accepts no liability for any damage caused by this email or its attachments.</p>",
        "id": 294645659,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661163960
    },
    {
        "content": "<p>From: Harry Butterworth &lt;<a href=\"mailto:heb1001@gmail.com\">heb1001@gmail.com</a>&gt;<br>\nI think the behaviour has changed between 2014 and 2015 as 2014 used to use<br>\n100% of CPU with hyperthreading turned on and 2015 now peaks only just<br>\nabove 50%.</p>\n<p>I've been running with hyperthreading disabled in the BIOS anyway as I did<br>\nsome benchmarking (using run_tests from seL4) with 2014 and the fastest<br>\nconfiguration I found (for my x5680) was with hyperthreading disabled.<br>\nSome of the tests were a bit faster at the same clock speed with<br>\nhyperthreading disabled but the main benefit was that by disabling<br>\nhyperthreading I could run with a higher clock speed for the same CPU<br>\ntemperature at max load.</p>\n<p>I also benchmarked the difference between speedstep on and off (on an i7<br>\n5820k this time) and see a 10% improvement by turning speedstep off which<br>\nwill be useful in the winter when I need a heater.</p>",
        "id": 294645733,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661163972
    },
    {
        "content": "<p>From: Matthew Fernandez &lt;<a href=\"mailto:matthew.fernandez@nicta.com.au\">matthew.fernandez@nicta.com.au</a>&gt;<br>\nOn 29/06/15 14:22, Harry Butterworth wrote:</p>\n<blockquote>\n<p>I think the behaviour has changed between 2014 and 2015 as 2014 used to use 100% of CPU with<br>\nhyperthreading turned on and 2015 now peaks only just above 50%.</p>\n<p>I've been running with hyperthreading disabled in the BIOS anyway as I did some benchmarking (using<br>\nrun_tests from seL4) with 2014 and the fastest configuration I found (for my x5680) was with<br>\nhyperthreading disabled.  Some of the tests were a bit faster at the same clock speed with<br>\nhyperthreading disabled but the main benefit was that by disabling hyperthreading I could run with a<br>\nhigher clock speed for the same CPU temperature at max load.</p>\n<p>I also benchmarked the difference between speedstep on and off (on an i7 5820k this time) and see a<br>\n10% improvement by turning speedstep off which will be useful in the winter when I need a heater.</p>\n</blockquote>\n<p>Thanks, Harry, informative to hear your results. I don't have the same processor, but I suspect mine<br>\nbehaves the same in limiting the clock frequency with hyperthreading enabled. I don't want to<br>\ndisable it or speedstep, so I'll just live with my current setup.</p>\n<blockquote>\n<p>On 29 Jun 2015 09:08, \"Matthew Fernandez\" &lt;<a href=\"mailto:matthew.fernandez@nicta.com.au\">matthew.fernandez@nicta.com.au</a><br>\n&lt;mailto:<a href=\"mailto:matthew.fernandez@nicta.com.au\">matthew.fernandez@nicta.com.au</a>&gt;&gt; wrote:</p>\n<p>Hi,</p>\n<p>Isabelle/jEdit has an option to configure the number of threads in use for parallel proofs:<br>\n       Plugins &gt; Plugin options &gt; Isabelle &gt; General &gt; Parallel processing &gt; Threads</p>\n<p>By default, this is set to 0 which indicates the \"hardware max.\" I find on machines with<br>\n    hyperthreading, this means the<br>\n    number of physical cores, not the number of logical hardware threads. E.g. on a machine I have<br>\n    here with 2 hyperthreaded<br>\n    cores, Isabelle/jEdit appears to use 2 threads when I would prefer 4. I realise I can set this<br>\n    manually, but I was<br>\n    wondering if the default behaviour is deliberate? Perhaps the assumption is that the shared<br>\n    resources on the cores are<br>\n    kept busy enough by Isabelle that the extra threads won't help. I'm just asking out of<br>\n    curiosity, more than anything<br>\n    else. The host environment is 64-bit Linux by the way.</p>\n<p>Thanks,<br>\n    Matt</p>\n<p>________________________________</p>\n<p>The information in this e-mail may be confidential and subject to legal professional privilege<br>\n    and/or copyright. National ICT Australia Limited accepts no liability for any damage caused by<br>\n    this email or its attachments.<br>\n</p>\n</blockquote>\n<hr>\n<p>The information in this e-mail may be confidential and subject to legal professional privilege and/or copyright. National ICT Australia Limited accepts no liability for any damage caused by this email or its attachments.</p>",
        "id": 294645840,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661164021
    }
]