[
    {
        "content": "<p>From: Lawrence Paulson &lt;<a href=\"mailto:lp15@cam.ac.uk\">lp15@cam.ac.uk</a>&gt;<br>\nProv-E-Voting: computer-assisted formal analysis of electronic voting protocols.<br>\nComputer Security and Trust group, STRL, Faculty of Technology, De Montfort University, Leicester.</p>\n<p>STARTING OCTOBER 2010</p>\n<p>Applications are invited for a PhD research studentship within the Faculty of Technology, De Montfort University, Leicester.    The project will combine for the first time the use of a theorem prover, such as Isabelle, for the specification of electronic voting protocols and the verification of their security goals. It will benefit from close collaboration with Cambridge University and the University of Luxembourg.</p>\n<p>This research opportunity is one of over 15 scholarships funded by De Montfort University in 2010-11 to build on our excellent achievements in RAE 2008, to develop our research capacity into new and evolving areas of study and to consolidate our national and international research partnerships. Applications are invited from citizens of UK or EU who should have a good first degree (First Class, Upper Second Class or equivalent) in a relevant subject and, in particular, sufficient acquaintance with formal logic, computer-assisted formal methods and computer security. Doctoral studentships are available for up to 3 years full-time study starting October 2010 and provide a bursary of £13,500pa in addition to all university tuition fees.</p>\n<p>Applicants are requested to contact the Faculty Research Office to receive an admission pack. Each application must outline how the applicant intends to pursue research in formal analysis of electronic voting protocols using a theorem prover. Each application must also be accompanied by a full CV and two supporting reference letters. Please email Lindsey Trent: <a href=\"mailto:lrtrent@dmu.ac.uk\">lrtrent@dmu.ac.uk</a> to receive further details.</p>\n<p>Please quote ref: DMU Studentships 2010</p>\n<p>CLOSING DATE : Friday 16th April 2010</p>\n<p>[Via G Bella]</p>",
        "id": 294104455,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660834785
    }
]