[
    {
        "content": "<p>From: Van Staden  Stephan &lt;<a href=\"mailto:stephan.vanstaden@inf.ethz.ch\">stephan.vanstaden@inf.ethz.ch</a>&gt;<br>\nDear all,</p>\n<p>I have some trouble configuring a fresh Isabelle2013-2/jedit installation:</p>\n<ol>\n<li>\n<p>It seems that sledgehammer only invokes \"e\" and \"spass\". How can I configure it to invoke more solvers (e.g. those that Isabelle2011 invoked by default)? It would be best if this is a persistent configuration setting, so that I don't have to repeat it every time I launch Isabelle or sledgehammer.</p>\n</li>\n<li>\n<p>Auto completion used to show a drop-down box with the sigma character when I typed \"sig\". Similarly, it used to show an existential quantifier when I typed \"exists\". This does not work anymore. How can I turn it on again?</p>\n</li>\n</ol>\n<p>Many thanks,<br>\nStephan</p>",
        "id": 294269925,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660916845
    },
    {
        "content": "<p>From: John Wickerson &lt;<a href=\"mailto:johnwickerson@cantab.net\">johnwickerson@cantab.net</a>&gt;<br>\nI know the answer to the second: you have to type \"\\sig\" rather than \"sig\" nowadays.</p>\n<p>John</p>",
        "id": 294269941,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660916851
    },
    {
        "content": "<p>From: Buday Gergely &lt;<a href=\"mailto:gbuday@karolyrobert.hu\">gbuday@karolyrobert.hu</a>&gt;<br>\nHi Stephan,</p>\n<p>for 1,</p>\n<p><a href=\"http://www.cl.cam.ac.uk/research/hvg/Isabelle/dist/Isabelle2013-2/doc/sledgehammer.pdf\">http://www.cl.cam.ac.uk/research/hvg/Isabelle/dist/Isabelle2013-2/doc/sledgehammer.pdf</a></p>\n<p>gives you details on how to set the necessary shell variables. If on Windows, you should start the batch file that gives you a cygwin prompt and then go ahead. Read the section 2 Installation.</p>\n<ul>\n<li>Gergely</li>\n</ul>",
        "id": 294270005,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660916882
    },
    {
        "content": "<p>From: Van Staden  Stephan &lt;<a href=\"mailto:stephan.vanstaden@inf.ethz.ch\">stephan.vanstaden@inf.ethz.ch</a>&gt;<br>\nHi Buday,</p>\n<p>I'm afraid this does not solve my problem. The shell variables help to locate local (as opposed to remove) solvers, but I want to invoke remote ones plus the standard ones that come with Isabelle2013-2.</p>\n<p>Stephan</p>",
        "id": 294270048,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660916888
    },
    {
        "content": "<p>From: Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt;<br>\nThat actually depends on your number of Isabelle/ML worker threads, which <br>\nis determined from the number of harware cores.</p>\n<p>Sledgehammer has some builtin smartness to guess which provers you want. <br>\nBut that is not immediately obvious, and based on assumptions from TTY / <br>\nProof General interaction, where the ML process is idle waiting to process <br>\nthe next command, and then has all cores available.  These assumptions no <br>\nlonger hold in Isabelle/jEdit, where many things can run in parallel all <br>\nthe time --- which was the whole point of the exercise to go beyond TTY / <br>\nProof General several years ago.</p>\n<p>Sledgehammer defaults need to be sorted out again for the next release <br>\n(summer 2014), to make it clear and simple what the configuration is, and <br>\nwhere it is actually configured.</p>\n<p>Until then, you can write the list of provers for Sledgehammer into the <br>\n\"Provers\" entry field in the Isabelle/jEdit Sledgehammer panel.  Then type <br>\nRETURN to run it and make that content persistent in the history of the <br>\ntext field.  Next time, the field content will default again to the <br>\ndynamic smart value provided by Sledeghammer from Isabelle/ML, but you can <br>\nselect an alternative from your GUI history, using the triangle or <br>\nright-click on the field as usual in jEdit.</p>\n<p>Makarius</p>",
        "id": 294270060,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660916894
    },
    {
        "content": "<p>From: Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt;<br>\nThe last two sentences are the typical user-reflex to get back to <br>\nsomething familiar as quick as possible, and missing the main points of <br>\nimprovements that happened in the meantime.</p>\n<p>Whenever there is a user-relevant change, the NEWS file is the first point <br>\nto look.  It is easily available via the Documentation panel, entry <br>\n\"NEWS\", in particular it says:</p>\n<p>* Improved completion mechanism, which is now managed by the<br>\n   Isabelle/jEdit plugin instead of SideKick.  Refined table of Isabelle<br>\n   symbol abbreviations (see $ISABELLE_HOME/etc/symbols).</p>\n<p>Moreover, it is vital to look around what is new, otherwise important NEWS <br>\nare missed like this one:</p>\n<p>* New manual \"jedit\" for Isabelle/jEdit, see isabelle doc or<br>\n   Documentation panel.</p>\n<p>That manual also has some section on completion, but it still demands some <br>\nstudy and experimentation to see how the mechanism actually works. That <br>\ntime is well-invested, though, since typing stuff into the text-buffer is <br>\ndone all the time, and knowing its options and possibilities helps to <br>\nbecome more productive.</p>\n<p>That does not mean that it is the final word to completion in <br>\nIsabelle/jEdit.  I have already further ideas in the back-hand, and more <br>\nmight emerge from experience reports by people who have worked with it for <br>\nsome time, leaving old things behind and looking towards new things.</p>\n<p>Makarius</p>",
        "id": 294270073,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660916900
    },
    {
        "content": "<p>From: Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt;<br>\nYou <em>can</em> press the Apply button, but it does not mean you <em>must</em>. Just <br>\nbecause there is one (obvious) way does not mean that there are no others.</p>\n<p>When the Sledgehammer panel gains focus, its \"Provers\" field becomes <br>\nactive, and RETURN will run the main operation.</p>\n<p>I leave it as an exercise to find out more than one way to have a jEdit <br>\ndockable window gain focus, just by keyboard control. I don't even know <br>\nall this myself -- jEdit is very flexible, without making it too heavy or <br>\nbloated.</p>\n<p>Moreover the specific \"action\" isabelle-sledgehammer might help to apply<br>\ngeneral principles of jEdit.  See again the Isabelle/jEdit manual and its <br>\nincluded link to the jEdit documentation.</p>\n<p>Makarius</p>",
        "id": 294270137,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660916924
    },
    {
        "content": "<p>From: Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt;<br>\nThat seems to be mostly outdated, from long ago when there were no <br>\n\"Isabelle components\" yet.  I don't know anything about the practical <br>\nrelevance of the zoo of exotic provers, but the main ones are already <br>\nincluded in the Isabelle distribution.</p>\n<p>The remote Z3 server at TUM disappeared without anybody taking notice.</p>\n<p>Makarius</p>",
        "id": 294270157,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660916931
    },
    {
        "content": "<p>From: Gergely Buday &lt;<a href=\"mailto:gbuday@gmail.com\">gbuday@gmail.com</a>&gt;<br>\nSome people would like to use higher-order provers Satallax and<br>\nLEO-II. Would it be possible to include them in the distribution? I<br>\nguess relying on ocaml is not necessary welcome as it would add an<br>\nadditional dependency. What do you think? At the end of March I would<br>\nhave some free time for creating the automatic building.</p>\n<ul>\n<li>Gergely</li>\n</ul>",
        "id": 294270194,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660916944
    },
    {
        "content": "<p>From: Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt;<br>\nThere is no need for automatic building -- Isabelle is not another Linux <br>\ndistribution or package repository.  What is required is routine <br>\nmulti-platform support as described in <br>\n<a href=\"http://isabelle.in.tum.de/repos/isabelle/file/972f0aa7091b/Admin/PLATFORMS\">http://isabelle.in.tum.de/repos/isabelle/file/972f0aa7091b/Admin/PLATFORMS</a></p>\n<p>By coincidence Jasmin and myself are maintaining most of these Isabelle <br>\ncomponents that end up in the final release.  Ultimately, such components <br>\nneed to be work routinely for all users on all platforms according to the <br>\nabove specification.</p>\n<p>Makarius</p>",
        "id": 294272113,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660917550
    },
    {
        "content": "<p>From: Gergely Buday &lt;<a href=\"mailto:gbuday@gmail.com\">gbuday@gmail.com</a>&gt;<br>\nMakarius wrote:</p>\n<p>But how to provide this multiplatform support other than building it<br>\nfor the different platforms? Should I provide binaries only?</p>\n<ul>\n<li>Gergely</li>\n</ul>",
        "id": 294272136,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660917558
    }
]