[
    {
        "content": "<p>From: \"Thiemann, René\" &lt;<a href=\"mailto:Rene.Thiemann@uibk.ac.at\">Rene.Thiemann@uibk.ac.at</a>&gt;<br>\nDear all,</p>\n<p>I’d like to announce the following new AFP entry.</p>\n<p>Enjoy,<br>\nRené</p>\n<p>Zermelo Fraenkel Set Theory in Higher-Order Logic<br>\n  by Lawrence C. Paulson</p>\n<p>This entry is a new formalisation of ZFC set theory in Isabelle/HOL. It is logically equivalent to Obua's HOLZF; the point is to have the closest possible integration with the rest of Isabelle/HOL, minimising the amount of new notations and exploiting type classes.</p>\n<p>There is a type V of sets and a function elts :: V =&gt; V set mapping a set to its elements. Classes simply have type V set, and a predicate identifies the small classes: those that correspond to actual sets. Type classes connected with orders and lattices are used to minimise the amount of new notation for concepts such as the subset relation, union and intersection. Basic concepts — Cartesian products, disjoint sums, natural numbers, functions, etc. — are formalised.</p>\n<p>More advanced set-theoretic concepts, such as transfinite induction, ordinals, cardinals and the transitive closure of a set, are also provided. The definition of addition and multiplication for general sets (not just ordinals) follows Kirby.</p>\n<p>The theory provides two type classes with the aim of facilitating developments that combine V with other Isabelle/HOL types: embeddable, the class of types that can be injected into V (including V itself as well as V*V, etc.), and small, the class of types that correspond to some ZF set.</p>",
        "id": 294765570,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661201769
    },
    {
        "content": "<p>From: Wolfgang Jeltsch &lt;<a href=\"mailto:wolfgang-it@jeltsch.info\">wolfgang-it@jeltsch.info</a>&gt;<br>\nHi!</p>\n<p>I’m very happy about this submission, which in particular defines small<br>\ntypes that are closed under function space construction, using the class<br>\nsystem and integrating everything with standard Isabelle/HOL<br>\ninfrastructure. Thanks a lot to the author.</p>\n<p>All the best,<br>\nWolfgang</p>",
        "id": 294765687,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661201836
    },
    {
        "content": "<p>From: \"Dr. Brendan Patrick Mahony\" &lt;<a href=\"mailto:mahonybp@tpg.com.au\">mahonybp@tpg.com.au</a>&gt;<br>\nCongrats on this.</p>\n<p>Are there plans to integrate into the datatype package?</p>\n<p>In particular, automatic instance proofs for small class closure? </p>\n<p>Presumably these follow from the instances already proved, but the datatype representation is confusing to some of us.</p>\n<p>Any thoughts on cardinality and the standard HOL semantics?</p>\n<p>Cheers,</p>\n<p>Brendan</p>",
        "id": 294765722,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661201856
    },
    {
        "content": "<p>From: Lawrence Paulson &lt;<a href=\"mailto:lp15@cam.ac.uk\">lp15@cam.ac.uk</a>&gt;<br>\nI hope the datatype developers might be persuaded to help with this, at least after these type classes turn out to be useful.</p>\n<p>You see, although it occurred to me that they might be useful, I wasn’t able to think up any convincing applications. I’d be glad to hear what you want to use it for.</p>\n<p>Larry</p>",
        "id": 294765747,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661201866
    },
    {
        "content": "<p>From: Peter Lammich &lt;<a href=\"mailto:lammich@in.tum.de\">lammich@in.tum.de</a>&gt;<br>\nHi,</p>\n<p>when I saw this entry, a few applications immediately struck my mind.<br>\nApart from HOL models (already mentioned here), it can also be used to<br>\nmodel heaps with arbitrary (small) data on it, similar as<br>\nImperative/HOL does for countable data right now. It would allow a<br>\nstraightforward extension of Imperative/HOL to support references to<br>\nfunctions. </p>\n<p>Less straightforward, but important for my applications, I could store<br>\nabstract data types (e.g. sets, sets of sets, etc)  on the heap, and<br>\nlater refine them to more concrete types. Extending my refinement<br>\nframework to allow refinement on the heap has been stopped by<br>\ndifficulties to express the abstract heap so far.</p>\n<p>Note that the \"deriving\"-tool should be straightforward to extend to<br>\ninfer the \"small\" typeclass, like it already does for \"countable\".</p>",
        "id": 294765753,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661201873
    },
    {
        "content": "<p>From: Jasmin Blanchette via Cl-isabelle-users &lt;<a href=\"mailto:cl-isabelle-users@lists.cam.ac.uk\">cl-isabelle-users@lists.cam.ac.uk</a>&gt;<br>\nLarry wrote:</p>\n<blockquote>\n<p>I hope the datatype developers might be persuaded to help with this, at least after these type classes turn out to be useful.</p>\n</blockquote>\n<p>Peter wrote:</p>\n<blockquote>\n<p>Note that the \"deriving\"-tool should be straightforward to extend to infer the \"small\" typeclass, like it already does for \"countable\".</p>\n</blockquote>\n<p>Indeed. I just want to emphasize that such tools can be developed as plugins, without the participation of the datatype developers. Of course, I'd be ready to help to explain the relevant (undocumented) APIs to whoever is willing to implement extensions. I know some users (e.g. in Innsbruck) made sense of the APIs even without help, so it shouldn't be too difficult to master them with a bit of help.</p>\n<p>Jasmin</p>",
        "id": 294765764,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661201879
    },
    {
        "content": "<p>From: Dominique Unruh &lt;<a href=\"mailto:unruh@ut.ee\">unruh@ut.ee</a>&gt;<br>\nHi,</p>\n<blockquote>\n<p>Note that the \"deriving\"-tool should be straightforward to extend to infer the \"small\" typeclass, like it already does for \"countable\".</p>\n</blockquote>\n<p>I would like to point out that I have already written such a tool (not <br>\nin AFP) for a very similar type class (called \"universe\").</p>\n<p><a href=\"https://github.com/dominique-unruh/qrhl-tool/blob/master/isabelle-thys/Universe.thy\">https://github.com/dominique-unruh/qrhl-tool/blob/master/isabelle-thys/Universe.thy</a></p>\n<p>There you can just write \"derive universe XXX\" for almost any defined <br>\ntype XXX.</p>\n<p>(And I am using it to define a heap with arbitrary types, as Larry <br>\nsuggested.)</p>\n<p>It currently includes ZFHOL instead, but it should be easy to port it to <br>\nthe new AFP entry.</p>\n<p>If anyone has concrete interest in that, I'd be happy to port it to the <br>\nnew ZF AFP entry. (Otherwise I just put it on my TODO list for \"sometime\".)</p>\n<p>Best wishes,<br>\nDominique.</p>",
        "id": 294765835,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661201892
    },
    {
        "content": "<p>From: \"Dr. Brendan Patrick Mahony\" &lt;<a href=\"mailto:mahonybp@tpg.com.au\">mahonybp@tpg.com.au</a>&gt;<br>\nWell, the number one thing would to use “string =&gt; V” (or some variation thereof) as a tractable model for hierarchical records which would then serve as vehicle for hierarchical abstract systems modelling activities. Existing Isabelle structuring features (theories, locales, records, tuples) are \"sort of adequate” for modelling a given well understood system interface instance, but are a positive pain for discussing the mathematics of or even characterising classes of systems and their relationships. Reuse, refactoring and system abstraction …  </p>\n<p>(BTW well founded sets maybe need a more distinctive type name than V)</p>\n<p>Brendan</p>",
        "id": 294765843,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661201898
    }
]