[
    {
        "content": "<p>From: Gergely Buday &lt;<a href=\"mailto:gbuday@gmail.com\">gbuday@gmail.com</a>&gt;<br>\nHi,</p>\n<p>if there is a reference in a proof to an automatically verified lemma, I<br>\ncan CTRL-click on the name and Isabelle/JEdit takes me to the definition of<br>\ne.g. the datatype. But the lemma is not explicit there.</p>\n<p>Is there a way to display the lemma other than using the Find feature? It<br>\nwould be nice to have a button to display the theorem in a tooltip.</p>\n<ul>\n<li>Gergely</li>\n</ul>",
        "id": 294279198,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660919772
    },
    {
        "content": "<p>From: Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt;<br>\nThe commands 'thm' or 'print_statement' do that, when put in the proper <br>\nplace in the source, with the proper names of the facts.</p>\n<p>If the Prover IDE would just externalize and print everything by default, <br>\nthe front-end would collapse from the mass of the material.  People have <br>\nalready complained that underpowered hardware is overloaded by the default <br>\nsetup of Isabelle/jEdit, which produces more than an order of magnitude <br>\nmore content than was done in the past.</p>\n<p>Extremely light machines are fashionable, but another reason for the trend <br>\nis the unability of most software applications to make use of big machines <br>\ntoday, which means many cores.  This does not mean that Isabelle defaults <br>\nwill become airy, but stay in somewhere in the middle: high-end laptops or <br>\nmidrange workstations.</p>\n<p>Makarius</p>",
        "id": 294279705,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660919936
    },
    {
        "content": "<p>From: Buday Gergely &lt;<a href=\"mailto:gbuday@karolyrobert.hu\">gbuday@karolyrobert.hu</a>&gt;<br>\nMakarius wrote:</p>\n<blockquote>\n<p>If the Prover IDE would just externalize and print everything by default, <br>\nthe front-end would collapse from the mass of the material.  </p>\n</blockquote>\n<p>I did not think to print everything in advance. My idea was to show a tooltip that contains the lemma on demand. Clearly ctrl-click takes you to the original proof but this is distracting. I do not see how much burden would this involve but you will tell us.</p>\n<ul>\n<li>Gergely</li>\n</ul>",
        "id": 294279726,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660919943
    }
]