[
    {
        "content": "<p>From: Takashi KITAMURA &lt;<a href=\"mailto:t.kitamura@aist.go.jp\">t.kitamura@aist.go.jp</a>&gt;<br>\nWe are looking for one postdoc researcher or programmer at<br>\nResearch Institute for Secure Systems (RISEC), National Institute<br>\nof Advanced Industrial Science and Technology (AIST) in Japan.<br>\nThe position will be for research related combinatorial testing, in<br>\nparticular, automatic generation of test sets from the formal description<br>\nof test requirements. The research will be programming-intensive, so<br>\nthe candidates must have good programming skills.  In particular,<br>\ngood knowledge of data structure and algorithm are required.<br>\nAlso, the candidates must have general interest in software engineering.<br>\nOn the other hand, speaking Japanese is <em>not</em> required.<br>\nThe first term is until the end of the fiscal year, but the project itself is<br>\nuntil November 2016, so that the extension is possible based on the<br>\nperformance. The position is available immediately. Interested<br>\ncandidates should apply by sending email with the application<br>\nmaterials to <a href=\"mailto:risec-jobs-ml@aist.go.jp\">risec-jobs-ml@aist.go.jp</a>.</p>\n<p>=========================================================<br>\nPost-doc or programmer (employed as technical staff)  (software testing)</p>\n<p>Outline:</p>\n<ul>\n<li>Test generation using model-based testing and constraint solving.</li>\n<li>Develop algorithms on graph-based data structures.</li>\n<li>Experience with Java, and/or C, Scala, Haskell needed.</li>\n<li>Strong know-how in software analysis and algorithms.</li>\n<li>Annual contract but can be extended for up to 3 years.</li>\n<li>Start date on Feb. 1 2014 or later.</li>\n<li>Office location is in Amagasaki (15 min away from Osaka by local trains)</li>\n</ul>\n<p>Content of work:</p>\n<ul>\n<li>Develop the software of a next-generation test case generator.</li>\n<li>Integrate the tool with existing components and products.</li>\n<li>The position is open to programmer (employed as technical staff) or post-doc.</li>\n<li>\n<p>For a post-doc, publications about the tool and case studies are<br>\nalso a goal of the work. The Ph.D. degree must have been obtained<br>\nbetween 0 and 7 years prior to starting the position.</p>\n</li>\n<li>\n<p>Details on the web page given in Japanese can be given in English on request.</p>\n</li>\n<li>More information of programmer (employed as technical staff), please<br>\nrefer the information of \"software engineer\" in accompanying document.</li>\n</ul>\n<p>Research field:<br>\nGeneral field/Informatics</p>\n<p>Qualifications:</p>\n<ul>\n<li>Experience with Java, and/or C, Scala, Haskell needed (ideally at least two).</li>\n<li>Strong know-how in software analysis and algorithms.</li>\n<li>Post-doc: Strong verbal and written communication skills in English.</li>\n<li>Post-doc: Ph.D. degree obtained at most 7 years prior to start date.</li>\n</ul>\n<p>Treatment:</p>\n<ul>\n<li>Initial contract: immediately - 2015-03-31 (can be extended).</li>\n<li>\n<p>Working hours: Basically 8:30 - 17:15 including a one-hour lunch<br>\nbreak, flexible hours possible. Work days: Mon - Fri excl. public<br>\nholidays and end/start of the calendar year.</p>\n</li>\n<li>\n<p>Paid holidays (annual leave) based on AIST rules.</p>\n</li>\n<li>Social security/insurance benefits included</li>\n<li>Salary based on experience. (e.g. post-doc: from 2200 JPY/hour)</li>\n</ul>\n<p>Application materials:</p>\n<ol>\n<li>CV</li>\n<li>Copy of Ph.D. certificate (for post-doc position)</li>\n<li>Work history</li>\n<li>Publication list (for post-doc)</li>\n<li>Cover letter (one page)</li>\n<li>Apply by sending email with the materials to <a href=\"mailto:risec-jobs-ml@aist.go.jp\">risec-jobs-ml@aist.go.jp</a>.</li>\n</ol>",
        "id": 294264683,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660915692
    }
]