[
    {
        "content": "<p>From: Sandra Alves &lt;<a href=\"mailto:sandra@dcc.fc.up.pt\">sandra@dcc.fc.up.pt</a>&gt;<br>\n(Apologies for multiple copies of this announcement. Please circulate.)</p>\n<hr>\n<p>Call for Location for FSCD 2021</p>\n<p>The FSCD conference covers all aspects of Formal Structures for Computation and Deduction from theoretical foundations to applications.  The annual FSCD conference comprises the main conference and a considerable number of affiliated workshops (expectedly, more than ten).</p>\n<p>We invite proposals for locations to host the 6th FSCD International Conference to be held during the summer of 2021. Previous (and upcoming) FSCD meetings include:</p>\n<p>FSCD 2016 in Porto (Portugal);<br>\nFSCD 2017 in Oxford (UK) co-located with ICFP 2017;<br>\nFSCD 2018 in Oxford (UK) as part of FLoC 2018;<br>\nFSCD 2019 in Dortmund (Germany); <br>\nFSCD 2020 in Paris (France) co-located with IJCAR 2020.</p>\n<p>Therefore, for 2021, we particularly encourage proposals outside Europe.</p>\n<p>The deadline for proposals is <strong>* 31st March 2019 </strong>*. Proposals should be sent to the FSCD Steering Committee Chair (see contact information above). We encourage proposers to register their intention informally as soon as possible. Selected proposals are to be presented at the business meeting of FSCD 2019 taking place at Dortmund in June 2019.  The final decision about hosting and organising of FSCD 2021 will be  taken by the SC after an advisory vote of the members of the community in attendance at the business meeting. </p>\n<p>Proposals should address the following points:<br>\nFSCD Conference Chair (complete name and current position), host institution, FSCD Local Committee (complete names and current positions), availability of student-volunteers. <br>\nNational, regional, and local government and industry support, both organizational and financial.<br>\nAccessibility to the location (i.e., transportation) and  attractiveness of the proposed site. Accessibility can include both information about local transportation and travel information to the location (flight and/or train connections), as well as estimated costs. <br>\nAppropriateness of the proposed dates (including consideration of holidays/other events during the period), hotel prices, and access to dormitory facilities for students.<br>\nEstimated costs on registration for the conference and workshops, both for regular and student participants.<br>\nConference and exhibit facilities for the anticipated number of registrants (typically around 200). For example: number, capacity and audiovisual equipment of meeting rooms; a large plenary session room that can hold all the registrants; enough rooms for parallel sessions/workshops/tutorials; internet connectivity and workstations for demos/competitions; catering services; and presence of professional staff.<br>\nResidence accommodations and food services in a range of price categories and close to the conference venue, for example, number and cost range of hotels, and availability and cost of dormitory rooms (e.g., at local universities) and kind of services they offer.<br>\nOther relevant information, which can include information about leisure activities and attractiveness of the location (e.g., cultural and historical aspects, touristic activities, etc...).</p>\n<p>Contact information:<br>\nDelia Kesner<br>\n<a href=\"mailto:kesner@irif.fr\">kesner@irif.fr</a><br>\nFSCD SC Chair</p>",
        "id": 294748131,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661194348
    }
]