[
    {
        "content": "<p>From: Alwen Tiu &lt;<a href=\"mailto:alwen.tiu@gmail.com\">alwen.tiu@gmail.com</a>&gt;<br>\n[Apologies for multiple postings]</p>\n<p>==================================================<br>\nDoctoral Symposium<br>\nof the 20th International Conference on Engineering of Complex Computer<br>\nSystems<br>\n(ICECCS), December 9-12 2015, Gold Coast, Australia</p>\n<p><a href=\"http://iceccs2015.monash.edu.au\">http://iceccs2015.monash.edu.au</a><br>\n==================================================</p>\n<hr>\n<p>Aims</p>\n<hr>\n<p>A Doctoral Symposium will be held in conjunction with the 20th<br>\nInternational Conference on Engineering of Complex Computer Systems<br>\n(ICECCS), which will take place in Melbourne, Australia, from December<br>\n9th to 12th. The Doctoral Symposium provides an opportunity for PhD<br>\nstudents to present and discuss their research. It is meant to promote<br>\na friendly and supportive environment for students to exchange ideas<br>\nand to receive feedbacks from researchers in the fields and their<br>\nfellow students on their future research directions.</p>\n<hr>\n<p>Submission information</p>\n<hr>\n<p>We invite students to submit abstracts of their work (in<br>\nprogress). The topics of the abstract should be broadly relevant to<br>\nthe topics of the conference, that is, related to complex<br>\ncomputer-based systems, including the causes of complexity and means<br>\nof avoiding, controlling, or coping with complexity. Please refer to<br>\nthe ICECCS website for a list of suggested topics:<br>\n<a href=\"http://iceccs2015.monash.edu.au/2015/index.jsp\">http://iceccs2015.monash.edu.au/2015/index.jsp</a>.</p>\n<p>Your submission should clearly identify the problem you are working<br>\non, related work and existing solutions (if any), your approach and<br>\nmethodology, and contributions you have made or expect to make should<br>\nthe problem be solved. If it is still a work-in-progress, please also<br>\ndiscuss the current stage of research and future work to be done.</p>\n<p>Submitted manuscripts should be in English and formatted in the style<br>\nof the double-column IEEE format. Each submission must not be longer<br>\nthan 4 pages, including figures, references, and appendices. All<br>\nsubmissions should be in PDF format. The IEEE templates for the<br>\nsubmission can be found here<br>\n<a href=\"http://www.ieee.org/conferences_events/conferences/publishing/templates.html\">http://www.ieee.org/conferences_events/conferences/publishing/templates.html</a><br>\n.<br>\nAll submissions must be done through the EasyChair website of the<br>\nconference:</p>\n<p><a href=\"https://easychair.org/conferences/?conf=iceccs20150\">https://easychair.org/conferences/?conf=iceccs20150</a><br>\n(Make sure that you submit to the ICECCS 2015 doctoral symposium.)</p>\n<hr>\n<p>Important dates</p>\n<hr>\n<ul>\n<li>September 14th 2015: Submission deadline</li>\n<li>October 16th 2015: Notification of acceptance/rejection</li>\n</ul>\n<hr>\n<p>Program committee</p>\n<hr>\n<p>Aldeida Aleti, Monash University, Australia<br>\nÉtienne André,    Université Paris 13, France<br>\nGuangdong Bai, National University of Singapore, Singapore<br>\nFei He, Tsinghua University, China<br>\nAndrzej Mizera, University of Luxembourg, Luxembourg<br>\nJun Pang (co-chair), University of Luxembourg, Luxembourg<br>\nAlwen Tiu (co-chair), Nanyang Technological University, Singapore<br>\nTian Zhang, Nanjing University, China</p>",
        "id": 294650212,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661165796
    }
]