[
    {
        "content": "<p>From: \"Achim D. Brucker\" &lt;<a href=\"mailto:brucker@spamfence.net\">brucker@spamfence.net</a>&gt;<br>\nWe are happy to announce the first public version of</p>\n<p>HOL-OCL, version 0.9.0<br>\n<a href=\"http://www.brucker.ch/projects/hol-ocl/\">http://www.brucker.ch/projects/hol-ocl/</a></p>\n<p>HOL-OCL is an interactive proof environment for the Object Constraint<br>\nLanguage (OCL). It is implemented as a shallow embedding of OCL into<br>\nthe Higher-order Logic (HOL) instance of the interactive theorem<br>\nprover Isabelle.</p>\n<p>HOL-OCL defines a machine-checked formalization of the semantics as<br>\ndescribed in the standard for OCL 2.0. This conservative, shallow<br>\nembedding of UML/OCL into Isabelle/HOL includes support for typed,<br>\nextensible UML data models supporting inheritance and subtyping inside<br>\nthe typed lambda-calculus with parametric polymorphism. As a<br>\nconsequence of conservativity with respect to higher-order logic<br>\n(HOL), we can guarantee the consistency of the semantic model.<br>\nMoreover, HOL-OCL provides several derived calculi for UML/OCL that<br>\nallow for formal derivations establishing the validity of UML/OCL<br>\nformulae. Elementary automated support for such proofs is also provided.</p>\n<p>Several papers describing HOL-OCL in detail are also available from<br>\nthe HOL-OCL website. In particular we recommend \"The HOL-OCL Book\"<br>\nas a general textbook on formal OCL semantics as well as a<br>\na main reference and system manual:</p>\n<p>A. D. Brucker and B. Wolff. The HOL-OCL Book. Tech. Rep. 525, ETH<br>\n  Zurich, 2006.<br>\n<a href=\"http://www.brucker.ch/bibliography/abstract/brucker.ea-hol-ocl-book-2006\">http://www.brucker.ch/bibliography/abstract/brucker.ea-hol-ocl-book-2006</a></p>\n<p>HOL-OCL is distributed under the GNU General Public License (GPL) and<br>\ncan be downloaded from the HOL-OCL web site at:</p>\n<p><a href=\"http://www.brucker.ch/research/hol-ocl/\">http://www.brucker.ch/research/hol-ocl/</a></p>\n<p>Kind regards,<br>\n    Achim D. Brucker and Burkhart Wolff</p>",
        "id": 294040802,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660815184
    }
]