[
    {
        "content": "<p>From: Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt;<br>\nDid the situation change in the past 2 weaks? Supposedly not, since the <br>\ncvc4 component in Isabelle2016-RC2 did not change in the meantime.</p>\n<p>The question remains, if there is a problem with that cvc4 compilation, or <br>\nsomething else on that particular Ubuntu 14.04 installation.</p>\n<p>Jasmin, if you want to change anything for Isabelle2016, the remaining <br>\ntime is about 1 week.</p>\n<p>Makarius</p>",
        "id": 294664061,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661171039
    },
    {
        "content": "<p>From: \"Eugene W. Stark\" &lt;<a href=\"mailto:isabelle-users@starkeffect.com\">isabelle-users@starkeffect.com</a>&gt;<br>\nIt is still crashing frequently, both on this system at home and<br>\non my office system (similar hardware, same OS, but installed at<br>\ndifferent times and with a somewhat different set of applications<br>\ninstalled).</p>\n<p>I sent Jasmin one of the problem files that he asked for, but I<br>\ndidn't hear if it was useful to him.</p>\n<p>By the way, perhaps this is associated with the crashing, but I<br>\nfind that hundreds and hundreds of megabytes of files are left in<br>\n/tmp/isabelle-xxx folders.  Examples: kodkodiXXXXXX.kki\",<br>\n\"kodkodiXXXXXX.err\", \"bash_errXXXXXXX\", etc.  Yesterday after a<br>\n5-hour session, there were about 3GB of such files that were not<br>\ndeleted when I exited Isabelle -- enough to fill up my root<br>\npartition.</p>\n<p>- Gene Stark</p>",
        "id": 294664109,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661171045
    },
    {
        "content": "<p>From: \"Eugene W. Stark\" &lt;<a href=\"mailto:isabelle-users@starkeffect.com\">isabelle-users@starkeffect.com</a>&gt;<br>\nJust a quick note to mention I am experiencing fairly frequent<br>\ncrashes of cvc4 using stock Isabelle2016-RC0 on Ubuntu 14.04.<br>\nFWIW, below is the initial text part of the \"whoopsie\" file.<br>\nThe cvc4 on Isabelle2015 also exhibited crashes, but not on this<br>\nmachine, as far as I know.</p>\n<p>If anyone needs info on library versions, let me know and I can<br>\nprobably collect it.</p>\n<p>- Gene Stark</p>",
        "id": 294665420,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661171580
    },
    {
        "content": "<p>From: Jasmin Blanchette &lt;<a href=\"mailto:jasmin.blanchette@inria.fr\">jasmin.blanchette@inria.fr</a>&gt;<br>\nDear Eugene,</p>\n<p>What would help me the most would be a CVC4 problem file. You can get it by writing</p>\n<p>sledgehammer [overlord]</p>\n<p>and picking up the file \"~/.isabelle/prob_cvc4.smt_in\".</p>\n<p>I might need additional information later, but for the moment let's see if I can reproduce the crash on one of my machines.</p>\n<p>Cheers,</p>\n<p>Jasmin</p>",
        "id": 294665438,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661171586
    },
    {
        "content": "<p>From: \"Eugene W. Stark\" &lt;<a href=\"mailto:isabelle-users@starkeffect.com\">isabelle-users@starkeffect.com</a>&gt;<br>\nWhere do I put this magic incantation?</p>\n<p>Presumably it has to be in force throughout the entire session,<br>\nsince there is no telling when the crash will occur.</p>\n<p>- Gene Stark</p>",
        "id": 294665456,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661171592
    },
    {
        "content": "<p>From: Jasmin Blanchette &lt;<a href=\"mailto:jasmin.blanchette@inria.fr\">jasmin.blanchette@inria.fr</a>&gt;<br>\nRight after the proof goal or lemma you are trying to prove, directly in the text editor (at the point where you would normally invoke Sledgehammer through its dedicated panel). E.g.</p>\n<p>lemma \"x = x\"<br>\n    sledgehammer [overlord]</p>\n<p>Jasmin</p>",
        "id": 294665476,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661171598
    },
    {
        "content": "<p>From: \"Eugene W. Stark\" &lt;<a href=\"mailto:isabelle-users@starkeffect.com\">isabelle-users@starkeffect.com</a>&gt;<br>\nI will see what I can do, but it is not deterministically repeatable,<br>\nand I usually just invoke sledgehammer by typing \"try\" or \"try0\".</p>\n<p>- Gene Stark</p>",
        "id": 294665493,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661171605
    },
    {
        "content": "<p>From: Jasmin Blanchette &lt;<a href=\"mailto:jasmin.blanchette@inria.fr\">jasmin.blanchette@inria.fr</a>&gt;<br>\nI see. Then I recommend you instead add</p>\n<p>sledgehammer_params [overlord]</p>\n<p>somewhere upstream (e.g. at the top of your file or in a theory file all your other theory files depend on). This will also affect \"try\".</p>\n<p>Be aware that this option is not thread-safe -- i.e. if you have several Sledgehammers running at the same time somehow (e.g. several jEdits running), the problem or proof files might overwrite each other. Which is not the end of the world. I have never run into problems myself and use this option often (hence its name ;)), but I thought I'd mention this.</p>\n<p>Jasmin</p>",
        "id": 294665508,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661171610
    },
    {
        "content": "<p>From: Jasmin Blanchette &lt;<a href=\"mailto:jasmin.blanchette@inria.fr\">jasmin.blanchette@inria.fr</a>&gt;<br>\nDear Eugene,</p>\n<p>I'm bringing back this to the mailing list, since it might be of general interest.</p>\n<p>I see! Then I think this is something that is potential affecting everybody. CVC4 doesn't like being killed. This I have experienced first hand, when invoking it from the command line. I will investigate and report this to the CVC4 developers.</p>\n<p>I hope you can find a workaround to avoid any distraction from the Ubuntu launcher. Otherwise, there's always the option of swapping CVC4 out and Z3 in...</p>\n<p>Cheers,</p>\n<p>Jasmin</p>",
        "id": 294667471,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661172254
    },
    {
        "content": "<p>From: Jasmin Blanchette &lt;<a href=\"mailto:jasmin.blanchette@inria.fr\">jasmin.blanchette@inria.fr</a>&gt;<br>\nHi Makarius,</p>\n<blockquote>\n<p>Did the situation change in the past 2 weaks? Supposedly not, since the cvc4 component in Isabelle2016-RC2 did not change in the meantime.</p>\n</blockquote>\n<p>(Nothing changed, except that 2 weeks ago was 1 week before the IJCAR deadline, whereas now is 6 hours before the extended deadline...)</p>\n<blockquote>\n<p>The question remains, if there is a problem with that cvc4 compilation, or something else on that particular Ubuntu 14.04 installation.</p>\n<p>Jasmin, if you want to change anything for Isabelle2016, the remaining time is about 1 week.</p>\n</blockquote>\n<p>The issue is not a regression -- the binaries are identical in Isabelle2015 and Isabelle2016-RC*. I'd rather not do anything that might break things for other users at this point. I'll investigate things privately with Eugene and hopefully have a satisfactory fix for him and for Isabelle2016-1.</p>\n<p>Jasmin</p>",
        "id": 294668203,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661172518
    },
    {
        "content": "<p>From: Jasmin Blanchette &lt;<a href=\"mailto:jasmin.blanchette@inria.fr\">jasmin.blanchette@inria.fr</a>&gt;<br>\nHi Eugene,</p>\n<blockquote>\n<p>I sent Jasmin one of the problem files that he asked for, but I didn't hear if it was useful to him.</p>\n</blockquote>\n<p>It is still on my radar, but due to a seminar this week it might still take some time before I come back to you.</p>\n<blockquote>\n<p>By the way, perhaps this is associated with the crashing, but I<br>\nfind that hundreds and hundreds of megabytes of files are left in<br>\n/tmp/isabelle-xxx folders.  Examples: kodkodiXXXXXX.kki\",<br>\n\"kodkodiXXXXXX.err\", \"bash_errXXXXXXX\", etc.  Yesterday after a<br>\n5-hour session, there were about 3GB of such files that were not<br>\ndeleted when I exited Isabelle -- enough to fill up my root<br>\npartition</p>\n</blockquote>\n<p>This is somewhat puzzling. The \"kodkodi*\" files, for example, should all be removed as soon as Nitpick has come back to you. Could there be an issue with the permissions?</p>\n<p>Cheers,</p>\n<p>Jasmin</p>",
        "id": 294668364,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661172586
    },
    {
        "content": "<p>From: \"Eugene W. Stark\" &lt;<a href=\"mailto:isabelle-users@starkeffect.com\">isabelle-users@starkeffect.com</a>&gt;<br>\nYou have embarrassed me into attempting to merge my stuff and try Isabelle2016-1-RC0.<br>\nBut now before I can get back to what I was doing and report on whether CVC4 is still<br>\ncrashing, I need to know what the new warning \"Not a proper equation\" means in a<br>\ndatatype definition as follows (also attached):</p>\n<p>theory Barf<br>\nimports Main Category<br>\nbegin</p>\n<p>locale foo =<br>\n    fixes X<br>\n    assumes \"X = X\"</p>\n<p>context foo<br>\n  begin</p>\n<p>datatype (discs_sels) 't \"term\" =<br>\n      C<br>\n    | T \"'t term * 't term\"</p>\n<p>end</p>\n<p>Another issue I noticed: JEdit now forcibly resets the indentations of lines<br>\nwith keywords such as \"locale\" when I type the keyword, or, what is even<br>\nmore irritating, when I type ENTER at the end of the line.  I think this<br>\nnew behavior is fairly disruptive of the typing habits I have established<br>\nto this point.</p>\n<p>- Gene Stark<br>\n<a href=\"/user_uploads/14278/NcUCHvVF4QAPPo6ofLsfyysG/Barf.thy\">Barf.thy</a></p>",
        "id": 294684635,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661177543
    },
    {
        "content": "<p>From: Jasmin Blanchette &lt;<a href=\"mailto:jasmin.blanchette@inria.fr\">jasmin.blanchette@inria.fr</a>&gt;<br>\nDear Eugene,</p>\n<blockquote>\n<p>But now before I can get back to what I was doing and report on whether CVC4 is still crashing,</p>\n</blockquote>\n<p>Please let us know how this goes. Regardless, the next release candidate will likely feature a new version of CVC4.</p>\n<blockquote>\n<p>I need to know what the new warning \"Not a proper equation\" means in a<br>\ndatatype definition as follows (also attached):</p>\n</blockquote>\n<p>Thank you for your report. In short, the code generator is now more verbose, and the \"datatype\" package interacts with it. I have a solution locally to get rid of the warning that is likely to be part of the next release candidate.</p>\n<blockquote>\n<p>Another issue I noticed: JEdit now forcibly resets the indentations of lines<br>\nwith keywords such as \"locale\" when I type the keyword, or, what is even<br>\nmore irritating, when I type ENTER at the end of the line.  I think this<br>\nnew behavior is fairly disruptive of the typing habits I have established<br>\nto this point.</p>\n</blockquote>\n<p>I guess this is for Makarius to answer.</p>\n<p>Cheers,</p>\n<p>Jasmin</p>",
        "id": 294684681,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661177563
    },
    {
        "content": "<p>From: Lars Hupel &lt;<a href=\"mailto:hupel@in.tum.de\">hupel@in.tum.de</a>&gt;<br>\nDear Gene,</p>\n<p>I am myself trying to get used to this, but in case you don't want the<br>\nnew behaviour, there is a way of switching it off.</p>\n<p>Open the global options in jEdit (\"Utilities\" in the menu bar). In the<br>\nleft tree, pick \"jEdit\"/\"Shortcuts\". Filter for \"newline\". You'll find a<br>\ncommand \"Newline with indentation of ...\" associated to \"ENTER\". Click<br>\non \"ENTER\" and then on \"Remove Current\".</p>\n<p>Cheers<br>\nLars</p>",
        "id": 294684693,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661177566
    },
    {
        "content": "<p>From: Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt;<br>\nI generally recommend to resist the first impulse to get back to old<br>\nhabits on the spot, and first get used to new behavior, unless that<br>\nturns out to be utterly wrong.</p>\n<p>It is part of the Isabelle development model that there is a constant<br>\nflow of changes imposed on users. This keeps both the system and the<br>\nusers live and vigorous. After 30 years, Isabelle is still young and<br>\nemerging towards ultimate perfection. Just compare Isabelle98 with<br>\nIsabelle2016 for example, and compare that difference with other more<br>\nconservative systems, and than decide if you want to be back in 1998<br>\nwith the established habits from that time.</p>\n<p>More concretely on indentation: there used to be a canonical scheme<br>\nbuilt into Proof General / Emacs over many years. When that was<br>\nsuperseded by Isabelle/jEdit several years ago, I did not immediately<br>\nre-implement the traditional Isar indentation for various accidental<br>\nreasons, but it was clear it would happen one day.</p>\n<p>The current indentation scheme of Isabelle2016-1-RC0 conforms to the old<br>\nProof General / Emacs scheme from 1998 about 98%, but there are also<br>\nadditional cases, since the Isar language has changed significantly<br>\nduring all these years. When implementing it, some consequences turned<br>\nout different from what I considered canonical Isar indentation over<br>\nmany years -- so I also had to change a few of my old habits.</p>\n<p>With the new default indentation always on, live has become so much<br>\neasier so that I never look back again. Suddenly there is so little to<br>\ntype to get indentation right. There are still a few cases, where manual<br>\nindentation with C+i is required, but that is the opposite of the old<br>\nIsabelle/jEdit scheme to do everything manually -- and every user in a<br>\nslightly different way.</p>\n<p>Note that the indentation of keywords performed by ENTER is meant to be<br>\nalways right, while extra indentation via C+i is only a 90%<br>\napproximation: the full syntax and its delicate details are not known to<br>\nthe editor (and not even to the prover).</p>\n<p>Makarius</p>",
        "id": 294684711,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661177574
    },
    {
        "content": "<p>From: Simon Wimmer &lt;<a href=\"mailto:wimmersimon@gmail.com\">wimmersimon@gmail.com</a>&gt;<br>\nHi Jasmin,</p>\n<p>did you make an attempt to resolve this for the next release?<br>\nI just noticed that I find reports of CVC4 crashing on my Mac (running OSX<br>\nSierra now) a few times per day.<br>\nI am not sure if I had this before or if this resurfaced with Sierra.</p>\n<p>Cheers,</p>\n<p>Simon</p>",
        "id": 294694842,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661178100
    },
    {
        "content": "<p>From: Simon Wimmer &lt;<a href=\"mailto:wimmersimon@gmail.com\">wimmersimon@gmail.com</a>&gt;<br>\nI forgot to mention: the crashes are caused by Isabelle-2016 and<br>\nIsabelle-2016-1-RC0 alike.</p>",
        "id": 294694863,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661178107
    },
    {
        "content": "<p>From: Jasmin Blanchette &lt;<a href=\"mailto:jasmin.blanchette@inria.fr\">jasmin.blanchette@inria.fr</a>&gt;<br>\nDear Simon,</p>\n<p>Thanks for reminding me of this. I have about 12 unanswered emails on Isabelle Users which I haven't fully processed yet and Eugene's report is probably one of them.</p>\n<p>We will soon recompile CVC4 and other provers. We can then check if the problem has automagically gone away in the past two years of CVC4 development. I must say, I always use the repository version of Isabelle on my Mac, and I used to have many CVC4 zombies lying around (a symptom of the crash, I believe), but in the past N months things have gone quiet, so I'm wondering if something has improved on the Isabelle side.</p>\n<p>Cheers,</p>\n<p>Jasmin</p>",
        "id": 294696321,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661178211
    },
    {
        "content": "<p>From: \"Eugene W. Stark\" &lt;<a href=\"mailto:isabelle-users@starkeffect.com\">isabelle-users@starkeffect.com</a>&gt;<br>\nCVC4 still crashes regularly with Isabelle2016 on Ubuntu 16.04 LTS.<br>\nFor some reason it seems to still be useful, though.  I believe this<br>\nis because (as surmised earlier in this thread) the crashing seems to<br>\noccur when Isabelle kills a no-longer-needed CVC4 process, not during<br>\nactual useful work.</p>\n<p>- Gene Stark</p>",
        "id": 294696366,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661178223
    },
    {
        "content": "<p>From: Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt;<br>\nDid you try Isabelle2016-1-RC0 from<br>\n<a href=\"http://isabelle.in.tum.de/website-Isabelle2016-1-RC0\">http://isabelle.in.tum.de/website-Isabelle2016-1-RC0</a> already?</p>\n<p>There is now also a daily snapshot at <a href=\"http://isabelle.in.tum.de/devel\">http://isabelle.in.tum.de/devel</a> --<br>\nit will quickly converge to Isabelle2016-1-RC1 at the end of the week.</p>\n<p>Makarius</p>",
        "id": 294696387,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661178229
    }
]