[
    {
        "content": "<p>From: bwolff &lt;<a href=\"mailto:bwolff@inf.ethz.ch\">bwolff@inf.ethz.ch</a>&gt;<br>\nDear Isabelle Users,</p>\n<p>perhaps you might be interested in the following paper,<br>\nin particular if you are interested in empirical data<br>\nover the never-ending debate \"Model-Checking or Theorem Proving?\".</p>\n<p>David Basin and Hironobu Kuruma and Kazuo Takaragi and <br>\n   Burkhart Wolff:<br>\n   Verification of a Signature Architecture with HOL-Z. <br>\n   In Formal Methods 2005. <br>\n   LNCS 3582 Springer Verlag, pp. 269--285, 2005.<br>\n   Computer Security Group, ETH Zürich</p>\n<p>Abstract:<br>\n   =========<br>\n   We report on a case study in using HOL-Z, an embedding of Z in    <br>\n   higher-order logic, to specify and verify a security architecture   <br>\n   for administering digital signatures. We have used HOL-Z to<br>\n   formalize and combine both data-oriented and process-oriented <br>\n   architectural views. Afterwards, we formalized temporal requirements<br>\n   in Z and carried out verification in higher-order logic. The same<br>\n   architecture has been previously verified using the SPIN model<br>\n   checker. Based on this, we provide a detailed comparison of these two<br>\n   different approaches to formalization (infinite state with rich data<br>\n   types versus finite state) and verification (theorem proving versus#<br>\n   model checking). Contrary to common belief, our case study suggests<br>\n   that Z is well suited for temporal reasoning about process models<br>\n   with rich data. Moreover, our comparison highlights the advantages of<br>\n   this approach and provides evidence that, in the hands of experienced<br>\n   users, theorem proving is neither substantially more time-consuming<br>\n   nor more complex than model checking.</p>\n<p>URL:<a href=\"http://kisogawa.inf.ethz.ch/WebBIB/publications/papers/2005/3_fm.pdf\">http://kisogawa.inf.ethz.ch/WebBIB/publications/papers/2005/3_fm.pdf</a></p>\n<p>bu</p>",
        "id": 293896262,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660742793
    },
    {
        "content": "<p>From: Burkhart Wolff &lt;<a href=\"mailto:bwolff@inf.ethz.ch\">bwolff@inf.ethz.ch</a>&gt;<br>\nDear all,</p>\n<p>we are happy to announce our paper:</p>\n<p>D. Basin,  H. Kuruma, K. Miyazaki, K. Takaragi and B. Wolff: <br>\n   Verifying a Signature Architecture - A Comparative Case Study.<br>\n   In Formal Aspects of Computing, 2006.<br>\n   To appear.</p>\n<p>Abstract:<br>\n<a href=\"http://kisogawa.inf.ethz.ch/cgi-bin/publications/extract_abstract.cgi?DATABASE=infsec&amp;KEY=basin.ea:verifying:2006\">http://kisogawa.inf.ethz.ch/cgi-bin/publications/extract_abstract.cgi?DATABASE=infsec&amp;KEY=basin.ea:verifying:2006</a><br>\nPDF: <a href=\"http://kisogawa.inf.ethz.ch/WebBIB/publications/papers/2006/fac.pdf\">http://kisogawa.inf.ethz.ch/WebBIB/publications/papers/2006/fac.pdf</a></p>\n<p>The paper reports on a substantial case study from the field of<br>\ncomputer security that had been done both with a model checking<br>\napproach and a theorem proving approach, such that empirical<br>\ndata could be gained over what time had be invested to what<br>\nactivity in both approaches.</p>\n<p>The case-study gives some evidence, that theorem proving<br>\nisn't that ineffective after all, in particular if both<br>\nbehavioral and data-modeling aspects are non-trivial and<br>\nif the modeling problem is open at the beginning (i.e. it <br>\nis unclear how to formalize the intended properties.)<br>\nIn our case, theorem proving did not use (significantly) more <br>\ntime, it used more expertise. And model-checking did have<br>\na significant risc to prove valid, but inintended properties.</p>\n<p>Enjoy!</p>\n<p>Best regards</p>\n<p>Burkhart Wolff (and David Basin)</p>",
        "id": 294042071,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660815742
    }
]