[
    {
        "content": "<p>From: Joachim Breitner &lt;<a href=\"mailto:mail@joachim-breitner.de\">mail@joachim-breitner.de</a>&gt;<br>\nHi,</p>\n<p>I’m trying to add the Nielsen-Schreier theorem to the FreeGroups theory<br>\nin AFP. I’m following a proof in a modern text book¹ which seems to be<br>\nsufficiently rigorous to base on. Yet, I needed almost 500 lines and a<br>\nwhole day just to almost proof the first item in the first lemma  – that<br>\nis less than half a page of proof-related definitions and lemmata in the<br>\nbook. I get the feeling that I’m doing it wrong.</p>\n<p>Most of the time I seem to be spending with proving that some element is<br>\nin the carrier of the group, i.e. \"x \\&lt;in&gt; carrier (free_group gens)\",<br>\nwhich is “obvious” to the mathematician. Most group-related lemmata have<br>\nsuch a proposition in their premises, so I need to careful cite the<br>\nright carrier-statements before any kind of automation would work.</p>\n<p>To me it seems that if I had a type for the set of group elements, then<br>\ntype inference would had no trouble showing these requirements. But, if<br>\nI understand correctly, that would require dependent types (because the<br>\ntype would encapsulate the parameter \"gens\"), which are not supported in<br>\nIsabelle. Is that right? Is it also right within a locale, or can locale<br>\ncontexts introduce types?</p>\n<p>Are there work-arounds or other best practice to handle such a problem?</p>\n<p>Thanks,<br>\nJoachim</p>\n<p>PS: Is it ok to create personal branches, named appropriately, on<br>\n<a href=\"http://afp.hg.sourceforge.net/hgweb/afp/afp/\">http://afp.hg.sourceforge.net/hgweb/afp/afp/</a> where I could push my work<br>\nto cite it here?</p>\n<p>¹ <a href=\"http://books.google.de/books?id=RGzK_DOTijsC&amp;lpg=PA285&amp;dq=schreier-nielsen&amp;pg=PA285#v=onepage&amp;q&amp;f=false\">http://books.google.de/books?id=RGzK_DOTijsC&amp;lpg=PA285&amp;dq=schreier-nielsen&amp;pg=PA285#v=onepage&amp;q&amp;f=false</a><br>\n<a href=\"/user_uploads/14278/Mv00FB5GNUAAXqs01FXMFAK7/signature.asc\">signature.asc</a></p>",
        "id": 294124164,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660840772
    },
    {
        "content": "<p>From: Alexander Krauss &lt;<a href=\"mailto:krauss@in.tum.de\">krauss@in.tum.de</a>&gt;<br>\nHi Joachim,</p>\n<blockquote>\n<p>Most of the time I seem to be spending with proving that some element is<br>\nin the carrier of the group, i.e. \"x \\&lt;in&gt; carrier (free_group gens)\",<br>\nwhich is “obvious” to the mathematician. Most group-related lemmata have<br>\nsuch a proposition in their premises, so I need to careful cite the<br>\nright carrier-statements before any kind of automation would work.</p>\n</blockquote>\n<p>This is a notorious problem, and there is no satisfactory solution. From <br>\n2011 on I'll be working on an infrastructure to deal with this <br>\n(basically recovering what type systems do on the level of reasoning), <br>\nbut I am not expecting to have something usable for quite some time.</p>\n<blockquote>\n<p>To me it seems that if I had a type for the set of group elements, then<br>\ntype inference would had no trouble showing these requirements. But, if<br>\nI understand correctly, that would require dependent types (because the<br>\ntype would encapsulate the parameter \"gens\"), which are not supported in<br>\nIsabelle. Is that right? Is it also right within a locale, or can locale<br>\ncontexts introduce types?</p>\n</blockquote>\n<p>Yes, that's right. Dependent types arise naturally in this kind of <br>\nreasoning. \"free_group gens\" is one example. Another is \"matrix n m A\" <br>\netc. There are no dependent types in HOL, and putting locales on top <br>\ndoes not help (Currently, local typedefs are permitted, but they may not <br>\ndepend on locale parameters, so it is just a formal locality).</p>\n<blockquote>\n<p>Are there work-arounds or other best practice to handle such a problem?</p>\n</blockquote>\n<p>Well, not really. Sometimes a term dependency can be modelled as a type <br>\ndependency, e.g. the famous R^n (where n is modelled as a type). But <br>\nthis has a number of limitations and does not make sense in many cases.</p>\n<p>Another thing that may help a bit is to write a simproc that discharges <br>\nmembership proof obligations. Then at least the simplifier works a bit <br>\nbetter in these situations. But it requires some ML, and unfortunately <br>\nother tools cannot easily be extended like this.</p>\n<blockquote>\n<p>PS: Is it ok to create personal branches, named appropriately, on<br>\n<a href=\"http://afp.hg.sourceforge.net/hgweb/afp/afp/\">http://afp.hg.sourceforge.net/hgweb/afp/afp/</a> where I could push my work<br>\nto cite it here?</p>\n</blockquote>\n<p>Please don't do this! Having everybody's private branches centrally is a <br>\nmaintenance nightmare. Instead you can easily publish your own branch <br>\n(read: clone of the repository with your own changes) on the web. This <br>\nis what Mercurial is good at. If you don't have a server, there are also <br>\npublic hosting sites.</p>\n<p>Alex</p>",
        "id": 294124180,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660840778
    },
    {
        "content": "<p>From: Joachim Breitner &lt;<a href=\"mailto:mail@joachim-breitner.de\">mail@joachim-breitner.de</a>&gt;<br>\nHi Alexander,</p>\n<p>Am Samstag, den 11.12.2010, 12:39 +0100 schrieb Alexander Krauss:</p>\n<blockquote>\n<blockquote>\n<p>Most of the time I seem to be spending with proving that some element is<br>\nin the carrier of the group, i.e. \"x \\&lt;in&gt; carrier (free_group gens)\",<br>\nwhich is “obvious” to the mathematician. Most group-related lemmata have<br>\nsuch a proposition in their premises, so I need to careful cite the<br>\nright carrier-statements before any kind of automation would work.</p>\n</blockquote>\n<p>This is a notorious problem, and there is no satisfactory solution. From <br>\n2011 on I'll be working on an infrastructure to deal with this <br>\n(basically recovering what type systems do on the level of reasoning), <br>\nbut I am not expecting to have something usable for quite some time.</p>\n</blockquote>\n<p>great, I am looking forward to that. And at least I’m not doing<br>\nsomething stupid :-).</p>\n<blockquote>\n<blockquote>\n<p>PS: Is it ok to create personal branches, named appropriately, on<br>\n<a href=\"http://afp.hg.sourceforge.net/hgweb/afp/afp/\">http://afp.hg.sourceforge.net/hgweb/afp/afp/</a> where I could push my work<br>\nto cite it here?</p>\n</blockquote>\n<p>Please don't do this! Having everybody's private branches centrally is a <br>\nmaintenance nightmare. Instead you can easily publish your own branch <br>\n(read: clone of the repository with your own changes) on the web. This <br>\nis what Mercurial is good at. If you don't have a server, there are also <br>\npublic hosting sites.</p>\n</blockquote>\n<p>Ok, just asking.</p>\n<p>Greetings,<br>\nJoachim<br>\n<a href=\"/user_uploads/14278/TImjrBXj5dQXPEkDU1ULZ5at/signature.asc\">signature.asc</a></p>",
        "id": 294124195,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660840784
    },
    {
        "content": "<p>From: Gerwin Klein &lt;<a href=\"mailto:gerwin.klein@nicta.com.au\">gerwin.klein@nicta.com.au</a>&gt;<br>\nHi Joachim,</p>\n<p>I'll leave the content questions to others on the list who know more about the formalisation.</p>\n<p>To expand a bit on Alex's answer for the AFP question:</p>\n<p>No, the AFP will not support branches, definitely not in-repository branches. As Alex said, this would be a maintenance nightmare, but it also does not make sense for what the AFP is -- a public archive of reviewed entries.</p>\n<p>It may be a reasonable idea to use a branch locally for development, but publishing it for citing it separately and using the name AFP for it would be very much discouraged. The point of the AFP is that it is quality controlled and edited. </p>\n<p>We give authors access to the development version of the AFP for maintenance, but we trust them to make maintenance changes only and we monitor all commits. Adding major developments is not what this access if for, much less adding new entries. Any such activities need to be coordinated with the editors.</p>\n<p>Technically, to create a branch, you could make a local clone of the repository (not an in-repository branch) and work on that.</p>\n<p>I don't quite see the point in such a branch, though. An additional major theorem like this should be a new AFP submission, based on the existing entry. It should be based on the released version of the archive and the released version of Isabelle, not on <a href=\"http://afp.hg.sourceforge.net/hgweb/afp/afp/\">http://afp.hg.sourceforge.net/hgweb/afp/afp/</a> which is the development version and unstable, often changing daily based on the development version of Isabelle.</p>\n<p>From the sound of it, we'd be more than happy to accept a new submission with the development you're working on.</p>\n<p>Cheers,<br>\nGerwin</p>",
        "id": 294124216,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660840792
    },
    {
        "content": "<p>From: Joachim Breitner &lt;<a href=\"mailto:mail@joachim-breitner.de\">mail@joachim-breitner.de</a>&gt;<br>\nHi Gerwin,</p>\n<p>ok, that wasn’t fully clear to me (and I already violated that rule by<br>\nfinishing the free-group-isomorphism result in this commit:<br>\n<a href=\"http://afp.hg.sourceforge.net/hgweb/afp/afp/rev/132265dbbf80\">http://afp.hg.sourceforge.net/hgweb/afp/afp/rev/132265dbbf80</a>, sorry for<br>\nthat).</p>\n<p>So at least in this case, I’d like to continue basing my work on<br>\nIsabelle-devel and AFP-devel (otherwise I’d have to undo compatibility<br>\nchanges and add all the auxiliary lemmas that went into HOL by now), but<br>\nI’ll not push my changes but rather put my repository somewhere and ask<br>\nthe editors to review and merge once (and if) I’m done.</p>\n<p>Should such a new theorem be submitted as a new AFP entry or as an<br>\nupdate of the existing FreeGroup entry?</p>\n<p>Greetings,<br>\nJoachim<br>\n<a href=\"/user_uploads/14278/sOSlA8uw1K-gAkQp3YUw-j_k/signature.asc\">signature.asc</a></p>",
        "id": 294124273,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660840803
    },
    {
        "content": "<p>From: Gerwin Klein &lt;<a href=\"mailto:gerwin.klein@nicta.com.au\">gerwin.klein@nicta.com.au</a>&gt;<br>\nHi Joachim,</p>\n<p>On 12/12/2010, at 5:10 AM, Joachim Breitner wrote:</p>\n<blockquote>\n<p>ok, that wasn’t fully clear to me (and I already violated that rule by<br>\nfinishing the free-group-isomorphism result in this commit:<br>\n<a href=\"http://afp.hg.sourceforge.net/hgweb/afp/afp/rev/132265dbbf80\">http://afp.hg.sourceforge.net/hgweb/afp/afp/rev/132265dbbf80</a>, sorry for<br>\nthat).</p>\n</blockquote>\n<p>I guess the question is what is a \"major new theorem\" or \"major new addition\". </p>\n<p>This commit above is ok as an incremental change, and naturally fits into the development entry, so nobody had a problem with it. If you have similar things but just a bit bigger, you should coordinate with the editors, and we're very likely to give you an ok for the change. It should be noted in the public history/changelog of the entry, though.  </p>\n<p>Your description sounded like major new work to me, in size at least on the order of the existing entry. I would not say that this is just a small addition or maintenance change then. One indication for this was that you wanted to cite the change. If it's big enough for that, I'd usually think that it is a new entry. It is possible that in some cases (maybe this one too) that it makes sense to merge the new work with an existing entry, and if there are good reasons for it we'll be happy to do that. In any case it at least needs discussion and review, and needs to be marked in the public history of the entry again.</p>\n<p>The main concern is that AFP entries need to be citable.  For that to work, it must be clear what a citation refers to, that target must be unchangeable, and it must be reproducible for readers. For an evolving system like Isabelle the last two are in conflict, so we make regular releases and allow maintenance changes. Those that want (convenient) reproducible can download the current version, those that want to know exactly what was described in the paper can download the version that was submitted or cited (a citation will contain the entry name and URL and a year, maybe a month, so that should be clearly defined). </p>\n<p>For this to make sense, even the maintenance version must still at least be close to the cited version. If we accept silent major changes, this breaks.</p>\n<p>As evidenced by our discussion, \"major\" doesn't have a precise meaning and we're happy to be flexible. As a solution to changes that don't warrant a new entry, but that do significantly change what a reader would reasonably expect in an entry, we've introduced a public history/changelog for entries where these changes can be marked and it is made clear for readers what happened when (the version control changelog would be way to low-level for that). As editors we want to know of things that go in there. We haven't had a case yet where we violently disagreed, only cases where we had suggestions for change and usually no problem at all.</p>\n<p>So from a practical point of view, we should discuss off-list how big your change really is and if it should be merged or not. It's hard to say without seeing the new development or knowing more about it.</p>\n<blockquote>\n<p>So at least in this case, I’d like to continue basing my work on<br>\nIsabelle-devel and AFP-devel (otherwise I’d have to undo compatibility<br>\nchanges and add all the auxiliary lemmas that went into HOL by now),</p>\n</blockquote>\n<p>This happens from time to time. We can do that, but it has a major disadvantage for you until the next release: you can't really cite the new development yet, even if it is in the afp repository. It only becomes properly visible to site users with the next Isabelle release. The next release is rumoured to be planned for early next year, so this might not be a big deal this time.</p>\n<p>The reason it is not citable is that it is not reproducible. It would be major work for a reader or referee to figure out which exact hg id of the entry and of Isabelle you are referring to. It would be hard now, and it would be very hard in 10 years (who knows what version control system we're running then). With just the data of a normal citation it would be pretty much impossible.</p>\n<blockquote>\n<p>but I’ll not push my changes but rather put my repository somewhere and ask<br>\nthe editors to review and merge once (and if) I’m done.</p>\n</blockquote>\n<p>If that is what you want to do, a local hg clone of the afp development repository is probably the right way to go, because you can pull in Isabelle related changes.</p>\n<p>Cheers,<br>\nGerwin</p>",
        "id": 294124300,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660840809
    },
    {
        "content": "<p>From: Joachim Breitner &lt;<a href=\"mailto:mail@joachim-breitner.de\">mail@joachim-breitner.de</a>&gt;<br>\nHi,</p>\n<p>Am Sonntag, den 12.12.2010, 10:54 +1100 schrieb Gerwin Klein:</p>\n<blockquote>\n<p>Your description sounded like major new work to me, in size at least<br>\non the order of the existing entry. I would not say that this is just<br>\na small addition or maintenance change then. One indication for this<br>\nwas that you wanted to cite the change. </p>\n</blockquote>\n<p>ah, there is a misunderstanding, cause by unclear wording on my side.<br>\nWith “cite” I meant that I want to show my current development state<br>\neasily when asking technical questions (which started this thread), and<br>\nit would be convenient to have it available in some publicly readable<br>\nrepository with hgweb access. I did not mean or plan citing in the<br>\nacademical sense.</p>\n<p>(But I still see that with hg it is inconvenient to have personal<br>\nbranches in the AFP repository and that I will host my branch somewhere<br>\nelse.)</p>\n<blockquote>\n<p>So from a practical point of view, we should discuss off-list how big<br>\nyour change really is and if it should be merged or not. It's hard to<br>\nsay without seeing the new development or knowing more about it.</p>\n</blockquote>\n<p>I’ll raise that once it’s ready.</p>\n<blockquote>\n<blockquote>\n<p>but I’ll not push my changes but rather put my repository somewhere <br>\nand ask the editors to review and merge once (and if) I’m done.</p>\n</blockquote>\n<p>If that is what you want to do, a local hg clone of the afp<br>\ndevelopment repository is probably the right way to go, because you<br>\ncan pull in Isabelle related changes.</p>\n</blockquote>\n<p>yes, this is already what I’m doing.</p>\n<p>Greetings,<br>\nJoachim<br>\n<a href=\"/user_uploads/14278/--oqwL4ALtEgLyoh8FahwuF_/signature.asc\">signature.asc</a></p>",
        "id": 294124339,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660840820
    }
]