[
    {
        "content": "<p>From: Stephan Merz &lt;<a href=\"mailto:Stephan.Merz@loria.fr\">Stephan.Merz@loria.fr</a>&gt;<br>\nSince the TLA+ proof system is partly based on Isabelle, the following announcement may be of particular interest to this mailing list.</p>\n<p>Thanks for your consideration,</p>\n<p>Stephan Merz</p>\n<hr>\n<p>Research team: Tools for Proofs, MSR-INRIA Joint Centre<br>\n=======================================================</p>\n<p>The Microsoft Research-INRIA Joint Centre is offering a 2-year<br>\nposition for a post-doctoral researcher to contribute to a proof development<br>\nenvironment for TLA+ developed in the Tools for Proofs project (see<br>\n<a href=\"http://www.msr-inria.inria.fr\">http://www.msr-inria.inria.fr</a>).</p>\n<p>Research Context<br>\n================</p>\n<p>TLA+ is a language for specifying and reasoning about systems,<br>\nincluding concurrent and distributed systems.  It is based on<br>\nfirst-order logic, set theory, temporal logic, and a module system.<br>\nTLA+ and its tools have been used in industry for over a decade.  More<br>\nrecently, we have extended TLA+ to include hierarchically structured<br>\nformal proofs that are independent of any proof checker.  We have<br>\nreleased several versions of the TLAPS proof checker<br>\n(<a href=\"http://msr-inria.inria.fr/~doligez/tlaps/\">http://msr-inria.inria.fr/~doligez/tlaps/</a>) and integrated it into the<br>\nTLA+ Toolbox, an IDE for the TLA+ tools<br>\n(<a href=\"http://research.microsoft.com/en-us/um/people/lamport/tla/toolbox.html\">http://research.microsoft.com/en-us/um/people/lamport/tla/toolbox.html</a>).</p>\n<p>TLAPS and the Toolbox support the top-down development of proofs and<br>\nthe checking of individual proof steps independently of the rest of<br>\nthe proof.  This helps users focus on the part of the proof they are<br>\nworking on.  Although still lacking important features, TLAPS is<br>\nalready a powerful tool and has been used for a few verification<br>\nprojects, including a proof of the safety properties of a Byzantine-fault<br>\ntolerant consensus algorithm<br>\n(<a href=\"http://research.microsoft.com/en-us/um/people/lamport/tla/byzpaxos.html\">http://research.microsoft.com/en-us/um/people/lamport/tla/byzpaxos.html</a>).</p>\n<p>TLAPS consists of the Proof Manager (PM, an interpreter for the<br>\nproof language that computes the proof obligations corresponding to<br>\neach proof step) and an extensible list of backend provers. Current backends<br>\ninclude the tableau prover Zenon, an encoding of TLA+ as an object logic<br>\nin the Isabelle proof assistant, and a generic backend for SMT solvers.<br>\nWhen possible, we expect backend provers to produce a detailed proof that<br>\nis then checked by Isabelle.  In this way, we can obtain high assurance<br>\nof correctness as well as satisfactory automation.</p>\n<p>The current version of the PM handles only the \"action\" part of TLA+:<br>\nfirst-order formulas with primed and unprimed variables, where a<br>\nvariable v is considered to be unrelated to its primed version v'.<br>\nThis allows us to translate non-temporal proof obligations to standard<br>\nfirst-order logic, without the overhead associated with an encoding of<br>\ntemporal logic into first-order logic.</p>\n<p>Description of the activity of the post-doc<br>\n===========================================</p>\n<p>You will work with other members of the project, including Leslie<br>\nLamport, Damien Doligez, and Stephan Merz, on the extension of the<br>\nTLA+ proof language to temporal operators.  This extension poses<br>\ninteresting conceptual and practical problems.  In particular, the new<br>\ntranslation must smoothly extend the existing one since temporal proof<br>\nsteps rely on action-level subproofs.  You will have the primary<br>\nresponsibility for designing and implementing algorithms to generate<br>\ncorresponding proof obligations.</p>\n<p>As time permits and depending on your interests, you will have the<br>\nopportunity to contribute to further improving the proof checker.<br>\nThis may include:</p>\n<ul>\n<li>\n<p>adding support for certain TLA+ features that are not yet handled by<br>\n  the PM, such as recursive operator definitions and elaborate patterns<br>\n  for variable bindings;</p>\n</li>\n<li>\n<p>finding what improvements are needed by verifying real examples, perhaps<br>\n  including liveness of the aforementioned consensus algorithm;</p>\n</li>\n<li>\n<p>integrating new backends to improve the automation of proofs;</p>\n</li>\n<li>adding validation of proofs by backends whose proofs are not<br>\n  now checked.</li>\n</ul>\n<p>Skills and profile of the candidate<br>\n===================================</p>\n<p>You should have a solid knowledge of logic and set theory as well as<br>\ngood implementation skills related to symbolic theorem proving.  Of<br>\nparticular relevance are parsing and compilation techniques.  Our<br>\ntools are mainly implemented in OCaml.  Experience with temporal and<br>\nmodal logics, Isabelle, Java or Eclipse would be a plus.</p>\n<p>Given the geographical distribution of the members of the team,<br>\nwe highly value a good balance between the ability to work in a team<br>\nand the capacity to propose initiatives.</p>\n<p>Location<br>\n========</p>\n<p>The Microsoft Research-INRIA Joint Centre is located on the Campus of<br>\nINRIA Saclay south of Paris, near the Le Guichet RER station.</p>\n<p>Starting date<br>\n=============</p>\n<p>The normal starting date of the contract would be September 2012,<br>\nbut we can arrange for an extremely well-qualified candidate to<br>\nstart sooner.</p>\n<p>Contact<br>\n=======</p>\n<p>Candidates should send a resume and the name and e-mail addresses of<br>\none or two references to Damien Doligez &lt;<a href=\"mailto:damien.doligez@inria.fr\">damien.doligez@inria.fr</a>&gt;.<br>\nThe deadline for application is April 15, 2012.</p>\n<p>This announcement is available at<br>\n<a href=\"http://www.msr-inria.inria.fr/Members/doligez/post-doc-position-2012/view\">http://www.msr-inria.inria.fr/Members/doligez/post-doc-position-2012/view</a></p>",
        "id": 294153130,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660850067
    }
]