[
    {
        "content": "<p>From: Denis Bueno &lt;<a href=\"mailto:dbueno@gmail.com\">dbueno@gmail.com</a>&gt;<br>\nHi all,</p>\n<p>In a proof I am working on, I need to formalise the statement \"let x<br>\nbe the largest member of X\".  There is the Max operator in Finite_Set<br>\nwhich provides this, but it requires the elements in the set X to be<br>\nordered by a linear order.  My elements are <em>linearly ordered</em> but<br>\nthey are not ordered by a linear order.  That is, my order is locally<br>\nlinear in the context I care about, but it is not linear in general.<br>\nIs there a way to express this fact to Isabelle so I can use the Max<br>\nfunction?</p>\n<p>Second, since I couldn't figure out how to express this to Isabelle<br>\n(if it is indeed possible), I tried to prove that there is always a<br>\nmax for my set.  Mathematically, this is achieved via a simple<br>\ninduction on the cardinality of the set X, and indeed in the<br>\nFinite_Set library there is the induction rule<br>\n\"Finite_Set.finite_ne_induct\" for an induction whose base case is a<br>\nnon-empty set, which is exactly what I want.  However, Isabelle<br>\nrejects my attempt to perform this induction (\"empty result<br>\nsequence\").</p>\n<p>Concretely, I am using a sequence-prefix ordering from the library<br>\nLList2 [0]: x &lt;= y if the sequence x is a prefix of y.  In my proof,<br>\nevery element of the set X is a prefix of a fixed sequence, t.  Thus,<br>\nthe elements in X are linearly ordered, since any two elements x and y<br>\nare prefixes of t, and thus x &lt;= y or y &lt;= x.</p>\n<p>If you can help me, please try out the proof script, which I've<br>\nattached: the relevant induction is for the theorem on line 152.<br>\nThank you.</p>\n<p>[0] <a href=\"http://afp.sourceforge.net/browser_info/current/HOL/Lazy-Lists-II/LList2.html\">http://afp.sourceforge.net/browser_info/current/HOL/Lazy-Lists-II/LList2.html</a><br>\n<a href=\"/user_uploads/14278/UfgK4IB6wcBI9qt4tOYNU6J8/Hyper.thy\">Hyper.thy</a></p>",
        "id": 294058270,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660822474
    },
    {
        "content": "<p>From: Tobias Nipkow &lt;<a href=\"mailto:nipkow@in.tum.de\">nipkow@in.tum.de</a>&gt;<br>\nI don't think there is anything readymade anywhere. All I can suggest is <br>\nto take the development of Max in FiniteSet and generalize and adapt it <br>\nto your situation. The structure of the development should stay the <br>\nsame, but of course many details will change.</p>\n<p>Regards<br>\nTobias</p>\n<p>Denis Bueno schrieb:</p>",
        "id": 294058276,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660822476
    },
    {
        "content": "<p>From: Stefan Friedrich &lt;<a href=\"mailto:stefan.friedrich@methodpark.de\">stefan.friedrich@methodpark.de</a>&gt;<br>\nHi Denis,</p>\n<p>concerning your second question, the proof in the enclosed theory file<br>\nshould do the trick.</p>\n<p>Cheers,</p>\n<p>Stefan</p>\n<p>Denis Bueno schrieb:<br>\n<a href=\"/user_uploads/14278/DFlpWv-ULq5G5XQ42aKz2zXG/Hyper.thy\">Hyper.thy</a></p>",
        "id": 294058314,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660822490
    },
    {
        "content": "<p>From: Denis Bueno &lt;<a href=\"mailto:dbueno@gmail.com\">dbueno@gmail.com</a>&gt;<br>\nThank you all for your help.  In the end I used the proof developed by<br>\nStefan which I believe is essentially what Tobias suggested.</p>\n<p>Stefan, reading your proof was insightful and helpful.  Thanks again!</p>",
        "id": 294058561,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660822598
    }
]