[
    {
        "content": "<p>From: Manuela Bujorianu &lt;<a href=\"mailto:Manuela.Bujorianu@manchester.ac.uk\">Manuela.Bujorianu@manchester.ac.uk</a>&gt;</p>\n<hr>\n<p>WE APOLOGIZE IF YOU RECEIVE MULTIPLE COPIES OF THIS MESSAGE</p>\n<hr>\n<p>CALL FOR PAPERS</p>\n<p>International Workshop on Formal Methods for Aerospace (FMA)</p>\n<p>A satellite workshop of the 16th International Symposium<br>\n                               on Formal Methods-FM</p>\n<p>Eindhoven, The Netherlands,   3rd November 2009</p>\n<p><a href=\"http://personalpages.manchester.ac.uk/staff/Manuela.Bujorianu/FMA.htm\">http://personalpages.manchester.ac.uk/staff/Manuela.Bujorianu/FMA.htm</a></p>\n<p>PDF version: <a href=\"http://www.csc.liv.ac.uk/~michael/fma09cfp.pdf\">http://www.csc.liv.ac.uk/~michael/fma09cfp.pdf</a></p>\n<p>BACKGROUND:<br>\nAerospace systems are not only safety critical, but also mission  <br>\ncritical, and often have very high performance requirements. For  <br>\nexample, while there is no safety issue regarding a planetary rover,  <br>\nthe system performance must justify the great cost of deploying it.  <br>\nConsequently, if we are to tackle to development and analysis of  <br>\naeronautical systems is a formal way, we must enrich traditional  <br>\nformal methods with new (or, at least, rarely investigated) research  <br>\nissues. This naturally leads to a interdisciplinary approach, which  <br>\nmight: underline the importance of some research problems from  <br>\naeronautics to the formal method community; and promote new formal  <br>\ntechniques combining principles from artificial intelligence and  <br>\ncontrol engineering.<br>\nThe source of new problems comes from the great diversity of  <br>\naeronautical systems, including satellites, UAVs, terrestrial or other  <br>\nkinds of flying robots. These systems can be involved in complex  <br>\nactivities such as space exploration, telecommunications support, fire  <br>\ndetection, geo-mapping, weather prognoses, geo-rectification, search &amp;  <br>\nrescue, traffic surveillance, target tracking, etc. From these  <br>\napplications, concepts such as autonomy, collective behaviour,  <br>\ninformation fusion, cognitive skills, coordination, flocking, are  <br>\nrequired and new solutions, such as digital pheromones, swarms, system  <br>\nof systems of robots, sensing, physical actuation, are developed.  <br>\nConsidering this rich landscape of research problems and potential  <br>\nsolutions, interdisciplinarity seems to be the most natural route.  <br>\nFormal methods could benefit from integration with well-developed  <br>\nmethods from other disciplines. Many such opportunities are easily at  <br>\nhand, for example the coordination of UAVs or satellites, which have  <br>\nbeen successfully tackled using various techniques from control  <br>\nengineering and numerical tools from dynamic programming. In addition,  <br>\nthere exist an abundance of examples of the use of artificial  <br>\nintelligence techniques in aeronautics (target tracking, rover  <br>\nplanning, multi-agent technologies and so on). The implementation of  <br>\nthese methods could benefit from formal development. Conversely, from  <br>\nthe cross-fertilization of multidisciplinary approaches we can expect  <br>\nmore robust, safe and mechanizable development and verification  <br>\nmethods for aerospace systems.</p>\n<p>AIM AND SCOPE:<br>\nThe main workshop objective is to promote a holistic view and  <br>\ninterdisciplinary methods for design, verification and co-ordination  <br>\nof aeronautical systems, by combining formal methods with techniques  <br>\nfrom control engineering and artificial intelligence. The very  <br>\ndemanding safety, robustness and performance requirements of these  <br>\nsystems require unprecedented integration of heterogeneous techniques  <br>\nand models. The aim of FMA is to bring together active researchers  <br>\nfrom all the above areas to discuss and present their work. Relevant  <br>\ntopics include, but are not limited to (all with a focus on potential  <br>\napplication in aerospace design or engineering):<br>\n  new modeling paradigms<br>\n  formal verification of safety and performance properties<br>\n  combining formal and analytical techniques in modeling and verification<br>\n  heterogeneous and hybrid system models<br>\n  probabilistic and stochastic modeling and verification methods<br>\n  agent technologies<br>\n  multi-agent coordination<br>\n  runtime monitoring<br>\n  trajectory specification languages<br>\n  runtime monitoring</p>\n<p>PAPER SUBMISSION:<br>\nWe invite submissions of high quality, original papers in the above  <br>\nareas. Papers should be written in English, formatted according to the  <br>\nSpringer LNCS style, and not exceed 16 pages including figures,  <br>\nreferences, etc. At least one author of the accepted papers should  <br>\nregister at the workshop. Submissions must be made via  <br>\n<a href=\"http://www.easychair.org/conferences/?conf=fma09\">http://www.easychair.org/conferences/?conf=fma09</a>.</p>\n<p>The pre-proceedings will be available as an online technical report  <br>\nand disseminated at the workshop. We are in negotiation for a journal  <br>\nspecial issue for selected (extended and revised) papers.</p>\n<p>IMPORTANT DATES:<br>\nDeadline for submission:           21st August 2009<br>\nNotification of acceptance:        28th September 2009<br>\nCamera Ready Copy due:             11th October 2009</p>\n<p>WORKSHOP CO-CHAIRS:<br>\nManuela Bujorianu  (Manchester, UK)<br>\nMichael Fisher (Liverpool, UK)<br>\nCorina Pasareanu (CMU (SV), USA)</p>\n<p>Programme Committee:</p>\n<p>Howard Barringer  (Manchester, UK)<br>\nMarius Bozga  (Verimag, FR)<br>\nRicky Butler  (NASA, USA)<br>\nErnst-Erich Doberkat  (Dortmund, DE)<br>\nAlessandro Giua  (Cagliari, IT)<br>\nJianghai Hu  (Purdue, USA)<br>\nRom Langerak  (Twente, NL)<br>\nJohn Lygeros  (Zurich, CH)<br>\nSavi Maharaj  (Stirling, UK)<br>\nTiziana Margaria  (Potsdam, DE)<br>\nCesar Munoz  (NASA, USA)<br>\nFlemming Nielson  (DTU, DK)<br>\nDusko Pavlovic  (Oxford, UK)<br>\nCristina Seceleanu  (Malardalen, SE)<br>\nRoberto Segala  (Verona, IT)<br>\nFerucio Tiplea  (Iasi, RO)<br>\nAntonios Tsourdos  (Cranfield, UK)<br>\nMike Whalen  (Minnesota, USA)<br>\nVirginie Wiels  (ONERA, FR)</p>",
        "id": 294075030,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660828526
    }
]