[
    {
        "content": "<p>From: <a href=\"mailto:Rosemary.Monahan@nuim.ie\">Rosemary.Monahan@nuim.ie</a><br>\nVerifyThis Verification Competition 2015<br>\n  FIRST ANNOUNCEMENT AND CALL FOR PROBLEMS<br>\n  Competition to be held at ETAPS 2015<br>\n 12 April 2015, London, UK</p>\n<p><a href=\"http://etaps2015.verifythis.org/\">http://etaps2015.verifythis.org/</a></p>\n<hr>\n<p>Get involved, even if you cannot participate in the competition: provide<br>\n a challenge.</p>\n<p>IMPORTANT DATES<br>\n  Submission deadline: November 28, 2014<br>\n Competition: April 12, 2015</p>\n<p>CALL FOR PROBLEMS<br>\n  To extend the problem pool and tender better to the needs of the<br>\n participants, we are now soliciting verification problems for the<br>\n competition (itself introduced below):</p>\n<p>- a problem should contain an informal statement of the algorithm to be<br>\n   implemented (optionally with complete or partial pseudocode) and the<br>\n   requirement(s) to be verified</p>\n<ul>\n<li>a problem should be suitable for a 60-90 minute time slot</li>\n<li>submission of reference solutions is strongly encouraged</li>\n<li>\n<p>problems with an inherent language- or tool-specific bias should be<br>\n   clearly identified as such</p>\n</li>\n<li>\n<p>problems that contain several subproblems or other means of difficulty<br>\n   scaling are especially welcome</p>\n</li>\n<li>\n<p>the organizers reserve the right (but no obligation) to use the<br>\n   problems in the competition, either as submitted or with modifications</p>\n</li>\n<li>\n<p>submissions from (potential) competition participants are allowed</p>\n</li>\n</ul>\n<p>Problems from previous competitions can be seen at <a href=\"http://www.verifythis.org\">http://www.verifythis.org</a><br>\n  Submissions are to be sent per email to <a href=\"mailto:etaps2015@verifythis.org\">etaps2015@verifythis.org</a> by the<br>\n date indicated above.</p>\n<p>PRIZES<br>\n  The best submission will receive a prize.<br>\n   ABOUT<br>\n  VerifyThis 2015 will take place as part of the European Joint<br>\n Conferences on Theory and Practice of Software (ETAPS 2015) on April<br>\n 12th, 2015 in London, UK. It is the 4th event in the VerifyThis<br>\n competition series.</p>\n<p>The aims of the competition are:</p>\n<ul>\n<li>\n<p>to bring together those interested in formal verification, and to<br>\n   provide an engaging, hands-on, and fun opportunity for discussion  </p>\n</li>\n<li>\n<p>to evaluate the usability of logic-based program verification tools in<br>\n   a controlled experiment that could be easily repeated by others.  </p>\n</li>\n</ul>\n<p>The competition will offer a number of challenges presented in natural<br>\n language. Participants have to formalize the requirements, implement a<br>\n solution, and formally verify the implementation for adherence to the<br>\n specification.  </p>\n<p>There are no restrictions on the programming language and verification<br>\n technology used. The correctness properties posed in problems will have<br>\n the input-output behaviour of programs in focus. Solutions will be judged<br>\n for correctness, completeness and elegance.</p>\n<p>Registration details are forthcoming. Informal inquiries are welcome at<br>\n<a href=\"mailto:etaps2015@verifythis.org\">etaps2015@verifythis.org</a>.</p>\n<p>ORGANIZERS</p>\n<p>* Marieke Huisman, University of Twente, the Netherlands<br>\n * Vladimir Klebanov, Karlsruhe Institute of Technology, Germany<br>\n * Rosemary Monahan, Maynooth University, Ireland</p>\n<p>CONTACT<br>\n<a href=\"mailto:etaps2015@verifythis.org\">etaps2015@verifythis.org</a><br>\n<a href=\"http://etaps2015.verifythis.org/\">http://etaps2015.verifythis.org/</a></p>",
        "id": 294320033,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660926588
    }
]