[
    {
        "content": "<p>From: Otmane Ait Mohamed &lt;<a href=\"mailto:ait@encs.concordia.ca\">ait@encs.concordia.ca</a>&gt;<br>\nTPHOLs'2008 Business Meeting</p>\n<p>August 21, 2008 (3-4pm)</p>\n<p>The meeting  started with  Sofiene Tahar presenting  a summary  of the<br>\ninitial proposal for  TPHOLS2008, a summary of how  things went in the<br>\nconference  this year. This  was followed  by a  brief talk  by Tobias<br>\nNipkow about TPHOLs 2009. Matt Kaufman talked then about his ideas for<br>\nTPHOLs 2010. After that several issues were discussed including TPHOLs<br>\nname change, and  venue for 2011. The meeting  ended with Matt Kaufman<br>\nthanking  Sofiene  Tahar, Otmane  Ait  Mohammed  and  Cesar Munoz  for<br>\narranging TPHOLs 2008.</p>\n<p>Sofiene started  by showing a  presentation from his  initial proposal<br>\nfor TPHOLs  2008 given at the  business meeting of  TPHOLs 2007.  Main<br>\nfeatures  in   the  proposal  were,  in  commemoration   of  20  years<br>\nanniversary:   embedded  tutorials,   invited  talks,   and  satellite<br>\nworkshops together with regular  contributions. He then summarized the<br>\ntime  line  from  call  for   papers  for  TPHOLs  2008,  to  abstract<br>\nsubmissions, to  submission of papers,  notice of acceptance  and then<br>\nfinally some  conference statistics. 45 papers were  submitted from 13<br>\ncountries.  Sixteen were  accepted as  regular papers,  6  as emerging<br>\ntrend papers,  and 1 as proof  pearl. The regular  session papers were<br>\narchived  in  LNCS  format  where  emerging  trends  proceedings  were<br>\nprovided to  the participants (hardcopies  and CD ROM). CD  as default<br>\nand hardcopy by request (he  reported that 20 copies were enough!). It<br>\nwas also  promised that the source  code, and slides  of all tutorials<br>\nand invited  talks shall be provided  on the conference web  site in a<br>\nfew days.</p>\n<p>While talking about finances Sofiene mentioned that there were several<br>\ngenerous  sponsors  which  made  this event  possible,  they  included<br>\nConcordia University, the Faculty of Engineering and Computer Science,<br>\nINTEL, RESMIQ,  and NIA. All the  expenses are expected to  be met and<br>\nthere  may be some  money left  over! Special  rates were  provided to<br>\nstudents  attending  the  conference.  There  was a  plan  to  provide<br>\nbursaries  to   some  students  attending  the   conference  but  that<br>\nunfortunately  could not  be accomplished.   Overall, this  year there<br>\nwere 39 regular attendees, 23 students  + 6 from Concordia, a total of<br>\n68.</p>\n<p>Tobias then talked  about TPHOLS 2009. The TPHOLs  conference web site<br>\nis \"<a href=\"http://tphols.in.tum.de\">http://tphols.in.tum.de</a>\".  In his presentation,  he showed several<br>\npictures of the university  campus and the computer science department<br>\nbuilding, and  the \"slide\"  from the third  floor of the  building. He<br>\nsuggested two possible  dates for the conference, either  third or the<br>\nlast  week   of  August  of   2009  with  first  preference   for  the<br>\nlatter. Tobias also mentioned that he has checked web sites of several<br>\nother conference such as CADE, FMCAD,  CAV, etc. to make sure there is<br>\nno date conflicts. The conference  format will be the same as previous<br>\nyear, spread over four days  and consisting of invited papers, regular<br>\ncontributions, emerging trends, and a  workshop on the last day of the<br>\nconference,  The  organizers of  TPHOLs  are  Tobias Nipkow,  Makarius<br>\nWenzel, Stefan Berghofer, and Christian Urban.</p>\n<p>The 22nd  TPHOLs will take place  in the computer  science building of<br>\nthe  Technische   Universitat  Munchen.  The  venue  is   out  of  the<br>\ncity.  There are no  hotels on  campus. Nearest  hotel is  about 20-25<br>\nminutes walk away. One can take the subway to Munich which takes about<br>\n25 minutes. There one can find a range of prices for hotels. There are<br>\ndirect flights from several metropolitan cities to Munich, e.g. Paris,<br>\nLondon, Nice, Montreal,  Chicago. The excursion will be  probably be a<br>\nvisit to museum followed by a  city tour. Archival format will be LNCS<br>\nand support for the invited  speakers will be provided. The organizers<br>\nwill be looking for sources of  support but the cost in Munich may not<br>\nbe  as low  Montreal which  was  truly exceptional,  as elaborated  by<br>\nTobias.</p>\n<p>Matt  talked  about  TPHOLs/ITP  in  2010.  ITP  (Interactive  theorem<br>\nProving)  2010 will  be held  in Edinburgh  as part  of FLoC  2010. He<br>\nbriefly described the history  of TPHOLs name change. Initially TPHOLs<br>\nwanted to be part of FLoC, but  FLoC said no. Then an idea was floated<br>\nthat  if TPHOLs  and ACL2  can join  together, then  they can  reach a<br>\ncritical mass needed to be part of FLOC (Approximately 30 participants<br>\nfrom ACL2, and about 60 participants from TPHOLs community)</p>\n<p>For 2010, the idea is to have one day tutorial, two parallel sessions,<br>\none for ACL2 community and one  for the HOL community. Through show of<br>\nhands about  20 to  25 showed  interest in attending  a full  day ACL2<br>\ntutorial.  There were  about 65 people present in  the conference room<br>\nat the time of the show of hand vote.</p>\n<p>This  was followed  by open  discussion of  several issues.  The first<br>\nissue  discussed was  the change  of name  of TPHOLs  to  ITP starting<br>\n2010. Matt lead  the discussion. He asked  if this is a  good idea? He<br>\nalso mentioned that the steering committee seemed to like it. This was<br>\nfollowed by  a short discussion, mostly  in favor of  the name change,<br>\nwith some against the change of  name arguing the loss of the \"TPHOLs\"<br>\nicon.  Burkhart  Wolf, John Mathews, Peter Homier,  Matt Kaufman, Yves<br>\nBertot, David  Lester, Cameron  Freer and several  others participated<br>\nint  the discussion.  Some of  the  comments included  \"it's a  better<br>\nname\", \"we  deal with problems which  are much harder  to handle\", \"we<br>\nbring human insight into the automated reasoning\", \"Its just evolution<br>\nof the name\", \"it will help draw more representation from industry and<br>\nthe  mathematics community\",  \"the number  21st  gives us  an aura  of<br>\nrespectability so we should not  reset the number of the conference to<br>\none\", \"FLOC is a good venue to start a new name\".</p>\n<p>Sofiene suggested that since not all in the HOL community are present,<br>\nwe should ask for feedback  regarding the name change through email. A<br>\nquestion  was asked  who should  lead this  effort, and  Tobias kindly<br>\naccepted to do it.</p>\n<p>A question  was asked about what's  the plan after  FLoC 2010. Sofiene<br>\nmentioned that  Elsa Gunter showed interest in  holding the conference<br>\nat University of Urbana Champaign in 2011.</p>\n<p>It was mentioned  that it has been a tradition  to hold the conference<br>\nin Europe one year and in  a country outside Europe the following year<br>\n(or in broader  sense change continent every year).  Issues about visa<br>\nto USA were  discussed. There was a mention  of avoiding countries who<br>\nhave  unreasonable   policies  regarding  immigration   and  therefore<br>\ndifficulty for  travel. Some  countries will not  give visas  and some<br>\nhave a lot of paperwork that needs to be done to get a visa.</p>\n<p>Finally,  Matt thanked Sofiene  Tahar, Otmane  Ait Mohammed  and Cesar<br>\nMunoz for arranging the conference this year.  One of the participants<br>\nmentioned that he  registered late and was not able  to find the exact<br>\nlocation from  the conference web site. Sofiene  replied that detailed<br>\ninformation about  the conference  was to sent  to all  the registered<br>\nparticipants a few days before the conference via email.</p>",
        "id": 294065362,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660825244
    }
]