[
    {
        "content": "<p>From: Jean Martina &lt;<a href=\"mailto:jean.martina@cl.cam.ac.uk\">jean.martina@cl.cam.ac.uk</a>&gt;<br>\nThis position accepts propositions on IoT security protocol specification<br>\nand verification.</p>\n<p>Jean</p>\n<p><em>Post-Doctoral Open Position</em></p>\n<p>The Software/Hardware Integration Lab (LISHA) has an open position for a<br>\npost-doctoral fellow the field of <em>embedded real-time systems</em>.</p>\n<p><em>The Laboratory</em></p>\n<p>LISHA was established at UFSC in 1984 to promote research on the frontier<br>\nbetween hardware and software. Since then, LISHA has contributed to a large<br>\nnumber of R&amp;D projects, many of which were executed in cooperation with<br>\ninternational institutions. Computer architecture, hardware design,<br>\noperating systems, and computer networks have been the main topics of<br>\ninterest for the researchers and students associated to the Lab. Late in<br>\nthe last decade, these topics converged into that that is now LISHA's major<br>\nexpertise: Embedded Systems.</p>\n<p><em>Position Description</em></p>\n<p>The post-doctoral fellow will have the opportunity to work with LISHA<br>\nfaculty staff and to develop his/her own research agenda in fields related<br>\nto embedded systems, such as multicore real-time systems, Internet of<br>\nThings (IoT), and dedicated hardware. LISHA offers an environment of<br>\ninternational cooperation as well as the involvement with teaching<br>\nactivities.</p>\n<p><em>Your Profile</em></p>\n<p>You must hold a PhD degree that is related to embedded systems and should<br>\nhave a record in conductining highly competitive research and publishing<br>\nyour research results in top conferences and journals. Portuguese language<br>\nskills is not required. English is mandatory.</p>\n<p><em>Benefits</em></p>\n<p>A good research environment with international cooperation and freedom to<br>\nresearch</p>\n<p>Involvement with teaching actitivites</p>\n<p>2-year contract, R$4.100,00 per month free of taxes</p>\n<p>Possibility to work in R&amp;D projects</p>\n<p>To apply send an email to lisha @ lisha . ufsc .br with your CV, a<br>\nstatement of interest, and the name of two references (researches with<br>\ndoctor degree)</p>\n<p><em>University and Location</em></p>\n<p>The Federal University of Santa Catarina (UFSC) is a public university in<br>\nFlorianopolis. UFSC is one of the leading latin american research<br>\nuniversity, being one of the largest universities in Brazil.</p>\n<p>Florianopolis is the capital city of Santa Catarina State. It is composed<br>\nof one main island, a continental part, and the surrounding small islands.<br>\nThe city is known for having a high life quality and its 42 beaches, being<br>\nthe Brazilian capital city with the highest HDI (0.875) according to the<br>\nUN. The economy of Florianopolis is heavily based on information<br>\ntechnology, tourism, and services. Newsweek placed Florianopolis in the<br>\n\"Ten most dynamic cities of the world\"* list in 2006.<strong> Veja</strong> magazine, a<br>\nBrazilian publication, named the city as \"the best place to live\" in Brazil*<br>\n.</p>\n<p>It is also possible to spend some time at the LISHA facilities in Joinville<br>\n-- 200km far from Florianopolis and the biggest city in Santa Catarina<br>\nstate.</p>\n<p><em>Application</em></p>\n<p>To apply for the position, send an email to lisha @ lisha . ufsc .br with<br>\nyour CV, a statement of interest, and contact information for two<br>\nresearchers able to reference you</p>",
        "id": 294323616,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660927785
    }
]