[
    {
        "content": "<p>From: \"<a href=\"mailto:natasha.sharygina@usi.ch\">natasha.sharygina@usi.ch</a>\" &lt;<a href=\"mailto:natasha.sharygina@usi.ch\">natasha.sharygina@usi.ch</a>&gt;<br>\n[Apologies if you receive multiple copies of this CFP]</p>\n<hr>\n<p>FMCAD 2010<br>\n                   Call for Papers<br>\nInternational Conference on Formal Methods in Computer-Aided Design<br>\n               Lugano, Switzerland<br>\n               20-23 October 2010<br>\n<a href=\"http://fmcad10.iaik.tugraz.at/\">http://fmcad10.iaik.tugraz.at/</a></p>\n<p>IMPORTANT DATES</p>\n<p>Paper Submission:    5 May 2010<br>\nAuthor Notification:  7 July 2010<br>\nFinal Version:         28 July 2010<br>\nConference:  20-23 October 2010</p>\n<p>CONFERENCE SCOPE</p>\n<p>FMCAD 2010 is the tenth in a series of conferences on the theory and<br>\napplication of formal methods in hardware and system design and<br>\nverification.  FMCAD provides a leading international forum to researchers<br>\nand practitioners in academia and industry for presenting and discussing<br>\nnovel methods, technologies, theoretical results, and tools for formally<br>\nreasoning about computing systems, as well as open challenges therein. This<br>\nyear, FMCAD is privileged to have Joseph Sifakis, Founder and Director of<br>\nVERIMAG Laboratory, a Turing Award 2007 winner, to deliver its keynote<br>\naddress on Scientific Challenges and Work Directions in Embedded Systems<br>\nDesign.</p>\n<p>NEW: FMCAD 2010 has two tracks (but no parallel sessions): the research<br>\ntrack and the industrial track.</p>\n<p>RESEARCH TRACK</p>\n<p>Topics of interest:</p>\n<p>Advancing industrial-strength technologies in Model Checking,<br>\n   Theorem Proving, Equivalence Checking, Abstraction and Refinement<br>\n   Techniques, Reduction and Abstraction Techniques, Compositional<br>\n   Methods, Decision Procedures, SMT solvers, Bit-Precise Reasoning,<br>\n   Word-Level Techniques, SAT- and BDD-based methods, Probabilistic<br>\n   Methods, and Combinations of Deductive Methods and Decision<br>\n   Procedures.</p>\n<p>Applications of Formal Methods in Specification, Design and<br>\n   Verification</p>\n<p>Topics relating to the application and applicability of Property-Based<br>\n   Verification, Equivalence Checking, Semi-formal Verification, Runtime<br>\n   Verification, Simulation and Test-case Generation, Coverage Analysis,<br>\n   Microcode Verification, Concurrent Systems, Timing Verification, and<br>\n   Formal Approaches to Performance and Power.</p>\n<p>System-Level Design and Verification, especially for Embedded<br>\n   Systems, Software Verification, HW/SW Co-Design and Verification,<br>\n   Transaction-Level Verification.</p>\n<p>Modeling and Specification Languages, Model-Based Design,<br>\n   Verification-Based Testing, Design Derivation and Transformation,<br>\n   Correct-by-Construction Methods.</p>\n<p>INDUSTRIAL TRACK</p>\n<p>This track is dedicated to industry users of formal methods, including<br>\n   work on real industrial-scale designs being done in universities and<br>\n   research organizations. We invite such users to describe their experience with<br>\n   formal methods, including evaluations of commercial tools, case studies of<br>\n   industrial-scale applications, experience reports on novel and challenging<br>\n   applications, or methodologies for the incorporation of formal or semi-<br>\n   formal methods into the industrial design flow.  Finally, we invite tool<br>\n   presentations, of industrial-strength commercial tools as well as novel<br>\n   academic tools that are not yet industrial strength, but address a real<br>\n   industrial need.  Tool presentations should describe the capabilities or<br>\n   novel features of the tool, or an innovative algorithm, a new approach,<br>\n   or original application methodology.</p>\n<p>EXHIBITION </p>\n<p>FMCAD 2010 will feature also an exhibition with limited free-of-charge<br>\n   booth space for which academic novelty is not a requirement.  Note that <br>\n   since space is limited, we will not be able to accept every request for a booth, <br>\n   and that preference will be given to requests by authors of accepted tool <br>\n   presentations.  EDA vendors are especially encouraged to submit a tool <br>\n   presentation and/or to request booth space in order to demo their tools.</p>\n<p>SUBMISSIONS</p>\n<p>Submissions must be made electronically in PDF format via EasyChair.<br>\n   More details will be provided on the FMCAD web site.  The<br>\n   proceedings are planned to be published by IEEE and ACM and will be<br>\n   available online in the ACM Digital Library and at IEEE Xplore.</p>\n<p>Research Track Submissions</p>\n<p>Two categories of research papers can be submitted: regular papers (8<br>\n   pages) containing original research, and short papers (4 pages) describing<br>\n   emerging results and work-in-progress.</p>\n<p>Industrial Track Submissions</p>\n<p>Submitters to the industrial track will have the option of submitting a<br>\n   regular paper (8 pages), a short paper (4 pages), or a deck of up to<br>\n   25 slides (for tool presentations: 4 pages or 15 slides). Both papers<br>\n   and slide submissions will be reviewed. Regular and short papers will<br>\n   appear in the proceedings as usual, while authors of accepted slide <br>\n   presentations will be invited to write a one page abstract for the <br>\n   proceedings.</p>\n<p>For exhibition space, submission is not required and an email request to<br>\n   the industrial track chairs is sufficient.  However, due to limited space<br>\n   we will not be able to accept every request.  We therefore strongly<br>\n   advise those interested in exhibition space to submit a tool presentation, <br>\n   as we will give preference for booth space to authors of accepted tool <br>\n   presentations.</p>\n<p>Regular and short papers must use the IEEE Transactions format on<br>\n   letter-size paper using a 10-point font (see<br>\n<a href=\"http://www.ieee.org/portal/pages/pubs/transactions/stylesheets.html\">www.ieee.org/portal/pages/pubs/transactions/stylesheets.html</a>).<br>\n   Research Track papers must contain original research that has not been<br>\n   previously published, nor concurrently submitted for publication.  For<br>\n   both research and industry submissions, any partial overlap with a<br>\n   published or concurrently submitted paper must be clearly indicated.<br>\n   (For slide decks, use an extra slide to discuss overlaps; this slide may<br>\n   be excluded from the final presentation.)  By submitting their work,<br>\n   the authors agree to present it at the conference if selected. Authors<br>\n   are strongly encouraged to provide adequate access to their<br>\n   experimental data for verification.</p>\n<p>A small number of accepted papers will be considered for a<br>\n   distinguished paper award.</p>\n<p>CHAIRS</p>\n<p>Roderick Bloem, Graz University of Technology, Austria<br>\nNatasha Sharygina, University of Lugano, Switzerland and Carnegie Mellon University, USA</p>\n<p>INDUSTRIAL TRACK CHAIRS</p>\n<p>Wolfgang Ecker, Infineon, Germany<br>\nCindy Eisner, IBM Haifa Research Laboratory, Israel</p>\n<p>TUTORIAL CHAIR</p>\n<p>Helmut Veith, Vienna University of Technology, Austria</p>\n<p>PUBLICITY CHAIR</p>\n<p>Hana Chockler, IBM Haifa Research Laboratory, Israel</p>\n<p>LOCAL ARRANGEMENTS</p>\n<p>Mariagiovanna Sami, University of Lugano, Switzerland<br>\nUmberto Bondi, University of Lugano, Switzerland<br>\nDaniela Dimitrova, University of Lugano, Switzerland<br>\nFrancesco Regazzoni, University of Lugano, Switzerland and UCL Louvaine-la-Neuve, Belgium</p>\n<p>STEERING COMMITEE</p>\n<p>Jason Baumgartner, IBM, USA<br>\nAarti Gupta, NEC Labs America, USA<br>\nWarren Hunt, University of Texas at Austin, USA<br>\nPanagiotis Manolios, Northeastern University, USA<br>\nMary Sheeran, Chalmers University of Technology, Sweden</p>",
        "id": 294098715,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660833115
    }
]