[
    {
        "content": "<p>From: Elizabeth Leonard &lt;<a href=\"mailto:elizabeth.leonard@nrl.navy.mil\">elizabeth.leonard@nrl.navy.mil</a>&gt;<br>\nFull-Time Computer Scientist Positions<br>\n(US Citizens only)<br>\nNaval Research Laboratory<br>\nCenter for High Assurance Computer Systems<br>\nWashington, DC 20375</p>\n<p>The Software Engineering Section of NRL’s Center for High Assurance <br>\nComputer Systems is looking to hire full-time, permanent members for its <br>\nresearch staff. Persons hired will initially support ongoing funded <br>\nefforts in the section, but will eventually be expected to develop, and <br>\nobtain funding for, their own research programs.</p>\n<p>The objective of the section’s research program is to develop formal, <br>\nmathematically based methods, models, algorithms, theories, and tools <br>\nsupporting both the construction and analysis of software at different <br>\nlevels of abstraction, from requirements through code. Such methods and <br>\ntools provide vital support for the development of high assurance <br>\nsoftware for systems, such as autonomous systems, security systems and <br>\ndevices, and control software, that must satisfy critical system <br>\nproperties such as safety, timing, fault tolerance, and security. Many <br>\nof the formal-methods-based techniques and tools produced in the <br>\nSection’s past research have been applied to real Navy systems.</p>\n<p>Current research in the section includes:</p>\n<p>Application-Specific Security of Source Code: This project is developing <br>\ntheory, methods, and tools for analyzing source code for <br>\napplication-specific security properties such as data separation, <br>\nabsence of undesirable information flows, nonbypassability of critical <br>\ncode, and proper memory sanitization. The research combines <br>\ntemplate-based specification of security properties with automatic <br>\ngeneration and checking of assertions to verify that code satisfies the <br>\nspecified properties and to detect violations of those properties.</p>\n<p>High Assurance Cyber-Physical Systems:This project is developing new <br>\ntheory, methods, and tools for model-based development of cyber-physical <br>\nsystems.All methods and tools developed in the project will be <br>\ndemonstrated on real systems, which may include unmanned vehicles and <br>\nrobots.</p>\n<p>Applications of Formal Methods in Developing Real Critical Systems:</p>\n<p>(1) Robotics: Formal-methods-based modeling and analysis techniques and <br>\ntools are being applied to critical software components of a robot <br>\ndesigned to service satellites in space. In addition to applying <br>\nwell-established formal analysis methods and tools, new analysis <br>\ntechniques and tools are being developed to provide assurance that the <br>\nrobot behaves safely and functions correctly.</p>\n<p>(2) Secure Systems: Formal analysis methods and tools are being <br>\ndeveloped and applied to critical aspects of a framework for <br>\nself-securing systems.</p>\n<hr>\n<p>Application Process</p>\n<hr>\n<p>U.S. citizenship is required.</p>\n<p>Interested candidates should send a CV and cover letter to Dr. Elizabeth <br>\nLeonard (<a href=\"mailto:elizabeth.leonard@nrl.navy.mil\">elizabeth.leonard@nrl.navy.mil</a>). Please indicate in your email <br>\nthat you are applying for a fulltime, permanent position.</p>",
        "id": 294726231,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661186501
    },
    {
        "content": "<p>From: Elizabeth Leonard via Cl-isabelle-users &lt;<a href=\"mailto:cl-isabelle-users@lists.cam.ac.uk\">cl-isabelle-users@lists.cam.ac.uk</a>&gt;<br>\nFull-Time Computer Scientist Positions </p>\n<p>(US Citizens only. Masters, Ph.D, or equivalent required.)</p>\n<p>Naval Research Laboratory</p>\n<p>Center for High Assurance Computer Systems</p>\n<p>Washington, DC 20375</p>\n<p>The Software Engineering Section of NRL's Center for High Assurance Computer<br>\nSystems has openings for two full-time, permanent research positions.  New<br>\nhires will initially support the section's currently funded efforts but will<br>\nbe expected eventually to develop and obtain funding for their own research.</p>\n<p>The objective of the section's research program is to develop formal,<br>\nmathematically-based methods, models, algorithms, theories and tools<br>\nsupporting the construction and analysis of software and software systems.<br>\nThe methods and tools provide critical support for the development of high<br>\nassurance software for systems, such as autonomous systems, secure systems,<br>\nand control software that must satisfy properties such as safety, fault<br>\ntolerance, timing, and security.  Many formal methods and tools produced by<br>\nthe section's research have been applied to practical Navy and other<br>\nindustrial-strength systems.  Current research projects in the section<br>\ninclude Application-Specific Security of Source Code, High Assurance<br>\nCyber-Physical Systems, Using Formal Methods in Building a Space Robot, and<br>\nFormal Methods for Self-Securing Systems.</p>\n<p>We are interested in candidates with expertise in one or more of the<br>\nfollowing: </p>\n<p>.       formal modeling, analysis, verification, and validation of<br>\nautonomous systems, including those that include machine learning</p>\n<p>.       formal modeling, analysis, verification, and validation of<br>\ncyber-physical systems </p>\n<p>.       compositional techniques for model-based software specification and<br>\nanalysis</p>\n<p>.       scenario-based synthesis of software models</p>\n<p>.       requirements elicitation methods and tools</p>\n<p>.       automatic test-case generation</p>\n<p>.       automatic code generation</p>\n<p>.       assurance cases for system safety and security</p>\n<p>.       verification techniques and tools: decision procedures, SMT solvers,<br>\nmodel checking, theorem proving</p>\n<p>.       design and use of automatable techniques for verification of system<br>\nproperties of source code based on code assertions and procedure contracts</p>\n<p>.       combining methods from AI (e.g., machine learning) with formal<br>\nmethods </p>\n<p>.       incremental/regression verification</p>\n<hr>\n<p>Application Process</p>\n<hr>\n<p>A Masters, Ph.D., or the equivalent is required. U.S. citizenship is<br>\nrequired.</p>\n<p>Interested candidates should send a CV to Dr. Elizabeth Leonard<br>\n(<a href=\"mailto:elizabeth.leonard@nrl.navy.mil\">elizabeth.leonard@nrl.navy.mil</a>). Please indicate in your email that you are<br>\napplying for a full-time, permanent position.</p>",
        "id": 294749147,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661194732
    },
    {
        "content": "<p>From: Elizabeth Leonard via Cl-isabelle-users &lt;<a href=\"mailto:cl-isabelle-users@lists.cam.ac.uk\">cl-isabelle-users@lists.cam.ac.uk</a>&gt;<br>\nFull-Time Computer Scientist Positions<br>\nNaval Research Laboratory<br>\nCenter for High Assurance Computer Systems<br>\nWashington, DC 20375</p>\n<p>The Software Engineering Section of NRL’s Center for High Assurance <br>\nComputer Systems has multiple openings for full-time, permanent research <br>\npositions.  New hires will initially support the section’s currently <br>\nfunded efforts but will be expected eventually to develop and obtain <br>\nfunding for their own research.</p>\n<p>The objective of the section’s research program is to develop formal, <br>\nmathematically-based methods, models, algorithms, theories and tools <br>\nsupporting the construction and analysis of software and software <br>\nsystems.  The methods and tools provide critical support for the <br>\ndevelopment of high assurance software for systems, such as autonomous <br>\nsystems, secure systems, and control software that must satisfy <br>\nproperties such as safety, fault tolerance, timing, and security.  Many <br>\nformal methods and tools produced by the section’s research have been <br>\napplied to practical Navy and other industrial-strength systems.  <br>\nCurrent research projects in the section include High Assurance <br>\nCyber-Physical Systems, Using Formal Methods to Assure the Safety and <br>\nCorrectness of AI Agents That Learn, Assured Development and Operation <br>\nof Autonomous Systems, Runtime Verification for Autonomous Systems that <br>\nUse AI, and Using Formal Methods in Building a Space Robot.</p>\n<p>We are interested in candidates with expertise in one or more of the <br>\nfollowing:<br>\n•    formal modeling, analysis, verification, and validation of <br>\nautonomous systems, including those that include machine learning<br>\n•    formal modeling, analysis, verification, and validation of <br>\ncyber-physical systems<br>\n•    combining methods from AI (e.g., machine learning) with formal methods<br>\n•    synthesis of runtime monitors from formal specifications<br>\n•    compositional techniques for model-based software specification and <br>\nanalysis<br>\n•    scenario-based synthesis of software models<br>\n•    requirements elicitation methods and tools<br>\n•    automatic test-case generation<br>\n•    automatic code generation<br>\n•    assurance cases for system safety and security<br>\n•    verification techniques and tools: decision procedures, SMT <br>\nsolvers, model checkers, theorem provers</p>\n<hr>\n<p>Application Process</p>\n<hr>\n<p>A Masters, Ph.D., or the equivalent is required. U.S. citizenship is <br>\nrequired.</p>\n<p>Interested candidates should send a CV to Dr. Elizabeth Leonard <br>\n(<a href=\"mailto:elizabeth.leonard@nrl.navy.mil\">elizabeth.leonard@nrl.navy.mil</a>). Please indicate in your email that you <br>\nare applying for a full-time, permanent position.</p>",
        "id": 294767261,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661202527
    }
]