[
    {
        "content": "<p>From: Dale Miller &lt;<a href=\"mailto:dale@lix.polytechnique.fr\">dale@lix.polytechnique.fr</a>&gt;<br>\nThe following postdoc position is available at the LIX labs on the campus<br>\nof Ecole Polytechnique, France.</p>\n<p><em>PostDoc: Designing and implementing proof certificates</em></p>\n<p><em>Context</em></p>\n<p>ProofCert is a recently awarded ERC Advanced Grant that will be funded for<br>\nthe five years 2012-2016. The goal of ProofCert is to design a format for<br>\nproof certificates that can capture the proof evidence within all major<br>\ntheorem provers while also being checkable by a simple, declarative proof<br>\nchecker. This format must allow treating some inference steps as<br>\n(non-deterministic) computation and as well as supporting (bounded) proof<br>\nreconstruction.</p>\n<p>A postdoctoral position is available within the ProofCert project. This<br>\nposition is concerned with helping to design, implement, and experimentally<br>\nvalidate the design of proof certificates for a range of theorem provers in<br>\nclassical first-order logic. The position is for one year, with a second<br>\nyear extension possible.  It should start in Fall 2012.</p>\n<p>The ideal candidate should have strong backgrounds in</p>\n<p>- basic proof theory (in particular, the sequent calculus);<br>\n   - various automated and interactive theorem proving systems; and<br>\n   - programming in logic programming (Prolog or lambda Prolog) as well as<br>\n   other high-level programming languages (such as ML or Haskell).</p>\n<p><em>Venue</em></p>\n<p>The postdoc will be a member of the INRIA Parsifal team and will work in a<br>\nnew building on the campus of the Ecole Polytechnique that houses the<br>\nLaboratoire d’Informatique (LIX). This campus is situated to the south of<br>\nParis, an easy commute from Paris on the RER B regional train line. French<br>\nproficiency is not necessary.</p>\n<p><em>Application</em></p>\n<p>Candidates must have a Ph.D.; if the Ph.D. thesis is not yet defended when<br>\nthe application is made, the candidate should provide the planned defense<br>\ndate and the composition of the thesis committee.</p>\n<p>To apply, contact Dale Miller (dale.miller at <a href=\"http://inria.fr\">inria.fr</a>) and include a cover<br>\nletter and (links to) your CV and publication list. Additional material,<br>\nsuch as letters of recommendation, will be requested if necessary. Early<br>\nexpression of interest is encouraged.  We plan to make a decision on this<br>\nposition around the beginning of April 2012.</p>\n<p><em>More Information</em></p>\n<p>Further information regarding ProofCert and the Parsifal team can be found<br>\nat the following links.</p>\n<ul>\n<li>The ERC Advanced Grant ProofCert: <a href=\"http://team.inria.fr/parsifal/proofcert/\">http://team.inria.fr/parsifal/proofcert/</a></li>\n<li>The INRIA Parsifal team: <a href=\"http://team.inria.fr/parsifal/\">http://team.inria.fr/parsifal/</a></li>\n<li>\n<p>Positions offered by Parsifal in 2012:<br>\n<a href=\"http://team.inria.fr/parsifal/positions/\">http://team.inria.fr/parsifal/positions/</a></p>\n</li>\n<li>\n<p>Miller's web page: <a href=\"http://www.lix.polytechnique.fr/Labo/Dale.Miller/\">http://www.lix.polytechnique.fr/Labo/Dale.Miller/</a></p>\n</li>\n</ul>",
        "id": 294152402,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660849796
    }
]