[
    {
        "content": "<p>From: <a href=\"mailto:Gerwin.Klein@data61.csiro.au\">Gerwin.Klein@data61.csiro.au</a><br>\nWe are hiring again, and have two open positions for proof engineers. Isabelle/HOL experience a strong plus!</p>\n<p>Cheers,<br>\nGerwin</p>\n<p>Data61 Seeking Proof Engineers<br>\n==============================</p>\n<p>If only there were a place where I could prove theorems for money, change the<br>\nworld, and have fun while doing it...</p>\n<p>Sounds too good to exist?</p>\n<p>In the Trustworthy Systems team at Data61 that's what we do for a living. We<br>\nare the creators of seL4, the world's first fully formally verified operating<br>\nsystem kernel with extreme performance and strong security &amp; correctness<br>\nproofs. Our highly international team is located on the UNSW campus, close to<br>\nthe beautiful beaches of sunny Sydney, Australia, one of the world's most<br>\nliveable cities.</p>\n<p>We are looking for two motivated proof engineers who want to join our team,<br>\nmove things forward, and have global impact. We are expanding our team,<br>\nbecause seL4 is going places. There are active projects around the world in</p>\n<p>- Automotive - because cars have been hacked enough<br>\n  - Aviation - for more security and safety for autonomous vehicles<br>\n  - Defence - protecting confidential information<br>\n  - Connected consumer devices - with security built in from the start<br>\n  - Spaceflight, autonomous and crewed - because awesome</p>\n<p>To make these projects successful, we need to scale formal verification.<br>\nYou would</p>\n<p>- work on industrial-scale formal proofs in Isabelle/HOL and HOL4<br>\n  - develop formally verified infrastructure for building secure systems<br>\n    on top of seL4</p>\n<p>- contribute to improved proof automation and better reasoning techniques<br>\n  - apply formal proof to real-world systems and tools</p>\n<p>To apply for this position, you should possess a significant subset of the<br>\nfollowing skills.</p>\n<p>- functional programming in a language like Haskell, ML, or OCaml<br>\n  - first-order or higher-order formal logic<br>\n  - basic experience in C<br>\n  - ability and desire to quickly learn new techniques<br>\n  - undergraduate degree in Computer Science, Mathematics, or similar<br>\n  - ability and desire to work in a larger team</p>\n<p>We are hiring at two levels, so if you are more qualified or experienced than<br>\nthe above would suggest, you can come in as a senior proof engineer.</p>\n<p>If you additionally have experience</p>\n<p>- in software verification with an interactive theorem prover such as<br>\n    Isabelle/HOL, HOL4, or Coq, and/or</p>\n<p>- with operating systems and microkernels, and/or<br>\n  - in verified applications technology such as CakeML</p>\n<p>you should definitely apply!</p>\n<p>If you have the right skills and background, we can provide training on the<br>\njob. Continual learning is a central component of everything we do. You will<br>\nwork with a unique world-leading combination of OS and formal methods<br>\nexperts, students at undergraduate and PhD level, engineers, and researchers<br>\nfrom 5 continents, speaking over 15 languages. Trustworthy Systems is a fun,<br>\ncreative, and welcoming workplace with flexible hours &amp; work arrangements.</p>\n<p>We value diversity in all forms and welcome applications from people of all<br>\nages, including people with disabilities, and those who identify as LGBTIQ.<br>\nSee <a href=\"https://ts.data61.csiro.au/diversity/\">https://ts.data61.csiro.au/diversity/</a> for more information.</p>\n<p>Salary ranges for this position (in AUD) (plus superannuation):</p>\n<ul>\n<li>Junior: 61-78K, 80-91K</li>\n<li>Senior: 95-103K, 109-128K<br>\ndepending on experience and qualifications.</li>\n</ul>\n<p>Apply online at the following links:</p>\n<ul>\n<li><a href=\"https://jobs.csiro.au/job/Sydney,-NSW-Proof-Engineer/438797400/\">https://jobs.csiro.au/job/Sydney,-NSW-Proof-Engineer/438797400/</a></li>\n<li><a href=\"https://jobs.csiro.au/job/Sydney,-NSW-Senior-Proof-Engineer/438798100/\">https://jobs.csiro.au/job/Sydney,-NSW-Senior-Proof-Engineer/438798100/</a></li>\n</ul>\n<p>Your application should include a cover letter, CV, undergraduate transcript<br>\n(if applicable), and contact information for two references.</p>\n<p>This round of applications closes 21 November 2017.</p>\n<p>The seL4 code and proof, and the CakeML project, are open source.<br>\nCheck them out at <a href=\"https://seL4.systems\">https://seL4.systems</a> and <a href=\"https://cakeml.org\">https://cakeml.org</a></p>\n<p>More information about Data61's Trustworthy Systems team at<br>\n<a href=\"https://ts.data61.csiro.au\">https://ts.data61.csiro.au</a></p>\n<p>Still studying? We also have internship opportunities!<br>\n<a href=\"https://ts.data61.csiro.au/students/\">https://ts.data61.csiro.au/students/</a></p>",
        "id": 294720612,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661184664
    }
]