[
    {
        "content": "<p>From: Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt;<br>\nDear Isabelle users,</p>\n<p>I am not sure if the subsequent CFP made it on the list as intended. The <br>\nabstract deadline has passed already yesterday, but there is about one <br>\nmore week left for the main submission deadline.  Moreover, the PC chairs <br>\nhave agreed to be flexible to accomodate late submissions.</p>\n<p>Makarius</p>\n<p>---------- Forwarded message ----------<br>\nDate: Fri, 17 Feb 2012 11:15:14 +0100<br>\nFrom: Johan Jeuring &lt;<a href=\"mailto:J.T.Jeuring@uu.nl\">J.T.Jeuring@uu.nl</a>&gt;<br>\nTo: <a href=\"mailto:om@openmath.org\">om@openmath.org</a>, <a href=\"mailto:om-announce@openmath.org\">om-announce@openmath.org</a>, <a href=\"mailto:poplmark@lists.seas.upenn.edu\">poplmark@lists.seas.upenn.edu</a>,<br>\n<a href=\"mailto:project-calculemus@lists.jacobs-university.de\">project-calculemus@lists.jacobs-university.de</a>,<br>\n<a href=\"mailto:project-latexml@lists.jacobs-university.de\">project-latexml@lists.jacobs-university.de</a>,<br>\n<a href=\"mailto:projects-mkm-ig@jacobs-university.de\">projects-mkm-ig@jacobs-university.de</a>,<br>\n<a href=\"mailto:project-omdoc@lists.jacobs-university.de\">project-omdoc@lists.jacobs-university.de</a>, <a href=\"mailto:proofpower@lemma-one.com\">proofpower@lemma-one.com</a>,<br>\n<a href=\"mailto:pvs@csl.sri.com\">pvs@csl.sri.com</a><br>\nSubject: [MKM-IG] Conference on Intelligent Computer Mathematics,<br>\n     last call for papers</p>\n<p>CICM 2012 - Conference on Intelligent Computer Mathematics<br>\n            July 9-13, 2012 at Jacobs University, Bremen, Germany</p>\n<p><a href=\"http://www.informatik.uni-bremen.de/cicm2012/\">http://www.informatik.uni-bremen.de/cicm2012/</a></p>\n<p>Call for Papers</p>\n<hr>\n<p>As computers and communications technology advance, greater<br>\nopportunities arise for intelligent mathematical computation. While<br>\ncomputer algebra, automated deduction, mathematical publishing and<br>\nnovel user interfaces individually have long and successful histories,<br>\nwe are now seeing increasing opportunities for synergy among these<br>\nareas. The Conference on Intelligent Computer Mathematics offers a<br>\nvenue for discussing these areas and their synergy.</p>\n<p>The conference will be organized by Serge Autexier and Michael<br>\nKohlhase at Jacobs University in Bremen and consist of five tracks:</p>\n<p>Artificial Intelligence and Symbolic Computation (AISC)<br>\n   Co-Chairs: John A. Campbell, Jacques Carette<br>\nCalculemus<br>\n   Chair: Gabriel Dos Reis<br>\nDigital Mathematical Libraries (DML)<br>\n   Chair: Petr Sojka<br>\nMathematical Knowledge Management (MKM)<br>\n   Chair: Makarius Wenzel<br>\nSystems and Projects<br>\n   Chair: Volker Sorge</p>\n<p>The overall programme will be organized by the General Program Chair<br>\nJohan Jeuring.</p>\n<p>Invited talks will be given by:</p>\n<p>Yannis Haralambous, Département Informatique, Télécom Bretagne<br>\nConor McBride, Department of Computer and Information Sciences,<br>\n   University of Strathclyde<br>\nCezar Ionescu, Potsdam Institute for Climate Impact Research</p>\n<hr>\n<p>Important dates</p>\n<hr>\n<p>Abstract submission:          20 February 2012<br>\nSubmission deadline:          26 February 2012<br>\nReviews sent to authors:     23 March 2012<br>\nRebuttals due:                     30 March 2012<br>\nNotification of acceptance: 6  April 2012<br>\nCamera ready copies due:   20 April 2012<br>\nConference:                         9-13 July 2012</p>\n<hr>\n<p>Tracks</p>\n<hr>\n<p><strong>* AISC </strong>*</p>\n<p>Symbolic computation can be roughly described as the study of<br>\nalgorithms which operate on expression trees. Another way to phrase<br>\nthis is to say that the denotational semantics of expressions trees is<br>\nnot fixed, but is rather context dependent. Expression simplification<br>\nis probably the archetypal symbolic computation. Mathematically<br>\noriented software (such as the so-called computer algebra systems)<br>\nhave been doing this for decades, but not long thereafter, systems<br>\ndoing proof planning and theorem discovery also started doing the<br>\nsame; some attempts at knowledge management and 'expert systems' were<br>\nalso symbolic, but less successfully so. More recently, many different<br>\nkinds of program analyses have gotten `symbolic', as well as some of<br>\nthe automated theorem proving (SMT, CAV, etc).</p>\n<p>But a large number of the underlying problems solved by symbolic<br>\ntechniques are well known to be undecidable (never mind the many that<br>\nare EXP-time complete, etc). Artificial Intelligence has been<br>\nattacking many of these different sub-problems for quite some time,<br>\nand has also built up a solid body of knowledge. In fact, most<br>\nsymbolic computation systems grew out of AI projects.</p>\n<p>These two fields definitely intersect. One could say that in the<br>\nintersection lies all those problems for which we have no decision<br>\nprocedures. In other words, decision procedures mark a definite phase<br>\nshift in our understanding, but are not always possible. Yet we still<br>\nwant to solve certain problems, and must find 'other' means of<br>\n(partial) solution. This is the fertile land which comprises the core<br>\nof AISC.</p>\n<p>Rather than try to exhaustively list topics of interest, it is<br>\nsimplest to say that AISC seeks work which advances the understanding<br>\nof</p>\n<p>Solving problems which fundamentally involve the manipulation of<br>\nexpressions, but for which decision procedures are unlikely to ever<br>\nexist.</p>\n<p><strong>* Calculemus </strong>*</p>\n<p>Calculemus is a series of conferences dedicated to the integration of<br>\ncomputer algebra systems (CAS) and systems for mechanised reasoning,<br>\nthe interactive theorem provers or proof assistants (PA) and the<br>\nautomated theorem provers (ATP). Currently, symbolic computation is<br>\ndivided into several (more or less) independent branches: traditional<br>\nones (e.g., computer algebra and mechanised reasoning) as well as<br>\nnewly emerging ones (on user interfaces, knowledge management, theory<br>\nexploration, etc.) The main concern of the Calculemus community is to<br>\nbring these developments together in order to facilitate the theory,<br>\ndesign, and implementation of integrated systems for computer<br>\nmathematics that will routinely be used by mathematicians, computer<br>\nscientists and engineers in their every day business.</p>\n<p>The topics of interest of Calculemus include but are not limited to:</p>\n<p>* Theorem proving in computer algebra (CAS)<br>\n    * Computer algebra in theorem proving (PA and ATP)<br>\n    * Case studies and applications that both involve computer<br>\n            algebra and mechanised reasoning<br>\n    * Representation of mathematics in computer algebra<br>\n    * Adding computational capabilities to PA and ATP<br>\n    * Formal methods requiring mixed computing and proving<br>\n    * Combining methods of symbolic computation and formal<br>\n                  deduction<br>\n    * Mathematical computation in PA and ATP<br>\n    * Theory, design and implementation of interdisciplinary<br>\n            systems for computer mathematics<br>\n    * Theory exploration techniques<br>\n    * Input languages, programming languages, types and constraint<br>\n                languages, and modeling languages for mechanised<br>\n                mathematics systems (PA, CAS, and ATP).<br>\n    * Infrastructure for mathematical services</p>\n<p><strong>* DML </strong>*</p>\n<p>Mathematicians dream of a digital archive containing all peer-reviewed<br>\nmathematical literature ever published, properly linked, validated and<br>\nverified.  It is estimated that the entire corpus of mathematical<br>\nknowledge published over the centuries does not exceed 100,000,000<br>\npages, an amount easily manageable by current information<br>\ntechnologies. Following success of DML 2008, DML 2009 DML 2010, and<br>\nDML 2011 track objectives are to formulate the strategy and goals of a<br>\nglobal mathematical digital library and to summarize the current<br>\nsuccesses and failures of ongoing technologies and related projects as<br>\nEuDML, asking such questions as:</p>\n<p>* What technologies, standards, algorithms and formats should<br>\n        be used and what metadata should be shared?<br>\n    * What business models are suitable for publishers of<br>\n        mathematical literature, authors and funders of their<br>\n        projects and institutions?<br>\n    * Is there a model of sustainable, interoperable, and<br>\n        extensible mathematical library that mathematicians<br>\n        can use in their everyday work?<br>\n    * What is the best practice for<br>\n        * retrodigitized mathematics (from images via OCR to<br>\n                          MathML or TeX);<br>\n        * retro-born-digital mathematics (from existing<br>\n            electronic copy in DVI, PS or PDF to MathML or<br>\n            TeX);<br>\n        * born-digital mathematics (how to make needed<br>\n            metadata and file formats available as a side<br>\n            effect of publishing workflow [CEDRAM/Euclid<br>\n            model])?</p>\n<p>DML is an opportunity to share experience and best practices between<br>\nprojects in any area (MKM, NLP, OCR, pattern recognition, whatever)<br>\nthat could change the paradigm for searching, accessing, and<br>\ninteracting with the mathematical corpus. The track is<br>\ntrans/interdisciplinary and contributions from any kind of people on<br>\nany aspect of the DML building are welcome.</p>\n<p><strong>* MKM </strong>*</p>\n<p>Mathematical Knowledge Management is an interdisciplinary field of<br>\nresearch in the intersection of mathematics, computer science, library<br>\nscience, and scientific publishing. The objective of MKM is to develop<br>\nnew and better ways of managing sophisticated mathematical knowledge,<br>\nbased on innovative technology of computer science, the Internet, and<br>\nintelligent knowledge processing. MKM is expected to serve<br>\nmathematicians, scientists, and engineers who produce and use<br>\nmathematical knowledge; educators and students who teach and learn<br>\nmathematics; publishers who offer mathematical textbooks and<br>\ndisseminate new mathematical results; and librarians and<br>\nmathematicians who catalog and organize mathematical knowledge.</p>\n<p>The conference is concerned with all aspects of mathematical knowledge<br>\nmanagement. A non-exclusive list of important topics includes:</p>\n<p>* Representations of mathematical knowledge<br>\n    * Authoring languages and tools<br>\n    * Repositories of formalized mathematics<br>\n    * Deduction systems<br>\n    * Mathematical digital libraries<br>\n    * Diagrammatic representations<br>\n    * Mathematical OCR<br>\n    * Mathematical search and retrieval<br>\n    * Math assistants, tutoring and assessment systems<br>\n    * MathML, OpenMath, and other mathematical content standards<br>\n    * Web presentation of mathematics<br>\n    * Data mining, discovery, theory exploration<br>\n    * Computer algebra systems<br>\n    * Collaboration tools for mathematics<br>\n    * Challenges and<br>\n[message truncated]</p>",
        "id": 294152942,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660849997
    }
]