[
    {
        "content": "<p>From: Kreutzer + Schweikardt &lt;<a href=\"mailto:floc@informatik.hu-berlin.de\">floc@informatik.hu-berlin.de</a>&gt;<br>\nCall for Participation --- FLoC'06</p>\n<p>The 2006 Federated Logic Conference<br>\n                      Seattle, Washington, USA<br>\n                       August 10 -- August 22, 2006</p>\n<p><a href=\"http://www.easychair.org/FLoC-06/\">http://www.easychair.org/FLoC-06/</a></p>\n<p>We are pleased to announce the fourth Federated Logic Conference<br>\n(FLoC'06) to be held in Seattle, Washington, in August 2006, at the<br>\nSeattle Sheraton (<a href=\"http://www.easychair.org/FLoC-06/floc-hotel.html\">http://www.easychair.org/FLoC-06/floc-hotel.html</a>).</p>\n<p>FLoC'06 promises to be the premier scientific meeting in computational<br>\nlogic in 2006.  The following conferences will participate in FLoC'06:</p>\n<p>CAV     Conference on Computer Aided Verification (Aug 17-20)<br>\nICLP    Int'l Conference on Logic Programming (Aug 17-20)<br>\nIJCAR   Int'l Joint Conference on Automated Reasoning (Aug 17-20)<br>\nLICS    IEEE Symposium on Logic in Computer Science (Aug 12-15)<br>\nRTA     Conference on Rewriting Techniques and Applications (Aug 12-14)<br>\nSAT     Int'l Conference on Theory and Applications of<br>\n         Satisfiability Testing (Aug 12-15)</p>\n<p>The six major conferences will be accompanied by 41 workshops, held on<br>\nAug. 10-11, 15-16, and 21-22.</p>\n<p>The FLoC'06 program includes a keynote session to commemorate the Goedel<br>\nCentenary, with John Dawson and Dana Scott as speakers, a keynote talk<br>\nby David Harel, plenary talks by Randy Bryant and David Dill, and<br>\ninvited talks by F. Bacchus, A. Blass, B. Buchberger, A. Darwiche, M.<br>\nDas, J. Esparza, J. Giesl, A. Gordon, T. Hoare, O. Kupferman, M. Lam, D.<br>\nMiller, K. Sakallah, J. Stoy, and C. Welty.</p>\n<p>FLoC has received an NSF grant to provide funds for travel grants of up<br>\nto $750 for student attendees of FLoC'06. We expect to award about 50<br>\ngrants. See application information on the website.</p>\n<p>Seattle, the Emerald city, sits on the shores of Puget Sound surrounded<br>\nby mountains to the east and west.  Lovely views of blue waters and snow<br>\ncapped peaks seem to appear everywhere - around the next bend in the<br>\nroad or between the buildings downtown. Seattle is the gateway to the<br>\nPacific Northwest, a premier tourist attraction. <br>\nIn Seattle, Mt. Rainier enchants visitors; in Vancouver, British<br>\nColumbia, the Coast Range juts out over downtown; and in Portland, 5,000<br>\nacres of forestland north of the city center harbor deer, elk, and the<br>\nodd bear and cougar.</p>\n<p>Online registration for FLoC is now open at:</p>\n<p><a href=\"http://www.easychair.org/FLoC-06/\">http://www.easychair.org/FLoC-06/</a></p>\n<p>Deadline for preferred hotel rate is June 21, 2006.<br>\nDeadline for early registration is July 10, 2006.</p>\n<p>FLoC'06 Steering Committee</p>\n<p>Moshe Y. Vardi      (General Chair)<br>\nThomas Ball         (Conference Co-Chair)<br>\nJakob Rehof         (Conference Co-Chair)<br>\nEdmund Clarke       (CAV)<br>\nReiner Hahnle       (IJCAR)<br>\nManuel Hermenegildo (ICLP)<br>\nPhokion Kolaitis    (LICS)<br>\nHenry Kautz         (SAT)<br>\nAart Middeldorp     (RTA)<br>\nAndrei Voronkov     (IJCAR)</p>",
        "id": 293911179,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660747452
    }
]