[
    {
        "content": "<p>From: Claude Marché &lt;<a href=\"mailto:Claude.Marche@inria.fr\">Claude.Marche@inria.fr</a>&gt;<br>\n[Feel free to redistribute this announcement/Apologizes for multiple <br>\ncopies]</p>\n<p>The Joint Laboratory ProofInUse (<a href=\"https://www.adacore.com/proofinuse\">https://www.adacore.com/proofinuse</a>) <br>\nhires an experienced R&amp;D engineer (M/F) in the domain of Formal Methods <br>\nfor Software Engineering:</p>\n<p><a href=\"https://jobs.inria.fr/public/classic/en/offres/2018-01034\">https://jobs.inria.fr/public/classic/en/offres/2018-01034</a></p>\n<p>ProofInUse originates from the sharing of resources and knowledge <br>\nbetween the Toccata research team (<a href=\"http://toccata.lri.fr/\">http://toccata.lri.fr/</a>), specializing <br>\nin techniques for deductive program verification and the SME AdaCore, a <br>\nsoftware publisher, specializing in providing software development tools <br>\nfor critical systems. The SME TrustInSoft (<a href=\"https://trust-in-soft.com/\">https://trust-in-soft.com/</a>), <br>\nspecialized in advanced static analysis techniques for safety and <br>\nsecurity of C/C++ source code, recently joined the ProofInUse Laboratory.</p>\n<p>The purpose of ProofInUse is to increase significantly the number of <br>\ncustomers of the SPARK 2014 and the TrustInSoft Analyzer technologies, <br>\nby popularizing the use of formal proof techniques. This popularization <br>\nrequires the resolution of several scientific and technological <br>\nchallenges. A first axis of work is to design and implement a new <br>\nplug-in for deductive verification in the TrustInSoft Analyzer, making <br>\nuse of the Why3 intermediate (<a href=\"https://why3.lri.fr/\">https://why3.lri.fr/</a>) tool for <br>\nverification condition generation, along the guidelines and design <br>\nchoices previously adopted for SPARK, that include strong restrictions <br>\non the analyzed code regarding the possibility of aliasing in data <br>\nstructures. This new plug-in must support new techniques for analyzing <br>\nbit-level and floating-point codes, as well as new facilities for <br>\nproviding counterexamples when proofs fail. A second axis of work is to <br>\nleverage the former non-aliasing restrictions, via an alias analysis <br>\nbased on a Rust-style sharing control and borrowing. A third axis is to <br>\nactively participate to the development of a formally proved C/C++ <br>\nsoftware library.</p>\n<p>The recruited engineer will work in close collaboration with the <br>\nProofInUse Research and Development team, to address both the scientific <br>\nand the technological challenges presented above. It is expected that <br>\nthe engineer contributes both to advancing the academic knowledge in <br>\nProofInUse context and to the transfer of this knowledge into the <br>\nsoftware products distributed by AdaCore and TrustInSoft. The engineer <br>\nwill participate actively to the production of scientific publications, <br>\nand to the software development of the Why3 tool and the TrustInSoft <br>\nAnalyzer.</p>\n<p>We expect from the candidate some experience with Formal Methods for <br>\nSoftware Engineering in a broad sense, typically the candidate should <br>\nhave defended a PhD in the domain of Formal Methods. More specifically, <br>\na plus would be some experience in formal logic and proof techniques, in <br>\nautomated deduction, in Satisfiability Modulo Theory solvers, in Model <br>\nChecking or in Abstract Interpretation techniques.</p>\n<p>The candidate should have a fair experience in software development, a <br>\nplus would be the knowledge of functional programming, and the knowledge <br>\nof the programming languages OCaml, C/C++ and/or Rust.</p>\n<p>The candidate should be able to write and speak in English fluently.</p>\n<p>The job will take place both on Toccata's lab site in building 650 of <br>\nUniversity Paris-Sud in Orsay, and at TrustInSoft's site in Paris, France.</p>\n<p>The position is to be filled as soon as possible starting from Nov 1st <br>\n2018, for a duration of 36 months.</p>\n<p>Apply by sending a CV and a motivation letter to the e-mail contact <br>\naddresses below, and/or via the URL given at the top of this message.</p>\n<p>Contact/Information: <a href=\"mailto:Claude.Marche@inria.fr\">Claude.Marche@inria.fr</a>, <br>\n<a href=\"mailto:Benjamin.Monate@trustinsoft.com\">Benjamin.Monate@trustinsoft.com</a>, <a href=\"mailto:Yannick.Moy@adacore.com\">Yannick.Moy@adacore.com</a></p>",
        "id": 294744956,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661193055
    }
]