[
    {
        "content": "<p>From: Alex Meyer &lt;<a href=\"mailto:alex153@outlook.lv\">alex153@outlook.lv</a>&gt;<br>\nAre there some thoughts, efforts and ideas about implementing Isabelle/HOL (or part of it) on quantum computer? I am novice in quantum computing, but I can not find any guidance about quantum algorithms that are designed especially for the type theory of any kind or first-order/higher-order logic. Does quantum community call those algorithms somehow differently or have different perspective? Or maybe quantum speedup is not available for the type of reasoning that is done by Isabelle/HOL?</p>\n<p>Alex</p>",
        "id": 294767288,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661202539
    },
    {
        "content": "<p>From: Thomas Sewell &lt;<a href=\"mailto:sewell@chalmers.se\">sewell@chalmers.se</a>&gt;<br>\nA friend of mine was interested in using FPGAs to accelerate various computational tasks, and asked about Isabelle.</p>\n<p>I think that, for these purposes, Isabelle is a functional program that does a lot of pointer chasing (searching through pointer-linked data structures). It has a lot of binary search trees and similar in its memory. There's not a lot of interesting numerical calculations. This is challenging to optimise. Existing CPUs and cache architectures are fairly well tuned for pointer chasing. I don't think that quantum or FPGAs or GPUs would be good for this workload as is: too much state and not enough computation. I'm no expert, perhaps I'll turn out to be dead wrong.</p>\n<p>It might be possible to do surgery on Isabelle to speed up some of its common calculations, but be warned about correctness. A change which sped up the Isabelle kernel but made it less obviously correct would probably be rejected.</p>\n<p>Cheers,</p>\n<p>Thomas.</p>",
        "id": 294767299,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661202542
    },
    {
        "content": "<p>From: Dominique Unruh &lt;<a href=\"mailto:unruh@ut.ee\">unruh@ut.ee</a>&gt;<br>\nI think implementing Isabelle/HOL (as a whole) on a quantum computer is <br>\nnot a very meaningful task. (Quantum computers shine at very specific <br>\ncomputational tasks but one would not write a whole application on it.) <br>\nHowever, I think it would be conceivable to use a quantum computer in <br>\nthe implementation of certain tactics. For example, a tactic for solving <br>\nSAT (not SMT) problems could be implemented by outsourcing to a quantum <br>\nSAT solver to get a polynomial speedup. (See <br>\n<a href=\"https://quantumalgorithmzoo.org/\">https://quantumalgorithmzoo.org/</a>, section on \"Algorithm: Constraint <br>\nSatisfaction\".) There exist also quantum algorithms for speeding up <br>\nbacktracking (see same section), this could, hypothetically, be used to <br>\nreimplement some tactics that backtrack a lot (I think auto, simp, <br>\nblast, force, ... all do). I say hypothetically because a naïve approach <br>\nof implementing them on a quantum computer would work only in the QRAM <br>\nmodel (which assumes a random access in superposition of many different <br>\nmemory locations) which I think is not a realistic cost model even for <br>\nlong-term quantum computers. (This is because of the \"pointer chasing\" <br>\nthat Thomas mentioned.) But maybe there are some cases where even a more <br>\nrealistic memory model can be used. But this is far from obvious (at <br>\nleast to me).</p>\n<p>One note: Quantum computers tend to be noisy (i.e., make errors). But at <br>\nleast for the ideas I'm mentioning above, this would not be a problem <br>\nfor the soundness of Isabelle because the tactics would produce <br>\nclassically checkable certificates.</p>\n<p>Other note: I was here taking a long-term view on quantum computation. <br>\nIf we are talking about NISQ (near-term), then I don't think there are <br>\nany speedups useful for Isabelle (but I would be curious to be proven <br>\nwrong on this point).</p>\n<p>Best wishes,<br>\nDominique.</p>",
        "id": 294767340,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661202560
    }
]