[
    {
        "content": "<p>From: Gudmund Grov &lt;<a href=\"mailto:ggrov@staffmail.ed.ac.uk\">ggrov@staffmail.ed.ac.uk</a>&gt;<br>\nVSTTE 2012 Verification Competition starts Tuesday 8 November 2011!</p>\n<p>Follow the announcements at the competition Web page:</p>\n<p><a href=\"https://sites.google.com/site/vstte2012/compet\">https://sites.google.com/site/vstte2012/compet</a></p>\n<p>Join the discussion group or subscribe to our mailing list:</p>\n<p><a href=\"http://groups.google.com/group/vstte-2012-verification-competition\">http://groups.google.com/group/vstte-2012-verification-competition</a></p>\n<p>vstte-2012-verification-competition+subscribe@googlegroups.com</p>\n<p>VSTTE 2012 Verification Competition</p>\n<hr>\n<p>A software verification competition is organized on behalf of the<br>\nVSTTE 2012 conference (<a href=\"https://sites.google.com/site/vstte2012\">https://sites.google.com/site/vstte2012</a>).<br>\nThe purposes of this competition are: to help promote approaches and<br>\ntools, to provide new verification benchmarks, to stimulate further<br>\ndevelopment of verification techniques, and to have fun.</p>\n<p>The contest takes place during 48 hours, on 8-10 November 2011, two<br>\nmonths prior to the conference. Problems will be put on the website of<br>\nthe conference. Solutions must be sent by email to the competition<br>\norganizers. Any programming language, specification language, and<br>\nverification tool is allowed.</p>\n<p>There will be several independent problems.  Each problem is<br>\npresented as a sequential algorithm, using English or pseudocode, and<br>\na list of properties to formally prove about it, also expressed in<br>\nplain English and standard mathematical notation. Participants have<br>\nliberty to implement the proposed algorithms in functional,<br>\nimperative, object-oriented, or any other programming style.</p>\n<p>Anybody interested can take part in the contest. Team work is allowed,<br>\nbut only teams up to 4 members are eligible for the first prize.<br>\nIndividual participants may belong to several teams.<br>\nHowever, the same solution cannot appear in different submissions.</p>\n<p>The winner is awarded a talk slot at VSTTE 2012, to present any<br>\nresearch of his/her choice of interest for the VSTTE community. In<br>\nparticular, a presentation of solutions to the competition problems<br>\nand/or of the techniques and system used would be appreciated.</p>\n<p>Tuesday   8 Nov 2011, 15:00 UTC - competition starts<br>\n  Thursday 10 Nov 2011, 15:00 UTC - competition stops</p>\n<p>Monday 12 Dec 2011 - the winner is notified<br>\n  28-29 Jan 2012 - results are announced at VSTTE 2012</p>",
        "id": 294146939,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660847864
    }
]