[
    {
        "content": "<p>From: Thomas Genet &lt;<a href=\"mailto:thomas.genet@irisa.fr\">thomas.genet@irisa.fr</a>&gt;<br>\nCELTIQUE is looking for PhD candidates and postdocs!</p>\n<p>The IRISA/Inria Celtique group in Rennes (France) has several open PhD and<br>\npost-doctoral position. The positions are funded by David Pichardie's <br>\neuropean<br>\nERC VESTA project (2018-2023). Postdoc applicants must have a PhD in <br>\nComputer<br>\nScience. PhD applicants must have a Master in Computer Science. We seek<br>\ncandidates with a solid theoretical background in Computer Science, in <br>\nat least<br>\none of the following topics: - formal semantics of programming languages</p>\n<ul>\n<li>compiler implementation</li>\n<li>abstract interpretation</li>\n<li>Coq proof assistant</li>\n</ul>\n<p>Postdoc positions are one year, with the possibility of extension to a <br>\nsecond<br>\nyear. All position may start after September 1st 2018.</p>\n<p>Candidate that are specially interested by compiler verification will <br>\nalso be<br>\nconsidered for a postdoc in the national ANR project Discover<br>\n(<a href=\"http://discover.irisa.fr/\">http://discover.irisa.fr/</a>), and can negotiate a starting time earlier than<br>\nSeptember.</p>\n<p>The working language is English, knowledge of French is not required. <br>\nThe successful candidate will join the Celtique team at IRISA, INRIA Rennes:<br>\n<a href=\"https://team.inria.fr/celtique/\">https://team.inria.fr/celtique/</a></p>\n<p>Applicants should send their curriculum vitae, cover letter and <br>\nnames/contact<br>\ninformation of two references to David Pichardie<br>\n(<a href=\"mailto:david.pichardie@ens-rennes.fr\">david.pichardie@ens-rennes.fr</a>). Recommandation letters should be sentto <br>\nDavid<br>\nPichardie directly.</p>\n<p>Potential research projects</p>\n<ul>\n<li>Verification of static analysis with the Coq proof assistant</li>\n<li>\n<p>Formal verification of abstract interpreters using the Galois connection<br>\n   framework inside Coq</p>\n</li>\n<li>\n<p>Formal verification of state-of-the-art SSA-based compiler optimisations</p>\n</li>\n<li>\n<p>Advanced abstract interpretation for software security (Java, C, or <br>\nassembly<br>\n   programs)</p>\n</li>\n<li>\n<p>Innovative techniques for extraction of efficient code with Coq<br>\n<a href=\"/user_uploads/14278/ZSNzpH-2xfJAwO2h_Rp4Jxms/Portion-de-message-joint\">Portion de message joint</a></p>\n</li>\n</ul>",
        "id": 294727465,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661186862
    }
]