[
    {
        "content": "<p>From: Jeremy Avigad &lt;<a href=\"mailto:avigad@cmu.edu\">avigad@cmu.edu</a>&gt;<br>\nMathematical Structures in Computer Science</p>\n<p>Special Issue on</p>\n<p>Advances and Perspectives in the Mechanization of Mathematics</p>\n<p>Guest Editors: Andrea Asperti and Jeremy Avigad</p>\n<p>Call for contributions</p>\n<p>Recent advances in automated reasoning and interactive theorem proving <br>\nhave made it possible to formalize and mechanically check substantial <br>\nmathematical theorems, such as the prime number theorem, the four color <br>\ntheorem, and the Jordan curve theorem. In particular, a number of <br>\ninteractive proof assistants have been developed to help users manage <br>\nlibraries of definitions and theorems, and fill in the inferential <br>\ndetails of a mathematical argument. Automated methods are also often <br>\nused to verify calculations that are too long and complex to check by <br>\nhand. As mathematical proofs become more complicated and, increasingly, <br>\nrely on extensive calculation, this gives rise to an exciting <br>\ninteraction between traditional methods and computational means of <br>\nverifying mathematical claims.</p>\n<p>The present issue is devoted to recent advances and new perspectives in <br>\nthis field, including descriptions of formalizations, thoughtful <br>\nreflection on the future of the discipline, novel insights, innovative <br>\nresearch directions, and critical assessments of the current state of <br>\nthe art.</p>\n<p>Deadlines</p>\n<p>Deadline for submissions: June 28, 2010<br>\nAuthor's notification: September 27, 2010</p>\n<p>Submissions:</p>\n<p>All papers should be written in pdf and submitted via the EasyChair <br>\nsystem, accessible at the following address: <br>\n<a href=\"https://www.easychair.org/login.cgi?conf=mscsadvancesandperspectivesint\">https://www.easychair.org/login.cgi?conf=mscsadvancesandperspectivesint</a><br>\nAuthors are invited to write their papers following the mscs <br>\ninstructions available in the MSCS guide for contributors downloadable <br>\nhere: <a href=\"http://assets.cambridge.org/MSC/MSC_ifc.pdf\">http://assets.cambridge.org/MSC/MSC_ifc.pdf</a>.</p>\n<p>Extended versions of work previously published in conference proceedings <br>\nare eligible for submission but authors should make it clear how their <br>\nsubmission improves upon the conference publication; in those cases <br>\nwhere Cambridge University Press is not the publisher of the original <br>\nconference proceedings, authors should take care to avoid infringing <br>\nthat publisher's copyright. Authors who wish to discuss potential <br>\nsubmissions are encouraged to contact the guest editors.</p>\n<p>Papers should not be longer than 35 pages; shorter papers are obviously <br>\nwelcome.</p>\n<hr>\n<p>All information can be found at the following web page:<br>\n<a href=\"http://www.cs.unibo.it/~asperti/mscs\">http://www.cs.unibo.it/~asperti/mscs</a></p>\n<p>-- Andrea Asperti &amp; Jeremy Avigad</p>",
        "id": 294107329,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660835644
    }
]