[
    {
        "content": "<p>From: Stephan Merz &lt;<a href=\"mailto:Stephan.Merz@loria.fr\">Stephan.Merz@loria.fr</a>&gt;<br>\nSummer School on Verification Technology, Systems &amp; Applications<br>\n<a href=\"http://www.mpi-inf.mpg.de/VTSA09/\">http://www.mpi-inf.mpg.de/VTSA09/</a></p>\n<p>A summer school on verification technology, systems and applications <br>\nwill be organized by the INRIA research center in Nancy, in cooperation <br>\nwith the Max-Planck Institute für Informatik in Saarbrücken and the <br>\nUniversity of Luxemburg. The school will take place during the week of <br>\nOctober 12, 2009 in Nancy, France.</p>\n<p>The following speakers have accepted to give courses:</p>\n<p>Daniel Le Berre: SAT and related technologies from a practitioner's <br>\nperspective<br>\nPatricia Bouyer: On the verification and control of timed systems<br>\nLeonardo de Moura: On Designing and Implementing Satisfiability Modulo <br>\nTheory Solvers<br>\nStephan Schulz: Implementation of First-Order Theorem Provers<br>\nBenjamin Werner: Coq proofs -- the case of prime numbers</p>\n<p>Participation is free (except for travel and accomodation costs) and <br>\nopen to anybody holding at least a Bachelor degree (or equivalent) in <br>\ncomputer science. Basic knowledge of propositional and first-order logic <br>\nis assumed. The number of participants is limited. Please apply <br>\nelectronically by <em>August 30, 2009</em> by sending</p>\n<ul>\n<li>a one-page CV,</li>\n<li>\n<p>an application letter explaining your interest in the school and your <br>\nexperience in the area,</p>\n</li>\n<li>\n<p>a copy of your bachelor certificate (or equivalent or higher)</p>\n</li>\n</ul>\n<p>to <a href=\"mailto:lamotte@mpi-inf.mpg.de\">lamotte@mpi-inf.mpg.de</a>.</p>\n<p>For details please see the Web page of the school.<br>\n<a href=\"/user_uploads/14278/wVFWe4g0srTPfIMwBH9DXEpv/Stephan_Merz.vcf\">Stephan_Merz.vcf</a></p>",
        "id": 294078720,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660829938
    }
]