[
    {
        "content": "<p>From: Christian Maeder &lt;<a href=\"mailto:Christian.Maeder@dfki.de\">Christian.Maeder@dfki.de</a>&gt;<br>\nHi,</p>\n<p>is there a way to export a parsed, type-checked and possibly proven<br>\ntheory file as an xml file (or another format.)</p>\n<p>I've found the yxml (xml to yxml converter) in the documentation, but no<br>\nway to create xml in the first place.</p>\n<p>Thanks Christian</p>",
        "id": 294067723,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660826037
    },
    {
        "content": "<p>From: Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt;<br>\nXML is merely a complex way to represent simple trees, while YXML is a <br>\nmuch simpler version that also achieves better performance (about an order <br>\nof magnitude compared to the best XML parser).</p>\n<p>Being able to import and export simple trees efficiently does not give <br>\naccess to internal Isabelle theory content yet.  In fact it is impossible <br>\nto externalize the actual theory, because it may contain arbitary abstract <br>\ndata defined by the user somewhere.</p>\n<p>What you can do is to turn some aspects of the theory content into an <br>\nexternal format and try to make sense out of it.  For example the tables <br>\nof types, consts, theorems etc. similar to the output of print_theory.  <br>\nSee also src/Pure/Tools/xml_syntax.ML for an example of how some concrete <br>\nML datatypes of Isabelle can be represented as XML trees.</p>\n<p>Instead of peeking at low-level details of internal theory values there is <br>\nanother way of getting information about how the system interprets the <br>\noriginal sources.  This is an emerging concept only present in recent <br>\ndevelopment versions: the system issues detailed status messages for the <br>\nbits and pieces of text it has encountered and parsed in a certain way <br>\n(information about type-checking will follow later).</p>\n<p>You can try this with Proof General with option -m test_markup enabled. <br>\nSee the attached theory and log of status messages produced as a side <br>\neffect of loading it.</p>\n<p>At the moment this is merely a trace of some aspects of the internal <br>\nprocessing of theory sources.  Later we will use it more systematically <br>\nfor the next generation of Isabelle user interfaces and document <br>\npreparation systems, with \"semantic\" information attached to the sources.</p>\n<p>Makarius<br>\n<a href=\"/user_uploads/14278/CDDpFnxwJLjJZpdGDHtD4Uz1/A.thy\">A.thy</a><br>\n<a href=\"/user_uploads/14278/zEj3VomIw-rtqav78kUGN_Hs/A.log\">A.log</a></p>",
        "id": 294067725,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660826040
    }
]