[
    {
        "content": "<p>From: Freek Wiedijk &lt;<a href=\"mailto:freek@cs.ru.nl\">freek@cs.ru.nl</a>&gt;<br>\nSYSTEM ANNOUNCEMENT: PROOFWEB</p>\n<p>We are pleased to announce the availability of our ProofWeb<br>\nsystem for teaching logic and using proof assistants through<br>\nthe web.  For details go to the ProofWeb home page at:</p>\n<p><a href=\"http://proofweb.cs.ru.nl/\">http://proofweb.cs.ru.nl/</a></p>\n<p>Attached to this mail is the text on the ProofWeb home page.</p>\n<p>Cezary Kaliszyk<br>\nDan Synek<br>\nFemke van Raamsdonk<br>\nFreek Wiedijk<br>\nHerman Geuvers<br>\nJames McKinna</p>\n<p>WHAT IS PROOFWEB?</p>\n<p>ProofWeb is both a system for teaching logic and for using<br>\nproof assistants through the web.</p>\n<p>ProofWeb can be used in three ways.  First, one can use the<br>\nguest login, for which one does not even need to register.<br>\nSecondly, a user can be a student in a logic or proof<br>\nassistants course.  We are hosting courses free of charge.<br>\nIf you are a teacher and would like to host your course on<br>\nthis server, send email to <a href=\"mailto:proofweb@cs.ru.nl\">proofweb@cs.ru.nl</a>.  Thirdly,<br>\nif teachers do not want to trust us with their students'<br>\nfiles, they can freely download the ProofWeb system and<br>\nrun it on a server of their own.</p>\n<p>LOGIC ON THE WEB</p>\n<p>ProofWeb is a system for practising natural deduction on the<br>\ncomputer.  It is almost, but not quite, entirely unlike the<br>\nJape system.  ProofWeb is based on the Coq proof assistant<br>\nand runs inside any modern web browser.  To use ProofWeb<br>\none does not need to install software locally, not even a<br>\nplugin: a web browser is all one needs.  With ProofWeb one<br>\nruns logic exercises on a web server, just like gmail keeps<br>\nall mail messages on its server.  This means that students<br>\nwill be able to access their exercises wherever they have<br>\na web browser, and that teachers at any time can see the<br>\nstatus of their students' work.</p>\n<p>ProofWeb comes with a database of basic logic exercises<br>\nthat are graded according to difficulty.  The ProofWeb<br>\nsystem automatically grades the exercises of the students.<br>\nTo the students this is presented as a traffic light:<br>\ntheir goal is to get a green light for all their exercises.</p>\n<p>A ProofWeb user talks to the Coq system on the server<br>\nwithout any translation.  There just are a few additional<br>\ntactics to make Coq's behavior follow the logic textbooks.<br>\nThis means that in ProofWeb the full power of Coq is<br>\navailable, even to beginner students.  On the other hand<br>\nProofWeb tries hard to present deductions exactly the way<br>\nthey look in the textbooks.  In particular ProofWeb exactly<br>\nfollows the conventions of a well-known logic textbook,<br>\n\"Logic in Computer Science: Modelling and Reasoning about<br>\nSystems\" by Michael Huth and Mark Ryan, published by<br>\nCambridge University Press.  For this reason ProofWeb is<br>\nespecially attractive for courses that use this textbook.<br>\nProofWeb both supports Gentzen-style natural deduction in<br>\nwhich proofs look likes trees with the conclusion at the<br>\nroot, and Fitch-style natural deduction in which proofs<br>\nconsist of lines grouped together with boxes or \"flags\".</p>\n<p>PROOF ASSISTANTS ON THE WEB</p>\n<p>ProofWeb is a system that allows anyone to try out proof<br>\nassistants without installing anything.  It is almost, but<br>\nnot quite, entirely unlike the Proof General interface for<br>\nproof assistants.  ProofWeb was designed to be used with<br>\nCoq, but the interface has been successfully extended to<br>\nother proof assistants, and in particular it supports the<br>\nIsabelle system.</p>\n<p>Although ProofWeb was designed for teaching logic to<br>\nundergraduate computer science students, it also has been<br>\nsuccessfully used to teach proof assistant courses to<br>\ngraduate students.</p>\n<p>RELATED PROJECTS</p>\n<p>The ProofWeb interface has been used and extended in various<br>\nprojects.  The main ones are a prototype by Cezary Kaliszyk<br>\nand Pierre Corbineau of a system that combines ProofWeb<br>\nwith a mathematical encyclopedia in the style of Wikipedia,<br>\nand PC-Extra, an arbitrary precision calculator by Cezary<br>\nKaliszyk, based on the PhD work of Russell O'Connor.</p>\n<p>ABOUT PROOFWEB</p>\n<p>ProofWeb was developed in 2006 and 2007 in the education<br>\ninnovation project \"Web deduction for education in formal<br>\nthinking\" which was financed by Surf Foundation, the Radboud<br>\nUniversity Nijmegen and the Free University Amsterdam.<br>\nThe main developer of the system was Cezary Kaliszyk, after<br>\nideas by Freek Wiedijk.  The ProofWeb exercise database<br>\nand a first version of the natural deduction tactics were<br>\ndeveloped by Maxim Hendriks.  ProofWeb was refined based<br>\non experiences with the system in courses given by Femke<br>\nvan Raamsdonk, Hanno Wupper and Roel de Vrijer.</p>",
        "id": 294068268,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660826238
    }
]