[
    {
        "content": "<p>From: Stefan Berghofer &lt;<a href=\"mailto:berghofe@in.tum.de\">berghofe@in.tum.de</a>&gt;<br>\nThe</p>\n<p>28th Marktoberdorf Summer School 2007</p>\n<p>is ready for application up to now and at the latest until February, 28<br>\n2007.</p>\n<p>The \"Marktoberdorf Summer School\" is a two weeks' course for young<br>\ncomputer scientists and mathematicians working in the field of formal<br>\nsoftware and systems development. The course aims at the dissemination<br>\nof advanced scientific knowledge and the promotion of international<br>\ncontacts among scientists.</p>\n<p>Further information with lecturer's topics and the application form can<br>\nbe found under the web-page  <a href=\"http://asimod.in.tum.de/\">http://asimod.in.tum.de/</a></p>\n<p>The Summer School topic will be</p>\n<p>Formal Logical Methods for System Security and Correctness</p>\n<p>The objective of the Summer School is to present the state of the art in<br>\nthe field of proof technology. The lecturers will show that methods of<br>\ncorrect-by-construction program and synthesis allow a high level<br>\nprogramming method more amenable to security and reliability analysis<br>\nand guarantees. By (1) providing the necessary theoretical background<br>\nand (2) presenting corresponding application oriented concepts, the<br>\nobjective is an in-depth presentation of such methods covering both<br>\ntheoretical foundations and industrial practice based on the promise of<br>\ncreating a secure-by-construction programming methodology. We assembled<br>\nleading researchers in computer science and applied logics who have made<br>\nsignificant advances in creating a formal logical basis for system security.</p>\n<p>Lecturers are</p>\n<p>Gilles Barthe    Orna Grumberg    Martin Hyland    Tobias Nipkow<br>\nBob Constable    John Harrison    John Mitchell    Helmut Schwichtenberg<br>\nJavier Esparza    Martin Hofmann    Greg Morrisett    Stan Wainer</p>\n<p>Especially invited to apply for participation are young researchers from<br>\ncountries like<br>\nAlbania, Algeria, Armenia, Azerbaijan, Belarus, Bulgaria, Croatia,<br>\nEgypt, Georgia, Israel, Jordan, Kazakhstan, Kyrghyz Republi,<br>\nMarocco, Mauritania, Moldova, Romania, Russian Federation, Tajikistan,<br>\nthe former Yugoslav Republic of Macedonia, Tunisia,<br>\nTurkmenistan, Ukraine, Uzbekistan.</p>",
        "id": 294046468,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660817496
    }
]