[
    {
        "content": "<p>From: Dominic Mulligan &lt;<a href=\"mailto:s0346804@sms.ed.ac.uk\">s0346804@sms.ed.ac.uk</a>&gt;<br>\nHi all,<br>\n  I'm attempting to use a CVS version of Isabelle with polyml-5.0.  When <br>\nI try to start the Isabelle process from the command line (\"isabelle\" or <br>\n\"isabelle-process\") Isabelle refuses to start and I get the following <br>\nerror: \"Unable to allocate immutable area\" (incidentally, I also get <br>\nthis error when trying to build the heaps, I'm currently using a heap <br>\nbuilt on another machine).  Trying to start Isabelle from within PG also <br>\ngives a similar error (this time preceded by a warning about locales, <br>\nfirst line of error: \"perl: Setting locale failed\", then followed by <br>\nwarnings stating my locale is being set to the standard locale, (\"C\"), <br>\nand finally the error about the immutable area).</p>\n<p>I have tried to use polyml-4.2 (the version linked to on the Isabelle <br>\nsite) to build the HOL heap, but after a build time of over an hour and <br>\na quarter, I gave up.  Clearly something is seriously wrong.  For my <br>\npurposes, I'd like to stick with the version of Isabelle that I'm trying <br>\nto use.  With this in mind, can anyone shed any light on the origin of <br>\nthe \"unable to allocate immutable area\" error, and what can be done to <br>\nfix it?  A quick Google search has turned up nothing of note.</p>\n<p>Many thanks,<br>\nDominic Mulligan.</p>",
        "id": 294050592,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660819293
    },
    {
        "content": "<p>From: Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt;<br>\nThis sounds like a genuine problem of Poly/ML on your particular platform, <br>\nalthough 5.0 usually works quite well on a large number of systems.</p>\n<p>Maybe you should ask on the polyml mailing list.</p>\n<p>Makarius</p>",
        "id": 294050600,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660819299
    }
]