[
    {
        "content": "<p>From: \"Thiemann, Rene\" &lt;<a href=\"mailto:Rene.Thiemann@uibk.ac.at\">Rene.Thiemann@uibk.ac.at</a>&gt;<br>\nRepresentation and Partial Automation of the Principia Logico-Metaphysica in<br>\nIsabelle/HOL </p>\n<p>by Daniel Kirchner</p>\n<p>We present an embedding of the second-order fragment of the Theory of Abstract<br>\nObjects as described in Edward Zalta's upcoming work Principia<br>\nLogico-Metaphysica (PLM) in the automated reasoning framework Isabelle/HOL.<br>\nThe Theory of Abstract Objects is a metaphysical theory that reifies property<br>\npatterns, as they for example occur in the abstract reasoning of mathematics,<br>\nas abstract objects and provides an axiomatic framework that allows to reason<br>\nabout these objects. It thereby serves as a fundamental metaphysical theory<br>\nthat can be used to axiomatize and describe a wide range of philosophical<br>\nobjects, such as Platonic forms or Leibniz' concepts, and has the ambition to<br>\nfunction as a foundational theory of mathematics. The target theory of our<br>\nembedding as described in chapters 7-9 of PLM employs a modal relational type<br>\ntheory as logical foundation for which a representation in functional type<br>\ntheory is known to be challenging.</p>\n<p>Nevertheless we arrive at a functioning representation of the theory in the<br>\nfunctional logic of Isabelle/HOL based on a semantical representation of an<br>\nAczel-model of the theory. Based on this representation we construct an<br>\nimplementation of the deductive system of PLM which allows to automatically<br>\nand interactively find and verify theorems of PLM.</p>\n<p>Our work thereby supports the concept of shallow semantical embeddings of<br>\nlogical systems in HOL as a universal tool for logical reasoning as promoted<br>\nby Christoph Benzmüller.</p>\n<p>The most notable result of the presented work is the discovery of a previously<br>\nunknown paradox in the formulation of the Theory of Abstract Objects. The<br>\nembedding of the theory in Isabelle/HOL played a vital part in this discovery.<br>\nFurthermore it was possible to immediately offer several options to modify the<br>\ntheory to guarantee its consistency. Thereby our work could provide a<br>\nsignificant contribution to the development of a proper grounding for object<br>\ntheory.</p>\n<p>For further details, see <a href=\"https://www.isa-afp.org/entries/PLM.html\">https://www.isa-afp.org/entries/PLM.html</a></p>\n<p>Enjoy this new entry,<br>\nRené</p>",
        "id": 294720312,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661184554
    }
]