[
    {
        "content": "<p>From: Lawrence Paulson &lt;<a href=\"mailto:lp15@cam.ac.uk\">lp15@cam.ac.uk</a>&gt;</p>\n<hr>\n<p>The Sixth NASA Formal Methods Symposium<br>\n<a href=\"http://www.NASAFormalMethods.org/\">http://www.NASAFormalMethods.org/</a><br>\n             29 April - 1 May 2014<br>\n NASA Johnson Space Center, Houston, Texas, USA</p>\n<hr>\n<p>Theme of the Symposium:</p>\n<hr>\n<p>The widespread use and increasing complexity of mission- and safety-critical systems require advanced techniques that address their specification, verification, validation, and certification requirements.<br>\nThe NASA Formal Methods Symposium is a forum for theoreticians and practitioners from academia, industry, and government, with the goals of identifying challenges and providing solutions to achieving assurance in mission- and safety-critical systems. Within NASA such systems include autonomous robots, separation assurance algorithms for aircraft, Next Generation Air Transportation (NextGen), and autonomous rendezvous and docking for spacecraft. Moreover, emerging paradigms such as property-based design, code generation, and safety cases are bringing with them new challenges and opportunities. The focus of the symposium will be on formal techniques, their theory, current capabilities, and limitations, as well as their application to aerospace, robotics, and other safety-critical systems in all design life-cycle stages. We encourage submissions on cross-cutting approaches marrying formal verification techniques with advances in safety-critical system development, such as requirements generation, analysis of aerospace operational concepts, and formal methods integrated in early design stages carrying throughout system development.<br>\nTopics of Interest:</p>\n<hr>\n<p>* Model checking<br>\n   * Theorem proving<br>\n   * Static analysis<br>\n   * Model-based development<br>\n   * Runtime monitoring<br>\n   * Formal approaches to fault tolerance<br>\n   * Applications of formal methods to aerospace systems<br>\n   * Formal analysis of cyber-physical systems, including hybrid and embedded systems<br>\n   * Formal methods in systems engineering, modeling, requirements, and specifications<br>\n   * Requirements generation, specification debugging, formal validation of specifications<br>\n   * Use of formal methods in safety cases<br>\n   * Use of formal methods in human-machine interaction analysis<br>\n   * Formal methods for parallel hardware implementations<br>\n   * Use of formal methods in automated software engineering and testing<br>\n   * Correct-by-design, design for verification, and property-based design techniques<br>\n   * Techniques and algorithms for scaling formal methods; e.g. abstraction and symbolic methods, compositional techniques, parallel and distributed techniques<br>\n   * Application of formal methods to emerging technologies<br>\nImportant Dates:</p>\n<hr>\n<p>Abstract Submission: 14 Nov 2013<br>\nPaper Submission:    21 Nov 2013<br>\nPaper Notifications: 14 Jan 2014<br>\nCamera-ready Papers: 11 Feb 2014<br>\nSymposium: 29 April - 1 May 2014<br>\nLocation &amp; Cost:</p>\n<hr>\n<p>The symposium will take place at the Gilruth Center, NASA Johnson Space Center, Houston, Texas, USA, 29 April to 1 May 2013.<br>\nThere will be no registration fee for participants. All interested individuals, including non-US citizens, are welcome to attend, to listen to the talks, and to participate in discussions; however, all attendees must register.<br>\nSubmission Details:</p>\n<hr>\n<p>There are two categories of submissions:</p>\n<p>1. Regular papers describing fully developed work and complete results (15 pages)<br>\n  2. Short papers describing tools, experience reports, or descriptions of work in progress with preliminary results (6 pages)<br>\nAll papers should be in English and describe original work that has not been published or submitted elsewhere. All submissions will be fully reviewed by members of the Programme Committee. Papers will appear in a volume of Springer's Lecture Notes on Computer Science (LNCS), and must use LNCS style formatting. Papers should be submitted in PDF format.<br>\nKeynote Speakers:</p>\n<hr>\n<ul>\n<li>Larry Paulson, University of Cambridge, UK</li>\n<li>Moshe Y. Vardi, Rice University, USA</li>\n<li>Special Guest Talk: \"NASA Future Challenges in Formal Methods\"<br>\nOrganizers:</li>\n</ul>\n<hr>\n<p>Mike Hinchey (General Chair)<br>\nJulia Badger (PC Chair)<br>\nKristin Yvonne Rozier (PC Chair)<br>\nSteering Committee:</p>\n<hr>\n<p>Ewen Denney, SGT/NASA Ames<br>\nBen Di Vito, NASA Langley<br>\nKlaus Havelund, NASA/JPL<br>\nGerard Holzmann, NASA/JPL<br>\nCesar Munoz, NASA Langley<br>\nCorina Pasareanu, CMU/NASA Ames<br>\nSuzette Person, NASA Langley<br>\nKristin Y. Rozier, NASA Ames</p>",
        "id": 294246286,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660909042
    }
]