[
    {
        "content": "<p>From: Mikhail Chekhov &lt;<a href=\"mailto:mikhail.chekhov.w@gmail.com\">mikhail.chekhov.w@gmail.com</a>&gt;<br>\nDear All,</p>\n<p>I would like to ask several questions with regard to the availability of<br>\ntools for the visualization of orders based on theorems stated in<br>\nIsabelle/HOL and certain other related questions:</p>\n<p>1. Are there any tools already available for the visualization of orders<br>\n   or relationships between predicates (apart from the locale_deps and<br>\n   class_deps)? Are there any ongoing efforts dedicated to the development of<br>\n   such tools?</p>\n<p>2. Is it possible to extract (with ease) arbitrary subsets of the<br>\n   diagrams produced by class_deps/locale_deps and add them to the formal<br>\n   proof documents?</p>\n<p>3. I would like to understand what is the policy on the inclusion of<br>\n   external tools in the build process for the submission of articles to the<br>\n   AFP. In particular, I would like to understand if it would be acceptable<br>\n   for the build process to call any commands associated with graphviz.</p>\n<hr>\n<p>Background</p>\n<p>I sketched a graphviz-based snippet for the visualization of certain types<br>\nof partial orders in the form of the Hasse-like diagrams (more precisely,<br>\nat the moment, I allow the edges shown in such diagrams to form an<br>\narbitrary subset of the edges of the traditional Hasse diagram for a given<br>\nordered set) from theorems stated in Isabelle/HOL for a particular<br>\napplication. I am thinking about whether it is worth taking this<br>\ndevelopment one step further and create a small package from it.<br>\nUnfortunately, it relies on graphviz and I am not certain whether this<br>\ncould be allowed in the AFP submissions. Furthermore, before taking this<br>\ntool with any degree of seriousness, I would like to understand if anything<br>\nsimilar already exists or is being developed. I attached a couple of<br>\nscreenshots taken from the formal proof documents amended with the diagrams<br>\ncreated by the (sketched) tool for a reference.</p>\n<p>Thank you,<br>\nMikhail Chekhov<br>\n<a href=\"/user_uploads/14278/yTljK1uIgsKnuGkssF9DjICI/example_1.png\">example_1.png</a><br>\n<a href=\"/user_uploads/14278/thBk9flhvDDu0PVJXxdRqNbA/example_2.png\">example_2.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/14278/yTljK1uIgsKnuGkssF9DjICI/example_1.png\" title=\"example_1.png\"><img src=\"/user_uploads/14278/yTljK1uIgsKnuGkssF9DjICI/example_1.png\"></a></div><div class=\"message_inline_image\"><a href=\"/user_uploads/14278/thBk9flhvDDu0PVJXxdRqNbA/example_2.png\" title=\"example_2.png\"><img src=\"/user_uploads/14278/thBk9flhvDDu0PVJXxdRqNbA/example_2.png\"></a></div>",
        "id": 294767369,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661202573
    },
    {
        "content": "<p>From: Mikhail Chekhov &lt;<a href=\"mailto:mikhail.chekhov.w@gmail.com\">mikhail.chekhov.w@gmail.com</a>&gt;<br>\nDear All,</p>\n<p>This is a partial reply to one of my own old questions on the list:<br>\n<a href=\"https://lists.cam.ac.uk/pipermail/cl-isabelle-users/2019-December/msg00058.html\">https://lists.cam.ac.uk/pipermail/cl-isabelle-users/2019-December/msg00058.html</a>.<br>\nI thought that it may be worth making an attempt to resurrect this thread<br>\nin light of a recent paper by Clemens Ballarin for the Isabelle Workshop:<br>\n<a href=\"https://files.sketis.net/Isabelle_Workshop_2020/Isabelle_2020_paper_2.pdf\">https://files.sketis.net/Isabelle_Workshop_2020/Isabelle_2020_paper_2.pdf</a>.<br>\nThis paper provides a positive answer to Question 2 from the thread that I<br>\nstarted. Thus, once again, I would like to thank the author (indeed, this<br>\nis the second time a publication from Clemens Ballarin provides an answer<br>\nto one of my questions on the list:<br>\n<a href=\"https://lists.cam.ac.uk/pipermail/cl-isabelle-users/2020-April/msg00077.html\">https://lists.cam.ac.uk/pipermail/cl-isabelle-users/2020-April/msg00077.html</a><br>\n).</p>\n<p>Undeniably, I am very interested in whether there exist any active projects<br>\nrelated to the extraction of diagrams from theories or auto-generation of<br>\ntheories from diagrams (to the point of designing my own prototype for the<br>\nextraction of diagrams for one particular application area, not directly<br>\nrelated to locales), as well as finding the answers to Questions 1 and 3<br>\nfrom the aforementioned thread. Therefore, I would be very pleased to<br>\nreceive any comments in relation to the aforementioned matters.</p>\n<p>Kind Regards,<br>\nMikhail Chekhov</p>",
        "id": 294828037,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661245342
    }
]