[
    {
        "content": "<p>From: Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt;<br>\n[Apologies for possible multiple postings.]</p>\n<hr>\n<p>CALL FOR PAPERS</p>\n<hr>\n<p>THedu'11<br>\n                 CTP components for educational software<br>\n<a href=\"http://www.uc.pt/en/congressos/thedu\">http://www.uc.pt/en/congressos/thedu</a></p>\n<p>Workshop at CADE-23,<br>\n           23nd International Conference on Automated Deduction<br>\n                 Wroclaw, Poland, July 31- August 5, 2011<br>\n<a href=\"http://cade23.ii.uni.wroc.pl/\">http://cade23.ii.uni.wroc.pl/</a></p>\n<hr>\n<p>THedu'11 Scope</p>\n<hr>\n<p>This workshop intends to gather the research communities for Computer<br>\nTheorem proving (CTP), Automated Theorem Proving (ATP),  Interactive<br>\nTheorem Proving (ITP) as well as for Computer Algebra Systems (CAS) and<br>\nDynamic Geometry Systems (DGS).<br>\nThe goal of this union is to combine and focus systems of these areas to<br>\nenhance existing educational software as well as studying the design of<br>\nthe next generation of mechanised mathematics assistants (MMA). Elements<br>\nfor next-generation MMA's include:</p>\n<p>* Declarative Languages for Problem Solution: education in applied<br>\nsciences and in engineering is mainly concerned with problems, which are<br>\nunderstood as operations on elementary objects to be transformed to an<br>\nobject representing a problem solution. Preconditions and postconditions<br>\nof these operations can be used describe the possible steps in the<br>\nproblem space; thus, ATP-systems can be used to check if an operation<br>\nsequence given by the user does actually present a problem solution.<br>\nSuch \"Problem Solution Languages\" encompass declarative proof languages<br>\nlike Isabelle/Isar or Coq's Mathematical Proof Language, but also more<br>\nspecialized forms such as, for example, geometric problem solution<br>\nlanguages that express a proof argument in Euklidian Geometry or<br>\nlanguages for graph theory.</p>\n<p>* Consistent Mathematical Content Representation:  libraries of<br>\nexisting ITP-Systems, in particular those following the LCF-prover<br>\nparadigm, usually provide logically coherent and human readable<br>\nknowledge. In the leading provers, mathematical knowledge is covered to<br>\nan extent beyond most courses in applied sciences. However, the<br>\npotential of this mechanised knowledge for education is clearly not yet<br>\nrecognised adequately: renewed pedagogy calls for enquiry-based learning<br>\nfrom concrete to abstract --- and the knowledge's logical coherence<br>\nsupports such learning: for instance, the formula 2.Ï? depends on the<br>\ndefinition of reals and of multiplication; close to these definitions<br>\nare the laws like commutativity etc. However, the complexity of the<br>\nknowledge's tracable interrelations poses a challenge to usability design.</p>\n<p>* User-Guidance in Stepwise Problem Solving: Such guidance is<br>\nindispensable for independent learning, but costly to implement so far,<br>\nbecause so many special cases need to be coded by hand. However, CTP<br>\ntechnology makes automated generation of user-guidance reachable:<br>\ndeclarative languages as mentioned above, novel programming languages<br>\ncombining computation and deduction, methods for automated construction<br>\nwith ruler and compass from specifications, etc --- all these methods<br>\n'know how to solve a problem'; so, use the methods' knowledge to<br>\ngenerate user-guidance mechanically, is an appealing challenge for  ATP<br>\nand ITP, and probably for compiler construction!</p>\n<p>In principle, mathematical software can be conceived as models of<br>\nmathematics: The challenge addressed by this workshop is to provide<br>\nappealing models for MMAs which are interactive and which explain<br>\nthemselves such that interested students can independently learn by<br>\ninquiry and experimentation.</p>\n<p>Program Committee</p>\n<hr>\n<p>Ralph-Johan Back, Abo University, Turku, Finland<br>\n   Francisco Botana, University of Vigo at Pontevedra, Spain<br>\n   Florian Haftman, Munich University of Technology, Germany<br>\n   Predrag Janicic, University of Belgrade, Serbia<br>\n   Cezary Kaliszyk, University of Tsukuba, Japan<br>\n   Julien Narboux, University of Strasbourg, France<br>\n   Walther Neuper, Graz University of Technology, Austria<br>\n   Pedro Quaresma, University of Coimbra, Portugal<br>\n   Wolfgang Schreiner, Johannes Kepler University, Linz, Austria<br>\n   Laurent Théry, Sophia Antipolis, INRIA, France<br>\n   Makarius Wenzel, University Paris-Sud, France<br>\n   Burkhart Wolff, University Paris-Sud, France</p>\n<p>Important Dates</p>\n<hr>\n<p>* Abstract Submission:  15 Apr 2011<br>\n   * Submission Deadline:  29 Apr 2011 (by THedu'11 easychair)<br>\n   * Author Notification:   3 Jun 2011<br>\n   * Final Version:         1 Jul 2011 (by THedu'11 easychair)<br>\n   * Worshop Day:          31 Jul 2011</p>\n<p>Submission</p>\n<hr>\n<p>We welcome submission of proposals to present a demo, as well as<br>\nsubmissions of papers presenting original unpublished work which is not<br>\nbeen submitted for publication elsewhere.</p>\n<p>Selected papers will appear in CISUC Technical Report series (ISSN<br>\n0874-338X, [1]). All accepted papers and system demos will be presented<br>\nat the workshop, and the extended abstracts will be made available<br>\nonline. A publication medium for post-proceedings is under consideration.</p>\n<p>Papers and demo proposals should be submitted via THedu'11 easychair [2].</p>\n<p>Papers should be no more than 8 pages in length and are to be submitted<br>\nin PDF format. They must conform to the ACM SIGPLAN style guidelines [3].</p>\n<p>At least one author of each accepted paper/demo is expected to attend<br>\nTHedu'11 and presents her or his paper/demo.</p>\n<p>[1] <a href=\"http://www.uc.pt/en/fctuc/ID/cisuc/RecentPublications/Techreports/\">http://www.uc.pt/en/fctuc/ID/cisuc/RecentPublications/Techreports/</a><br>\n[2] <a href=\"http://www.easychair.org/conferences/?conf=thedu11\">http://www.easychair.org/conferences/?conf=thedu11</a><br>\n[3] <a href=\"http://www.acm.org/sigs/sigplan/authorInformation.htm\">http://www.acm.org/sigs/sigplan/authorInformation.htm</a></p>",
        "id": 294126889,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660841575
    }
]