[
    {
        "content": "<p>From: Mateja Jamnik &lt;<a href=\"mailto:mateja.jamnik@cl.cam.ac.uk\">mateja.jamnik@cl.cam.ac.uk</a>&gt;<br>\nDear colleagues:</p>\n<p>I have been awarded a Leverhulme Trust funded research grant in collaboration with Gem Stapleton in Brighton for a three year project on diagrammatic reasoning and we are currently looking to appoint two post-docs. The Cambridge-based post-doc will be particularly relevant to this community. They will need experience in formal logic and implementing reasoning systems. The Brighton-based post-doc will need experience in conducting empirical studies. More details are included below. We’d be grateful if you could pass the details on to anyone who you might think is suitable for either of the posts, or let us know so that we can contact them directly.</p>\n<p>Thank you very much in advance for your help.</p>\n<p>Kind regards,<br>\nMateja</p>\n<p>mateja jamnik • univ of cambridge computer laboratory<br>\n<a href=\"mailto:mateja.jamnik@cl.cam.ac.uk\">mateja.jamnik@cl.cam.ac.uk</a> &lt;mailto:<a href=\"mailto:mateja.jamnik@cl.cam.ac.uk\">mateja.jamnik@cl.cam.ac.uk</a>&gt; • <a href=\"http://www.cl.cam.ac.uk/~mj201\">http://www.cl.cam.ac.uk/~mj201</a> &lt;<a href=\"http://www.cl.cam.ac.uk/~mj201\">http://www.cl.cam.ac.uk/~mj201</a>&gt;</p>\n<p><strong> Details on the Two Positions </strong></p>\n<p>The University of Cambridge, led by Dr Mateja Jamnik, and the University of Brighton, led by Dr Gem Stapleton, are seeking to appoint two enthusiastic researchers, each for three years (full time), to work collaboratively on the interdisciplinary Accessible Reasoning with Diagrams project funded by the Leverhulme Trust. In this project we want to devise and implement an accessible diagrammatic logic for modelling and reasoning in diverse domains.</p>\n<p>The Research Associate employed at Cambridge will  be expected to help develop modelling and reasoning case studies, and to design an accessible diagrammatic logic for modelling and visual reasoning. They will also be required to lead on the implementation of a reasoning system for our diagrammatic representations, and help test and evaluate the accessibility of our system. The successful applicant for the Cambridge position must have experience in designing formal logical representations, and implementing and evaluating reasoning systems. It is also essential that they have a background in several of: diagrammatic reasoning, theorem proving, logic, ontology engineering, artificial intelligence. To apply for this post, visit <a href=\"http://www.jobs.cam.ac.uk/job/10046/\">http://www.jobs.cam.ac.uk/job/10046/</a> &lt;<a href=\"http://www.jobs.cam.ac.uk/job/10046/\">http://www.jobs.cam.ac.uk/job/10046/</a>&gt;. The deadline for applications is 11 May 2016. Please direct informal enquiries to Dr Mateja Jamnik: <a href=\"mailto:mateja.jamnik@cl.cam.ac.uk\">mateja.jamnik@cl.cam.ac.uk</a> &lt;mailto:<a href=\"mailto:mateja.jamnik@cl.cam.ac.uk\">mateja.jamnik@cl.cam.ac.uk</a>&gt;.</p>\n<p>The Research Fellow employed at Brighton will be expected to help develop modelling and reasoning case studies and to conduct empirical studies into the effectiveness of diagrammatic representations and reasoning systems. They will also be required to contribute to the design of empirically informed diagram layout algorithms. The successful applicant for the Brighton position must have experience in designing, executing and analysing the data from empirical studies involving human participants. It is also essential that they have a background in at least one of: diagrammatic reasoning, ontology engineering, logic, information visualization, cognitive science. To apply for this post, visit <a href=\"https://jobs.brighton.ac.uk/vacancy.aspx?ref=SM0155-16-108\">https://jobs.brighton.ac.uk/vacancy.aspx?ref=SM0155-16-108</a> &lt;<a href=\"https://jobs.brighton.ac.uk/vacancy.aspx?ref=SM0155-16-108\">https://jobs.brighton.ac.uk/vacancy.aspx?ref=SM0155-16-108</a>&gt;. The deadline for applications is 15 May 2016. Please direct informal enquiries to Dr Gem Stapleton: <a href=\"mailto:g.e.stapleton@brighton.ac.uk\">g.e.stapleton@brighton.ac.uk</a> &lt;mailto:<a href=\"mailto:g.e.stapleton@brighton.ac.uk\">g.e.stapleton@brighton.ac.uk</a>&gt;.</p>\n<p>The project begins on 11 July 2016 and successful applicants should be available to start on that date.</p>",
        "id": 294672615,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661173858
    },
    {
        "content": "<p>From: Mateja Jamnik &lt;<a href=\"mailto:mateja.jamnik@cl.cam.ac.uk\">mateja.jamnik@cl.cam.ac.uk</a>&gt;<br>\nDear colleagues:</p>\n<p>I have been awarded an EPSRC research grant in collaboration with a cognitive scientist Prof Peter Cheng at Sussex University for an 18 months feasibility project on how to find the most suitable representation for a given problem. </p>\n<p>I am currently looking to appoint a post-doc in Cambridge who will need experience in formal logic and implementing reasoning systems. More details are included below. I’d be grateful if you could pass the details on to anyone who you might think is suitable for this post, or let me know so that I can contact them directly.</p>\n<p>Thank you very much in advance for your help.</p>\n<p>Kind regards,<br>\nMateja</p>\n<p>mateja jamnik • univ of cambridge computer laboratory<br>\n<a href=\"mailto:mateja.jamnik@cl.cam.ac.uk\">mateja.jamnik@cl.cam.ac.uk</a> • <a href=\"http://www.cl.cam.ac.uk/~mj201\">http://www.cl.cam.ac.uk/~mj201</a></p>\n<p><strong> Details of the Position in Cambridge </strong></p>\n<p>The University of Cambridge is looking to appoint an enthusiastic researcher to join this project concerned with exploring and computationally modelling how people choose and use representations for problems that they are solving. The project is entitled \"How to (re)represent it?\" and is led by Dr Mateja Jamnik. It runs jointly with Prof Peter Cheng at the University of Sussex. This EPSRC funded project is part of the EPSRC new and emerging area in ICT on Human-like Computing and AI.</p>\n<p>We want to model in computational systems the inherent human ability to choose or change appropriate representations, and make machines do the same. We want to find out what are the cognitive processes that humans use to select representations, what criteria they use to choose them, and how we can model this ability on machines. </p>\n<p>The Research Associate employed at Cambridge will  be expected to lead on the implementation of the algorithms that allow users to choose alternative representations, and build a ranking and recommendation system based on the taxonomy from cognitive studies to suggest appropriate representation given a particular problem and user. </p>\n<p>The ideal candidate must have experience in designing formal logical representations, and implementing and evaluating reasoning systems. It is also essential that they have a background in several of: diagrammatic reasoning, theorem proving, logic, ontology engineering, mathematics, artificial intelligence.</p>\n<p>To apply online for this vacancy and to view further information about the role, please visit: <a href=\"http://www.jobs.cam.ac.uk/job/16298\">http://www.jobs.cam.ac.uk/job/16298</a>. </p>\n<p>The deadline for receipt of applications is midnight on Monday 12th February 2018. Interviews will take place shortly after either in person or by telephone.</p>\n<p>Please direct informal enquiries to Dr Mateja Jamnik: <a href=\"mailto:mateja.jamnik@cl.cam.ac.uk\">mateja.jamnik@cl.cam.ac.uk</a>.</p>\n<p>The project begins on 1 April 2018 and runs for 18 months.</p>",
        "id": 294724895,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661186073
    }
]