[
    {
        "content": "<p>From: Andrew Tolmach &lt;<a href=\"mailto:apt@cs.pdx.edu\">apt@cs.pdx.edu</a>&gt;</p>\n<hr>\n<p>Post-doctoral position in Formal Verification<br>\nPortland State University</p>\n<hr>\n<p>Applications are invited for a post-doctoral research position at<br>\nPortland State University in the area of formal verification and its<br>\napplications to network and systems software.</p>\n<p>The hosting project, SOUND (Safety on Untrusted Network Devices), is a<br>\nnew joint effort with researchers at the University of Pennsylvania<br>\n(UPenn) and BAE Systems, funded as part of the DARPA MRC<br>\n(Mission-Oriented Resilient Clouds) program.  The goal of SOUND is to<br>\nconstruct distributed systems that are highly resilient against<br>\ncyber-attack, using new ideas in protocols, authentication, and<br>\nauditing. SOUND is also closely integrated with the existing SAFE<br>\n(Semantically Aware Foundation Environment) project, hosted at UPenn,<br>\nHarvard, Northeastern, and BAE.  SAFE is designing a highly secure<br>\nhost architecture, taking a completely clean-slate approach to the<br>\nprocessor, programming language, and operating system.  SAFE hosts<br>\nwill be used as reliable components within SOUND networks.</p>\n<p>At Portland State, we will apply formal verification at multiple<br>\nlevels---specification, algorithms and protocols, and<br>\nimplementation---to increase assurance of both SAFE and SOUND.  Our<br>\ninitial efforts will build on our experience producing verified<br>\nimplementations of runtime-system components using the Coq proof<br>\nassistant in the context of the HASP/HARTS project. This post-doc<br>\nposition offers an opportunity to put formal methods to work to attack<br>\ncritical problems in the security of our cyber-infrastructure, in<br>\ncollaboration with leading researchers in secure systems and<br>\nlanguages, and within a highly visible program.</p>\n<p>The ideal candidate will have a Ph.D. in Computer Science with<br>\nexpertise in formal verification (for example, using Coq, Isabelle, or<br>\nsimilar tools) and in one or more of the following areas: security,<br>\nnetworking, and systems software.  This position initially runs<br>\nthrough September 2012 with the possibility of renewal for up to three<br>\nyears total duration. Review of applications will begin immediately.<br>\nThe position will remain open until finalists are identified.  Start<br>\ndate is negotiable, but ideally within a few months. Starting salary<br>\nis $60,000 per year, plus generous health and vacation benefits.</p>\n<p>Background on this research effort can be found at:</p>\n<ul>\n<li>On SOUND: <a href=\"http://www.cs.pdx.edu/~apt/MRCprop_technical.pdf\">http://www.cs.pdx.edu/~apt/MRCprop_technical.pdf</a>    </li>\n<li>On SAFE: <a href=\"http://www.crash-safe.org/papers\">http://www.crash-safe.org/papers</a></li>\n<li>On HASP/HARTS: <a href=\"http://web.cecs.pdx.edu/~apt/icfp10.pdf\">http://web.cecs.pdx.edu/~apt/icfp10.pdf</a></li>\n</ul>\n<p>To apply, please send a CV together with a brief description of your<br>\nresearch accomplishments and interests, including the names of three<br>\nreferences, to sound-adm 'at' <a href=\"http://cs.pdx.edu\">cs.pdx.edu</a>. Please include the phrase<br>\n\"SOUND Postdoc\" in the subject line.  Questions about the position<br>\nmay be sent directly to Andrew Tolmach (apt 'at' <a href=\"http://cs.pdx.edu\">cs.pdx.edu</a>).</p>\n<p>Portland State University is an Affirmative Action, Equal Opportunity<br>\ninstitution and welcomes applications from candidates who support<br>\ndiversity.</p>",
        "id": 294149996,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660848956
    }
]