[
    {
        "content": "<p>From: Christoph LANGE &lt;<a href=\"mailto:math.semantic.web@gmail.com\">math.semantic.web@gmail.com</a>&gt;<br>\nDear Isabelle community,</p>\n<p>as a part of our work on formalising auctions<br>\n(<a href=\"http://www.cs.bham.ac.uk/research/projects/formare/code/auction-theory/\">http://www.cs.bham.ac.uk/research/projects/formare/code/auction-theory/</a>) we<br>\nimplemented an algorithm that computes all partitions of a given set and<br>\nproved its correctness.  This is joint work with Marco B. Caminati,<br>\nManfred Kerber and Colin Rowat.</p>\n<p>Even though this is just one small building block of our soundness proof<br>\nof a combinatorial auction (see <a href=\"http://arxiv.org/abs/1308.1779\">http://arxiv.org/abs/1308.1779</a> for the<br>\nbig picture), it is self-contained, and we believe that it is of general<br>\ninterest.  We are further working on a verified algorithm to compute all<br>\ninjective functions between two given sets.</p>\n<p>Our main reason for defining these functions in a computable way is the<br>\nability to use Isabelle's code generator to generate verified auction<br>\nsoftware.  Please see<br>\n<a href=\"http://www.cs.bham.ac.uk/research/projects/formare/code/auction-theory/isabelle/Auction/code/\">http://www.cs.bham.ac.uk/research/projects/formare/code/auction-theory/isabelle/Auction/code/</a><br>\nfor executable Scala demos.</p>\n<p>The sources can be found in our GitHub repository<br>\n<a href=\"https://github.com/formare/auctions/\">https://github.com/formare/auctions/</a> at<br>\n<a href=\"https://github.com/formare/auctions/blob/master/isabelle/Auction/Partitions.thy\">https://github.com/formare/auctions/blob/master/isabelle/Auction/Partitions.thy</a>.</p>\n<p>I'm sure Partitions.thy is of interest for the AFP.  However, other<br>\nparts of our Auction Theory Toolbox (maintained on GitHub) depend on it.<br>\n Do you have a good recommendation for how to submit Partitions.thy to<br>\nthe AFP without breaking the dependencies of our Toolbox?</p>\n<p>Furthermore, would such a theory be of interest for the Isabelle library?</p>\n<p>Cheers,</p>\n<p>Christoph</p>",
        "id": 294248399,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660909822
    },
    {
        "content": "<p>From: Tobias Nipkow &lt;<a href=\"mailto:nipkow@in.tum.de\">nipkow@in.tum.de</a>&gt;<br>\nYou can always modify the development version of your AFP entry to keep it in<br>\nsync with the rest of your toolbox.</p>\n<p>Parts of IsaFoR, the Isabelle Formalization of Rewriting by Christian Sternagel<br>\nand René Thiemann, live in the AFP. Either of them should share their experience<br>\nwith this arrangement.</p>\n<p>Tobias</p>",
        "id": 294249195,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660910096
    },
    {
        "content": "<p>From: René Thiemann &lt;<a href=\"mailto:rene.thiemann@uibk.ac.at\">rene.thiemann@uibk.ac.at</a>&gt;<br>\nSo far, we are quite satisfied with our setup, that some parts of IsaFoR are in the AFP and<br>\nothers are not. Here are my personal opinions on our setup:</p>\n<p>1) If you are always working with the development version of Isabelle, then there<br>\n   is no problem at all to put parts of your work in the AFP. Because then you can<br>\n   at any time change your AFP entries.</p>\n<p>2) Putting theories in the AFP has the big advantage that updates for your theories<br>\n   in AFP w.r.t. changes in Isabelle will most likely done by someone else, namely<br>\n   the person who did the change in Isabelle.<br>\n   Moreover, you get feedback by other Isabelle users who want to use your AFP-theories,<br>\n   and the visibility of your development is increased.</p>\n<p>3) If you are working with a release version of Isabelle, then one problem might be<br>\n   that changes in the AFP-part of your theories will only become visible in the AFP<br>\n   at the next release. To this end, we usually only put those parts into the AFP <br>\n   which are quite stable. Moreover, in our local development we accumulate changes<br>\n   for the AFP-part, which are then integrated into the AFP shortly before the next<br>\n   release. In this way, other persons (students) can always work with IsaFoR and<br>\n   a release version of Isabelle. (Exceptions are shortly before the next release where<br>\n   we merge our theories with the AFP) </p>\n<p>Hope this helps,<br>\nRené</p>",
        "id": 294249225,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660910108
    },
    {
        "content": "<p>From: Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt;<br>\nHere you should swap the articles and say \"a development version\" vs. \"the <br>\nrelease version\".</p>\n<p>Development versions are many: more than 50000 right now.  When you make <br>\nan arbitrary shot at some of them, you get \"the\" version on your machine <br>\nin some directory, while the public repository keeps moving.  You need to <br>\ncare about keeping it in sync with other snapshots of other projects (e.g. <br>\nAFP), tell other people about the changeset id you happen to have etc. <br>\nTo work smoothly, you need to follow ongoing changes frequently.  Staying <br>\nbehind too long means your \"latest development version\" becomes more <br>\noutdated than the last public Isabelle release version. (You IsaFoR guys <br>\nmanage all that very well, and there is even a formal COMPATIBILITY file <br>\nwith changeset ids of Isabelle and AFP within your repository.)</p>\n<p>In contrast, Isabelle releases are well-defined stable checkpoints that <br>\nhappen every 6-10 months and remain \"current\" over a longer time.  When <br>\nsomeone posts on the mailing list, there is no need to say \"I am using the <br>\nlatest release\" (or one or two releases behind), since that can be easily <br>\nguessed or tried out quickly against 2 or 3 alternatives (instead of <br>\nthousands above).  Someone who happens to have some project based on some <br>\nproper release from a few years ago can still be helped out.  (Archeology <br>\non repository versions that are more than a few months old is much <br>\nharder.)</p>\n<p>Anyway, we are presently again in a state of confusion about <br>\nisabelle-users vs. isabelle-dev, proper releases vs. arbitrary repository <br>\nsnapshots.  I've just myself posted ongoing repository changes about a <br>\nmostly administrative tool \"isabelle components\" on this mailing list by <br>\naccident.</p>\n<p>Makarius</p>",
        "id": 294249670,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660910251
    }
]