[
    {
        "content": "<p>From: RF Todd &lt;<a href=\"mailto:R.F.Todd@sms.ed.ac.uk\">R.F.Todd@sms.ed.ac.uk</a>&gt;<br>\nHi all,</p>\n<p>I am just wondering if you know how to create a definition in Isabelle<br>\nor Isar over a specific interval.</p>\n<p>I am trying to create the Gram-Schmidt Process in Isabelle and have<br>\ncome across the problem of how to define:</p>\n<p>(ith lambda i) = (innerproduct (ith v n) (ith u i))/(innerproduct (ith<br>\nu i) (ith u i)) over the interval i = 1,..,(n-1)</p>\n<p>I want to calculate each lambda starting with the first lambda and  <br>\nthen finishing on the (n-1)th lambda. Not sure how to do this in  <br>\nIsabelle.</p>\n<p>Regards,</p>\n<p>Rachel</p>",
        "id": 294057038,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660821999
    },
    {
        "content": "<p>From: Steven Obua &lt;<a href=\"mailto:obua@in.tum.de\">obua@in.tum.de</a>&gt;<br>\nRF Todd wrote:</p>\n<p>There is no definitional construct in Isabelle for doing a definition in <br>\nthe style you suggest above.</p>\n<p>By the way, note that the use of the name \"lambda\" is probably confusing <br>\nfor most Isabelle users, as one thinks automatically of a function...</p>\n<p>So, what is the type of lambda, v, and u ?<br>\nIt seems to be some kind of list of vectors? If this is so, then you <br>\ncannot define lambda by saying what \"ith lambda i\" is for i=1..,,n-1.<br>\nYou would need to define a list of length n-1 such that the above <br>\nproperty holds. Note also that list indices start with 0, not with 1.</p>\n<p>As Gram-Schmidt is basically a recursive procedure, you could define a <br>\nrecursive function that does the job of modelling this procedure. There <br>\nis lots of support for defining recursive functions in Isabelle, but <br>\nthere is no support for defining things in the above \"interval-style\".</p>\n<p>Best,</p>\n<p>Steven</p>",
        "id": 294057153,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660822065
    },
    {
        "content": "<p>From: Tobias Nipkow &lt;<a href=\"mailto:nipkow@in.tum.de\">nipkow@in.tum.de</a>&gt;<br>\nOne more thought: you might be able to use the foldl function from <br>\ntheory List. Something like \"foldl f a [0..&lt;n]\". This iterates f over <br>\n[0,...,n-1] with start value \"a\".</p>\n<p>Tobias</p>\n<p>Steven Obua wrote:</p>",
        "id": 294057162,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660822071
    }
]