[
    {
        "content": "<p>From: Rob Arthan &lt;<a href=\"mailto:rda@lemma-one.com\">rda@lemma-one.com</a>&gt;<br>\nKen,</p>\n<p>Unfortunately, the paper by Ondrej Kuncar and Andrei Popescu that you cite gives<br>\na description of the definitional mechanisms in HOL that is about 25 years out of date.<br>\nThe new_specification mechanism allows implicit definitions and cannot be viewed<br>\nas a syntactic abbreviation mechanism. There is a proof of the conservativeness of a <br>\n(generalisation of) this mechanism in Andy Pitts’ Introduction to the HOL Logic (ref. [31]<br>\nin the paper). new_specification is implemented in all the \"HOL-based provers” listed<br>\nin the paper.</p>\n<p>Due to tinkering on my part around 2013, new_specification has been extended to relax<br>\ncertain constraints on polymorphism that it imposed. The resulting gen_new_specification<br>\nhas been proved conservative informally by me and formally in HOL4 by Ramana Kumar,<br>\nMagnus Myreen and Scott Owens  (see their and my papers in ITP 2014 and/or JAR 56(3)).<br>\ngen_new_specification is implemented (to my knowledge) in HOL4, ProofPower and OpenTheory.</p>\n<p>Regards,</p>\n<p>Rob.</p>",
        "id": 294694552,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661177996
    },
    {
        "content": "<p>From: Ondřej Kunčar &lt;<a href=\"mailto:kuncar@in.tum.de\">kuncar@in.tum.de</a>&gt;<br>\nHi Rob,<br>\nyou are right that we mention only the plain definitions in HOL and not <br>\nthe implicit ones, when we compare the definitional mechanism of HOL and <br>\nIsabelle/HOL. (If this what you meant; I assume you didn't mean to say <br>\nthat the overloading in Isabelle is 25 years out of date).<br>\nI clearly remember that one of the early versions of our paper contained <br>\nthe comment that the current HOL provers use the more powerful mechanism <br>\nthat you mentioned but I guess that it was lost during later editing. We <br>\nwill include it again into the journal version of the paper.</p>\n<p>I wanted to comment on your statement that A. Pitts proved that <br>\ndefinitions in HOL are conservative. Such statements are always a little <br>\nbit puzzling to me because when you say conservative (without any <br>\nmodifier), I always think that you mean the notion that \"nothing new can <br>\nbe proved if you extend your theory (by a definition)\". I think a lot of <br>\npeople (including me) think that this is THE conservativity. There is <br>\nalso a notion of the model-theoretic conservativity that requires that <br>\nevery model of the old theory can be expanded to a model of the new <br>\ntheory. This is a stronger notion and implies the proof conservativity.</p>\n<p>As far as I know, A. Pitts considers only a subset of all possible <br>\nmodels (so called standard models) in his proof and he only proves that <br>\nthese models can be extended from the old to the new theory. But as far <br>\nas I know this does not imply the proof conservativity.</p>\n<p>Best,<br>\nOndrej</p>",
        "id": 294694621,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661178017
    }
]