[
    {
        "content": "<p>From: Christian Urban &lt;<a href=\"mailto:urbanc@in.tum.de\">urbanc@in.tum.de</a>&gt;<br>\nApologies for multiple postings. Please bring this announcement <br>\nto the attention of anyone who might be interested.</p>\n<p>Postdoctoral researcher in the <br>\n             Nominal Methods Group at the TU Munich</p>\n<p>We have an open position for a postdoctoral researcher in the<br>\nnewly formed nominal methods group at the TU Munich. The research<br>\nof our group is centered around the nominal datatype package. This <br>\npackage pushes the state of the art of formalising programming <br>\nlanguages and solving POPLmark-like problems without having to <br>\nresort to using de-Bruijn indices and higher-order abstract syntax.<br>\nMore information about the group can be found under</p>\n<p><a href=\"http://www4.in.tum.de/~urbanc/Nominal/\">http://www4.in.tum.de/~urbanc/Nominal/</a></p>\n<p>The work we are interested in is both theoretical and practical,<br>\nin the sense of implementing the tools we design. An ideal candidate <br>\nfor the position has therefore experience with formalisations and <br>\ntheorem provers as well as with functional programming. The research <br>\nthemes for the position are broad including developing novel features<br>\nof Isabelle, advancing the nominal logic theory and conducting <br>\ncase-studies using our tools. </p>\n<p>We offer an active and friendly research environment in the Isabelle<br>\ngroup in Munich. We have close ties with many international researchers<br>\nworking on the POPLmark Challenge. Munich is Germany's most attractive <br>\ncity - the Alps are very close and local beer and merrymaking are not <br>\nfrowned upon in Bavaria.</p>\n<p>The appointment is for two years initially with possible extensions. <br>\nThe position is open from September 2006, but slightly earlier or <br>\nlater starting dates can also be considered. Remuneration will be <br>\nin accordance with the German Scale BAT-IIa for researchers. The<br>\nsalary depends on age and family circumstances; typical numbers<br>\nare 2980 Euros per month for a single 25 year old rising to 3200<br>\nEuros per month for a single 30 year old.</p>\n<p>Informal inquiries about the position may be send to <a href=\"mailto:urbanc@in.tum.de\">urbanc@in.tum.de</a>.<br>\nSend applications no later than 26th of May 2006. To apply send your <br>\napplication (preferably electronically) including a CV, publication <br>\nlist, contact details of 2 referees and a statement of research to</p>\n<p><a href=\"mailto:urbanc@in.tum.de\">urbanc@in.tum.de</a>       or        Dr Christian Urban <br>\n                                 Institute for Computer Science I4<br>\n                                 TU Munich, <br>\n                                 Boltzmannstr. 3, <br>\n                                 D-85748 Garching, <br>\n                                 Germany.</p>",
        "id": 293905225,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660745755
    }
]