[
    {
        "content": "<p>From: Gerwin Klein &lt;<a href=\"mailto:gerwin.klein@nicta.com.au\">gerwin.klein@nicta.com.au</a>&gt;<br>\nThe deadline is drawing closer!</p>\n<p>2nd Call for Papers</p>\n<p>Special Issue On Operating Systems Verification</p>\n<p>Journal of Automated Reasoning</p>\n<p>Industrial-strength software analysis and verification has advanced in recent<br>\nyears through the introduction of model checking, automated and interactive<br>\ntheorem proving, static analysis techniques, as well as correctness by<br>\ndesign. However, many techniques are working under restrictive assumptions<br>\nwhich are invalidated by complex (embedded) system software such as operating<br>\nsystem kernels, low-level device drivers or microcontroller code.</p>\n<p>This special issue will be devoted to the formal verification of operating<br>\nsystems and similar low-level systems code. The emphasis is on techniques and<br>\nmethods that provide real solutions to real software problems. A real<br>\nsolution is one that is applicable to the problem in industry and not one<br>\nthat only applies to an abstract, academic toy version of it. Submissions are<br>\nencouraged, but not limited to, the following topics and their application to<br>\noperating systems or low-level systems code:</p>\n<p>* model checking<br>\n     * automated and interactive theorem proving<br>\n     * embedded systems development<br>\n     * programming languages<br>\n     * verifying compilers<br>\n     * software certification</p>\n<p>Manuscripts should be unpublished works and not submitted elsewhere. Revised<br>\nand enhanced versions of papers published in conference proceedings that have<br>\nnot appeared in archival journals are eligible for submission. All<br>\nsubmissions will be reviewed according to the usual standards of scholarship<br>\nand originality.</p>\n<p>Papers should be in pdf format, following the JAR guidelines for authors, and<br>\nbe submitted via EasyChair at:<br>\n<a href=\"http://www.easychair.org/conferences/?conf=jarosv08\">http://www.easychair.org/conferences/?conf=jarosv08</a></p>\n<p>Please do not use the Springer online submission system for the special issue<br>\nat this stage, but EasyChair instead. To encourage a speedy review cycle, it<br>\nwill be expected that authors of submissions also serve as referees.</p>\n<p>For more information, please see<br>\n<a href=\"http://www.cse.unsw.edu.au/~kleing/JAR-OSV-08/\">http://www.cse.unsw.edu.au/~kleing/JAR-OSV-08/</a></p>\n<p>Guest Editors<br>\nGerwin Klein, NICTA, Australia, gerwin.klein at <a href=\"http://nicta.com.au\">nicta.com.au</a><br>\nRalf Huuck, NICTA, Australia, ralf.huuck at <a href=\"http://nicta.com.au\">nicta.com.au</a><br>\nBastian Schlich, RWTH Aachen, Germany, schlich at <a href=\"http://cs.rwth-aachen.de\">cs.rwth-aachen.de</a></p>\n<p>Important Dates<br>\nSep 15 2008    Submission Deadline<br>\nDec 15 2008    Notification of accepted papers<br>\nJan 15 2009    Final version</p>",
        "id": 294065099,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660825188
    }
]