[
    {
        "content": "<p>From: Daniel Le Métayer &lt;<a href=\"mailto:daniel.le-metayer@inria.fr\">daniel.le-metayer@inria.fr</a>&gt;<br>\nPrivacy by Design: from Theory to Practice (Postdoc Position at Inria in Lyon) <br>\nPrivacy by design (PbD) is often held up as a necessary step to improve privacy protection in the digital society. It will even become a legal obligation in the European Community if the current draft of the Data Protection Regulation eventually gets adopted. A range of privacy enhancing technologies (PETs) are now available, which can provide strong privacy guarantees in a variety of contexts. But PbD is more than the use of privacy enhancing technologies: it relies on the idea that privacy requirements should be taken into account in the early stages of the design of a system and can have a potential impact on its overall architecture. In other words, privacy by design represents a paradigm shift: prevent rather than cure and it should be supported by suitable design and development methodologies. </p>\n<p>The main goal of the postdoc will be to study formal methods for PbD and contribute to the definition of appropriate design and development methodologies for PbD based on formal models. </p>\n<p>The postdoc will take place in the Inria PRIVATICS team in Lyon in the context of a European project on privacy by design. <br>\nLyon is the second urban area in France. It is close to the French Alps and two hours or less (in TGV) from Paris, Geneva, Turin and the Mediterranean coast. The city has developed a reputation as the capital of gastronomy; it is known for its rich cultural life, its historical and architectural landmarks and is a UNESCO World Heritage Site. </p>\n<p><a href=\"https://team.inria.fr/privatics/\">https://team.inria.fr/privatics/</a> <br>\n<a href=\"https://site.inria.fr/cappris_institutionnel/\">https://site.inria.fr/cappris_institutionnel/</a> <br>\n<a href=\"http://www.lyon.fr/page/websites-in-english-about-lyon-france.html\">http://www.lyon.fr/page/websites-in-english-about-lyon-france.html</a> </p>\n<p>The position is initially offered for a period of one or two years. Applications will be accepted until the position has been filled. </p>\n<p>Applications have to be sent to : daniel.le-metayer at <a href=\"http://inria.fr\">inria.fr</a>.</p>",
        "id": 294261466,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660914542
    }
]