[
    {
        "content": "<p>From: Lutz Schroeder &lt;<a href=\"mailto:Lutz.Schroeder@dfki.de\">Lutz.Schroeder@dfki.de</a>&gt;<br>\n[Thanks for circulating the CfP below]</p>\n<p>OSEMA 2011 Call for Papers</p>\n<p>1st International Workshop on Ontology and Semantic web for<br>\nManufacturing  (OSEMA 2011)<br>\n<a href=\"http://www.osema.org.ve/\">http://www.osema.org.ve/</a><br>\nat the 8th Extended Semantic Web Conference (ESWC 2011)<br>\n<a href=\"http://www.eswc2011.org\">http://www.eswc2011.org</a><br>\nMay 29th or 30th, Hersonissos, Crete, Greece</p>\n<p>SUBMISSION DEADLINE February 25</p>\n<p>The necessity of continuous innovation and improvement in productivity<br>\npresents the manufacturing industry with huge challenges. Not only is<br>\nthere a demand for more creative designs, there is also the need to<br>\nimprove support for streaming designs into production lines. Delivering<br>\nproducts to the market involves the flow of information between several<br>\nsteps ranging from design to prototyping, manufacturing and<br>\ndistributing.  Interoperability across software supporting these<br>\nactivities is notoriously limited.</p>\n<p>A semantic layer in the manufacturing sector may facilitate scenarios<br>\nsuch as the development of new products considering restrictions and<br>\nlimitations of the manufacturing facility on the one hand and on the<br>\nother hand considering customer needs. Here, the design of  new the<br>\nproduct is instantiated into a product ontology. This ontology has<br>\nmetadata including features related to materials, colors, dimensions,<br>\netc. Such features reflect customer preferences, but imply the necessity<br>\nof processes to acquire and manage them. In a second step into this<br>\nscenario, the ontology of the manufacturing process can be instantiated<br>\nby extracting features from the product ontology, thus enabling e.g. the<br>\nautomatic inference of manufacturability of the product.</p>\n<p>In this vein, ontologies and the Semantic Web facilitate the creation of<br>\nsuch metadata and enable reasoning over product and process restriction.<br>\nAlthough several approaches of this kind have been proposed, none of<br>\nthem are widely accepted so far, which means that there are still<br>\nseveral issues requiring extensive discussion and consensus in the<br>\ncommunity. Therefore, it is necessary to provide a discussion scenario<br>\nwhere theoretical positions, best practices, implementations, proposals<br>\nof standards, and frameworks are presented. It will deserve special<br>\ninterest to discuss how the manufacturing industry can take advantage of<br>\nSemantic Web technologies. OSEMA 2011 aims to provide such scenario.</p>\n<p>QUESTIONS AND TOPICS OF INTEREST</p>\n<ul>\n<li>\n<p>How can the Semantic Web support the development of new products?</p>\n</li>\n<li>\n<p>Why CAD ontologies? Do we really need them?</p>\n</li>\n<li>\n<p>Do we need one enterprise ontology, or a modular enterprise ontology?</p>\n</li>\n<li>\n<p>Can OWL be used to represent processes in the manufacturing domain?</p>\n</li>\n<li>\n<p>Knowledge management over the manufacturing “Know how”.</p>\n</li>\n<li>\n<p>How can the versioning of products be managed? Can ontology help? How?</p>\n</li>\n<li>\n<p>How can raw materials be semantically described?</p>\n</li>\n<li>\n<p>Can there be an ontological framework for manufacturing so that<br>\ndesigns and production are interoperable?</p>\n</li>\n<li>\n<p>Semantic search over the manufacturing information space</p>\n</li>\n<li>\n<p>How can tagging techniques be applied within the manufacturing domain?</p>\n</li>\n</ul>\n<p>AUDIENCE</p>\n<p>We want to bring together researchers and practitioners active in the<br>\ndesign, development, and application of ontologies and the Semantic Web<br>\nin the manufacturing domain, as well as industrial representatives in<br>\nComputer Aided Design (CAD), Computer Aided Process Planning (CAPP), and<br>\nComputer Aided Manufacturing (CAM) industry who are interested in<br>\nintegrating the Product Life Cycle management into their software tools.</p>\n<p>IMPORTANT DATES</p>\n<p>Submission deadline:     February 25, 2011<br>\nAcceptance notification: April 1, 2011<br>\nCamera-ready:            April 15, 2011<br>\nWorkshop date:           May 29 or 30, 2011</p>\n<p>SUBMISSION AND PROCEEDINGS</p>\n<p>Only electronic submissions will be considered. All submissions should<br>\nbe submitted in pdf format, to</p>\n<p><a href=\"https://www.easychair.org/conferences/?conf=osema2011\">https://www.easychair.org/conferences/?conf=osema2011</a></p>\n<p>Submissions should not exceed 14 pages and should be formatted according<br>\nto the LNCS Springer format<br>\n(<a href=\"http://www.springer.com/east/home/computer/lncs?SGWID=5-164-7-72376-0\">http://www.springer.com/east/home/computer/lncs?SGWID=5-164-7-72376-0</a>).<br>\nThe workshop proceedings will both be uploaded to CEUR<br>\n(<a href=\"http://ceur-ws.org/\">http://ceur-ws.org/</a>) and placed on electronic media for distribution at<br>\nthe conference.</p>\n<p>PROGRAM COMMITTEE</p>\n<ol>\n<li>\n<p>Aristeidis Matsokis, Laboratory for Computer Aided Design and<br>\nProduction, Switzerland.</p>\n</li>\n<li>\n<p>Aziz Bouras, University Claude Bernard Lyon II, France.</p>\n</li>\n<li>David Baxter, University of Cranfield, England</li>\n<li>Dong Yang, Shanghai jiao Tong University, China.</li>\n<li>Grubic Tonci, University of Cranfield, England.</li>\n<li>John Bateman, University of Bremen, Germany.</li>\n<li>Jürgen Angele, Ontoprise, Germany.</li>\n<li>Kristina Shea, Technische Universität München, Germany.</li>\n<li>Oliver Eck, Department of Computer Science, HTWG Konstanz, Germany.</li>\n<li>Parisa Ghoudous, University Claude Bernard Lyon I, France.</li>\n<li>Richard Gil Herrera, University Simón Bolivar. Venezuela.</li>\n<li>Sylvere Krima, National Institute of Standards and Technology<br>\n(NIST), USA.</li>\n<li>Yuh-Jen Chen, National Kaohsiung First University of Science and<br>\nTechnology, Taiwan.</li>\n</ol>\n<p>ORGANIZING COMMITTEE</p>\n<ul>\n<li>\n<p>Alexander García Castro, University of Bremen, Germany/University of<br>\nArkansas, USA. Email: <a href=\"mailto:alexgarciac@gmail.com\">alexgarciac@gmail.com</a></p>\n</li>\n<li>\n<p>Lutz Schröder, German Research Center for Artificial Intelligence<br>\n(DFKI). Email: <a href=\"mailto:Lutz.Schroeder@dfki.de\">Lutz.Schroeder@dfki.de</a></p>\n</li>\n<li>\n<p>Carlos Toro, Vicomtech Research Centre / Donostia-San Sebastían,<br>\nSpain. Email: <a href=\"mailto:ctoro@vicomtech.org\">ctoro@vicomtech.org</a></p>\n</li>\n<li>\n<p>Luis Enrique Ramos García, University of Bremen, Germany. Email:<br>\n<a href=\"mailto:s_7dns7r@uni-bremen.de\">s_7dns7r@uni-bremen.de</a></p>\n</li>\n</ul>",
        "id": 294128984,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660842161
    }
]