[
    {
        "content": "<p>From: Lawrence Paulson &lt;<a href=\"mailto:lp15@cam.ac.uk\">lp15@cam.ac.uk</a>&gt;<br>\nNew AFP entries are available from <a href=\"http://afp.sf.net\">http://afp.sf.net</a></p>\n<p>FocusStreamsCaseStudies<br>\nMaria Spichkova</p>\n<p>An Isabelle/HOL formalisation of stream processing components introduced in Focus, a framework for formal specification and development of interactive systems. This is an extended and updated version of the formalisation, which was elaborated within the methodology \"Focus on Isabelle\". In addition, we also applied the formalisation on three case studies that cover different application areas: process control (Steam Boiler System), data transmission (FlexRay communication protocol), memory and processing components (Automotive-Gateway System).</p>\n<p>GoedelGod<br>\nChristoph Benzmüller</p>\n<p>Dana Scott's version of Gödel's proof of God's existence is formalized in quantified modal logic KB (QML KB). QML KB is modeled as a fragment of classical higher-order logic (HOL); thus, the formalization is essentially a formalization in HOL.</p>\n<p>Larry Paulson</p>",
        "id": 294255452,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660912428
    },
    {
        "content": "<p>From: Lawrence Paulson &lt;<a href=\"mailto:lp15@cam.ac.uk\">lp15@cam.ac.uk</a>&gt;<br>\nI am happy to announce two new developments in the AFP. The first is a package for applicative functors, and the second uses that package to formalise the Stern-Brocot tree, which contains all rational numbers exactly once and in their lowest terms.  </p>\n<p><a href=\"http://afp.sourceforge.net/entries/Applicative_Lifting.shtml\">http://afp.sourceforge.net/entries/Applicative_Lifting.shtml</a><br>\n<a href=\"http://afp.sourceforge.net/entries/Stern_Brocot.shtml\">http://afp.sourceforge.net/entries/Stern_Brocot.shtml</a></p>\n<p>Many thanks to the authors for their contributions!</p>\n<p>Larry Paulson</p>",
        "id": 294661033,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661169914
    }
]