[
    {
        "content": "<p>From: Stephan Merz &lt;<a href=\"mailto:Stephan.Merz@loria.fr\">Stephan.Merz@loria.fr</a>&gt;<br>\nSummer School on Verification Technology, Systems &amp; Applications<br>\n<a href=\"http://www.mpi-inf.mpg.de/VTSA11/\">http://www.mpi-inf.mpg.de/VTSA11/</a></p>\n<p>A summer school on verification technology, systems and applications will be organized by the University of Liège, in cooperation with the Interdisciplinary Centre for Security, Reliability and Trust at the University of Luxembourg, Max-Planck Institute für Informatik in Saarbrücken and the INRIA research center in Nancy. The school will take place from September 19th to 23rd 2011 at the Montefiore Institute in Liège.</p>\n<p>The following speakers have accepted to give courses:</p>\n<ul>\n<li>\n<p>Alessandro Armando: The Rewriting Approach to Decision Procedures, Automatic Symbolic Analysis of Access Control Policies</p>\n</li>\n<li>\n<p>Franz Baader: Reasoning in Description Logics</p>\n</li>\n<li>\n<p>Bruno Blanchet: Automatic Verification of Security Protocols:  the verifier ProVerif</p>\n</li>\n<li>\n<p>Florent Jacquemard: Tree Automata Techniques for the Verification of Infinite-State Systems</p>\n</li>\n<li>\n<p>Joost-Pieter Katoen: Verification and Abstraction of Continuous-Time Markov Models</p>\n</li>\n</ul>\n<p>Participation is free (except for travel and accommodation costs) and open to anybody holding at least a Bachelor degree (or equivalent) in computer science. The number of participants is limited. Please apply electronically by <em>July 22th, 2010</em> by sending</p>\n<ul>\n<li>a one-page CV,</li>\n<li>an application letter explaining your interest in the school and your experience in the area,</li>\n<li>a copy of your bachelor certificate (or equivalent or higher)</li>\n</ul>\n<p>to <a href=\"mailto:vtsa11@montefiore.ulg.ac.be\">vtsa11@montefiore.ulg.ac.be</a></p>\n<p>For details please see the Web page of the school.</p>",
        "id": 294140616,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660845697
    }
]