[
    {
        "content": "<p>From: Gudmund Grov &lt;<a href=\"mailto:ggrov@staffmail.ed.ac.uk\">ggrov@staffmail.ed.ac.uk</a>&gt;<br>\n(Apologies if you receive multiple copies of this announcement)</p>\n<hr>\n<p><strong>* First Call for Participation </strong>*</p>\n<p>Third International Conference on Verified Software:<br>\n            Theories, Tools, and Experiments</p>\n<p>Edinburgh, Scotland</p>\n<p>August 16th-19th, 2010</p>\n<p><a href=\"http://www.macs.hw.ac.uk/vstte10\">http://www.macs.hw.ac.uk/vstte10</a></p>\n<p>SPONSORS: NSF, EPSRC, Microsoft Research, SICSA, Altran Praxis,<br>\n        SSEI, FME, Contemplate, Heriot-Watt University</p>\n<hr>\n<p>The Third International Conference on Verified Software: Theories,<br>\nTools, and Experiments follows a successful inaugural working<br>\nconference at Zurich (2005) and a successful conference in Toronto<br>\n(2008). This conference is part of the Verified Software Initiative<br>\n(VSI), a fifteen-year, cooperative, international project directed<br>\nat the scientific challenges of large-scale software verification.<br>\nVSI also includes UKCRC's Grand Challenge 6, i.e. Dependable Systems<br>\nEvolution. </p>\n<p>PROGRAMME <br>\nThe programme includes keynote presentations by Tom Ball (Microsoft),<br>\nGerwin Klein (National ICT Australia), Matthew Parkinson (University of<br>\nCambridge). There will also be a Summer School, Invited Tool Demo Presentations, a <br>\nVerification Competition, Industrial Tool Vendors as wells as two workshops:<br>\nTheory WS and Tools &amp; Experiments WS. A provisional programme is available at</p>\n<p><a href=\"http://www.macs.hw.ac.uk/vstte10/Programme.html\">http://www.macs.hw.ac.uk/vstte10/Programme.html</a></p>\n<p>VENUE<br>\nVSTTE 2010 is being hosted by Heriot-Watt University in Edinburgh.<br>\nThe conference dates coincide with the 2010 Edinburgh International<br>\nFestival and the Edinburgh Festival Fringe -- collectively the<br>\nlargest annual arts festival on the planet! The technical programme<br>\nwill take place in the Edinburgh Conference Centre (Heriot-Watt University <br>\ncampus), where accommodation will be available at very competitive rates for<br>\nfestival time. Social events will be arranged within the city centre,<br>\nmaking VSTTE an unique cultural and scholarly event for 2010!</p>\n<p>SOCIAL EVENTS<br>\nAs well as a welcome reception and conference banquet, SICSA are<br>\nsponsoring a special drinks reception in the Informatics Forum <br>\nat the heart of the Festival on August 17th. </p>\n<p>STUDENT SUPPORT<br>\nLimited support for students wishing to attend VSTTE 2010 is available. <br>\nPlease contact <a href=\"mailto:vstte10@macs.hw.ac.uk\">vstte10@macs.hw.ac.uk</a> for more details. </p>\n<p>REGISTRATION<br>\nOnline registration is available from</p>\n<p><a href=\"http://www.macs.hw.ac.uk/vstte10_reg/Registration.php\">http://www.macs.hw.ac.uk/vstte10_reg/Registration.php</a></p>\n<p>Early registration ends on July 31st.</p>",
        "id": 294111747,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660837061
    }
]