[
    {
        "content": "<p>From: Gerwin Klein &lt;<a href=\"mailto:Gerwin.Klein@nicta.com.au\">Gerwin.Klein@nicta.com.au</a>&gt;<br>\nWe are please to announce the availability of 3 new AFP entries at [http://afp.sf.net]. </p>\n<p>This brings the number of AFP entries over 100!</p>\n<ol>\n<li>Lattice Properties by Viorel Preoteasa</li>\n</ol>\n<p>This formalization introduces and collects some algebraic structures based on lattices and complete lattices for use in other developments. The structures introduced are complete distributive lattices, modular and distributive lattices, as well as lattice ordered groups. In addition to the results proved for the new lattices, this formalization also introduces theorems about latices and distributive lattices in general.</p>\n<ol start=\"2\">\n<li>Algebra of Monotonic Boolean Transformers by Viorel Preoteasa</li>\n</ol>\n<p>Algebras of imperative programming languages have been successful in reasoning about programs. In general an algebra of programs is an algebraic structure with programs as elements and with program compositions (sequential composition, choice, skip) as algebra operations. Various versions of these algebras were introduced to model partial correctness, total correctness, refinement, demonic choice, and other aspects. We formalize here an algebra which can be used to model total correctness, refinement, demonic and angelic choice. The basic model of this algebra are monotonic Boolean transformers (monotonic functions from a Boolean algebra to itself).</p>\n<ol start=\"3\">\n<li>Pseudo Hoops by George Georgescu, Laurentiu Leustean and Viorel Preoteasa</li>\n</ol>\n<p>Pseudo-hoops are algebraic structures introduced by B. Bosbach under the name of complementary semigroups. In this formalization we prove some properties of pseudo-hoops and we define the basic concepts of filter and normal filter. The lattice of normal filters is isomorphic with the lattice of congruences of a pseudo-hoop. We also study some important classes of pseudo-hoops. Bounded Wajsberg pseudo-hoops are equivalent to pseudo-Wajsberg algebras and bounded basic pseudo-hoops are equiv- alent to pseudo-BL algebras. Some examples of pseudo-hoops are given in the last section of the formalization.</p>\n<p>Cheers,<br>\nGerwin</p>",
        "id": 294145160,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660847217
    },
    {
        "content": "<p>From: Victor Porton &lt;<a href=\"mailto:porton@narod.ru\">porton@narod.ru</a>&gt;<br>\nWhat's about formalizing in Isabelle the concept of dual lattices using locales? ( I haven’t found the word :\"dual\" in Lattice_Infix.)</p>\n<p>I noted previously that to do this one need the ability to define locales inside locales, and Isabelle misses this.</p>\n<p>Will this every be done?</p>",
        "id": 294145199,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660847234
    },
    {
        "content": "<p>From: Viorel Preoteasa &lt;<a href=\"mailto:viorel.preoteasa@abo.fi\">viorel.preoteasa@abo.fi</a>&gt;<br>\nHello Victor,</p>\n<p>The class lattice_infix is just a wrapper around the lattice class from<br>\nthe standard Isabelle library. I added this class just as a work around<br>\nfor some feature that I could not get directly from the library.</p>\n<p>However lattice_infix will become obsolete with the next release of<br>\nIsabelle which adds support for the features built in lattice_infix.</p>\n<p>Best regards,</p>\n<p>Viorel</p>",
        "id": 294145384,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660847292
    }
]