[
    {
        "content": "<p>From: Joao Marcos &lt;<a href=\"mailto:botocudo@gmail.com\">botocudo@gmail.com</a>&gt;<br>\n(with apologies for multiple postings)</p>\n<p>TABLEAUX, FroCoS, ITP<br>\nCALL FOR WORKSHOPS AND TUTORIALS</p>\n<p>Three of the main conferences on automated reasoning -- TABLEAUX, FroCoS, and<br>\nITP - will be held in Brasilia, Brazil, between 25 and 29 September 2017.<br>\nFollowing the long tradition of those events, we invite researchers and<br>\npractitioners to submit proposals for co-located workshops and in-depth<br>\ntutorials on topics relating to automated theorem proving and its applications.<br>\nWorkshops/tutorials can target the automated reasoning community in general,<br>\nfocus on a particular theorem proving system, or highlight more specific<br>\nissues or recent developments.</p>\n<p>Co-located events will take place between 23 and 24/25 September and will be<br>\nheld on the same premises as the main conference. Conference facilities are<br>\noffered free of charge to the organisers. Workshop/tutorial-only attendees<br>\nwill enjoy a significantly reduced registration fee.</p>\n<p>Detailed organisational matters such as paper submission and review process,<br>\nor publication of proceedings, are up to the organisers of individual<br>\nworkshops. All accepted workshops/tutorials will be expected to have their<br>\nprogram ready by 18 August 2017.</p>\n<p>Proposals for workshops/tutorials should contain at least the following pieces<br>\nof information:</p>\n<p>- name and contact details of the main organiser(s)<br>\n    - (if applicable:) names of additional organisers<br>\n    - title and organisational style of event (tutorial, public workshop,<br>\n      project workshop, etc.)</p>\n<p>- preferred length of workshop (between half day and two days)<br>\n    - estimated number of attendees<br>\n    - short (up to one page) description of topic<br>\n    - (if applicable:) pointers to previous editions of the workshop, or to<br>\n      similar events</p>\n<p>Proposals are invited to be submitted by email to <a href=\"mailto:nalon@unb.br\">nalon@unb.br</a>, no later than<br>\n9 December 2016. Selected events will be notified by 23 December 2016. The<br>\nworkshop/tutorial selection committee consists of the TABLEAUX, FroCoS, and<br>\nITP program chairs and the conference organisers.</p>",
        "id": 294682452,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661177178
    }
]