[
    {
        "content": "<p>From: Gudmund Grov &lt;<a href=\"mailto:ggrov@staffmail.ed.ac.uk\">ggrov@staffmail.ed.ac.uk</a>&gt;<br>\n------ Apologies for multiple copies ------</p>\n<p>VSTTE 2010: Workshops on Theories, Tools and Experiments<br>\n            Edinburgh, Scotland, 19th August 2010</p>\n<p>The Third International Conference on Verified Software: Theories,<br>\nTools, and Experiments (VSTTE) is part of the Verified Software<br>\nInitiative (VSI), a fifteen-year, cooperative, international project<br>\ndirected at the scientific challenges of large-scale software<br>\nverification. VSTTE will host two workshops:</p>\n<ul>\n<li>\n<p>VS-Theory focuses on theoretical foundations of software<br>\n  verification.  Topics range from the difficult and essential study<br>\n  of soundness of delicate proof methods, to the discovery of new<br>\n  specification techniques and proof methods, to dramatic<br>\n  simplification or unification of existing methods, to as yet<br>\n  unknown breakthroughs.</p>\n</li>\n<li>\n<p>VS-Tools &amp; Experiments focuses on the development of verification<br>\n  tools and their experimental evaluation. Topics include interfaces<br>\n  between tools, tool integration platforms, and case studies.</p>\n</li>\n</ul>\n<p>The workshops will provide a forum to present new, possibly unfinished<br>\nwork and will also give the opportunity to propose research<br>\nchallenges, which will help form a research agenda for the Verified<br>\nSoftware Initiative. For further details, see the workshop web site:<br>\n<a href=\"http://www.macs.hw.ac.uk/vstte10/Workshops.html\">http://www.macs.hw.ac.uk/vstte10/Workshops.html</a></p>\n<p>Submissions <br>\nPapers must be written in English using Springer LNCS style. The<br>\npage limit is 10 pages for technical papers and 5 pages for<br>\nproposals of verification challenges.  The proceedings will be<br>\npublished as a technical report. Details on the submission process<br>\nare available at <a href=\"http://www.macs.hw.ac.uk/vstte10/Workshops.html\">http://www.macs.hw.ac.uk/vstte10/Workshops.html</a>.</p>\n<p>Important Dates<br>\nSubmission:    May 21, 2010<br>\nNotification:  June 25, 2010<br>\nFinal version: July 23, 2010<br>\nWorkshops:     August 19, 2010, 9am-1pm</p>\n<p>Chairs</p>\n<ul>\n<li>\n<p>VS-Theory is co-chaired by <br>\n    David Naumann, Stevens Institute of Technology, USA and<br>\n    Hongseok Yang, Queen Mary, University of London, UK</p>\n</li>\n<li>\n<p>VS-Tools &amp; Experiments is co-chaired by <br>\n    Tiziana Margaria, University of Potsdam, Germany and <br>\n    Rajeev Joshi, NASA/JPL Laboratory for Reliable Software, USA</p>\n</li>\n</ul>",
        "id": 294105901,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660835188
    }
]