[
    {
        "content": "<p>From: Walther Neuper &lt;<a href=\"mailto:wneuper@ist.tugraz.at\">wneuper@ist.tugraz.at</a>&gt;<br>\nCICM closed the general call, but this is still open ...<br>\n=======================================================================<br>\n            Call for Extended Abstracts &amp; Demonstrations</p>\n<hr>\n<p>ThEdu'16<br>\n         Theorem Prover Components for Educational Software<br>\n<a href=\"http://www.uc.pt/en/congressos/thedu/thedu16\">http://www.uc.pt/en/congressos/thedu/thedu16</a></p>\n<hr>\n<p>at CICM 2016<br>\n          Conferences on Intelligent Computer Mathematics<br>\n               July 25-29, 2016, Bialystok, Poland<br>\n<a href=\"http://www.cicm-conference.org/2016\">http://www.cicm-conference.org/2016</a></p>\n<hr>\n<p>THedu'16 Scope:</p>\n<p>Educational software tools have technologies integrated from CAS, from<br>\nDGS, from Spreadsheets and others, but not from (Computer) Theorem<br>\nProvers (TPs) with few exceptions: the latter have been developed to<br>\nmodel mathematical reasoning in software -- rigorous reasoning as a<br>\ncompanion of calculating, which guarantees the unsurpassed reliability<br>\nof mathematics. Providing students with insight in and experience with<br>\nthis kind of reliability is considered an essential aim of mathematics<br>\neducation.</p>\n<p>TPs intrude into science as well as into industry: They are used to<br>\ntackle difficult proofs in the science of mathematics, like the Four<br>\nColor Theorem or the Kepler Conjecture. In industry TPs are successfully<br>\nused to verify safety critical software. This workshop addresses a<br>\nwindow of opportunity during the still open development of TPs.</p>\n<p>The workshop provides a meeting place for educators and developers of<br>\neducational mathematics software and experts in TP. The discussions<br>\nshall clarify the requirements of education, identify advantages and<br>\npromises of TP for learning and motivate development of such a novel<br>\nkind of educational mathematical tools.</p>\n<p>Important Dates</p>\n<p>* Extended Abstracts:    4. June 2016<br>\n    * Author Notification:  18. June 2016     * Final Version:</p>\n<ol start=\"2\">\n<li>July 2016<p>* Workshop Day:         25-29. July 2016</p>\n</li>\n</ol>\n<p>Points of interest include:</p>\n<p>* Adaption of TP -- concepts and technologies for education: knowledge<br>\n    representation, simplifiers, reasoners; undefinednes, level of<br>\n    abstraction, etc.</p>\n<p>* Requirements on software support for reasoning -- reasoning appears<br>\n    as the most advanced method of human thought, so at which age<br>\n    which kind of support TP should be provided?</p>\n<p>* Automated TP in geometry -- relating intuitive evidence with logical<br>\n    rigor: specific provers, adaption of axioms and theorems, visual<br>\n    proofs, etc.</p>\n<p>* Application of TP components in SW for engineers -- Formal Methods<br>\n    increasingly advance into engineering practice, so educational<br>\n    software based on TP components could anticipate that advancement.</p>\n<p>* Levels of authoring -- in order to cope with generality of TP:<br>\n    experts adapt to specifics of countries or levels, teachers adapt<br>\n    to courses and students.</p>\n<p>* Adaptive modules, students modeling and learning paths -- services<br>\n    for user guidance provided by TP technology: which interfaces<br>\n    enable flexible generation of adaptive user guidance?</p>\n<p>* Next-step-guidance -- suggesting a next step when a student gets<br>\n    stuck in problem solving: which computational methods can extend<br>\n    TP for that purpose?</p>\n<p>* TP as unifying foundation -- for the integration of technologies<br>\n like CAS, DGS, Spreadsheets etc: interfaces for unified support of<br>\n    reasoning?</p>\n<p>* Continuous tool chains -- for mathematics education from high-school<br>\n    to university, from algebra and geometry to graph theory etc.</p>\n<p>Submission</p>\n<p>We welcome submission of extended abstracts and demonstration<br>\n  proposals presenting original unpublished work which is not been<br>\n  submitted for publication elsewhere.<br>\n    All accepted extended abstracts and demonstrations will be presented<br>\n  at the workshop. The extended abstracts will be made available<br>\n  online.<br>\n    Contributions should be submitted via THedu'16 easychair<br>\n<a href=\"https://www.easychair.org/conferences/?conf=thedu16\">https://www.easychair.org/conferences/?conf=thedu16</a>.<br>\n    Extended abstracts and demonstration proposals should be no more than<br>\n  4 pages in length and are to be submitted in PDF format. They must<br>\n  conform to the EPTCS style guidelines (<a href=\"http://style.eptcs.org/\">http://style.eptcs.org/</a>).<br>\n    At least one author of each accepted extended abstract/demonstration<br>\n  proposal is expected to attend THedu'15 and presents his/her extended<br>\n  abstract/demonstration. Joint publication in companion with other CICM<br>\n  events is under consideration (e.g. <a href=\"http://ceur-ws.org/\">http://ceur-ws.org/</a>).</p>\n<p>Program Committee</p>\n<p>Francisco Botana, University of Vigo at Pontevedra, Spain<br>\n    Roman Hašek, University of South Bohemia, Czech Republic<br>\n    Filip Maric, University of Belgrade, Serbia<br>\n    Walther Neuper, TUG University of Technology, Austria (co-chair)<br>\n    Pavel Pech, University of South Bohemia, Czech Republic<br>\n    Pedro Quaresma, University of Coimbra, Portugal (co-chair)<br>\n    Vanda Santos, CISUC, Portugal<br>\n    Wolfgang Schreiner, Johannes Kepler University, Austria<br>\n    Burkhart Wolff, University Paris-Sud, France</p>",
        "id": 294674053,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661174318
    }
]