[
    {
        "content": "<p>From: Tjark Weber &lt;<a href=\"mailto:webertj@in.tum.de\">webertj@in.tum.de</a>&gt;<br>\nDear Colleagues,</p>\n<p>Please bring this advert for PhD positions to the attention of<br>\npotential applicants.</p>\n<p>Potential applicants with an interest in theorem proving are welcome to<br>\ncontact me directly.</p>\n<p>Best,<br>\nTjark</p>\n<p>========== 8&lt; ==========</p>\n<p>Two Ph.D. positions in multicore computing at UPMARC (Uppsala<br>\nProgramming for Multicore Architectures Research Center) at Uppsala<br>\nUniversity</p>\n<p>Topics: Methods and tools for software development for multicore<br>\ncomputer systems within one or several of the following areas: computer<br>\narchitecture, computer networks, programming language technology,<br>\nreal-time and embedded systems, scientific computing, semantics,<br>\ntesting, verification.</p>\n<p>UPMARC has been formed to make a broad coordinated attack on the<br>\nchallenges of developing methods and tools to support development of<br>\nparallel software, and has been awarded a ten year Linnaeus grant from<br>\nthe Swedish Research Council, as a sign of scientific excellence. See<br>\n<a href=\"http://www.upmarc.se\">http://www.upmarc.se</a> for a list of senior researchers and current<br>\nresearch activities and projects at UPMARC.</p>\n<p>Application deadline: <strong>* May 6 </strong>*</p>\n<p>For more information about how to apply, consult the official<br>\nannouncement at<br>\n<a href=\"http://www.uu.se/jobb/phd-students/annonsvisning?languageId=1&amp;tarContentId=239195\">http://www.uu.se/jobb/phd-students/annonsvisning?languageId=1&amp;tarContentId=239195</a></p>\n<p>A PhD position requires a Master of Science in Computer Science,<br>\nComputer Engineering, or equivalent in a field which is relevant for<br>\nthe topic of the PhD thesis. The position is for a maximum of five<br>\nyears and includes departmental duties at a level of at most 20%<br>\n(typically teaching). The salary amounts currently to about 24.900 SEK<br>\nper month in the first year. Expected application content is described<br>\nin the announcement.</p>\n<p>The department is striving to achieve a more equal gender balance and<br>\nfemale candidates are particularly invited to apply.</p>\n<p>For more information, see <a href=\"http://www.upmarc.se\">http://www.upmarc.se</a> (UPMARC),<br>\n<a href=\"http://www.it.uu.se/\">http://www.it.uu.se/</a> (the department) or contact Prof. Bengt Jonsson,<br>\n<a href=\"mailto:bengt.jonsson@it.uu.se\">bengt.jonsson@it.uu.se</a>, or some other senior researcher in the UPMARC<br>\nconsortium.</p>",
        "id": 294239662,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660906408
    }
]