[
    {
        "content": "<p>From: Chantal Keller &lt;<a href=\"mailto:chantal.keller@wanadoo.fr\">chantal.keller@wanadoo.fr</a>&gt;</p>\n<hr>\n<p>Post-doctoral position in interactive theorem proving<br>\nComputational Logic Center<br>\nDepartment of Computer Science<br>\nThe University of Iowa</p>\n<hr>\n<p>Applications are invited for a post-doctoral research position in the <br>\nComputational Logic Center at the University of Iowa in the area of <br>\ninteractive theorem proving and verification.</p>\n<p>The position is funded by DARPA through the HACMS program. The work will <br>\nbe done in collaboration with researchers at New York University, the <br>\nUniversité Paris Sud and Princeton University. The main goal of the <br>\nproject is to increase the level of automation in the Coq proof <br>\nassistant by soundly integrating SMT solvers into it. Our immediate <br>\nemphasis is on supporting software verification efforts by other <br>\nresearch groups currently funded by HAMCS. However, we expect that the <br>\nresults of the integration will benefit Coq users in general.</p>\n<p>The ideal candidate will have a Ph.D. in Computer Science, general <br>\nknowledge of formal methods, and expertise in interactive theorem <br>\nproving in higher-order logics, with substantial experience in using <br>\nCoq, Isabelle, or similar tools. Candidates should demonstrate strong <br>\nprogramming and formal modeling skills. Previous experience in writing <br>\nCoq tactics and plug-ins is a considerable plus. Familiarity with SMT is <br>\nwelcome but not required.</p>\n<p>The position is a full time appointment that runs initially through <br>\nAugust 2016 and could be renewed for another year subject to <br>\nsatisfactory performance and continuous availability of funds. Review of <br>\napplications will begin immediately. The position will remain open until <br>\nfilled. The start date is negotiable, but ideally it should be as soon <br>\nas possible. The starting salary is $56,000 per year, plus health and <br>\nvacation benefits.</p>\n<p>Depending on the candidate's interests, there might be also be a <br>\npossibility to teach one course in the spring semester in the Computer <br>\nScience department as a visiting assistant professor. This is, however, <br>\na separate position that would entail a corresponding reduction of <br>\neffort for the postdoc appointment. It should be understood as an <br>\nopportunity, not as a requirement for the postdoc contract.</p>\n<p>Inquiries and applications should be sent via email to <br>\n<a href=\"mailto:cesare-tinelli@uiowa.edu\">cesare-tinelli@uiowa.edu</a> with \"Coq postdoc\" in the subject. When sending <br>\nan application please include your CV together with a brief description <br>\nof your research accomplishments and interests, including the names of <br>\nthree references.</p>\n<hr>\n<p>The Computational Logic Center at the University of Iowa is jointly <br>\nheaded by Professors Aaron Stump and Cesare Tinelli. In recent years, it <br>\nhas consisted on average of two faculty members, 3-5 postdocs, 6-7 PhD <br>\nstudents and a few master's and undergraduate students. Its work has <br>\nbeen funded by the AFRL, AFOSR, DARPA, NASA, NSF, Intel, Rockwell <br>\nCollins, and United Technologies.<br>\nIts main areas of research are automated deduction, satisfiability <br>\nmodulo theories, software verification, model checking, <br>\nverified-programming languages, and foundations of programming <br>\nlanguages. The center has a strong emphasis on theoretical foundations <br>\nbut is also known for a number of languages and tools co-developed with <br>\nexternal partners and used in academia and industry. These include the <br>\nSMT-LIB standard, the CVC3 and CVC4 SMT solvers, the Kind and Kind 2 <br>\nmodel checkers, the LFSC proof framework and checker, the Darwin theorem <br>\nprover, and the StarExec solver execution service.</p>",
        "id": 294651221,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661166169
    }
]