[
    {
        "content": "<p>From: Stefan Berghofer &lt;<a href=\"mailto:berghofe@in.tum.de\">berghofe@in.tum.de</a>&gt;<br>\nDear all,</p>\n<p>I recently came across a strange problem with case expressions involving the unit type.<br>\nTrying to prove something like</p>\n<p>lemma \"(case () of () =&gt; x) = x\"</p>\n<p>using \"apply simp\" causes the new goal</p>\n<p>\"(case ?M' of () =&gt; x) = x\"</p>\n<p>with a schematic variable to be generated, while \"apply auto\" just diverges. This slightly odd<br>\nbehaviour is caused by the rule old.unit.case_cong_weak, whose premise \"?M = ?M'\" is directly<br>\nsimplified to \"True\", rather than proved by reflexivity, which would eliminate the variable ?M'.<br>\nWould it make sense to remove this rule from the simpset?<br>\nOf course, the above example has been simplified a little. I actually noticed this problem when trying<br>\nto provide case syntax for record types, whose \"more\" fields usually contain the unit element.</p>\n<p>Greetings,<br>\nStefan</p>",
        "id": 294722115,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661185185
    },
    {
        "content": "<p>From: Stefan Berghofer &lt;<a href=\"mailto:berghofe@in.tum.de\">berghofe@in.tum.de</a>&gt;<br>\nHi Jasmin,</p>\n<p>thanks for your reply.</p>\n<p>On 11/03/2017 10:07 AM, Blanchette, J.C. wrote:</p>\n<blockquote>\n<blockquote>\n<p>Would it make sense to remove this rule from the simpset?</p>\n</blockquote>\n<p>You probably mean out of the \"cong\" set. By all means as far as I'm concerned.</p>\n<p>declare unit.case_cong_weak[cong del]</p>\n</blockquote>\n<p>Yes, that's exactly what I meant. Sorry for being a bit imprecise. Could you take care of this?<br>\nI am not that familiar with the setup of the new datatype package.</p>\n<blockquote>\n<p>(No need for the \"old.\" prefix; we're still in a transition phase but these will go away within a couple of releases.)</p>\n<p>We could also change \"ctr_sugar.ML\" so that it doesn't set the \"cong\" attribute for types that have a single nullary constructor, but it's probably overkill (and wouldn't catch all cardinality-1 cases).</p>\n</blockquote>\n<p>I agree. The above declare command should be completely sufficient.</p>\n<p>Greetings,<br>\nStefan</p>",
        "id": 294722654,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661185363
    }
]