[
    {
        "content": "<p>From: Felix Klaedtke &lt;<a href=\"mailto:felixkl@inf.ethz.ch\">felixkl@inf.ethz.ch</a>&gt;<br>\nOPEN POSITION AT ETH ZURICH<br>\n             Automata-based Verification of Hybrid Systems</p>\n<p>The research group headed by Prof. David Basin at the Swiss Federal<br>\nInstitute of Technology, Zurich (ETH Zurich), has an open position for<br>\na PhD student.  The position is part of a research project funded by<br>\nthe Swiss National Science Foundation.</p>\n<p>Our project will focus on methods and tools for the automatic<br>\nverification of hybrid systems using automata-based methods.</p>\n<p>We are looking for a dedicated and enthusiastic young researcher with<br>\na strong interest in formal methods and in combining aspects of both<br>\ntheory and practice.  Additionally, a strong background in at least<br>\nsome of the following areas would be an asset:<br>\n     automata theory<br>\n     model checking<br>\n     decision procedures for logical theories</p>\n<p>The prospective assistant enjoys the benefits of collaborating closely<br>\nwith other top groups working on automatic verification that<br>\nare involved in the AVACS project.  Applicants are encouraged to<br>\nfamiliarize themselves with our project work and the AVACS work at<br>\n<a href=\"http://www.avacs.org\">http://www.avacs.org</a>.</p>\n<p>The researcher employed will be given the opportunity to carry out a<br>\nPhD in Computer Science at ETH Zurich, on a topic related to the<br>\nproject.  ETH Zurich regulations require doctoral students to hold a<br>\nMaster's or equivalent degree (e.g. Diplom, DEA, etc.).  PhD students<br>\nare paid employees of the university, and salary and employment<br>\nconditions are very attractive.</p>\n<p>Zurich is a diverse and multicultural city which is consistently rated<br>\namong the best cities in the world in which to live.  This year,<br>\nZurich again shares top honors as the city with the best overall<br>\nquality of life (see<br>\n<a href=\"http://www.citymayors.com/features/quality_survey.html\">http://www.citymayors.com/features/quality_survey.html</a>).  We favor the<br>\nsame sort of diversity that defines Zurich's cultural makeup and<br>\nencourage anyone to apply with interest in formal methods, regardless<br>\nof where you're from.</p>\n<p>For further information please contact Felix Klaedtke at<br>\n<a href=\"mailto:felixkl@inf.ethz.ch\">felixkl@inf.ethz.ch</a>. Applications should also be send to<br>\n<a href=\"mailto:felixkl@inf.ethz.ch\">felixkl@inf.ethz.ch</a> and should include a curriculum vitae, a brief<br>\ndescription of research interests, and, if possible, letters of<br>\nrecommendation from teachers or employers.</p>",
        "id": 293896348,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660742812
    }
]