[
    {
        "content": "<p>From: Matthew Fernandez &lt;<a href=\"mailto:matthew.fernandez@nicta.com.au\">matthew.fernandez@nicta.com.au</a>&gt;<br>\nHi all,</p>\n<p>Apologies if this question has already been answered, but I could not<br>\nfind a nice solution.</p>\n<p>Section 3.1 of the Isabelle system manual describes the format<br>\ndescribing a session. The discussion in this section and surrounding<br>\nimplies that the session hierarchy is a tree and perhaps sessions cannot<br>\nhave multiple parents. I can construct this relationship by having a<br>\nsession A with parent B, that also imports a theory from session C. Is<br>\nthere a nicer way of doing this? Basically I want to write:</p>\n<p>session A = B + C + body...</p>\n<p>but it seems this is not permissible. Any advice would be greatly<br>\nappreciated.</p>\n<p>Thanks,<br>\nMatthew</p>\n<hr>\n<p>The information in this e-mail may be confidential and subject to legal professional privilege and/or copyright. National ICT Australia Limited accepts no liability for any damage caused by this email or its attachments.</p>",
        "id": 294243880,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660908127
    },
    {
        "content": "<p>From: Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt;<br>\nOn Thu, 25 Jul 2013, Matthew Fernandez wrote:</p>\n<blockquote>\n<p>Section 3.1 of the Isabelle system manual describes the format<br>\ndescribing a session. The discussion in this section and surrounding<br>\nimplies that the session hierarchy is a tree and perhaps sessions cannot<br>\nhave multiple parents.</p>\n</blockquote>\n<p>Yes, the overall hierarchy of sessions is a tree.  The word is mentioned <br>\nexplicitly on page 19 of the manual, where the form</p>\n<p>session A = B + body</p>\n<p>is explained.  I see 2 or 3 more occurrences of \"tree\" in the manual.</p>\n<blockquote>\n<p>I can construct this relationship by having a session A with parent B, <br>\nthat also imports a theory from session C. Is there a nicer way of doing <br>\nthis? Basically I want to write:</p>\n<p>session A = B + C + body...</p>\n<p>but it seems this is not permissible. Any advice would be greatly <br>\nappreciated.</p>\n</blockquote>\n<p>Sessions cannot be merged.  Normally you just figure out one main line in <br>\nthe tree path, and import further theories side-ways by loading the theory <br>\nsources again.  (A system of \"separate compilation\" as available in Coq <br>\nwould allow such fine-grained merges of precompiled modules, but it has <br>\nother performance problems.)</p>\n<p>Conceptually, session images are of relatively little importance.  They <br>\nare mainly a physical snapshot of a certain situation.  Build and load <br>\ntimes of big applications may be fine-tuned by smart arrangement of <br>\nsession images -- sometimes it just means to avoid redundant intermediate <br>\nimages, because these are also synchronization points for parallel proof <br>\nprocessing: one process needs to finish before another can be started.</p>\n<p>Just loading everything you need in one big session, e.g. starting from <br>\nHOL, might be not as bad as expected.  Historically it was not done by <br>\ndefault due to various technical snags that no longer exist.  E.g. I can <br>\nload all of AFP/JinjaThreads comfortably into one big session on my cheap <br>\nlaptop, starting from HOL-Word, for example.</p>\n<p>For AFP as big library the situation is slightly different: certain <br>\nsession images that are re-used a lot help to speed up the overall build <br>\nprocess.  (The isabelle build tool could be smarter to make such <br>\narrangements automatically.)</p>\n<p>Makarius</p>",
        "id": 294247348,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660909422
    }
]