[
    {
        "content": "<p>From: Daniel Le Métayer &lt;<a href=\"mailto:daniel.le-metayer@inria.fr\">daniel.le-metayer@inria.fr</a>&gt;<br>\nFormal methods for privacy and accountability </p>\n<p>The PRIVATICS research group at Inria Lyon is looking for PhD and postdoctoral researchers in formal methods with applications to privacy and accountability. </p>\n<p>The group is part of the new Inria project Lab CAPPRIS which supports collaborations with other research groups involved in privacy and formal methods and provides a very active research environment. PRIVATICS is also involved into several multidisciplinary projects on privacy and accountability with a variety of partners all over Europe. </p>\n<p>Topics of particular interest include, but are not limited to: </p>\n<ul>\n<li>formal models for privacy </li>\n<li>specification and verification of accountability properties </li>\n<li>formal approach to privacy by design </li>\n<li>verification of privacy requirements </li>\n</ul>\n<p>Lyon is the second urban area in France. It is close to the French Alps and two hours or less (in TGV) from Paris, Geneva, Turin and the Mediterranean coast. The city has developed a reputation as the capital of gastronomy; it is known for its rich cultural life, its historical and architectural landmarks and is a UNESCO World Heritage Site. </p>\n<p><a href=\"https://team.inria.fr/privatics/\">https://team.inria.fr/privatics/</a> <br>\n<a href=\"https://site.inria.fr/cappris_institutionnel/\">https://site.inria.fr/cappris_institutionnel/</a> <br>\n<a href=\"http://www.lyon.fr/page/websites-in-english-about-lyon-france.html\">http://www.lyon.fr/page/websites-in-english-about-lyon-france.html</a> </p>\n<p>PhD positions are initially offered for a period of three years and postdoc positions for a period of one or two years. <br>\nApplications will be accepted until the positions have been filled. <br>\nApplications have to be sent to daniel.le-metayer at <a href=\"http://inria.fr\">inria.fr</a>.</p>",
        "id": 294241352,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660907114
    }
]