[
    {
        "content": "<p>From: Tobias Nipkow &lt;<a href=\"mailto:nipkow@in.tum.de\">nipkow@in.tum.de</a>&gt;<br>\nWe have two new and substantial contributions by Peter Lammich. His<br>\nCollections Framework is recommended to anyone who wants to generate<br>\nefficient code operating on sets, maps etc implemented as trees, hash<br>\ntables etc.</p>\n<p><a href=\"http://afp.sourceforge.net/entries/Collections.shtml\">http://afp.sourceforge.net/entries/Collections.shtml</a></p>\n<p>Collections Framework</p>\n<p>This development provides an efficient, extensible, machine checked<br>\ncollections framework. The library adopts the concepts of interface,<br>\nimplementation and generic algorithm from object-oriented programming<br>\nand implements them in Isabelle/HOL. The framework features the use of<br>\ndata refinement techniques to refine an abstract specification (using<br>\nhigh-level concepts like sets) to a more concrete implementation (using<br>\ncollection data Twostructures, like red-black-trees). The code-generator<br>\nof Isabelle/HOL can be used to generate efficient code.</p>\n<p><a href=\"http://afp.sourceforge.net/entries/Tree-Automata.shtml\">http://afp.sourceforge.net/entries/Tree-Automata.shtml</a></p>\n<p>Tree Automata</p>\n<p>This work presents a machine-checked tree automata library for<br>\nStandard-ML, OCaml and Haskell. The algorithms are efficient by using<br>\nappropriate data structures like RB-trees. The available algorithms for<br>\nnon-deterministic automata include membership query, reduction,<br>\nintersection, union, and emptiness check with computation of a witness<br>\nfor non-emptiness. The executable algorithms are derived from<br>\nless-concrete, non-executable algorithms using data-refinement<br>\ntechniques. The concrete data structures are from the Isabelle<br>\nCollections Framework. Moreover, this work contains a formalization of<br>\nthe class of tree-regular languages and its closure properties under set<br>\noperations.</p>\n<p>Enjoy!<br>\nTobias</p>",
        "id": 294093028,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660832486
    }
]