[
    {
        "content": "<p>From: Ken Kubota &lt;<a href=\"mailto:mail@kenkubota.de\">mail@kenkubota.de</a>&gt;<br>\nHi John, Cris, Mark, Rob, and Roger,</p>\n<p>Before going into the details of John's e-mail on the motivation for HOL Light, <br>\nfrom which I included a larger passage, let me reply to the other comments <br>\nconcerning the overview at <a href=\"http://dx.doi.org/10.4444/100.111\">http://dx.doi.org/10.4444/100.111</a></p>\n<p>The following paragraph was added (plus a list of links):<br>\n\"Neither the graph nor the above list are comprehensive. Further logics are <br>\nWilliam M. Farmer's Q0u and Q0uqe (extensions of Andrews' Q0 with <br>\nundefinedness), and further systems are TPS by Peter B. Andrews et al., HOL <br>\nZero by Mark Adams (designed for trustworthiness, and rather a proof checker <br>\nlike Automath and the R0 implementation), and IMPS by William M. Farmer et al. <br>\n(with partial functions and subtypes). Historically, \"[t]he original LCF team <br>\nat Stanford consisted of Robin Milner, assisted by Whitfield Diffie\" [Gordon, <br>\n2000, p. 169] - now known for the Diffie-Hellman (DH) key exchange in <br>\ncryptography. Both Rob Arthan and Roger Bishop Jones generously credit each <br>\nother for having the main rôle in the creation of ProofPower.\"</p>\n<p>It's difficult to add more systems to the graph. Further are included in the <br>\nnew list and are in good company with Andrews' TPS, which I hesitated to add to <br>\nthe graph, as it would distract from the much more important Q0.</p>\n<p>Due to the suggestions of Rob Arthan, I have included a footnote for HOL with <br>\nthe three references given. I am not sure whether the mechanism is already <br>\nimplemented in HOL4, see section 2.5.5 of<br>\n<a href=\"http://freefr.dl.sourceforge.net/project/hol/hol/kananaskis-10/kananaskis-10-logic.pdf\">http://freefr.dl.sourceforge.net/project/hol/hol/kananaskis-10/kananaskis-10-logic.pdf</a></p>\n<p>In case the article on Isabelle/HOL by Ondrej Kuncar and Andrei Popescu will be <br>\nprinted again elsewhere, I would like to suggest two modifications of the part <br>\nquoted in my overview: 1. Gordon's proposal was rather in the eighties than in <br>\nthe nineties (release of HOL88 in 1988, Gordon's technical report of 1985).</p>\n<ol start=\"2\">\n<li>The formulation \"Classical Higher-Order Logic\" seems the be more common <br>\nthan \"Classic Higher-Order Logic\".</li>\n</ol>\n<p>Thanks to Cris Perdue, Mark Adams, Rob Arthan, and Roger Bishop Jones for the <br>\nhints.</p>\n<p>If you still miss any important information, please do not hesitate to send a <br>\nnotice via the mailing lists.</p>\n<p>John's e-mail on the motivation for HOL Light and his comparison with Andrews' <br>\nsystems is highly interesting. I would suggest an article \"On the Logical <br>\nFoundations of HOL Light\" or similar to make the information persistent, as the <br>\npolicy of the mailing list provider may change. For now, I have quoted from the <br>\npublicly available e-mail via the online link.</p>\n<p>I totally agree that the derivation of higher-order logic (and of mathematics <br>\nin general) on the basis of the notion of equality is \"quite satisfying\". When <br>\nI met Andrews, he told me that he chose the letter 'Q' in the name of his <br>\nsystem Q0 because it is based on the notion of equality. For philosophical <br>\nreasons, I would prefer the word 'identity', but mathematically it doesn't make <br>\na difference.</p>\n<p>As most people do not look behind the definitions (e.g., of the quantifiers), <br>\nthese definitions first might look \"intricate\", but logically they are simply <br>\nthe result of spelling out their inner logic (i.e., following Andrews' concept <br>\nof \"expressiveness\", which I also call \"reducibility\").</p>\n<p>In higher-order logic, where propositions are not a separate syntactic category <br>\nanymore, the \"conventional notation ∀x. P[x] [maps] down to ∀(λx. P[x])\".<br>\n<a href=\"https://www.cl.cam.ac.uk/~jrh13/hol-light/tutorial_220.pdf\">https://www.cl.cam.ac.uk/~jrh13/hol-light/tutorial_220.pdf</a> (p. 218),<br>\nor similarly<br>\n<a href=\"http://www.cl.cam.ac.uk/~mjcg/papers/HolHistory.pdf\">http://www.cl.cam.ac.uk/~mjcg/papers/HolHistory.pdf</a> (p. 10).<br>\nWith type abstraction, also types are not a separate syntactic category <br>\nanymore, but terms of type tau.<br>\nThen the quantifiers have the type as an argument, such that the expression is <br>\nnot just ALL (\\x. P[x]), but ALL t (\\x. P[x]), where 't' is the type (or a type <br>\nvariable), meaning \"for all x of type t, P holds\", for example<br>\n    ALL t (\\z.((x z) =&gt; (y z)))<br>\nin the definition of the subset or<br>\n    ALL o (\\x.(g x))<br>\nin Axiom 1 of R0 (Law of Excluded Middle, like Axiom 1 of Q0), see:<br>\n<a href=\"http://www.kenkubota.de/files/R0_draft_excerpt_with_definitions_and_groups.pdf\">http://www.kenkubota.de/files/R0_draft_excerpt_with_definitions_and_groups.pdf</a> (p. 357)<br>\n<a href=\"http://www.kenkubota.de/files/R0_draft_excerpt_with_axioms_and_proof_of_C_function.pdf\">http://www.kenkubota.de/files/R0_draft_excerpt_with_axioms_and_proof_of_C_function.pdf</a> (p. 351)</p>\n<p>I much appreciate that in HOL Light the basic logical notions including the <br>\nquantifiers are independent of the \"suspicious\" epsilon operator. Eventually, <br>\nmaybe with the introduction of type abstraction (already suggested by Gordon), <br>\nin the HOL systems the epsilon operator should be eliminated and replaced by <br>\nthe description operator, as in Andrews' Q0. For example, Gordon's definition <br>\nof \"the conditional term Cond\" in Gordon's 2001 paper at<br>\n<a href=\"http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.27.6103&amp;rep=rep1&amp;type=pdf\">http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.27.6103&amp;rep=rep1&amp;type=pdf</a> (p. 24)<br>\ncan be replaced by Andrews' definition of C, see Andrews' theorem 5313 and its <br>\nformal verification (here with type abstraction) at<br>\n<a href=\"http://www.kenkubota.de/files/R0_draft_excerpt_with_axioms_and_proof_of_C_function.pdf\">http://www.kenkubota.de/files/R0_draft_excerpt_with_axioms_and_proof_of_C_function.pdf</a> (pp. 165 ff.)</p>\n<p>Thank you very much for this interesting information, John.</p>\n<p>Best,</p>\n<p>Ken</p>\n<hr>\n<p>Ken Kubota<br>\ndoi: 10.4444/100<br>\n<a href=\"http://dx.doi.org/10.4444/100\">http://dx.doi.org/10.4444/100</a></p>",
        "id": 294694729,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661178058
    }
]