[
    {
        "content": "<p>From: Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt;<br>\nGerwin is responsible for the moves of AFP after this genocide by Bitbucket of<br>\napprox. 3% of its members. There are still a few weeks left.</p>\n<p>For the Isabelle infrastructure proper, I have already everything set in<br>\nplace, see also these blog entries:</p>\n<p><a href=\"https://sketis.net/2019/isabelle-phabricator-server-setup\">https://sketis.net/2019/isabelle-phabricator-server-setup</a></p>\n<p><a href=\"https://sketis.net/2020/selfhosting-of-mercurial-repositories\">https://sketis.net/2020/selfhosting-of-mercurial-repositories</a></p>\n<p>Moreover there is a private instance <a href=\"https://vcs.sketis.net\">https://vcs.sketis.net</a> for myself and my<br>\ncollaborators / co-authors --- I now prefer that over Github, Gitlab,<br>\nBitbucket. All my former public Bitbucket repositories are already at<br>\n<a href=\"https://makarius.sketis.net/repos\">https://makarius.sketis.net/repos</a> (when deleting a repository at Bitbucket it<br>\nallows to specify a follow-up link, and everything of worth points to my own<br>\nserver now).</p>\n<p>Concerning the status of the Mercurial community, I have done a lot of<br>\nresearch in the post few months. It is actually more alive and active than I<br>\nexpected, with paid professionals doing maintenance and further conceptual<br>\ndevelopment. Thus Mercurial is slightly more stable than Isabelle itself.</p>\n<p>So we can continue with Mercurial quitely and peacefully without having to<br>\nsubscribe to the noise and aggression of the Git guys. Somehow the attitude of<br>\n\"total world domination\" from the Linux kernel crew has been inherited by Git,<br>\nbut without the opposition of other powers like Microsoft. This might also<br>\nexplain the idea that to \"have won\" one has to kill everybody else. But this<br>\nwould also prevent conceptual progress that is still required in the area of<br>\nversioning: Git cannot be the last word on it.</p>\n<p>So for the sake of peace and technological progress, we can be glad that the<br>\nnon-git world still continues.</p>\n<p>Makarius</p>",
        "id": 294825699,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661244305
    },
    {
        "content": "<p>From: Max Haslbeck &lt;<a href=\"mailto:max.haslbeck@gmx.de\">max.haslbeck@gmx.de</a>&gt;<br>\nSo you are now the main developer AND responsible for hosting the complete development infrastructure of Isabelle. What if you can’t continue working on Isabelle?</p>",
        "id": 294825727,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661244314
    },
    {
        "content": "<p>From: Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt;<br>\nOn 21/03/2020 13:55, Max Haslbeck wrote:</p>\n<blockquote>\n<p>So you are now the main developer AND responsible for hosting the complete development infrastructure of Isabelle.</p>\n</blockquote>\n<p>Self-hosting in a broad sense has been part of the Isabelle approach from<br>\nearly on.</p>\n<p>Doing more and more of it myself saves me a lot of time: it avoids tedious<br>\nnegotiations with other administrative entities (and erratic decisions by big<br>\nplayers). Moreover, I learn how it actually works: self-hosting is easy and<br>\nfun, if done with a proper sense for simplicity and adequacy --- just like<br>\neverything else in Isabelle.</p>\n<blockquote>\n<p>What if you can’t continue working on Isabelle?</p>\n</blockquote>\n<p>Then it will be dead within approx. 5 years. We have been living with such a<br>\nsituation already in the past 20 years -- seriously.</p>\n<p>Users who are worried about that can come up with creative ideas to find<br>\nfunding, both or myself and for David Matthews (the grand master behind<br>\nPoly/ML). Even small amounts help, e.g. \"software maintenance contracts\"<br>\nassociated as \"materials\" for research projects. Of course, bigger amounts<br>\nhelp more.</p>\n<p>Makarius</p>",
        "id": 294825739,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661244319
    }
]