[
    {
        "content": "<p>From: Felipe Rodopoulos &lt;<a href=\"mailto:rodopoulos@aluno.unb.br\">rodopoulos@aluno.unb.br</a>&gt;<br>\nHello everyone,</p>\n<p>I am using the Isabelle HOL/Auth framework and the Inductive Method <br>\ntheory in<br>\norder to formalize and verify a banking authorization protocol called <br>\nDAP. The<br>\nspecification employs the user's smartphone as a trusted entity for <br>\nholding<br>\nsecrets (similar as the strategy adopted with smartcards in Shoup-Rubin<br>\nprotocol).</p>\n<p>Along some protocol steps, consistency checks are necessary for the <br>\nprotocol<br>\nproceed, e.g, checksum verification. Therefore, for modelling this <br>\nconcept, I<br>\nused basic conditional comparison between messages. The following <br>\nexample rule<br>\ncontains such strategy, in the last premise:</p>\n<p>Rule: \"[ evs \\in model; legalUse(Smartphone A); A != Server;<br>\n          Gets_s (Smartphone A) A {Transaction, r', Checksum} \\in set <br>\nevs;<br>\n          Checksum == Hash {Transaction, r'} ]<br>\n       ==&gt; Outputs (Smartphone A) A Transaction # evs \\in model\"</p>\n<p>The model specification phase went well. However, I am struggling with <br>\nsome<br>\nlemmas at the verification phase, where subgoals frequently came up, <br>\npointing to<br>\nrules with the structure presented above. In view of such situation, I <br>\nam<br>\nsuspecting that the consistency premise is not suitable for what I am <br>\ntrying to<br>\nachieve, which is an equality check between messages.</p>\n<p>I checked other protocol formalizations in Isabelle HOL/Auth library, <br>\nbut didn't<br>\nfind anything useful. Does someone know how to properly tackle this <br>\nproblem?</p>\n<p>Another issue I am having is deciphering messages. In the rule above, <br>\nmessage r'<br>\nis a cipher, generated at the Server, with the following structure: <br>\nCrypt (shrK<br>\nA) (Nonce r). At one of the latter steps of the protocol, agent A's <br>\nSmartphone<br>\nneeds to decipher r' in order to obtain the plaintext and send it to the <br>\nserver<br>\nagain, for further comparison. It posses A's private key, but I'm not <br>\nsure how<br>\ncan I properly obtain Nonce r from cipher r'. That said, how can I <br>\nproperly<br>\ndecipher r' at the Smartphone, given that it has A's private key?</p>\n<p>I hope I made myself clear. Thanks in advance.</p>",
        "id": 294740459,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661191332
    },
    {
        "content": "<p>From: Lawrence Paulson &lt;<a href=\"mailto:lp15@cam.ac.uk\">lp15@cam.ac.uk</a>&gt;<br>\nI don't understand the role of checksum verification here. You write Hash{Transaction,r'}, but it looks like the data being hashed is publicly visible on the network, so the hash has no security value. It's conceivable that the protocol provides this checksum to strengthen data integrity (i.e., guarding against transmission errors), but this hash cannot guard against cryptanalytic attacks unless it involves some sort of secret. It would be reasonable at this level of abstraction to assume that there will be no transmission errors and to eliminate the hash altogether.</p>\n<p>I wonder however whether communication between a user and their smart phone is regarded as secure from interception. (This would be similar to the smartcard case.) Make sure that your model recognises that.</p>\n<p>Larry</p>",
        "id": 294741327,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661191648
    },
    {
        "content": "<p>From: Lawrence Paulson &lt;<a href=\"mailto:lp15@cam.ac.uk\">lp15@cam.ac.uk</a>&gt;<br>\nYou express decryption in the rules themselves. In the case of an agent A receiving a message encrypted with its own key, write the message in the rule as Crypt (shrK A) (Nonce r). In this case the contents of the message is visible. In the case of a message containing fields encrypted with other keys, write them as X, X', et cetera, to indicate that they are opaque. You will see this if you examine the existing formalisation of, for example, the Otway-Rees Protocol.</p>\n<p>Larry</p>",
        "id": 294741337,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661191654
    }
]