[
    {
        "content": "<p>From: Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt;<br>\nNo, just the common sense you apply in the virtual village of a <br>\nscientific community. In principle everybody knows each other, directly <br>\nor indirectly via 1-2 intermediates, and you could eventually meet up in <br>\nperson on a workshop or conference. Of course, there is no obligation to <br>\nstart as a well-known insider, but there needs to be some openness to <br>\nbecome one eventually.</p>\n<p>Contributors to Isabelle and/or AFP need to be trustworthy and <br>\npersonally accountable for what they do. The LCF approach does not <br>\nprotect against non-sense that can be done on a shared repository. (I am <br>\nnot going to explain further details how and what could be done there.)</p>\n<p>Makarius</p>",
        "id": 294757562,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661198183
    },
    {
        "content": "<p>From: Wolfgang Jeltsch &lt;<a href=\"mailto:wolfgang-it@jeltsch.info\">wolfgang-it@jeltsch.info</a>&gt;<br>\nThe problem in the case of Wikipedia is that anonymous contributors can<br>\ncontribute rubbish without being held accountable for it under their<br>\nreal identities. However, in the case of the AFP we have a review<br>\nprocess (this is at least what I thought); so rubbish contributions<br>\nshould never make it into the AFP, independently of whether they are<br>\ncontributed anonymously or not.</p>\n<p>All the best,<br>\nWolfgang</p>",
        "id": 294757586,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661198191
    },
    {
        "content": "<p>From: Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt;<br>\nThe rubbish production on Wikipedia works quite differently -- by people <br>\nwho are proven experts (sometimes backed by big corporations or other <br>\ninterest groups). Likewise, and still quite different, is the abuse by <br>\nsome people on Stackoverflow with a lot of points. Neither of these <br>\nsystems work according to their official description on the front-page.</p>\n<p>Compared to that our Isabelle/AFP global village and virtual garden is <br>\nreally great.</p>\n<p>Makarius</p>",
        "id": 294757595,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661198197
    },
    {
        "content": "<p>From: Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt;<br>\nYou are right that there is a danger to diverge into questions of policy <br>\nthat are alien to this mailing list. So in a narrow sense that is off-topic.</p>\n<p>In a broader sense it is on topic: Isabelle/AFP is getting more and more <br>\nimportant and it could become something like a formal Wikipedia or <br>\nStackoverflow eventually. Some colleagues have occasionally started to <br>\nthink about proper research projects in such a direction.</p>\n<p>So in the near future, questions of policies, ethics, the general social <br>\nmodel etc. in our public libraries of formalized mathematics might <br>\nbecome very relevant. Pure Logic and Mathematics are not free from <br>\nimpact to the real (and messy) world.</p>\n<p>Makarius</p>",
        "id": 294757654,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661198220
    },
    {
        "content": "<p>From: Lawrence Paulson &lt;<a href=\"mailto:lp15@cam.ac.uk\">lp15@cam.ac.uk</a>&gt;<br>\nI didn’t quite understand what you’ve done here, but its potential sounds tremendous. I’d like know more about this. For example, are you able to derive some of the theorems in Analysis/Abstract_Topology from their type class analogues without needing separate proofs?</p>\n<p>Larry Paulson</p>",
        "id": 294759088,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661198726
    },
    {
        "content": "<p>From: Fabian Immler &lt;<a href=\"mailto:immler@in.tum.de\">immler@in.tum.de</a>&gt;<br>\nThank you for sharing this, this is a very useful development and at a <br>\nfirst glance, the code looks (at least to me) reasonably Isabelle/ML <br>\nidiomatic!</p>\n<p>To keep the expectations (that non-Types-To-Sets experts might have) <br>\nrealistic: The framework hides the \"local typedef\" part of the <br>\nTypes-To-Sets approach nicely. But I don't think this can already be <br>\nseen as a tool that enables an end-user to casually relativize theorems.<br>\nThis is because one needs to know a lot about the hierarchical structure <br>\n(i.e, one needs to provide a set-based locale hierarchy along the <br>\nhierarchy of type-classes in HOL and manually establish appropriate <br>\nrelationships between them) of the underlying type-based formalization <br>\nas well as the theoretical and technical (especially the transfer <br>\nmethod) background.</p>\n<p>That said, it is extremely helpful for a systematic relativization of <br>\nexisting libraries (as you have demonstrated with your numerous <br>\napplications). And those relativized libraries can then be used easily <br>\nby non-experts.</p>\n<p>I'd be glad to see a formalization of e.g., <br>\nHOL/Types_To_Sets/Examples/Linear_Algebra_On.thy based on your framework.</p>\n<p>I like your tts_statistics command (although I don't understand what the <br>\nargument \"cc\" should stand for), it seems like this could be used as a <br>\nmeans to keep relativized libraries in sync with the underlying <br>\nnon-relativized developments. One could imagine that a relativizing <br>\nsession fails to build when not all theorems of the underlying <br>\ntype-based library are relativized.</p>\n<p>I believe your developments (and also the applications) should be <br>\nincorporated into the isabelle repository, and better sooner than later. <br>\nThis is in order to avoid bit-rot and to ease improvements and <br>\ncontributions by other developers. I'd be happy to help (from an <br>\nengineering point of view) incorporating this in the development version <br>\nof Isabelle, but I am not so sure how to deal with the legal issues (if <br>\nthere are any) of contributions that are published by an anonymous <br>\ncontributor under a different license.</p>\n<p>Best regards,<br>\nFabian<br>\n<a href=\"/user_uploads/14278/UFDWmzEruJV4ys82ZEzMhcuO/smime.p7s\">smime.p7s</a></p>",
        "id": 294759128,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661198751
    },
    {
        "content": "<p>From: Fabian Immler &lt;<a href=\"mailto:immler@in.tum.de\">immler@in.tum.de</a>&gt;<br>\nI guess I can add this: I'm neither maintaining Isabelle nor the AFP, <br>\nbut I believe you must disclose your identity in order to have your <br>\ndevelopments accepted in the Isabelle repository or in the AFP.</p>\n<p>If it is not in one of those places, nobody will use or maintain your <br>\ndevelopments and that would be a shame.</p>\n<p>Fabian<br>\n<a href=\"/user_uploads/14278/XZQmVgmWwnDbVn_inHGZNSKp/smime.p7s\">smime.p7s</a></p>",
        "id": 294759137,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661198757
    },
    {
        "content": "<p>From: Lars Hupel &lt;<a href=\"mailto:hupel@in.tum.de\">hupel@in.tum.de</a>&gt;<br>\nLooking at the history of Isabelle+AFP, there are many contributions <br>\nwhere the authors have moved on from academia and/or Isabelle. I see no <br>\nobservable difference between that case and pseudonymous contributions.</p>\n<p>Cheers<br>\nLars</p>",
        "id": 294759193,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661198769
    },
    {
        "content": "<p>From: Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt;<br>\nBy definition everything in the Isabelle repository is subject to its <br>\nBSD-style license in the toplevel directory: all named contributors have <br>\nexplicitly or implicitly agreed to that in a legally binding way. (An <br>\nanonymous dummy is not a legal entity.)</p>\n<p>The Isabelle application bundle is different: it agglomerates multiple <br>\nprojects with multiple licenses like a Linux distribution.</p>\n<p>Makarius</p>",
        "id": 294759259,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661198805
    },
    {
        "content": "<p>From: Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt;<br>\nContributors that cannot be publicly identified have done great harm to <br>\nprojects like Wikipedia: a lot of its content is now rubbish, especially <br>\non topics of economic or political interest. Hopefully our great Archive <br>\nof Formal Proofs is not moving in such a direction.</p>\n<p>Makarius</p>",
        "id": 294759289,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661198818
    },
    {
        "content": "<p>From: Lars Hupel &lt;<a href=\"mailto:hupel@in.tum.de\">hupel@in.tum.de</a>&gt;<br>\nAre you suggesting introducing a government ID check for submissions? <br>\nBecause we don't do that presently. If our anonymous poster would've <br>\ngone with a name akin to \"Jane Doe\", we wouldn't even have this <br>\nconversation.</p>",
        "id": 294759326,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661198830
    }
]