[
    {
        "content": "<p>From: Dmitriy Traytel &lt;<a href=\"mailto:traytel@inf.ethz.ch\">traytel@inf.ethz.ch</a>&gt;<br>\nPh.D. Research Project at ETH Zürich on Big Data Monitoring<br>\nProf. David Basin and Dr. Dmitriy Traytel, ETH Zürich</p>\n<p>The Information Security Group carries out research on methods<br>\nand tools for the analysis and construction of safe and secure<br>\nsystems. This includes methods for specifying systems,<br>\ndeveloping systems in correctness-preserving ways, and verifying<br>\nor testing existing systems and infrastructures. Our goal is not<br>\nonly to build and analyze novel systems and security solutions,<br>\nbut also to develop better methods and tools for system<br>\nengineering and quality assurance activities.</p>\n<p>We have an open Ph.D. research position on \"Big Data<br>\nMonitoring\". The project's main objective is to develop and<br>\nimplement efficient, parallelized algorithms capable of checking<br>\nwhether a high-volume and high-velocity stream of events comply<br>\nwith given rules. The rules are formulated in an input language<br>\nthat allows users to express temporal and data dependencies<br>\nbetween different events in the data feed in a simple and<br>\nintuitive manner. If any of the rules are violated, a compact<br>\noutput of the data that caused the violation should be produced.</p>\n<p>The ideal candidate for this position is an enthusiastic,<br>\noutstanding researcher with a strong background and interest in<br>\none or more of the following areas:</p>\n<ul>\n<li>formal methods or mathematical logic,</li>\n<li>automata theory or model checking or runtime verification,</li>\n<li>stream processing or data stream management systems.</li>\n</ul>\n<p>Candidates with a strong theoretical background in related areas<br>\nare also encouraged to apply. ETH Zürich regulations require PhD<br>\ncandidates to hold a Master's or equivalent degree (e.g.<br>\nDiplom). The project is funded by the Swiss National Science<br>\nFoundation and will be supervised by Prof. David Basin and Dr.<br>\nDmitriy Traytel.</p>\n<p>The Ph.D. student will be a paid employee of ETH Zürich. Salary<br>\nand employment conditions are attractive. ETH Zürich regulations<br>\nrequire doctoral students to hold a Master's or equivalent<br>\ndegree (e.g. Diplom).</p>\n<p>Zurich is a diverse and multicultural city, which is<br>\nconsistently rated among the best cities in the world in which<br>\nto live. We favor the same sort of diversity that defines<br>\nZurich's cultural makeup and encourage anyone matching the<br>\nprofile above to apply, regardless of where you are from.</p>\n<p>Applications should include a curriculum vitae, a brief<br>\ndescription of research interests, transcripts of grades, 2-3<br>\nletters of recommendation from teachers or employers, and, if<br>\npossible, the Master's or Bachelor's thesis and publications.<br>\nApplications and informal inquiries should be sent to Dmitriy<br>\nTraytel at the following email address:</p>\n<p><a href=\"mailto:infsec.positions@inf.ethz.ch\">infsec.positions@inf.ethz.ch</a></p>\n<p>ETH Zürich specifically encourages women to apply with a view<br>\ntowards increasing the proportion of female researchers.</p>",
        "id": 294733420,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661188917
    }
]