[
    {
        "content": "<p>From: Tobias Nipkow &lt;<a href=\"mailto:nipkow@in.tum.de\">nipkow@in.tum.de</a>&gt;<br>\nMore on logic and algebra:</p>\n<p>A Variant of the Superposition Calculus<br>\nNicolas Peltier</p>\n<p>We provide a formalization of a variant of the superposition calculus, together <br>\nwith formal proofs of soundness and refutational completeness (w.r.t. the usual <br>\nredundancy criteria based on clause ordering). This version of the calculus uses <br>\nall the standard restrictions of the superposition rules, together with the <br>\nfollowing refinement, inspired by the basic superposition calculus: each clause <br>\nis associated with a set of terms which are assumed to be in normal form -- thus <br>\nany application of the replacement rule on these terms is blocked. The set is <br>\ninitially empty and terms may be added or removed at each inference step. The <br>\nset of terms that are assumed to be in normal form includes any term introduced <br>\nby previous unifiers as well as any term occurring in the parent clauses at a <br>\nposition that is smaller (according to some given ordering on positions) than a <br>\npreviously replaced term. The standard superposition calculus corresponds to the <br>\ncase where the set of irreducible terms is always empty.</p>\n<p><a href=\"https://www.isa-afp.org/entries/SuperCalc.shtml\">https://www.isa-afp.org/entries/SuperCalc.shtml</a></p>\n<p>Stone Algebras<br>\nWalter Guttmann</p>\n<p>A range of algebras between lattices and Boolean algebras generalise the notion <br>\nof a complement. We develop a hierarchy of these pseudo-complemented algebras <br>\nthat includes Stone algebras. Independently of this theory we study filters <br>\nbased on partial orders. Both theories are combined to prove Chen and Grätzer's <br>\nconstruction theorem for Stone algebras. The latter involves extensive reasoning <br>\nabout algebraic structures in addition to reasoning in algebraic structures.</p>\n<p><a href=\"https://www.isa-afp.org/entries/Stone_Algebras.shtml\">https://www.isa-afp.org/entries/Stone_Algebras.shtml</a></p>\n<p>Enjoy!<br>\n<a href=\"/user_uploads/14278/i-JmUZ08h4H9bWJjW-D7wqDm/smime.p7s\">smime.p7s</a></p>",
        "id": 294682033,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661177046
    }
]