[
    {
        "content": "<p>From: Jeremy Avigad &lt;<a href=\"mailto:avigad@cmu.edu\">avigad@cmu.edu</a>&gt;<br>\nThe 5th ACM SIGPLAN Conference on<br>\nCertified Programs and Proofs (CPP 2016)<br>\nin cooperation with ACM SIGLOG</p>\n<p>Saint Petersburg, Florida, USA<br>\nJanuary 18-19, 2016<br>\n<a href=\"http://people.csail.mit.edu/adamc/cpp16/\">http://people.csail.mit.edu/adamc/cpp16/</a><br>\nCo-located with POPL 2016 (<a href=\"http://conf.researchr.org/home/POPL-2016\">http://conf.researchr.org/home/POPL-2016</a>)</p>\n<p>Call for Papers<br>\n===============</p>\n<p>CPP is an international forum on theoretical and practical topics in<br>\nall areas, including computer science, mathematics, and education,<br>\nthat consider certification as an essential paradigm for their work.<br>\nCertification here means formal, mechanized verification of some sort,<br>\npreferably with production of independently checkable certificates.</p>\n<p>CPP 2016 is the fifth in the CPP conference series and will be co-located<br>\nwith POPL 2016 in Saint Petersburg, Florida from 18-19 January 2016.</p>\n<p>Important dates</p>\n<hr>\n<p>Abstract submission:    7 October 2015, anywhere on Earth (11:59 pm, UTC-12)<br>\nFull paper submission: 12 October 2015, anywhere on Earth (11:59 pm, UTC-12)<br>\nNotification:          18 November 2015<br>\nFinal versions due:     4 December 2015<br>\nConference dates:   18-19 January 2016</p>\n<p>Scope</p>\n<hr>\n<p>Suggested, but not exclusive, specific topics of interest for<br>\nsubmissions include:</p>\n<ul>\n<li>\n<p>certified or certifying programming, compilation, linking, OS<br>\n  kernels, runtime systems, and security monitors;</p>\n</li>\n<li>\n<p>program logics, type systems, and semantics for certified code;</p>\n</li>\n<li>\n<p>certified decision procedures, mathematical libraries, and<br>\n  mathematical theorems;</p>\n</li>\n<li>\n<p>proof assistants and proof theory;</p>\n</li>\n<li>new languages and tools for certified programming;</li>\n<li>program analysis, program verification, and proof-carrying code;</li>\n<li>certified secure protocols and transactions;</li>\n<li>\n<p>certificates for decision procedures, including linear algebra,<br>\n  polynomial systems, SAT, SMT, and unification in algebras of<br>\n  interest;</p>\n</li>\n<li>\n<p>certificates for semi-decision procedures, including equality,<br>\n  first-order logic, and higher-order unification;</p>\n</li>\n<li>\n<p>certificates for program termination;</p>\n</li>\n<li>logics for certifying concurrent and distributed programs;</li>\n<li>\n<p>higher-order logics, logical systems, separation logics, and logics<br>\n  for security;</p>\n</li>\n<li>\n<p>teaching mathematics and computer science with proof assistants.</p>\n</li>\n</ul>\n<p>Submission instructions</p>\n<hr>\n<p>Submitted papers should not exceed 12 pages in the ACM SIGPLAN<br>\nProceedings format. Shorter papers are welcome and will be given equal<br>\nconsideration. The proceedings of the conference will be published<br>\nby the ACM. Templates for ACM SIGPLAN format can be found on the<br>\nACM SIGPLAN website:<br>\n<a href=\"http://www.sigplan.org/Resources/Author\">http://www.sigplan.org/Resources/Author</a>.</p>\n<p>Papers should be submitted in PDF format, through the EasyChair<br>\nsubmission page:<br>\n<a href=\"https://www.easychair.org/conferences/?conf=cpp2016\">https://www.easychair.org/conferences/?conf=cpp2016</a></p>\n<p>Abstracts must be submitted by the deadline given above.<br>\nThe deadline for full papers falls one week later, and authors<br>\nhave the option to withdraw their papers during the window between the<br>\ntwo.</p>\n<p>Each submission must be written in English and provide sufficient<br>\ndetail to allow the program committee to assess the merits of the<br>\npaper. It should begin with a succinct statement of the issues, a<br>\nsummary of the main results, and a brief explanation of their<br>\nsignificance and relevance to the conference, all phrased for the<br>\nnon-specialist. Technical and formal developments directed to the<br>\nspecialist should follow. If the submission reports on a<br>\ncomputer-checked formalization, code, or the results of a computation,<br>\na link to the relevant data should be provided. References and<br>\ncomparisons with related work should be included. Papers not<br>\nconforming to the above requirements concerning format and length may<br>\nbe rejected without further consideration.</p>\n<p>The results must be unpublished and not submitted for publication<br>\nelsewhere, including the proceedings of other published conferences or<br>\nworkshops. The PC chairs should be informed of closely related work<br>\nsubmitted to a conference or journal in advance of submission.<br>\nOriginal formal proofs of known results in mathematics or computer<br>\nscience are among the targets. One author of each accepted paper is<br>\nexpected to present it at the conference.</p>\n<p>Program Committee</p>\n<hr>\n<p>Jeremy Avigad (co-chair), Carnegie Mellon University, US<br>\nSandrine Blazy, Université de Rennes 1, France<br>\nAdam Chlipala (co-chair), Massachusetts Institute of Technology, US<br>\nThierry Coquand, Chalmers University of Technology, Sweden<br>\nJohn Harrison, Intel, US<br>\nChris Hawblitzel, Microsoft Research, Redmond, US<br>\nCătălin Hriţcu, INRIA Paris-Rocquencourt, France<br>\nBrian Huffman, Galois, Inc., US<br>\nLaura Kovács, Chalmers University of Technology, Sweden<br>\nPeter Lammich, Technische Universität München, Germany<br>\nDan Licata, Wesleyan University, US<br>\nHongjin Liang, University of Science and Technology of China, China<br>\nPanagiotis Manolios, Northeastern University, US<br>\nDale Miller, INRIA Saclay and LIX, France<br>\nDominic Mulligan, Cambridge University, UK<br>\nLawrence Paulson, Cambridge University, UK<br>\nAndrei Popescu, Middlesex University London, UK<br>\nClaudio Sacerdoti Coen, University of Bologna, Italy<br>\nZachary Tatlock, University of Washington, US<br>\nCesare Tinelli, University of Iowa, US</p>",
        "id": 294646924,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661164497
    }
]