[
    {
        "content": "<p>From: Paolo Tranquilli &lt;<a href=\"mailto:tranquil@cs.unibo.it\">tranquil@cs.unibo.it</a>&gt;<br>\nNew postdoc position in the FP7 CerCo Project</p>\n<p>Job description:</p>\n<p>We are currently looking for a one year (or less) Post-Doc position at<br>\nthe Department of Computer Science, University of Bologna, to work on<br>\nthe CerCo FET-Open EU Project (see description below). The candidate<br>\ncan either contribute to the formal verification (in Matita) of the<br>\nCerCo complexity preserving compiler or he can study the application to<br>\nmore complex scenarios of the technique employed to provide exact<br>\ncost estimation of the execution time of programs.</p>\n<p>The gross salary is 26174 euros per year. Only a mimal amount of taxes<br>\nare due on it (net salary about 1900 euros per month). The tentative<br>\nstarting date is the middle of September 2012.</p>\n<p>The University of Bologna is the oldest western university and the<br>\nDepartment of Computer Science (<a href=\"http://www.cs.unibo.it/en/\">http://www.cs.unibo.it/en/</a>), located in<br>\nthe historic city center, has strong expertise in theoretical computer<br>\nscience and logic and it participates to several national and<br>\ninternational projects. The Post-Doc will join the HELM team, leaded by<br>\nProf. Asperti, whose members work in the domains of Type Theory and<br>\nMathematical Knowledge Management. The CerCo project is headed by<br>\nDr. Sacerdoti Coen. The candidate will benefit from exchange opportunity<br>\nwith the other project participants (University Paris-Diderot, Paris,<br>\nand University of Edinburgh, Edinburgh). The candidate will not have any<br>\nteaching duties.</p>\n<p>Requirements:</p>\n<p>Candidates should have a Ph.D. in Computer Science and previous<br>\nexperience in either Type Theory (in particular Interactive Theorem<br>\nProving) or Compiler Development, and being proficient in functional<br>\nprogramming languages. Candidates who have not defended their Ph.D. yet<br>\nbut are supposed to do that soon will also be considered.</p>\n<p>Project description:</p>\n<p>The CerCo FET-Open EU Project (<a href=\"http://cerco.cs.unibo.it\">http://cerco.cs.unibo.it</a>) is aimed at<br>\nproducing the first _formally_ _verified_ _complexity_preserving_<br>\ncompiler for a subset of C to the object code for a microprocessor used<br>\nin embedded systems. The output of the compilation process will be the<br>\nobject code and a copy of the source code annotated with _exact_<br>\ncomputational complexities for each program slice in O(1).<br>\nThe exact computational complexities (expressed in clock<br>\ncycles and parametric in the program input) can then be used to formally<br>\nreason on the overall code complexity. The source code of the compiler<br>\nwill be formally verified using the Matita Interactive Theorem Prover<br>\n(<a href=\"http://matita.cs.unibo.it\">http://matita.cs.unibo.it</a>), based on a variant of the Calculus of<br>\n(Co)Inductive Constructions.</p>\n<p>Application details:</p>\n<p>To apply some forms in Italian only must be filled in, signed, and<br>\nsent by courier. They must arrive before the 10th of September.<br>\nThe candidates should contact in advance Claudio Sacerdot Coen<br>\n&lt;<a href=\"mailto:sacerdot@cs.unibo.it\">sacerdot@cs.unibo.it</a>&gt; (in CC Paolo Tranquilli &lt;<a href=\"mailto:tranquil@cs.unibo.it\">tranquil@cs.unibo.it</a>&gt;)<br>\nfor further informations and assistance in the compilation of the forms.</p>\n<p>Paolo Tranquilli &amp; Claudio Sacerdoti Coen</p>",
        "id": 294221592,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660897791
    }
]