[
    {
        "content": "<p>From: <a href=\"mailto:Gerwin.Klein@data61.csiro.au\">Gerwin.Klein@data61.csiro.au</a><br>\nFirst Call for Papers:</p>\n<p>Workshop on<br>\n            Models for Formal Analysis of Real Systems<br>\n                           (MARS 2017)</p>\n<p>Affiliated With ETAPS 2017</p>\n<p>April 29, 2017 Uppsala, Sweden</p>\n<p><a href=\"http://mars-workshop.org/mars2017/\">http://mars-workshop.org/mars2017/</a></p>\n<p>AIM:<br>\nLogics and techniques for automated reasoning have often been<br>\ndeveloped with formal analysis and formal verification in mind.<br>\nTo show applicability, toy examples or tiny case studies are<br>\ntypically presented in research papers. Since the theory needs<br>\nto be developed first, this approach is reasonable.<br>\n However, to show that a developed approach actually scales to<br>\nreal systems, large case studies are essential. The development<br>\nof formal models of real systems usually requires a perfect<br>\nunderstanding of informal descriptions of the system—sometimes<br>\nfound in RFCs or other standard documents—which are usually just<br>\nwritten in English. Based on the type of system, an adequate<br>\nspecification formalism needs to be chosen, and the informal<br>\nspecification translated into it. Abstraction from unimportant<br>\ndetails then yields an accurate, formal model of the real system.<br>\n The process of developing a detailed and accurate model usually<br>\ntakes a large amount of time, often months or years; without even<br>\nstarting a formal analysis. When publishing the results on a formal<br>\nanalysis in a scientific paper, details of the model have to be skipped<br>\ndue to lack of space, and often the lessons learnt from modelling are<br>\nnot discussed since they are not the main focus of the paper.<br>\n The workshop aims at discussing exactly these unmentioned lessons.<br>\nExamples are:</p>\n<ul>\n<li>Which formalism is chosen, and why?</li>\n<li>Which abstractions have to be made and why?</li>\n<li>How are important characteristics of the system modelled?</li>\n<li>Were there any complications while modelling the system?</li>\n<li>Which measures were taken to guarantee the accuracy of the model?</li>\n</ul>\n<p>The workshop emphasises modelling over verification. In particular,<br>\nwe invite papers that present full Models of Real Systems, which may<br>\nlay the basis for future formal analysis. The workshop will bring<br>\ntogether researchers from different communities that all aim at verifying<br>\nreal systems and are developing formal models for such systems. Areas where<br>\nlarge models often occur are within networks, (trustworthy) systems and<br>\nsoftware verification (from byte code up to programming- and specification<br>\nlanguages). An aim of the workshop is to present different modelling<br>\napproaches and discuss pros and cons for each of them.</p>\n<p>SUBMISSION:</p>\n<p>Submissions must be unpublished and not be submitted for publication elsewhere.<br>\nContributions are limited to 8 pages EPTCS style (not counting the appendices),<br>\nbut shorter extended abstracts are welcome. Appendices (of arbitrary length) can<br>\nbe used to present all details of a formalised model; the appendices will be part<br>\nof the proceedings. In case a formal model is presented that is modelled in some<br>\nformalism or tool, such as timed automata for Uppaal or formal proofs for Isabelle/HOL,<br>\nthese models have to be submitted as well. They will be published as part of the<br>\nproceedings, and will be made available in our Repository of Models for Formal<br>\nAnalysis of Real Systems (<a href=\"http://mars-workshop.org/repository.html\">http://mars-workshop.org/repository.html</a>).<br>\nSubmissions must be in English and submitted in PDF format via EasyChair<br>\n(<a href=\"https://easychair.org/conferences/?conf=mars2017\">https://easychair.org/conferences/?conf=mars2017</a>).<br>\n All submissions will be peer reviewed by at least three referees based on their<br>\nnovelty, relevance and technical merit. The proceedings (including the electronic<br>\nmodels) will be published as part of the open access series Electronic Proceedings<br>\nin Theoretical Computer Science (EPTCS).</p>\n<p>IMPORTANT DATES (AoE):</p>\n<ul>\n<li>Submission: Friday 13 January 2017</li>\n<li>Notification: Monday 13 February 2017</li>\n<li>Final version: Monday 27 February 2017</li>\n<li>Workshop: Saturday 29 April 2017</li>\n</ul>\n<p>PROGRAMME COMMITTEE:</p>\n<p>Hubert Garavel          (INRIA, France)<br>\nJan Friso Groote  (Eindhoven University of Technology, The Netherlands)<br>\nHolger Hermanns (co-chair) (Saarland University, Germany)<br>\nPeter Höfner (co-chair) (Data61, CSIRO, Australia)<br>\nGerard Holzmann          (NASA/JPL, USA)<br>\nPavel Krcal             (Lloyd's Register, Sweden)<br>\nKim G. Larsen           (Aalborg University, Denmark)<br>\nDavid Parker            (University of Birmingham, United Kingdom)<br>\nFrits Vaandrager        (Radboud University, The Netherlands)<br>\nMarcel Verhoef          (European Space Agency, ESTEC, The Netherlands)</p>\n<p>CONTACT:</p>\n<p>mars2017@mars-workshop.org&lt;mailto:<a href=\"mailto:mars2017@mars-workshop.org\">mars2017@mars-workshop.org</a>&gt;</p>",
        "id": 294684794,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661177600
    }
]