[
    {
        "content": "<p>From: Ognjen Maric &lt;<a href=\"mailto:ognjen.maric@gmail.com\">ognjen.maric@gmail.com</a>&gt;<br>\nHi all,</p>\n<p>I'm getting exceptions from the split_beta simproc which propagate to<br>\nthe \"user-level\" (Isabelle 2013). Here's a minimal example:</p>\n<p>lemma \"P (\\&lt;lambda&gt;s. (case s of (x, y) \\&lt;Rightarrow&gt; c))\"<br>\n  using [[simp_depth_limit=0]]<br>\n  apply(simp)</p>\n<p>This results in:<br>\n*** Proof failed.<br>\n*** (case :000 of (x, y) \\&lt;Rightarrow&gt; c) = c<br>\n***  1. (case :000 of (x, y) \\&lt;Rightarrow&gt; c) = c<br>\n*** The error(s) above occurred for the goal statement:<br>\n*** (case :000 of (x, y) \\&lt;Rightarrow&gt; c) = c\u0001</p>\n<p>Setting the depth limit to 2 or higher makes the error go away. Glancing<br>\nat the simproc, it seems that its local function \"meta_eq\" assumes that<br>\nrewriting with just \"cond_split_eta\" will work, but this fails at low<br>\nsimp depths.</p>\n<p>Cheers,<br>\nOgnjen</p>",
        "id": 294252710,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660911379
    },
    {
        "content": "<p>From: Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt;<br>\nThanks for working out a well-defined example for this incident.</p>\n<p>This thread was left open over several months, because nobody felt <br>\nresponsible for a simproc that David von Oheimb made in 1998.  But the <br>\nproblem here is not the simproc, it is the Simplifier context in <br>\nIsabelle2013 (and Isabelle2013-2).</p>\n<p>Reductionism is the great fallacy of modern science, and I almost fell on <br>\nthe nose myself by \"fixing\" the simproc, although it is not at fault.  It <br>\nis merely an indicator of a problem somewhere else --- there is no need to <br>\nblame the messenger for a bad message.</p>\n<p>The real problem behind the incident above is \"localization\" of the <br>\nSimplifier, or rather lack thereof. That important and complex tool still <br>\nhad its own \"simpset\" over a long time, with unclear relation to the <br>\nall-important Proof.context that is uniform for all tools (and allows <br>\ntools to cooperate robustly in the first place, if done right).</p>\n<p>The mistake above is due to the Simplifier \"depth\" field: it ended up <br>\nsemantically as part of the context, but seems to belong to the simpset <br>\ninstead.  Thus nested tools like the split_eta and split_beta simprocs <br>\nmay provide a fresh environment for their own simplification business.</p>\n<p>Just some weeks ago, I discovered some other incoherence in the \"params\" <br>\nmanagement of the Simplifier: that field belongs into the context, not the <br>\nsimpset.</p>\n<p>Conclusion: it should work better again in the coming Isabelle2014 release <br>\n(summer 2014).</p>\n<p>Makarius</p>",
        "id": 294269859,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660916820
    }
]