[
    {
        "content": "<p>From: Leo Freitas &lt;<a href=\"mailto:leo.freitas@newcastle.ac.uk\">leo.freitas@newcastle.ac.uk</a>&gt;<br>\nFourth Verified Software Competition (VSComp) 2014<br>\n14-15 June 2014<br>\n<a href=\"http://vscomp.org\">http://vscomp.org</a></p>\n<p>Organizers: Ernie Cohen, Marcelo Frias, Peter Müller, Natarajan Shankar</p>\n<p>The Fourth Verified Software Competition (VSComp) aims to showcase the<br>\nprogress in verification technology.  The competition will occur over<br>\n48 hours during the weekend of 14/15 June starting with the<br>\npublication of the challenge problems at 0900 GMT of Sat June 14 and<br>\nending with the submission deadline for the solutions at 0900 GMT of<br>\nMon June 16.  Teams of up to three individuals can register to<br>\nparticipate just prior to the start of the competition at<br>\n<a href=\"http://vscomp.org\">http://vscomp.org</a>.  The competition will consist of five verification<br>\nchallenges (with possible sub-problems) spanning a range of domains,<br>\nincluding (but not limited to) sequential and concurrent algorithms,<br>\nrefinement, assertional verification, and metatheory.  Teams will have<br>\nto solve the challenge problems using mechanized tools.  Teams are<br>\nallowed to use multiple tools to tackle the challenges.  Only the best<br>\nthree problem solutions from each team will be taken into<br>\nconsideration for evaluating team performance.  An FAQ Wiki page will<br>\nbe maintained at the website to clarify questions that might come up<br>\nbefore or during the competition.  After the competition, solutions<br>\nwill be made publicly available for peer review by the other teams.<br>\nTeams should be available to answer questions during the peer review<br>\nprocess, and if necessary, be prepared to make their verification<br>\ntools available for experimentation.  Based on the results of the peer<br>\nreview, the organizers will evaluate the solutions for correctness,<br>\ncompleteness, and clarity.</p>\n<p>The winners will be given short speaking slots at VSTTE 2014 which<br>\ntakes place in Vienna during July 17, 18, 2014.  The competition will<br>\nrun on an honor system to ensure that above guidelines are being<br>\nfollowed by each of the teams.  We especially encourage the<br>\nparticipation of all-student teams and teams that are using tools<br>\ndeveloped by others.</p>\n<p>Questions or comments about the contest should be sent to <a href=\"mailto:vscomp2014@gmail.com\">vscomp2014@gmail.com</a>.</p>",
        "id": 294280956,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660920346
    }
]