[
    {
        "content": "<p>From: Moa Johansson &lt;<a href=\"mailto:moa.johansson@chalmers.se\">moa.johansson@chalmers.se</a>&gt;<br>\nThis workshop on Automated Mathematical Theory exploration will be held in on the 18th of July 2014 as part of the Vienna Summer of Logic.</p>\n<p>Scope<br>\nAutomated mathematical theory exploration is an exciting emerging research topic for mathematicians, developers of formalised mathematics, and those working on verified software. This topic concerns the theory and practice of developing software systems that support the automated development of mathematical theories, including the invention of definitions, theorems, conjectures, problems, examples and algorithms. The workshop aims to highlight the research area and foster collaboration amongst those working in software verification, formalised mathematics, and mathematical research, as well as help provide a shared understanding of the theory and tools for automated invention and discovery of mathematical theories.</p>\n<p>In this workshop, we want to encourage dissemination of knowledge as well as interaction between researchers. Thus the programme will involve an invited talk, contributions at different levels and possible system demos.</p>\n<p>Topics<br>\nWe invite proposals to give a talk and/or to provide a demo. Topics and demonstrations of interest include all aspects of mathematical theory exploration, especially the invention and discovery steps in the development of mathematical theories, and role of Machine Learning in guiding such processes. This includes, but is not limited to position statements, descriptions of important features, theories of theory exploration, and systems descriptions. We also welcome contributions on the application of theory exploration to other parts of mathematics, computer science and software engineering, as well as to other sciences such as physics and biology.</p>\n<p>Submission<br>\nSubmissions will be accepted based on light reviewing of extended abstracts by a review panel of researchers interested in the area. The extended abstracts will not be archival publications, but will be published online. Accepted submissions will also be disseminated in an informal proceedings which will be available during the workshop.</p>\n<p>Please submit extended abstracts and demo proposals by easychair: <a href=\"https://www.easychair.org/login.cgi?conf=automatheo14\">https://www.easychair.org/login.cgi?conf=automatheo14</a></p>\n<p>We invite submissions in 3 catgories:</p>\n<p>• short research paper (up to 8 pages)<br>\n    • system/tool description (3 pages)<br>\n    • work in progress abstract (3 pages)<br>\nWe suggest, but do not require, that you use the easychair style for formatting submissions. This is available from: <a href=\"http://www.easychair.org/easychair.zip\">http://www.easychair.org/easychair.zip</a></p>\n<p>Important Dates<br>\n    • Submission deadline: Fri 25th April 2014<br>\n    • Acceptance notification: Tue 20th May 2014<br>\n    • Final versions of submissions: Tue 27th May 2014<br>\n    • Workshop: Fri 18th July 2014</p>\n<p>Programme Committee<br>\n    • Jacques Fleuriot (Edinburgh)<br>\n    • Moa Johansson (Chalmers)<br>\n    • Alex Kissinger (Oxford) (tbc)<br>\n    • Katya Komendantskaya (Dundee)<br>\n    • Roy McCasland (Edinburgh)<br>\n    • Alison Pease  (Dundee)<br>\n    • Dan Rosen (Chalmers)<br>\n    • Alan Smaill   (Edinburgh)<br>\n    • Wolfgang Windsteiger (RISC)</p>",
        "id": 294271617,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660917409
    }
]