[
    {
        "content": "<p>From: Christoph Sprenger &lt;<a href=\"mailto:sprenger@inf.ethz.ch\">sprenger@inf.ethz.ch</a>&gt;<br>\nMultiple PhD and Postdoc positions in Information Security and Program<br>\nVerification at ETH Zurich, available immediately</p>\n<p>The Institute of Information Security (the groups of Prof. Adrian Perrig<br>\nand Prof. David Basin) and the Programming Methodology Group (Prof. Peter<br>\nMüller) at ETH Zurich have multiple open positions for PhD students and<br>\nPostdocs in a research project in the area of digital trust. The goal of<br>\nthis project is to develop a comprehensive, formally verified security<br>\narchitecture for communication in the physical and digital world. In<br>\nparticular, the project will develop protocols to transfer physical trust<br>\nrelationships into the digital world and store, manage, and use them. The<br>\ndesign will take into account human (mis-)behavior from the outset. A<br>\nparticular emphasis is on the formal verification of the architecture both<br>\nat the design and implementation level to rule out any undesired behavior.</p>\n<p>We are looking for enthusiastic and outstanding Computer Science or<br>\nMathematics students and postdoctoral researchers with a strong background<br>\nin some of the following topics:</p>\n<ul>\n<li>formal modeling and verification,</li>\n<li>program verification,</li>\n<li>theorem proving, model checking,</li>\n<li>cryptographic protocols,</li>\n<li>public-key infrastructure, identity management, authentication,</li>\n<li>networking and distributed systems, and</li>\n<li>design and implementation of security architectures.</li>\n</ul>\n<p>ETH Zurich regulations require PhD students to hold a Masters or equivalent<br>\ndegree (e.g., Diplom). All candidates matching the profile above are<br>\nencouraged to apply as soon as possible. We will process applications until<br>\nall positions are filled. Successful candidates are expected to start soon<br>\nafter acceptance, but the starting date is negotiable.</p>\n<p>Applications should include:</p>\n<ul>\n<li>a curriculum vitae,</li>\n<li>a brief description of research interests,</li>\n<li>transcripts of grades,</li>\n<li>letters of recommendation from teachers or employers, and,</li>\n<li>if possible, the Master's or Bachelor's thesis and publications.</li>\n</ul>\n<p>Applications and inquiries should be sent to Christoph Sprenger and Sandra<br>\nSchneider at the following email addresses.</p>\n<p><a href=\"mailto:infsec.positions@inf.ethz.ch\">infsec.positions@inf.ethz.ch</a>, <a href=\"mailto:jobs-pm@inf.ethz.ch\">jobs-pm@inf.ethz.ch</a> </p>\n<p>PhD students and Postdocs are paid employees of ETH Zurich. Salary and<br>\nemployment conditions are attractive. Zurich is a diverse and multicultural<br>\ncity which is consistently rated among the best cities in the world in<br>\nwhich to live.</p>",
        "id": 294763167,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661200623
    }
]