[
    {
        "content": "<p>From: Joachim Breitner &lt;<a href=\"mailto:breitner@kit.edu\">breitner@kit.edu</a>&gt;<br>\nHi,</p>\n<p>here at Karlsruhe we are offering a practical Course on Isabelle which<br>\nbegan last week and we were badly surprised that Isabelle/jEdit 2013 had<br>\nsevere issues on the machines in the student’s pool room: A short while<br>\ninto editing the highlighting (errors and the light blue) and the output<br>\nwindow are no longer updated.</p>\n<p>We could reproduce it most easily by writing, say,<br>\n        theory Scratch imports Main begin lemma \"foobar\"<br>\nand then changing \"lemma\" to \"le mma\" and back in very rapid succession.</p>\n<p>The machines in question are Fedora 18 systems, 64 bit, 4GB RAM, no swap<br>\nand the file systems on NFS. We also reproduced it on machines with more<br>\nRAM and on machien with the 32 bit libraries installed in addition. We<br>\ncannot reproduce it on our own workstations, though.</p>\n<p>It seems it is happening more easily on slower machine. Maybe some race<br>\ncondition?</p>\n<p>We are at a loss here – any idea how to get it working more reliable?</p>\n<p>Thanks,<br>\nJoachim<br>\n<a href=\"/user_uploads/14278/YmPlWq3vjBFnavnH522fCHfU/signature.asc\">signature.asc</a></p>",
        "id": 294240239,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660906654
    },
    {
        "content": "<p>From: Lars Noschinski &lt;<a href=\"mailto:noschinl@in.tum.de\">noschinl@in.tum.de</a>&gt;<br>\nI occasionally had similar problems but did not manage to produce a <br>\nreproducible example yet. However, I managed to get the system back to <br>\nworking by hitting the \"Cancel' button in the \"Theories\" window a few times.</p>\n<p>If I remember correctly, the problem occurred often when editing a proof <br>\nwhich was followed by a \"lemma (in LOC)\" where LOC was a reasonably big <br>\nlocale from HOL-Algebra.</p>\n<p>This occurred both with Isabelle 2013 and a recent Isabelle development <br>\nsnapshot. Debian with a 64-bit Isabelle, 6GB RAM, Core 2 Duo and a Gnome <br>\n3 desktop.</p>\n<p>-- Lars</p>",
        "id": 294240254,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660906663
    },
    {
        "content": "<p>From: Denis Lohner &lt;<a href=\"mailto:denis.lohner@kit.edu\">denis.lohner@kit.edu</a>&gt;<br>\nUnfortunately, hitting \"Cancel\" doesn't work here at Karlsruhe. However, <br>\nin the student's computer pool hitting \"Check\" while a large theory file <br>\nis being processed, seems to reliabely result in the same freeze of the <br>\nOutput panel.</p>\n<p>As there is no error message in the Output panel or at the command line, <br>\nwhat are our options to investigate the problem? Is there an option to <br>\nlog the communication between jEdit and the isabelle process? Would this <br>\ninformation help to find the cause?</p>\n<p>Thanks,<br>\n   Denis</p>",
        "id": 294240289,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660906675
    },
    {
        "content": "<p>From: Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt;<br>\nThe \"Protocol\" panel in Isabelle/jEdit gives a full transcript of the two <br>\nprocesses communicating, although that slows down things considerably, and <br>\nusually makes such non-deterministic problems disappear.</p>\n<p>There have been reports about several such real-time reactivity problems <br>\nin the past few months, but so far very few concrete hints of the actual <br>\nreasons.  Problems with Fedora 18 in particular had been reported before, <br>\nbut this does not say much -- recent Linux distributions all tend towards <br>\ninstabilities that were not there 1 or 2 years ago.</p>\n<p>In the next round of refinements of Isabelle/Scala and Isabelle/jEdit, I <br>\nwill be more defensive in the use of certain Java 7 GUI / window popup <br>\nfeatures, and also in the use of Scala actors.  There are reasons to <br>\nbelieve that these basic building blocks of the interactive framework are <br>\nnot 100% reliable.</p>\n<p>Apart from that, any more concrete observation where things don't work in <br>\nIsabelle2013 will be treated with the usual scrutiny.</p>\n<p>Makarius</p>",
        "id": 294241315,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660907101
    }
]