[
    {
        "content": "<p>From: Stephan Merz &lt;<a href=\"mailto:stephan.merz@loria.fr\">stephan.merz@loria.fr</a>&gt;<br>\nDear colleagues,</p>\n<p>the VTSA summer school may be of interest to the interactive theorem proving community. Also note that it takes place in the week following ITP 2016, and that Liège, Belgium, is easily reached from Nancy, France.</p>\n<p>I would be most obliged if you could pass on this announcement to interested students and colleagues.</p>\n<p>Best regards,<br>\nStephan Merz</p>\n<p>======================================================</p>\n<p>Summer School on Verification Technology, Systems &amp; Applications<br>\n<a href=\"http://www.mpi-inf.mpg.de/vtsa16/\">http://www.mpi-inf.mpg.de/vtsa16/</a></p>\n<p>The 9th edition of the Summer School on Verification Technology,<br>\nSystems and Applications (VTSA) will be organized by the University of<br>\nLiège, in cooperation with Inria Nancy - Grand Est, Max-Planck-Institut<br>\nfür Informatik Saarbrücken, Université du Luxembourg, and Universität<br>\nKoblenz-Landau. The school will take place from August 29th to<br>\nSeptember 2nd, 2016 at the Montefiore Institute in Liège, Belgium.</p>\n<p>The following speakers have accepted to give courses at VTSA 2016:</p>\n<ul>\n<li>\n<p>Hubert Comon: Communication security: Formal models and proofs</p>\n</li>\n<li>\n<p>Thomas Eiter: Answer set programming and extensions</p>\n</li>\n<li>\n<p>Jean Krivine: Executable knowledge representation in systems<br>\n  biology: The rule-based approach</p>\n</li>\n<li>\n<p>Tobias Nipkow: Introduction to interactive proof with Isabelle/HOL</p>\n</li>\n<li>\n<p>Ruzica Piskac: SMT-based verification of heap-manipulating Programs</p>\n</li>\n</ul>\n<p>Participation is free (except for travel and accommodation costs) and<br>\nopen to anybody holding at least a bachelor degree or equivalent in<br>\ncomputer science; it includes the lectures, daily coffee and lunchbreaks, <br>\nand a school dinner. Attendance is limited to 40 participants. <br>\nPlease apply electronically by sending to <a href=\"mailto:vtsa16@montefiore.ulg.ac.be\">vtsa16@montefiore.ulg.ac.be</a>:</p>\n<ul>\n<li>\n<p>a one-page CV,</p>\n</li>\n<li>\n<p>an application letter explaining your interest in the school and<br>\n your experience in the area,</p>\n</li>\n<li>\n<p>a copy of your bachelor certificate (or equivalent or a more significant<br>\ncertificate).</p>\n</li>\n</ul>\n<p>The deadline for application is July 12th, 2016. Notification of<br>\nacceptance will be given by July 15th, 2016.</p>\n<p>Full details are available at <a href=\"http://www.mpi-inf.mpg.de/vtsa16/\">http://www.mpi-inf.mpg.de/vtsa16/</a></p>",
        "id": 294678844,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661175932
    }
]