[
    {
        "content": "<p>From: Santiago Escobar &lt;<a href=\"mailto:sescobar@dsic.upv.es\">sescobar@dsic.upv.es</a>&gt;<br>\n10th International Workshop on Rewriting Logic and its Applications</p>\n<p>WRLA 2014<br>\nGrenoble, France, April 5th and 6th, 2014<br>\n<a href=\"http://www.dsic.upv.es/workshops/wrla2014/\">http://www.dsic.upv.es/workshops/wrla2014/</a></p>\n<p>The workshop will be held in conjunction with<br>\nETAPS 2014<br>\n17th European Joint Conferences on Theory and Practice of Software<br>\nApril 5-13, 2014<br>\n<a href=\"http://www.etaps.org/2014\">http://www.etaps.org/2014</a></p>\n<p>AIMS AND SCOPE</p>\n<p>Rewriting logic (RL) is a natural model of computation and an <br>\nexpressive semantic framework for concurrency, parallelism, <br>\ncommunication, and interaction. It can be used for specifying <br>\na wide range of systems and languages in various application <br>\nfields. It also has good properties as a metalogical framework <br>\nfor representing logics. In recent years, several languages <br>\nbased on RL (ASF+SDF, CafeOBJ, ELAN, Maude) have been designed <br>\nand implemented. The aim of the workshop is to bring together <br>\nresearchers with a common interest in RL and its applications, <br>\nand to give them the opportunity to present their recent works, <br>\ndiscuss future research directions, and exchange ideas.</p>\n<p>The topics of the workshop comprise, but are not limited to,</p>\n<ul>\n<li>foundations and models of RL;</li>\n<li>languages based on RL, including implementation issues;</li>\n<li>RL as a logical framework;</li>\n<li>RL as a semantic framework, including applications of RL to</li>\n<li>object-oriented systems,</li>\n<li>concurrent and/or parallel systems,</li>\n<li>interactive, distributed, open ended and mobile systems,</li>\n<li>specification of languages and systems;</li>\n<li>\n<p>use of RL to provide rigorous support for model-based software <br>\nengineering;</p>\n</li>\n<li>\n<p>formalisms related to RL, including</p>\n</li>\n<li>real-time and probabilistic extensions of RL,</li>\n<li>rewriting approaches to behavioral specifications,</li>\n<li>tile logic;</li>\n<li>verification techniques for RL specifications, including</li>\n<li>equational and coherence methods,</li>\n<li>\n<p>verification of properties expressed in first-order, <br>\n higher-order, modal and temporal logics,</p>\n</li>\n<li>\n<p>narrowing-based analysis and verification;</p>\n</li>\n<li>comparisons of RL with existing formalisms having analogous aims;</li>\n<li>application of RL to specification and analysis of</li>\n<li>distributed systems,</li>\n<li>physical systems.</li>\n</ul>\n<p>IMPORTANT DATES</p>\n<p>Submission deadline          December 30th 2013<br>\nAuthor notification          February 2nd 2014<br>\nVersion informal proceedings February 14th 2014</p>\n<p>SUBMISSIONS</p>\n<p>The final program of the workshop will include regular papers, <br>\ntool papers, and work-in-progress presentations. The program <br>\nwill also contain invited talks to be determined by the <br>\nprogram committee. Papers must contain original contributions, <br>\nbe clearly written, include appropriate references, and <br>\ncomparison with related work. They must be unpublished and <br>\nnot submitted simultaneously for publication elsewhere. <br>\nTool papers present a new tool, a new tool component, or <br>\nnovel extensions to an existing tool. They should provide a <br>\nshort description of the theoretical foundations with <br>\nrelevant citations, emphasize the design and implementation,<br>\nand give a clear account of the tool's functionality. The<br>\ndescribed tools must be publicly available via the web.<br>\nAll submissions should be formatted according to the <br>\nguidelines for Springer LNCS papers, and should be submitted <br>\nelectronically using EasyChair.</p>\n<p>Regular papers and work-in-progress should not exceed <br>\n15 pages including references. Tool papers can have a <br>\nmaximum of 6 pages including references and may have <br>\nan appendix of up to 4 additional pages with <br>\nusage details and tool demonstration.</p>\n<p>PROCEEDINGS</p>\n<p>All submissions will be evaluated by the Program Committee. <br>\nRegular papers, tool papers, and work-in-progress that <br>\nare accepted will be presented at the workshop and <br>\nincluded in the proceedings, which will be available<br>\nduring the workshop. Regular papers, tool papers, and <br>\ninvited presentations will also be published in a volume <br>\nin Springer's Lecture Notes in Computer Science <br>\n(LNCS) series to be distributed after the workshop. </p>\n<p>Depending on the number and the quality of the contributions, <br>\nwe will consider the preparation of a special issue in some <br>\nscientific journal in the field with extended versions of a <br>\nselection of the papers of the workshop.</p>\n<p>CONTACT INFORMATION</p>\n<p>For more information, please contact the organizers<br>\n<a href=\"mailto:sescobar@dsic.upv.es\">sescobar@dsic.upv.es</a><br>\nor visit the workshop web page<br>\n<a href=\"http://www.dsic.upv.es/workshops/wrla2014/\">http://www.dsic.upv.es/workshops/wrla2014/</a></p>",
        "id": 294252487,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660911288
    }
]