[
    {
        "content": "<p>From: Peter Lammich &lt;<a href=\"mailto:lammich@in.tum.de\">lammich@in.tum.de</a>&gt;<br>\nRefering to Isabelle2013-1-RC2:</p>\n<p>When loading some big development in jedit, e.g.,<br>\nJinjaThreads/JinjaThreads.thy, it prints an error message \"Bad<br>\nTheory: .../Basic_Main.thy\" and has an error marker (red underline) on<br>\nthe first line (theory JinjaThreads) of \"JinjaThreads.thy\". </p>\n<p>After a few second (30 or so, the error marker disappears), after a few<br>\nminutes, also the error message in the output disappears.</p>\n<p>This behaviour is really puzzling, I was already wondering what went<br>\nwrong here, until somebody told me that it is normal for jedit to print<br>\nsome error messages on correct theories, that then magically disappear<br>\nafter some time.</p>",
        "id": 294251383,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660910882
    },
    {
        "content": "<p>From: Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt;<br>\nThe expectation seems to be immediate (synchronized) feedback by the tight <br>\nreal-eval-print loop from distant past.  Isabelle/jEdit uses an <br>\nasynchronous model that is hardly new, not even for IDE frameworks in <br>\ngeneral. When you manage huge amounts of information, it is more efficient <br>\n(for the machine and the user) to give up the assumption of synchronous <br>\nsequential command application.</p>\n<p>To reduce confusion about the overall state of continuous checking the <br>\nTheories panel is quite helpful -- it is docked by default and can be <br>\nopened by a single click.</p>\n<p>Moreover the overall text view is \"greyed out\" if the editor is still <br>\nawaiting important feedback from the prover about already sumbitted edits.</p>\n<p>More status overview and warning/error summaries (as seen in other IDEs) <br>\ncan be expected for the future, but old-style synchronous TTY interaction <br>\nis not coming back.</p>\n<p>Makarius</p>",
        "id": 294255464,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660912434
    }
]