[
    {
        "content": "<p>From: Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt;<br>\nThere is a deeper problem behind it: Isabelle2017 and Isabelle2018 were<br>\na bit too liberal in the reform of session-qualified theory names, still<br>\nadmitting odd sub-directory layouts and shared sub-directories for<br>\ndifferent sessions.</p>\n<p>For Isabelle2019, I had some plans to clear this out: allowing theory<br>\nsources to reside only in explicitly specified session directories. Thus<br>\nmost of the uncertainty of theory file location would go away. I did not<br>\nmanage to re-open this on time, so it is postponed to a later release.</p>\n<p>So the overall situation in Isabelle2019 should be mostly the same as in<br>\nIsabelle2018.</p>\n<p>Makarius</p>",
        "id": 294755791,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661197429
    },
    {
        "content": "<p>From: Dominique Unruh &lt;<a href=\"mailto:unruh@ut.ee\">unruh@ut.ee</a>&gt;<br>\nHi,</p>\n<p>I updated to 2019-RC1 but forgot to update afp-devel to the required <br>\nversion (it was still on af53c1f41e1c). When starting jEdit, I get the <br>\nfollowing message (as a popup):</p>\n<p><em>/opt/Isabelle2019-RC1/src/Tools/jEdit/dist/jars/Isabelle-jEdit.jar:</em><br>\n    Cannot start:<br>\n    *** Duplicate theory<br>\n    \"/opt/Isabelle2019-RC1/src/HOL/Library/Countable_Set_Type.thy\" vs.<br>\n    \"HOL-Library.Countable_Set_Type\"</p>\n<p>The problem is solved by updating AFP. However, I wonder whether this <br>\nerror message can be improved, e.g., by indicating from where the <br>\nduplicate theories are included (this might be beyond the scope of the <br>\nRC, of course, if the information is not already available at the <br>\nlocation where the error is generated). Otherwise figuring out where the <br>\nerror is may involve a lot of detective work and try and error to narrow <br>\ndown where the problem comes from.</p>\n<p>Secondly, I wonder whether this message indicates a regression. If I <br>\nremember correctly, in 2018(?) a mechanism was introduced that allows <br>\nIsabelle to recognize when the same theory file is loaded via two <br>\ndifferent paths. (I may misremember.) The present case looks like an <br>\nexample of this. So should this error even occur?</p>\n<p>Best wishes,<br>\nDominique.</p>",
        "id": 294756241,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661197620
    }
]