[
    {
        "content": "<p>From: Lawrence Paulson &lt;<a href=\"mailto:lp15@cam.ac.uk\">lp15@cam.ac.uk</a>&gt;<br>\nAs I see it, there are advantages to both interfaces. And everything is accessible from ML simply because it is the implementation language, although of course this access may not be very convenient. I think it's generally accepted these days that the ML level really is more appropriate for development than for ordinary reasoning. It isn't realistic to support both Isar and the ML level as the day-to-day user interface; even with unlimited resources, such duplication wouldn't be very elegant.</p>\n<p>Isabelle has undergone very rapid change over the years, and this has meant leaving a lot of old practices behind. I know that it has caused users difficulties in the past, and it's unfortunate, but maintaining upwards compatibility is also very difficult. As one of the earliest Isabelle users, you naturally feel this much more than others do.</p>\n<p>Larry</p>",
        "id": 294226005,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660900013
    },
    {
        "content": "<p>From: Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt;<br>\nActually, the Prover IDE supports both Isabelle/Isar and Isabelle/ML <br>\npretty well -- note that Isabelle/ML needs to be distinguished from the ML <br>\nbootstrapping environment to get the Isabelle/Pure/Isar implementation up <br>\nand running.</p>\n<p>You can even imitate the proof style from the 1990-ies like this:</p>\n<p>apply (tactic {* my_tac @{context} 7 *})</p>\n<p>Its definitely not elegant, and there is little reason to use this form <br>\ntoday.  It is better to use method_setup to define your own application <br>\nspecific proof methods first, and then use them in the proofs.</p>\n<p>Makarius</p>",
        "id": 294226017,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660900020
    },
    {
        "content": "<p>From: Jeremy Dawson &lt;<a href=\"mailto:jeremy@rsise.anu.edu.au\">jeremy@rsise.anu.edu.au</a>&gt;<br>\nLarry,</p>\n<p>I take your first point, that \"everything is accessible from ML\",  but <br>\nin a practical sense, I would say it's not because the code is so <br>\ndifficult to understand.  (Much more difficult than either Isabelle as <br>\nit was in 1997, or HOL, to give examples within my experience.)</p>\n<p>In a way, my first contribution to this thread was to make it clear that <br>\nboth \"development\" and \"ordinary reasoning\" are intertwined - there was <br>\nquite a lot of \"development\" involved in getting the right combination <br>\nof compound tactics and proof steps to avoid a proof script which would <br>\nhave been 10000 lines long.</p>\n<p>The bigger issue is that pen and paper proofs I do and publish in a <br>\njournal will be available as long as people want to read them.  The <br>\nIsabelle proofs I do are in Isabelle 2005, and include theory and ML <br>\nfiles from 1997, and so will in the future be inaccessible to anyone who <br>\ndoesn't (or can't) install Isabelle 2005  (which only seems to work with <br>\none particular version of PolyML).  Given the philosophy of Isabelle <br>\ndevelopers, prospective users need to be warned that if they want to <br>\nwrite proofs which will be accessible to future researchers, they need <br>\nto be done in print.</p>\n<p>Finally, it's worth pointing out that no one in this thread has actually <br>\ncome up with a suggestion about how to do the sort of proof which was <br>\nthe subject of my original post other than using Standard ML (which, I <br>\nunderstand, was designed for exactly that purpose).</p>\n<p>Jeremy</p>\n<p>Lawrence Paulson wrote:</p>",
        "id": 294226062,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660900043
    },
    {
        "content": "<p>From: Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt;<br>\nOn Tue, 20 Nov 2012, Jeremy Dawson wrote:</p>\n<blockquote>\n<p>In a way, my first contribution to this thread was to make it clear that <br>\nboth \"development\" and \"ordinary reasoning\" are intertwined - there was <br>\nquite a lot of \"development\" involved in getting the right combination <br>\nof compound tactics and proof steps to avoid a proof script which would <br>\nhave been 10000 lines long.</p>\n</blockquote>\n<p>This is why I have never separated Isabelle/Isar and Isabelle/ML in that <br>\nsense, they are just two different languages of the Isabelle user-space. <br>\nMy first command implemented on the Isar toplevel was 'ML'.</p>\n<p>Isabelle/ML happens to be used much less in applications these days, <br>\nthough, and this is no problem, merely an indication that the abstractions <br>\nof Isar do most of your work already without extra tinkering in ML.</p>\n<p>Anyway, I've pointed to the Isar command 'method_setup' already.  If you <br>\nlook it up in the isar-ref or implementation manual, and then look at 5-10 <br>\nexamples in the library, you should rather quickly get an idea how to <br>\ndefine your own basic proof tools, like in the old ML-only times of <br>\nIsabelle in the 1990-ies.</p>\n<blockquote>\n<p>The bigger issue is that pen and paper proofs I do and publish in a <br>\njournal will be available as long as people want to read them.  The <br>\nIsabelle proofs I do are in Isabelle 2005, and include theory and ML <br>\nfiles from 1997, and so will in the future be inaccessible to anyone who <br>\ndoesn't (or can't) install Isabelle 2005 (which only seems to work with <br>\none particular version of PolyML).  Given the philosophy of Isabelle <br>\ndevelopers, prospective users need to be warned that if they want to <br>\nwrite proofs which will be accessible to future researchers, they need <br>\nto be done in print.</p>\n</blockquote>\n<p>Users just need to be told about AFP, to preserve things in the longer <br>\nterm.  (AFP does not accept ancient 1900-style scripts.)</p>\n<blockquote>\n<p>Finally, it's worth pointing out that no one in this thread has actually <br>\ncome up with a suggestion about how to do the sort of proof which was <br>\nthe subject of my original post other than using Standard ML (which, I <br>\nunderstand, was designed for exactly that purpose).</p>\n</blockquote>\n<p>We will come back to this on-topic on the original thread.  So far I've <br>\nskimmed a little over these theories by Christoph Lange, and it looks <br>\nmostly like a conventional \"Isar deflation\" job, not old-style ML <br>\ntinkering.</p>\n<p>Makarius</p>",
        "id": 294226084,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660900050
    },
    {
        "content": "<p>From: Lawrence Paulson &lt;<a href=\"mailto:lp15@cam.ac.uk\">lp15@cam.ac.uk</a>&gt;<br>\nI think it's a great pity that you are using such an elderly version of Isabelle.</p>\n<p>If you have a lot of legacy code that simply can't be ported, or an application where it works really well, okay. But for general proofs, there is simply no comparison between the Isabelle of today and one that is seven years old. Sledgehammer, counterexample finding, a very powerful function definition package, lots and lots of AFP theories… You shouldn't forego all of those.</p>\n<p>Larry</p>",
        "id": 294226108,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660900063
    },
    {
        "content": "<p>From: Jeremy Dawson &lt;<a href=\"mailto:jeremy@rsise.anu.edu.au\">jeremy@rsise.anu.edu.au</a>&gt;<br>\nLarry,</p>\n<p>I don't suppose the legacy code simply can't be ported, any more than it <br>\ncan't be translated into HOL.  But when I started to port it from <br>\nIsabelle2005 to Isabelle2007 (still using ML tactics) I quickly gave <br>\nup.  I expect it would be much worse now.</p>\n<p>And although it seems as though the documentation is more extensive now <br>\nthan it was then, to learn Isar I would anticipate having some <br>\nquestions.  And the sort of answers I've had in the past to questions <br>\n(\"look at Makarius's thesis\") aren't encouraging.  The point is that to <br>\ncontemplate converting everything to Isar I need to _know_ that help <br>\nwill be available.</p>\n<p>And anyway, what is the point of a system where you write tactics and <br>\nthen wrap them up as required to give them the type required by <br>\nmethod_setup, rather than just write tactics? (This is of course a <br>\nquestion to which the answer might be apparent if there was a more <br>\naccessible description of the structure of an Isar proof than Makarius's <br>\nthesis). Or learning something as totally weird as the grammar of the <br>\nIsar language?</p>\n<p>Cheers,</p>\n<p>Jeremy</p>\n<p>Lawrence Paulson wrote:</p>",
        "id": 294226131,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660900075
    },
    {
        "content": "<p>From: Lawrence Paulson &lt;<a href=\"mailto:lp15@cam.ac.uk\">lp15@cam.ac.uk</a>&gt;<br>\nThere is no doubt that the APIs have changed rapidly over the years, in large part to accommodate user requests (in particular, for all declarations to work within locales). It certainly does make life difficult for developers.</p>\n<p>There is a significant philosophical difference between Isabelle and HOL. I had always intended (perhaps even in 1986) that users should not have to write code in order to prove theorems. So I had no difficulty with a non-programmable notation for proofs, especially structured proofs, which (once you get the hang of them) make complicated proofs easier to write, understand and modify.</p>\n<p>Mike Gordon expressed the difference between HOL and Isabelle succinctly: HOL can be seen as an API for coding proof procedures, while Isabelle is an interactive theorem prover that you use right out of the box. I know that this doesn't help at all with your situation.</p>\n<p>Larry</p>",
        "id": 294226208,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660900106
    },
    {
        "content": "<p>From: Jeremy Dawson &lt;<a href=\"mailto:jeremy@rsise.anu.edu.au\">jeremy@rsise.anu.edu.au</a>&gt;<br>\nLawrence Paulson wrote:</p>\n<blockquote>\n<p>There is no doubt that the APIs have changed rapidly over the years, in large part to accommodate user requests (in particular, for all declarations to work within locales). It certainly does make life difficult for developers.</p>\n<p>There is a significant philosophical difference between Isabelle and HOL. I had always intended (perhaps even in 1986) that users should not have to write code in order to prove theorems. So I had no difficulty with a non-programmable notation for proofs, especially structured proofs, which (once you get the hang of them) make complicated proofs easier to write, understand and modify.</p>\n<p>Larry,</p>\n</blockquote>\n<p>This being so, it's very fortunate that you did such a good job of <br>\nproducing a programmable notation for proofs, in which one can write <br>\ncode in order to prove theorems, when necessary (granted that it's <br>\nmostly not necessary).</p>\n<blockquote>\n<p>Mike Gordon expressed the difference between HOL and Isabelle succinctly: HOL can be seen as an API for coding proof procedures, while Isabelle is an interactive theorem prover that you use right out of the box. I know that this doesn't help at all with your situation.</p>\n<p>Given that in HOL (as in Isabelle, both pre and post Isar) one can <br>\nalways use proof procedures coded by someone else, this seems to sum up <br>\nto saying that Isabelle/Isar is like HOL, minus the capacity to code <br>\none's own proof procedures, plus -- what ??</p>\n</blockquote>\n<p>Jeremy</p>\n<blockquote>\n<p>Larry</p>\n<p>On 21 Nov 2012, at 02:50, Jeremy Dawson &lt;<a href=\"mailto:jeremy@rsise.anu.edu.au\">jeremy@rsise.anu.edu.au</a>&gt; wrote:</p>\n<blockquote>\n<p>Larry,</p>\n<p>I don't suppose the legacy code simply can't be ported, any more than it can't be translated into HOL.  But when I started to port it from Isabelle2005 to Isabelle2007 (still using ML tactics) I quickly gave up.  I expect it would be much worse now.</p>\n<p>And although it seems as though the documentation is more extensive now than it was then, to learn Isar I would anticipate having some questions.  And the sort of answers I've had in the past to questions (\"look at Makarius's thesis\") aren't encouraging.  The point is that to contemplate converting everything to Isar I need to _know_ that help will be available.</p>\n<p>And anyway, what is the point of a system where you write tactics and then wrap them up as required to give them the type required by method_setup, rather than just write tactics? (This is of course a question to which the answer might be apparent if there was a more accessible description of the structure of an Isar proof than Makarius's thesis). Or learning something as totally weird as the grammar of the Isar language?</p>\n<p>Cheers,</p>\n<p>Jeremy</p>\n<p>Lawrence Paulson wrote:</p>\n<blockquote>\n<p>I think it's a great pity that you are using such an elderly version of Isabelle.</p>\n<p>If you have a lot of legacy code that simply can't be ported, or an application where it works really well, okay. But for general proofs, there is simply no comparison between the Isabelle of today and one that is seven years old. Sledgehammer, counterexample finding, a very powerful function definition package, lots and lots of AFP theories… You shouldn't forego all of those.</p>\n<p>Larry</p>\n</blockquote>\n</blockquote>\n</blockquote>",
        "id": 294226218,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660900112
    },
    {
        "content": "<p>From: Lawrence Paulson &lt;<a href=\"mailto:lp15@cam.ac.uk\">lp15@cam.ac.uk</a>&gt;<br>\nYou still have the capacity to code your own proof procedures; ML is just one level down. And you get a much more readable proof language.</p>\n<p>Some years ago, I translated a lot of proofs from HOL to Isabelle. The HOL proofs were opaque blocks of tactics, while in the corresponding structure proof you could see (even if you knew little of the Isar language) which local facts were available for use and what had to be proved. And almost certainly, creating those opaque blocks of tactics required much more effort, because the old ML style (whether in HOL or Isabelle) isn't very good at forward reasoning.</p>\n<p>Larry</p>",
        "id": 294226236,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660900124
    },
    {
        "content": "<p>From: Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt;<br>\nI've pointed to the method_setup command of Isabelle/Isar already.  It is <br>\ndocument in the \"isar-ref\" manual, as all other Isar commands.  The <br>\n\"implementation\" manual has further documentation about what proof methods <br>\nare, compared to bare-bones tactics (which are also documented there).</p>\n<p>The \"plus\" is much more than be discussed on such a mail thread.  It also <br>\ndepends on the imagination of users, what they make out of the vast formal <br>\nenvironment that Isabelle gives you today (as of current Isabelle2012).</p>\n<p>Makarius</p>",
        "id": 294226262,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660900136
    },
    {
        "content": "<p>From: Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt;<br>\nThe situation is a bit more general than this, and it is hard to arrange <br>\nIsar vs. ML in \"levels\" in particular.  Both are intertwined, cf. my <br>\nexplanation of Isabelle/Isar and Isabelle/ML as as the Yin and Yang of <br>\nIsabelle <br>\n<a href=\"https://lists.cam.ac.uk/pipermail/cl-isabelle-users/2012-April/msg00066.html\">https://lists.cam.ac.uk/pipermail/cl-isabelle-users/2012-April/msg00066.html</a></p>\n<p>In general Isar vs. its embedded languages works like this:</p>\n<p>* Isar is the main framework of Isabelle to integrate many<br>\n     other languages.</p>\n<p>* The Isar languages for specifications (e.g. 'theorem', 'definition',<br>\n     'function') and proofs (e.g. 'fix', 'assume', 'show' ...) are the<br>\n     primary applications of the Isar framework.</p>\n<p>* The logical language (Pure types/terms/propositions with specific HOL<br>\n     notation) is another important embedded language, cf. the quotes that<br>\n     have been around this language even in the ancient ML-only times of<br>\n     Isabelle in the 1990-ies.</p>\n<p>* ML is embedded into Isar in a similar manner, but at the same<br>\n     time it is the implementation language of Isar.  Moreover, ML quoted<br>\n     inside Isar can antiquote logic/Isar expressions.  So the image for<br>\n     that is <a href=\"http://en.wikipedia.org/wiki/File:Yin_and_Yang.svg\">http://en.wikipedia.org/wiki/File:Yin_and_Yang.svg</a></p>\n<p>In everyday life you don't use the ML inside Isar a lot, but you can <br>\nwhenever you need to.  It is more convenient than the ancient ML toplevel <br>\never was.  In Isabelle/jEdit you also have substantial IDE integration for <br>\nthis ML inside Isar.</p>\n<p>Makarius</p>",
        "id": 294226278,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660900142
    },
    {
        "content": "<p>From: Jeremy Dawson &lt;<a href=\"mailto:jeremy@rsise.anu.edu.au\">jeremy@rsise.anu.edu.au</a>&gt;<br>\nOn 11/22/2012 10:32 PM, Lawrence Paulson wrote:</p>\n<blockquote>\n<p>You still have the capacity to code your own proof procedures; ML is just one level down. And you get a much more readable proof language.</p>\n<p>Larry,</p>\n</blockquote>\n<p>While this is true, I did a lot of it a few years ago, and kept finding <br>\nthings not working.  Mostly to do with theories - in one way or another. <br>\n  Impossible (for me or, in one case, for the developer I spoke to) to <br>\nwork out exactly what was going on.</p>\n<blockquote>\n<p>Some years ago, I translated a lot of proofs from HOL to Isabelle. The HOL proofs were opaque blocks of tactics, while in the corresponding structure proof you could see (even if you knew little of the Isar language) which local facts were available for use and what had to be proved. And almost certainly, creating those opaque blocks of tactics required much more effort, because the old ML style (whether in HOL or Isabelle) isn't very good at forward reasoning.</p>\n<p>You're certainly right about opaque blocks of tactics - but having to <br>\nexecute a proof to see the intermediate steps has got to be the price <br>\nyou pay for not having to write down all those intermediate steps. This <br>\nwhole thread started with the topic of an (I assume) Isar proof which <br>\nwas too long to be readable.</p>\n</blockquote>\n<p>I don't know what local facts (or indeed facts generally) are.  I <br>\nsuspect it's part of the larger question of what the state of a part <br>\ncompleted Isar proof consists of, and how it related to what you see on <br>\nthe screen.  I understood (a year or two ago) that this was not documented.</p>\n<p>Jeremy</p>\n<blockquote>\n<p>Larry</p>\n<p>On 21 Nov 2012, at 22:31, Jeremy Dawson&lt;<a href=\"mailto:jeremy@rsise.anu.edu.au\">jeremy@rsise.anu.edu.au</a>&gt;  wrote:</p>\n<blockquote>\n<p>Given that in HOL (as in Isabelle, both pre and post Isar) one can always use proof procedures coded by someone else, this seems to sum up to saying that Isabelle/Isar is like HOL, minus the capacity to code one's own proof procedures, plus -- what ??<br>\n</p>\n</blockquote>\n</blockquote>",
        "id": 294226457,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660900216
    },
    {
        "content": "<p>From: Jeremy Dawson &lt;<a href=\"mailto:jeremy@rsise.anu.edu.au\">jeremy@rsise.anu.edu.au</a>&gt;<br>\nOn 11/22/2012 11:42 PM, Makarius wrote:</p>\n<blockquote>\n<p>On Thu, 22 Nov 2012, Jeremy Dawson wrote:</p>\n<blockquote>\n<p>Given that in HOL (as in Isabelle, both pre and post Isar) one can<br>\nalways use proof procedures coded by someone else, this seems to sum<br>\nup to saying that Isabelle/Isar is like HOL, minus the capacity to<br>\ncode one's own proof procedures, plus -- what ??</p>\n</blockquote>\n<p>From where did you get the \"minus\"? Certainly not from this thread,<br>\nwhere I've pointed to the method_setup command of Isabelle/Isar already.<br>\nIt is document in the \"isar-ref\" manual, as all other Isar commands. The<br>\n\"implementation\" manual has further documentation about what proof<br>\nmethods are, compared to bare-bones tactics (which are also documented<br>\nthere).</p>\n<p>Makarius,</p>\n</blockquote>\n<p>In another post I alluded to the fact that trying to mix ML and Isar so <br>\nfrequently made things not work.  But I acknowledge that it may be a <br>\nuseful feature for someone that understands the system (in particular, I <br>\nthink, how Isar handles theories).</p>\n<p>I see that the \"implementation\" manual has had a section on proof <br>\nmethods added since 2009 - I think that was a good thing to do.  I <br>\nhaven't got to studying it yet.</p>\n<blockquote>\n<p>The \"plus\" is much more than be discussed on such a mail thread. It also<br>\ndepends on the imagination of users, what they make out of the vast<br>\nformal environment that Isabelle gives you today (as of current<br>\nIsabelle2012).</p>\n<p>There is an ambiguity here between Isar (the language and its grammar) <br>\nand Isar (the design/structure, ie, methods, facts, etc). Obviously, <br>\nnothing that has been implemented in Standard ML couldn't be packaged in <br>\na way to make it convenient for users to use by calling Standard ML <br>\nfunctions.  The fact that the developers have not done so doesn't add to <br>\nthe merits of Isar (the language and its grammar).</p>\n<p>Jeremy</p>\n</blockquote>\n<blockquote>\n<p>Makarius</p>\n</blockquote>",
        "id": 294226466,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660900222
    },
    {
        "content": "<p>From: Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt;<br>\nOn Fri, 23 Nov 2012, Jeremy Dawson wrote:</p>\n<blockquote>\n<blockquote>\n<p>The \"plus\" is much more than be discussed on such a mail thread. It also<br>\ndepends on the imagination of users, what they make out of the vast<br>\nformal environment that Isabelle gives you today (as of current<br>\nIsabelle2012).</p>\n<p>There is an ambiguity here between Isar (the language and its grammar) <br>\nand Isar (the design/structure, ie, methods, facts, etc).</p>\n</blockquote>\n</blockquote>\n<p>There is indeed an ambiguity: \"Isar\" can mean several things at several <br>\nscales looking at it.  And the \"Isar framework\" is still more vast and <br>\nspacious than the things mentioned in the paragraph above.</p>\n<blockquote>\n<p>Obviously, nothing that has been implemented in Standard ML couldn't be <br>\npackaged in a way to make it convenient for users to use by calling <br>\nStandard ML functions.  The fact that the developers have not done so <br>\ndoesn't add to the merits of Isar (the language and its grammar).</p>\n</blockquote>\n<p>The Isar proof method called \"tactic\" actually presents the ML name space <br>\nto the user in a way that you can write nostalgic tactic expressions right <br>\ninto your Isar proofs.  E.g. like this:</p>\n<p>lemma \"A &amp; B --&gt; B &amp; A\"<br>\n   apply (tactic \"rtac impI 1\")<br>\n   apply (tactic \"etac conjE 1\")<br>\n   apply (tactic \"rtac conjI 1\")<br>\n   apply (tactic \"ALLGOALS atac\")<br>\n   done</p>\n<p>So it is basically the same like in 1993, just with some extra boiler <br>\nplate.  There is no practical point to use the above in reality, though.</p>\n<p>Makarius</p>",
        "id": 294226731,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660900351
    },
    {
        "content": "<p>From: Jeremy Dawson &lt;<a href=\"mailto:jeremy@rsise.anu.edu.au\">jeremy@rsise.anu.edu.au</a>&gt;<br>\nMakarius,</p>\n<p>On 11/24/2012 02:25 AM, Makarius wrote:</p>\n<blockquote>\n<p>On Fri, 23 Nov 2012, Jeremy Dawson wrote:</p>\n<blockquote>\n<p>Obviously, nothing that has been implemented in Standard ML couldn't<br>\nbe packaged in a way to make it convenient for users to use by calling<br>\nStandard ML functions. The fact that the developers have not done so<br>\ndoesn't add to the merits of Isar (the language and its grammar).</p>\n</blockquote>\n<p>The Isar proof method called \"tactic\" actually presents the ML name<br>\nspace to the user in a way that you can write nostalgic tactic<br>\nexpressions right into your Isar proofs. E.g. like this:</p>\n<p>lemma \"A &amp; B --&gt; B &amp; A\"<br>\napply (tactic \"rtac impI 1\")<br>\napply (tactic \"etac conjE 1\")<br>\napply (tactic \"rtac conjI 1\")<br>\napply (tactic \"ALLGOALS atac\")<br>\ndone</p>\n<p>Another misunderstanding, I'm afraid.  The above is about using ML from <br>\nwithin Isar.  I'm referring to the theoretical possibility of calling <br>\nfeatures of the Isar structure/framework from within ML. Such as, for <br>\nexample, as discussed in Feb 2010 in the thread called</p>\n</blockquote>\n<p>Giving a name to a tactics-expression,</p>\n<p>I would want the ML code that does something like</p>\n<p>val meth4 = EVERY [(TRY (REPEAT1 meth1)), meth2, meth3 ] ;</p>\n<p>made accessible.</p>\n<blockquote>\n<p>So it is basically the same like in 1993, just with some extra boiler<br>\nplate. There is no practical point to use the above in reality, though.</p>\n<p>No practical point ?? I think this email thread is getting too long - my <br>\nfirst post was of stuff that I asserted (and still do) that you can't <br>\nimagine how to do it sensibly other than in Standard ML.  (And the only <br>\nsuggestion that has been contributed at all was from you, in previous <br>\nemails, to wrap Standard ML in Isar via method-setup)</p>\n</blockquote>\n<p>Jeremy</p>\n<blockquote>\n<p>Makarius</p>\n</blockquote>",
        "id": 294226805,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660900381
    },
    {
        "content": "<p>From: Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt;<br>\nThe thread is indeed getting long and tedious, and it is unclear if it <br>\never ends.  When I say \"ML\" or \"Isabelle/ML\", it practically always means <br>\nthe ML that is embedded into Isar.  This is what you use for professional <br>\napplications these days.</p>\n<p>There is also a raw ML bootstrap environment to get the Isabelle/Pure <br>\nimplementation to the point where it can run the Isar toplevel with this <br>\nembedded ML.  In the 1990-ies, the user would continue with that raw ML <br>\ntoplevel to do proofs, but hardly anybody on the mailing list would <br>\nremember that today.</p>\n<p>Insisting to work with the raw ML toplevel is like traveling on a train <br>\nlike this: <a href=\"http://gehcrew.blogspot.fr/2010_03_01_archive.html\">http://gehcrew.blogspot.fr/2010_03_01_archive.html</a></p>\n<p>This technique works for a tramway to some extent, but not on the <br>\nhigh-speed train that Isabelle has become in recent years, where you <br>\nbetter sit comfortably inside.  And to get on such a train you merely <br>\npurchase a ticket, you don't come with its technical manuals and take the <br>\nengine apart while it is moving.</p>\n<p>Makarius</p>",
        "id": 294226878,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660900419
    },
    {
        "content": "<p>From: Jeremy Dawson &lt;<a href=\"mailto:jeremy@rsise.anu.edu.au\">jeremy@rsise.anu.edu.au</a>&gt;<br>\nMakarius,</p>\n<p>I'm not clear on the significance of your discussion about the meaning <br>\nof \"ML\" but when I say Standard ML I mean any use of it.</p>\n<p>Thanks for the link to (apparently) a German travelogue - it's a change <br>\nto the tedium, if nothing else.</p>\n<p>I'm left guessing what the discussion about trams and high-speed trains <br>\nis really about, but it may be worth noting that there is an <br>\nintermediate level of awareness which can actually be quite useful, such <br>\nas timetables, route maps, destination signs on trains and so forth.</p>\n<p>But if you like railway analogies - have you ever been to Karlsruhe? <br>\nThe city trams and high-speed trains actually use the same tracks.</p>\n<p>Cheers,</p>\n<p>Jeremy</p>",
        "id": 294226959,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660900443
    },
    {
        "content": "<p>From: Jens Doll &lt;<a href=\"mailto:jd@cococo.de\">jd@cococo.de</a>&gt;<br>\nHello all,</p>\n<p>when viewing the file Vickrey.thy from Tim I almost fell from my chair. <br>\nIt has 22 pages of code and that seems to be a normal length for Isabelle.</p>\n<p>Does anyone know how to shorten these artefacts or could someone explain <br>\nto me why proofs have to be that long?</p>\n<p>Jens</p>",
        "id": 294227782,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660900860
    },
    {
        "content": "<p>From: Jeremy Dawson &lt;<a href=\"mailto:jeremy@rsise.anu.edu.au\">jeremy@rsise.anu.edu.au</a>&gt;<br>\nJens,</p>\n<p>I don't know if this is a factor in this particular set of proofs, but <br>\noften a particular sequence of proof steps is reused repeatedly. </p>\n<p>In such a case it is advantageous not to have to write them all down <br>\nrepeatedly, but to reuse them. </p>\n<p>The Standard ML interface to Isabelle is ideally suited to this <br>\npurpose.  Unfortunately its use has become actively discouraged in <br>\nrecent years.</p>\n<p>To illustrate, here are some bits of a proof script of mine which makes <br>\ngood use of the Standard ML interface.</p>\n<p>fun mctrtac sg st = FIRST [ atac sg, (match_tac [mstrctr.ctr] sg),<br>\n  ((resolve_tac [mstrctr.Comma, mstrctr.Star] THEN_ALL_NEW mctrtac) sg),<br>\n  (rtac mstrctr.same sg) ] st ;</p>\n<p>fun dvi_ctr_tacs dths = [<br>\n  (rtac ex_conjI), (rtac mseqctr.I), mctrtac, mctrtac,<br>\n  (eresolve_tac [der_asm, dd1th] THEN_ALL_NEW<br>\n    resolve_tac dths THEN_ALL_NEW ssai_tac) ] ;</p>\n<p>fun init_dvi_ctr_tacs dths = [<br>\n  (* ensure only desired occurrence of rule is expanded *)<br>\n  Clarsimp_tac, dtac trans, (clarsimp_tac (cesimps rule_defs)),<br>\n  rtac refl, Clarsimp_tac,<br>\n  (SELECT_GOAL (EVERY [<br>\n    (* split up say F delible from (X,Y),Z |- W into cases:<br>\n      F (with stars) is X,Y or Z, or F is delible from X,Y,Z or W *)<br>\n    (REPEAT_SOME (eresolve_tac [mseqctr.elim,<br>\n        mstrctr_CommaR, mstrctr_StarR, mstrctr_IR]<br>\n      THEN_ALL_NEW Clarsimp_tac)),<br>\n    (* when deletion to substituted variable in rule *)<br>\n    TRYALL (EVERY' (dvi_ctr_tacs dths)) ])) ] ;</p>\n<p>fun xstacs th = [<br>\n  (rtac ex_conjI 1), (etac dd1th 2),<br>\n  ((rtac th THEN_ALL_NEW ssai_tac) 2),<br>\n  (rtac mseqctr.I 1), mctrtac 1, mctrtac 1 ] ;</p>\n<p>val th = rdp (tn [dca1, dppsA, dica1, dassoc]) ;</p>\n<p>in the above, each additional theorem in the list of arguments to tn <br>\ninvolves several proof steps</p>\n<p>val ctr_assoc_tacs = [<br>\n  (EVERY' (init_dvi_ctr_tacs [dassoc]) 1),<br>\n  (EVERY (xstacs ([dassoc, dassoc] MRS duA2))),<br>\n  (EVERY (xstacs th)) ] ;</p>\n<p>(and twelve more rather like ctr_assoc_tacs, just a bit different)</p>\n<p>val ctr_tacs = [ EVERY init_ctr_tacs,<br>\n  EVERY ctr_assoc_tacs,<br>\n  EVERY ctr_ica1_tacs, EVERY ctr_ica2_tacs,<br>\n  EVERY ctr_ics1_tacs, EVERY ctr_ics2_tacs,<br>\n  (EVERY' (init_dvi_ctr_tacs [dastars]) 1),<br>\n  (EVERY' (init_dvi_ctr_tacs [dassA]) 1),<br>\n  EVERY ctr_ca1_tacs, EVERY ctr_ca2_tacs,<br>\n  EVERY ctr_cs1_tacs, EVERY ctr_cs2_tacs,<br>\n  EVERY ctr_rstars_tacs, EVERY ctr_rssA_tacs ] ;</p>\n<p>If I had written this out in the modern style (using Isar) the above <br>\nwould expand to thousands, probably tens of thousands, of lines of code.</p>\n<p>Cheers,</p>\n<p>Jeremy Dawson</p>\n<p>Jens Doll wrote:</p>",
        "id": 294227946,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660900928
    },
    {
        "content": "<p>From: Christian Sternagel &lt;<a href=\"mailto:c-sterna@jaist.ac.jp\">c-sterna@jaist.ac.jp</a>&gt;<br>\nAlmost always, it is possible to considerably shorten proofs by use (and <br>\nproper setup) of automated techniques (maybe even more so when using <br>\nIsabelle/ML). The other extreme is to explicitly write every single step <br>\nin Isar (as I know from myself and many students I taught, mostly <br>\nbeginners use this kind of proofs... of course it also depends on your <br>\nintended audience).</p>\n<p>In my opinion both extremes are bad. It is an art (as is often pointed <br>\nout in Isar related manuals) to write Isar proofs that are readable yet <br>\nnot too verbose. But if you master this art, the gain is that others can <br>\nactually read your proofs and follow the steps without even starting <br>\nIsabelle (which is definitely not the case with the technique shown by <br>\nJeremy; so I would rather use that technique that are considered <br>\n\"trivial\" by humans... but then again humans are often wrong in their <br>\ninitial judgment of what is trivial ;)).</p>\n<p>I guess what I want to say is that no, proofs do not have to be <br>\nexceedingly long in many cases, but sometimes long versions (or rather <br>\nversions of appropriate length) are much better to read and maintain.</p>\n<p>cheers</p>\n<p>chris</p>",
        "id": 294228060,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660900995
    },
    {
        "content": "<p>From: Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt;<br>\nAs far as I am concerned, I never discouraged the use of Isabelle/ML, it <br>\nmerely came out of use as proof scripting languages, because there are <br>\nbetter ways these days.  Christian Sternagel has already hinted at the <br>\nfine art to combine structured Isar proof elements, and an assorted <br>\ncollection with proof tools.</p>\n<p>If you still want to have hard-core quick script hacking, the community <br>\nfor that is centered around SSReflect, which is continuing traditions of <br>\nAPL for proof recording.  The scripts then come out very tight and terse, <br>\nby experts for experts.</p>\n<p>I am still keen to seen such a quick-hacking approach turned into proper <br>\nuse for an advanced Prover IDE: instead of recording the gesticulation of <br>\nthe author in the script, it would produce a nice structured, readable, <br>\nmaintainable proof document.</p>\n<p>Makarius</p>",
        "id": 294228266,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660901081
    },
    {
        "content": "<p>From: Jeremy Dawson &lt;<a href=\"mailto:jeremy@rsise.anu.edu.au\">jeremy@rsise.anu.edu.au</a>&gt;<br>\nMakarius,</p>\n<p>My understanding has been that you - or someone - introduced new <br>\nfeatures in Isabelle which were accessible only from Isar, not from the <br>\nStandard ML interface.</p>\n<p>In my book this discourages the use of Standard ML, and also provides an <br>\nexplanation for it having \"come out of use\", regardless of its relative <br>\nmerits as a user interface language.</p>\n<p>I don't understand your reference to SSReflect.  How would that help me <br>\ndo Isabelle proofs?</p>\n<p>Jeremy</p>",
        "id": 294228303,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660901105
    }
]