[
    {
        "content": "<p>From: Filip Marić &lt;<a href=\"mailto:filipmatfbgacrs@gmail.com\">filipmatfbgacrs@gmail.com</a>&gt;<br>\nSecond CALL FOR PAPERS</p>\n<p>ADG 2016</p>\n<p>Eleventh International Workshop on Automated Deduction in Geometry</p>\n<p>Strasbourg, June, 27-29</p>\n<p><a href=\"http://icube-web.unistra.fr/adg2016/\">http://icube-web.unistra.fr/adg2016/</a></p>\n<p>Overview:</p>\n<p>ADG is a forum to exchange ideas and views, to present research results and<br>\nprogress, and to demonstrate software tools at the intersection between<br>\ngeometry and automated deduction. The workshop is held every two years. The<br>\nprevious editions of ADG were held in Coimbra in 2014, Edinburgh in 2012,<br>\nMunich in 2010, Shanghai in 2008, Pontevedra in 2006, Gainesville in 2004,<br>\nHagenberg in 2002, Zurich in 2000, Beijing in 1998, and Toulouse in 1996.<br>\nThe 11th edition, ADG 2016, will be held in Strasbourg, France, June 27 –<br>\n29, 2016.</p>\n<p>Scope:</p>\n<p>Relevant topics include (but are not limited to):</p>\n<p>-</p>\n<p>polynomial algebra, invariant and coordinate-free methods,<br>\n   -</p>\n<p>probabilistic, synthetic, and logic approaches, techniques for automated<br>\n   geometric reasoning from discrete mathematics, combinatorics, and numerics;<br>\n   -</p>\n<p>symbolic and numeric methods for geometric computation, geometric<br>\n   constraint solving, automated generation/reasoning and manipulation with<br>\n   diagrams;<br>\n   -</p>\n<p>design and implementation of geometry software, special-purpose tools,<br>\n   automated theorem provers, experimental studies;<br>\n   -</p>\n<p>applications of ADG to mechanics, geometric modelling, CAGD/CAD,<br>\n   computer vision, robotics and education.</p>\n<p>Submission Guidelines:</p>\n<p>-</p>\n<p>We invite the following types of submissions:<br>\n   -</p>\n<p>Extended abstracts<br>\n      -</p>\n<p>Full paper (maximum 20 pages)<br>\n      -</p>\n<p>The extended abstracts must address the following aspects explicitly.<br>\n   -</p>\n<p>Problem: What is the problem/question/objective?<br>\n      -</p>\n<p>Motivation: Why do we work on the problem? What is the importance?<br>\n      -</p>\n<p>State of the Art: What has been done already on the problem?<br>\n      -</p>\n<p>Contribution: What is the main original contribution?<br>\n      -</p>\n<p>Main Idea: What is the main idea underlying the contribution?<br>\n      -</p>\n<p>The submissions should follow the standard Springer LNCS Proceedings<br>\n   format &lt;<a href=\"http://www.springer.com/computer/lncs?SGWID=0-164-6-793341-0\">http://www.springer.com/computer/lncs?SGWID=0-164-6-793341-0</a>&gt;.<br>\n   -</p>\n<p>Electronic submission as PDF is required via EasyChair<br>\n   &lt;<a href=\"http://www.easychair.org/conferences/?conf=adg2016\">http://www.easychair.org/conferences/?conf=adg2016</a>&gt; (at<br>\n<a href=\"http://www.easychair.org/conferences/?conf=adg2016\">http://www.easychair.org/conferences/?conf=adg2016</a>).<br>\n   -</p>\n<p>If you have any problems with the submission of your paper, or questions<br>\n   concerning ADG 2016 or EasyChair, please contact <a href=\"mailto:adg2016@easychair.org\">adg2016@easychair.org</a>.</p>\n<p>Refereeing and Publication:</p>\n<p>-</p>\n<p>The submitted contributions will be subject to a summary review by the<br>\n   Program Committee, bearing in mind that this first review is mainly for<br>\n   presentation, NOT for publication.<br>\n   -</p>\n<p>Digital publication of the full papers accepted for presentation will be<br>\n   available at the workshop.<br>\n   -</p>\n<p>The authors of the full papers accepted for presentation at the workshop<br>\n   will be to submit their full and/or revised papers for publication in a<br>\n   formal proceedings of ADG 2016 after the workshop.<br>\n   -</p>\n<p>The full papers (submitted after the meeting) will be formally reviewed<br>\n   by PC members and external referees.<br>\n   -</p>\n<p>All participants are encouraged to bring along posters on their<br>\n   geometric work (irrespective of whether it was presented at the workshop or<br>\n   not) for display during ADG 2016.<br>\n   -</p>\n<p>The accepted full papers will be published in the Springer Lecture Notes<br>\n   in Artificial Intelligence (LNAI) series or Lecture Notes in Computer<br>\n   Science (LNCS) series.<br>\n   -</p>\n<p>The proceedings of ADG 1996, ADG 1998, ADG 2000, ADG 2002, and ADG 2004,<br>\n   ADG 2006,  ADG 2010, ADG 2012 and ADG 2014 appeared as LNAI 1360, LNAI<br>\n   1669, LNAI 2061, LNAI 2930, LNAI 3763, LNAI 4869, LNCS 6877, LNAI 7993 and<br>\n   LNAI 9201 respectively.</p>\n<p>Invited Speakers:</p>\n<p>-</p>\n<p>Predrag Janicic, Faculty of Mathematics, University of Belgrade</p>\n<p>Title: Geometrisation of Geometry</p>\n<p>Abstract: Coherent logic (CL) or geometry logic is a (semi-decidable)<br>\n   fragment of FOL that can be considered to be an extension of resolution<br>\n   logic. CL is suitable for formalization and automation of various<br>\n   mathematical theories, including geometry. This talk will give an overview<br>\n   of developments in geometry based on CL: automated theorem provers for CL,<br>\n   CL-based formalizations of geometry, CL-based proof representation for<br>\n   geometry, links between CL and geometry construction problems, links<br>\n   between CL and geometrical illustrations, etc.</p>\n<p>Dominique Michelucci, University of Burgundy.</p>\n<p>Title: Solving Constraints without Equations, Why and How</p>\n<p>Abstract: Classically, when we solve geometric constraints, the latter<br>\n   are represented with mathematical equations, or inequalities. These<br>\n   equations or inequalities are represented explicitly, with trees or DAGs or<br>\n   polynomials, etc. So it is easy to symbolically compute derivatives, etc.<br>\n   It is possible to make proofs of geometric theorems.</p>\n<p>But, recently, we meet more and more frequently problems for which<br>\n   equations are not available for many reasons, e.g. when the shape is the<br>\n   result of a procedure (subdivision surfaces; fractals). In this new<br>\n   framework, shapes or geometric figures are the results of the evaluation of<br>\n   black box procedures / algorithms / subprograms, feed with some parameters.<br>\n   These programs contain if-then-else constructs, loops, they compute fixed<br>\n   points, they call ODE and PDE solvers. Some parameters are free : how to<br>\n   compute their values to satisfy specified constraints ? How to solve<br>\n   without equations ?</p>\n<p>Important Dates:</p>\n<p>-</p>\n<p>April 22 short abstract submission<br>\n   -</p>\n<p>April 25 deadline for extended abstract or full paper submission<br>\n   -</p>\n<p>Mai 23 notification of acceptance<br>\n   -</p>\n<p>June 6 final version due<br>\n   -</p>\n<p>June 6 early registration<br>\n   -</p>\n<p>June 27 ADG</p>\n<p>Program Committee</p>\n<p>Chair: Ileana Streinu (USA)</p>\n<p>Members:</p>\n<p>-</p>\n<p>Michael Beeson (USA)<br>\n   -</p>\n<p>Francisco Botana (Spain)<br>\n   -</p>\n<p>John Bowers (USA)<br>\n   -</p>\n<p>Xiaoyu Chen (China)<br>\n   -</p>\n<p>Xiao-Shan Gao (China)<br>\n   -</p>\n<p>Tetsuo Ida (Japan)<br>\n   -</p>\n<p>Filip Maric (Serbia)<br>\n   -</p>\n<p>Pascal Mathis (France)<br>\n   -</p>\n<p>Julien Narboux (France)<br>\n   -</p>\n<p>Pavel Pech (Czech Republic)<br>\n   -</p>\n<p>Pedro Quaresma (Portugal)<br>\n   -</p>\n<p>Tomas Recio (Spain)<br>\n   -</p>\n<p>Pascal Schreck (France)<br>\n   -</p>\n<p>Meera Sitharam (USA)<br>\n   -</p>\n<p>Dongming Wang (China)<br>\n   -</p>\n<p>Bican Xia (China)</p>",
        "id": 294669044,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661172819
    }
]