[
    {
        "content": "<p>From: Andrei Popescu &lt;<a href=\"mailto:A.Popescu@mdx.ac.uk\">A.Popescu@mdx.ac.uk</a>&gt;<br>\nThis year, the colloquium is organized by the Middlesex University and enjoys some remarkable invited speakers.</p>\n<p>All the best,<br>\n  Andrei</p>\n<p>British Colloquium for Theoretical Computer Science<br>\n                    Middlesex University, Hendon, London, UK<br>\n                             14th--18th September 2015<br>\n<a href=\"http://www.cs.mdx.ac.uk/foundations/bctcs2015/\">http://www.cs.mdx.ac.uk/foundations/bctcs2015/</a></p>\n<p>CALL FOR PARTICIPATION</p>\n<p>The 31st British Colloquium for Theoretical Computer Science will be<br>\nhosted by the Foundations of Computing Group, Department of<br>\nComputer Science, Middlesex University, from 14th to 18th September,<br>\n2015.</p>\n<p>Associated with the meeting, on Thursday 17th September, is the<br>\nLondon Mathematical Society (LMS) Algorithms &amp; Cryptography Day. The<br>\nLMS will celebrate its 150th anniversary as BCTCS celebrates its 30th<br>\nwith its first visit to the capital.</p>\n<p>The purpose of BCTCS is to provide a forum in which researchers in<br>\ntheoretical computer science can meet, present research findings, and<br>\ndiscuss developments in the field. It also aims to provide an<br>\nenvironment in which PhD students can gain experience in presenting<br>\ntheir work, and benefit from contact with established researchers.</p>\n<p>The scope of the colloquium includes all aspects of theoretical<br>\ncomputer science, including automata theory, algorithms, complexity<br>\ntheory, semantics, formal methods, concurrency, types, languages and<br>\nlogics. Both computer scientists and mathematicians are welcome to<br>\nattend, as are participants from outside of the UK.</p>\n<p>The colloquium features both invited and contributed talks.  This year<br>\nthe invited speakers currently include the following:</p>\n<p>Samson Abramsky, Oxford University, UK.<br>\n   Timothy Gowers, Cambridge University, UK.<br>\n   Tony Hoare, Microsoft Research, UK.<br>\n   Thomas Hales, University of Pittsburgh, USA, (LMS Keynote).<br>\n   Per Martin-Lof, Stockholm University, Sweden.<br>\n   Joseph Sifakis, University of Grenoble, France.</p>\n<p>The LMS meeting on Thursday also has eminent speakers.</p>\n<p>Lance Fortnow, Georgia Tech, USA.<br>\n   Shafi Goldwasser, MIT, USA.<br>\n   Jon Kleinberg, Cornell University, USA.<br>\n   Mike Paterson, University of Warwick.<br>\n   Adi Shamir, Weizmann Institute, Israel.<br>\n   Nigel Smart, University of Bristol.</p>\n<p>Registration is now open from the following link:</p>\n<p><a href=\"http://www.onlinestore.mdx.ac.uk/browse/extra_info.asp?compid=1&amp;modid=5&amp;catid=93&amp;prodid=643\">http://www.onlinestore.mdx.ac.uk/browse/extra_info.asp?compid=1&amp;modid=5&amp;catid=93&amp;prodid=643</a></p>\n<p>The registration fee is £140 plus £40 for the conference dinner (note<br>\nthe receipt will not be itemised). We are grateful for support from the<br>\nHeilbronn Institute for Mathematical Research which will provide<br>\nbursaries for 18 students to cover registration fees and accommodation.<br>\nPlease register for free at the same link and send titles and<br>\nabstracts of talks to g.primiero@mdx.ac.uk&lt;mailto:<a href=\"mailto:g.primiero@mdx.ac.uk\">g.primiero@mdx.ac.uk</a>&gt;.</p>\n<p>The deadline for registration is 27th August.</p>\n<p>We have reserved a number of rooms at Hendon Hall Hotel at £110 per<br>\nnight (please contact barnabymartin@gmail.com&lt;mailto:<a href=\"mailto:barnabymartin@gmail.com\">barnabymartin@gmail.com</a>&gt;). However, there is the<br>\npossibility to stay at many hotels within a short bus journey and these<br>\nrooms are cheaper when booked by individuals.</p>\n<p>Barnaby Martin, Raja Nagarajan and Giuseppe Primiero.<br>\nOrganising Committee.</p>\n<hr>\n<p>Please note that Middlesex University's preferred way of receiving all correspondence is via email in line with our Environmental Policy. All incoming post to Middlesex University is opened and scanned by our digital document handler, CDS, and then emailed to the recipient.</p>\n<p>If you do not want your correspondence to Middlesex University processed in this way please email the recipient directly. Parcels, couriered items and recorded delivery items will not be opened or scanned by CDS.  There are items which are \"exceptions\" which will be opened by CDS but will not be scanned a full list of these can be obtained by contacting the University.</p>",
        "id": 294652338,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661166613
    }
]