[
    {
        "content": "<p>From: Jeremy Avigad &lt;<a href=\"mailto:avigad@cmu.edu\">avigad@cmu.edu</a>&gt;<br>\nCALL FOR PAPERS</p>\n<p>Special Issue On</p>\n<p>MILESTONES IN INTERACTIVE THEOREM PROVING</p>\n<p>Journal of Automated Reasoning</p>\n<p>The past few decades have seen major achievements in interactive theorem<br>\nproving, such as the formalisation of deep mathematical theorems and<br>\nsignificant bodies of theoretical computer science, as well as the<br>\nverification of complex software and hardware systems. Too often, these<br>\nimpressive results have been published in abbreviated or fragmentary form in<br>\nconference proceedings, or not at all. This special issue welcomes<br>\nfull-length papers describing past work not previously published in a<br>\njournal, along with new developments of any length. Small, self-contained<br>\nProof Pearls and applications of all kinds are also welcome.</p>\n<p>This special issue will be devoted to applications of interactive theorem<br>\nproving in their full variety: formalised mathematics, formalised theory,<br>\nformalised semantics, formal proofs of hardware or software systems. They can<br>\nbe large or small.</p>\n<p>Manuscripts should be unpublished works and not submitted elsewhere. Revised<br>\nand enhanced versions of papers published in conference proceedings that have<br>\nnot appeared in archival journals are eligible for submission. All<br>\nsubmissions will be reviewed according to the usual standards of scholarship<br>\nand originality.</p>\n<p>Papers should be in pdf format, following the JAR guidelines for authors, and<br>\nbe submitted using the usual Springer online submission system:<br>\n<a href=\"http://www.editorialmanager.com/jars/default.aspx\">http://www.editorialmanager.com/jars/default.aspx</a></p>\n<p>When you reach the drop-down menu \"Choose Article Type\", you must select<br>\n\"S.I. : MILESTONE\" to specify the special issue.. To encourage a speedy<br>\nreview cycle, it will be expected that authors of submissions also serve as<br>\nreferees.</p>\n<p>Important Dates<br>\n1 Apr 2017    Submission Deadline<br>\n1 Oct 2017    Notification of accepted papers<br>\n1 Jan 2018    Final version</p>\n<p>For more information, please see<br>\n<a href=\"http://www.cse.unsw.edu.au/~kleing/JAR-milestone/\">http://www.cse.unsw.edu.au/~kleing/JAR-milestone/</a></p>\n<p>Guest Editors<br>\n  Larry Paulson, University of Cambridge<br>\n  Jeremy Avigad, Carnegie Mellon University<br>\n  Gerwin Klein, Data61 and UNSW Australia</p>",
        "id": 294681310,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661176813
    }
]