[
    {
        "content": "<p>From: Cezary Kaliszyk &lt;<a href=\"mailto:cezarykaliszyk@gmail.com\">cezarykaliszyk@gmail.com</a>&gt;<br>\nWe invite candidates for multiple PhD student and Postdoc researcher<br>\npositions to start in 2017 or 2018 in the 5-year project<br>\n\"Strong Modular Proof Assistance: Reasoning across Theories\" in the<br>\nCL group at the University of Innsbruck.</p>\n<p>The starting date can be negotiated. PhD student positions like Postdoc<br>\npositions are formal employment in Austria, with a regular salary and<br>\nbenefits. Applications before June 15 will receive a full consideration.</p>\n<p>A background in proof assistants or machine learning is an advantage.<br>\nKnowledge of German is not required, the group is international and<br>\nthe language of communication is English.</p>\n<p>Candidates for a PhD position must hold a MSc in computer science or<br>\nmathematics and candidates for the postdoctoral position hold a PhD<br>\ndegree in computer science or mathematics.</p>\n<p>Applications and informal inquiries are welcome, please contact<br>\nCezary Kaliszyk (<a href=\"mailto:cezary.kaliszyk@uibk.ac.at\">cezary.kaliszyk@uibk.ac.at</a>). Applications should<br>\ninclude a CV and names and contact details of two references.<br>\nFor the Postdoc positions please include a brief research statement.</p>\n<p>The city of Innsbruck, which hosted the Olympic Winter Games in 1964,<br>\n1976 and 2012 (YOG), is superbly located in the beautiful surroundings<br>\nof the Tyrolean Alps. The combination of the Alpine environment and<br>\nurban life in this historic town provides a high quality of living.<br>\nThe CL group is one of the leading groups concerned with formalization<br>\nand certification in the world.</p>\n<p>More information and links about the project, the group, and the university:</p>\n<p><a href=\"http://cl-informatik.uibk.ac.at/cek/smart/\">http://cl-informatik.uibk.ac.at/cek/smart/</a></p>",
        "id": 294710423,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661181996
    }
]