[
    {
        "content": "<p>From: Leo Freitas &lt;<a href=\"mailto:leo.freitas@newcastle.ac.uk\">leo.freitas@newcastle.ac.uk</a>&gt;<br>\nIJCAR 2016 Workshop on “Paths not taken: thinking about the process of proof’’<br>\n(<a href=\"https://pathsnottakenblog.wordpress.com\">https://pathsnottakenblog.wordpress.com</a>)</p>\n<p>2nd July 2016 in Coimbra, Portugal.</p>\n<p>In association with IJCAR 2016.</p>\n<p>Keynote speaker: J Strother Moore, Admiral B.R. Inman Centennial Chair Emeritus in Computing Theory, Department of Computer Science, University of Texas at Austin.</p>\n<p>Important dates</p>\n<p>Submission deadline: 1st June 2016<br>\nNotification of final programme: 15th June 2016<br>\nWorkshop: 2nd July 2016</p>\n<p>Call for Position Statements:<br>\nPosition statements of up to 500 words should be submitted by email to <a href=\"mailto:pathsnottakenworkshop@gmail.com\">pathsnottakenworkshop@gmail.com</a> by 1st June 2016. They should be in PDF format, and include your name, email address and affiliation, and a short paragraph describing your background or experience in machine proof. Please indicate whether you would be willing to have your statement posted on this blog.</p>\n<p>Position statements might address topics such as:<br>\n– what do you find hardest or most challenging about machine proof?<br>\n– what do you do when you get stuck in a machine proof?<br>\n– what is the best advice you’ve ever been given about machine proof?<br>\n– what was your biggest failure in a machine proof?<br>\n– how do you plan and organise a machine proof?<br>\n– what is the best way to teach others to do machine proofs?</p>\n<p>The main aim for the workshop is discussion, thus submissions do not need to be original, and are in the form of “position statements” as described above. Extended versions of submissions may have been published previously, or submitted concurrently with or after this IJCAR 2016 to another workshop, conference or a journal. Presentations of work in progress, tools under development and PhD projects are also encouraged.</p>\n<p>We do not plan to publish workshop proceedings, but will publish a report based on the discussions, co-authored by the participants.</p>\n<p>The scope of the workshop covers research in automated reasoning, formal methods and proof processes. the scope includes, but is not limited to:<br>\n– The use of machine learning to support interactive theorem proving.<br>\n– The use of machine learning to enhance automated theorem proving.<br>\n– The development of proof search heuristics and how it can be informed by error.<br>\n– Techniques for counter-example generation.<br>\n– The use of constraint solvers in formal methods.<br>\n– The interplay between reasoning and modelling.<br>\n– Ontologies in the formal engineering process.<br>\n– Novel ideas on how to use AI (e.g. machine learning, pattern recognition) in proof automation.<br>\n– Use of cloud elasticity for: scalability on large scale developments, proof/lemma exploration.<br>\n– The relationship between formal and informal proofs in mathematics.</p>\n<p>Note that submission is not necessary for participation in the workshop.</p>\n<p>Thank you<br>\nLeo Freitas<br>\nUrsula Martin<br>\nGabriela Rino Nesin<br>\nCliff Jones<br>\n<a href=\"/user_uploads/14278/mPS1pBFGLqMU51TuniOt4Ae2/signature.asc\">signature.asc</a></p>",
        "id": 294670668,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661173311
    }
]