[
    {
        "content": "<p>From: Veronique Cortier &lt;<a href=\"mailto:veronique.cortier@loria.fr\">veronique.cortier@loria.fr</a>&gt;<br>\n<em>Please feel free to distribute</em></p>\n<p>CALL FOR PAPERS<br>\n================</p>\n<p>FCS'09</p>\n<p>Workshop on Foundations of Computer Security<br>\n<a href=\"http://www.loria.fr/~cortier/FCS09/\">http://www.loria.fr/~cortier/FCS09/</a></p>\n<p>August 9-10, 2009, Los Angeles, California, USA<br>\nAffiliated with LICS'09.</p>\n<p>IMPORTANT DATES<br>\n================<br>\nPapers due:     April 7, 2009<br>\nNotification of acceptance:     May 29, 2009<br>\nFinal papers:     June 30, 2009</p>\n<p>SCOPE<br>\n======<br>\nComputer security is an established field of computer science of both<br>\ntheoretical and practical significance. In recent years, there has<br>\nbeen increasing interest in logic-based foundations for various<br>\nmethods in computer security, including the formal specification,<br>\nanalysis and design of security protocols and their applications, the<br>\nformal definition of various aspects of security such as access<br>\ncontrol mechanisms, mobile code security and denial-of-service<br>\nattacks, and the modeling of information flow and its application to<br>\nconfidentiality policies, system composition, and covert channel<br>\nanalysis.</p>\n<p>The aim of the workshop FCS'09 is to provide a forum for continued<br>\nactivity in different areas of computer security, bringing computer<br>\nsecurity researchers in closer contact with the LICS community and<br>\ngiving LICS attendees an opportunity to talk to experts in computer<br>\nsecurity, on the one hand, and contribute to bridging the gap between<br>\nlogical methods and computer security foundations, on the other.</p>\n<p>We are interested both in new results in theories of computer security<br>\nand also in more exploratory presentations that examine open questions<br>\nand raise fundamental concerns about existing theories, as well as in<br>\nnew results on developing and applying automated reasoning techniques<br>\nand tools for the formal specification and analysis of security<br>\nprotocols. We thus solicit submissions of papers both on mature work<br>\n(possibly based on already published material) and on work in progress.</p>\n<p>Possible topics include, but are not limited to:<br>\nAutomated reasoning techniques, Composition issues, Formal<br>\nspecification, Foundations of verification, Information flow analysis,<br>\nLanguage-based security, Logic-based design, Program transformation,<br>\nSecurity models, Static analysis, Statistical methods, Tools, Trust<br>\nmanagement<br>\nfor     <br>\nAccess control and resource usage control, Authentication,<br>\nAvailability and denial of service, Covert channels, Confidentiality,<br>\nIntegrity and privacy, Intrusion detection, Malicious code, Mobile<br>\ncode, Mutual distrust, Privacy, Security policies, Security protocols</p>\n<p>All submissions will be peer-reviewed. Authors of accepted papers must<br>\nguarantee that their paper will be presented at the workshop.</p>\n<p>SUBMISSION<br>\n===========<br>\nSubmissions should be at most 15 pages (a4paper, 11pt), including<br>\nreferences.<br>\nThe cover page should include title, names of authors, co-ordinates of<br>\nthe corresponding author, an abstract, and a list of<br>\nkeywords. Submissions that are clearly too long may be rejected<br>\nimmediately. Additional material intended for the referees but not for<br>\npublication in the final version - for example details of proofs - may<br>\nbe placed in a clearly marked appendix that is not included in the<br>\npage limit.</p>\n<p>Authors are invited to submit their papers electronically, as portable<br>\ndocument format (pdf) or postscript (ps); please, do not send files<br>\nformatted for work processing packages (e.g., Microsoft Word or<br>\nWordperfect files). The only mechanism for paper submissions is via<br>\nthe dedicated easychair submission web page.<br>\n<a href=\"http://www.easychair.org/conferences/?conf=fcs09\">http://www.easychair.org/conferences/?conf=fcs09</a></p>\n<p>PUBLICATION<br>\n============<br>\nInformal proceedings will be made available in electronic format and<br>\nthey will be distributed to all participants of the workshop.</p>\n<p>AUDIENCE<br>\n=========<br>\nParticipation to the workshop will be open to anybody willing to register.</p>\n<p>PROGRAM COMMITTEE<br>\n===================<br>\nAlessandro Armando (Università di Genova, Italy)<br>\nMichael Backes (Saarland University and MPI-SWS, Germany)<br>\nMichele Bugliesi (Università Ca' Foscari, Italy)<br>\nStephen Chong (Harvard University, USA)<br>\nVéronique Cortier (LORIA INRIA-Lorraine, France; co-chair)<br>\nCas Cremers (ETH Zurich, Switzerland)<br>\nStéphanie Delaune (CNRS - ENS de Cachan, France)<br>\nDeepak Garg (Carnegie Mellon University, USA)<br>\nDieter Gollman (Hamburg University of Technology, Germany)<br>\nJerry den Hartog  (Technical University of Eindhoven, The Netherlands)<br>\nJan Jürjens (The Open University and Microsoft Research (Cambridge), UK)<br>\nRalf Küsters (Universität Trier, Germany)<br>\nCatherine Meadows (Naval Research Laboratory, USA)<br>\nMark Ryan (University of Birmingham, UK)<br>\nVitaly Shmatikov (University of Texas at Austin, USA; co-chair)<br>\nLuca Viganò (Università di Verona, Italy)</p>\n<p>ADDITIONAL INFORMATION<br>\n=======================<br>\nThe workshop is supported by the ANR project AVOTE.</p>",
        "id": 294074301,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660828269
    }
]