[
    {
        "content": "<p>From: Christoph Sprenger &lt;<a href=\"mailto:sprenger@inf.ethz.ch\">sprenger@inf.ethz.ch</a>&gt;<br>\nHi,</p>\n<p>I have recently installed the Isabelle 2011 on Mac Application, which  <br>\nincludes</p>\n<p>Carbon Emacs 23.2, and<br>\n   ProofGeneral 4.1pre101216</p>\n<p>(before I was using Isabelle 2009-1 with CE 22.3 and PG 3.7.1.1).  <br>\nThere a number of \"features\" of this combo that tend to drive me nuts.  <br>\nThese are:</p>\n<p>1) The Emacs Meta modifier is bound to the Option key instead of the  <br>\nCommand key.</p>\n<p>2) The Delete key acts like Backspace.</p>\n<p>3) When I point the mouse on a processed part of the input it becomes  <br>\nhighlighted in yellow and displays a \"tooltip\" frame with info about  <br>\nthe underlying object. Inside proofs it shows the proof state at the  <br>\nmouse position. While this looks like a cool new feature in PG4, I  <br>\nwould like to be able to turn both the highlighting and the \"tooltips\"  <br>\noff, when I do not need them. However, I was unable to find an option  <br>\nthat achieves this.</p>\n<p>4) There seem to be some bugs in PG 4 by which</p>\n<ul>\n<li>\n<p>the command processing gets out of sync (previously rare), indicated  <br>\nby the highlighting ending in the middle of a syntactic token or input  <br>\nsentence,</p>\n</li>\n<li>\n<p>the highlighting is not properly removed and some bits of processed  <br>\ninput stay yellow, after the mouse is moved away.</p>\n</li>\n</ul>\n<p>1) and 2) seem to be PG-independent \"features\" of CE 23.2 (does my CE  <br>\n22 config possibly disturb CE 23?), while 3) and 4) are PG-specific.   <br>\nPoint 4) is less of a problem than the others, since it does not occur  <br>\nvery often.</p>\n<p>I would greatly appreciate any help with these issues.</p>\n<p>Best wishes,<br>\nChristoph</p>",
        "id": 294134751,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660843979
    },
    {
        "content": "<p>From: Jasmin Blanchette &lt;<a href=\"mailto:jasmin.blanchette@gmail.com\">jasmin.blanchette@gmail.com</a>&gt;<br>\nHi Christoph,</p>\n<blockquote>\n<p>I would greatly appreciate any help with these issues.</p>\n</blockquote>\n<p>I ran into much the same issues, plus some more, including</p>\n<p>5) Windows that appear to prompt the user (e.g., \"Do you want to save?\") sometimes had absolutely ridiculous geometries, like 1000000 pixels wide. They were so wide that all I saw was a gray panel in the middle of the screen, which I couldn't close (the close button was like 500000 pixels to the left of the screen). I had to kill the app. This happened often enough to make the application totally unusable.</p>\n<p>This convinced me very quickly to go back to the \"good old\" Aquamacs. Not that I'm a big fan of the beast, but at least I know its bugs and I'm used to work around them.</p>\n<p>In my .bashrc file, I have the lines</p>\n<p>export EMACS=/Applications/Isabelle2009-2.app/Contents/Resources/Emacs.app/Contents/MacOS/Emacs<br>\nalias Isabelle=\"/Applications/Isabelle2011.app/Isabelle/bin/isabelle emacs -p $EMACS\"</p>\n<p>Then I can launch Isabelle2011 with the Aquamacs from Isabelle2009-2 by entering \"Isabelle\" on the command line.</p>\n<p>Jasmin</p>",
        "id": 294134787,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660843989
    },
    {
        "content": "<p>From: Brian Huffman &lt;<a href=\"mailto:brianh@cs.pdx.edu\">brianh@cs.pdx.edu</a>&gt;<br>\nOn Tue, Apr 12, 2011 at 5:38 AM, Christoph Sprenger<br>\n&lt;<a href=\"mailto:sprenger@inf.ethz.ch\">sprenger@inf.ethz.ch</a>&gt; wrote:</p>\n<blockquote>\n<p>Hi,</p>\n<p>I have recently installed the Isabelle 2011 on Mac Application, which<br>\nincludes</p>\n<p>Carbon Emacs 23.2, and<br>\n ProofGeneral 4.1pre101216<br>\n[...]<br>\n2) The Delete key acts like Backspace.</p>\n</blockquote>\n<p>This one at least is not too hard to fix. You will need to customize<br>\nthe option \"normal-erase-is-backspace\", which you can do using</p>\n<p>Options &gt; Customize Emacs &gt; Specific Option...</p>\n<p>and typing in \"normal-erase-is-backspace\". Try setting the value to<br>\n\"On\", and see if this solves your problem.</p>\n<p>I also have a related-but-different problem with delete vs. backspace<br>\nin the same version of ProofGeneral, but on Linux (Ubuntu) with GNU<br>\nEmacs 23.2.1. The delete key normally works properly, doing<br>\nforward-delete; but the symbol input shortcuts cause problems. For<br>\nexample, if I have just typed \"-\" or \"--\" (which are prefixes of<br>\n\"--&gt;\", the shortcut for the \\&lt;longrightarrow&gt; symbol), then my<br>\n\"delete\" key works like \"backspace\" instead.</p>\n<p>Interestingly, Carbon Emacs seems to do the right thing in this<br>\nsituation once I have \"normal-erase-is-backspace\" set properly, but<br>\nGNU Emacs on Linux gets it wrong no matter how<br>\n\"normal-erase-is-backspace\" is set.</p>\n<blockquote>\n<p>3) When I point the mouse on a processed part of the input it becomes<br>\nhighlighted in yellow and displays a \"tooltip\" frame with info about the<br>\nunderlying object. Inside proofs it shows the proof state at the mouse<br>\nposition. While this looks like a cool new feature in PG4, I would like to<br>\nbe able to turn both the highlighting and the \"tooltips\" off, when I do not<br>\nneed them. However, I was unable to find an option that achieves this.</p>\n</blockquote>\n<p>I would also like to be able to turn this feature off.</p>\n<ul>\n<li>Brian</li>\n</ul>",
        "id": 294134796,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660843991
    },
    {
        "content": "<p>From: David Aspinall &lt;<a href=\"mailto:David.Aspinall@ed.ac.uk\">David.Aspinall@ed.ac.uk</a>&gt;<br>\n<a href=\"http://tinyurl.com/pgchap3\">http://tinyurl.com/pgchap3</a></p>",
        "id": 294134814,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660844000
    },
    {
        "content": "<p>From: David Aspinall &lt;<a href=\"mailto:David.Aspinall@ed.ac.uk\">David.Aspinall@ed.ac.uk</a>&gt;</p>\n<blockquote>\n<p>4) There seem to be some bugs in PG 4 by which<br>\n- the command processing gets out of sync (previously rare), indicated by the highlighting ending in the middle of a syntactic token or input sentence,</p>\n</blockquote>\n<p>If you can repeat this, please report the bug at <a href=\"http://proofgeneral.inf.ed.ac.uk/trac\">http://proofgeneral.inf.ed.ac.uk/trac</a></p>\n<blockquote>\n<ul>\n<li>the highlighting is not properly removed and some bits of processed input stay yellow, after the mouse is moved away.</li>\n</ul>\n</blockquote>\n<p>Sounds likely to be a Emacs display engine bug rather than PG.  Try searching/reporting at <br>\n<a href=\"http://debbugs.gnu.org/\">http://debbugs.gnu.org/</a></p>\n<ul>\n<li>David</li>\n</ul>",
        "id": 294134821,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660844004
    },
    {
        "content": "<p>From: Alexander Krauss &lt;<a href=\"mailto:krauss@in.tum.de\">krauss@in.tum.de</a>&gt;<br>\nThis didn't help me. As I understand it, switching off \"Full Annotation\" <br>\nshould prevent saving (and displaying) the prover output. But even when <br>\ndisabled, I still get the tooltips, and they normally sit right in front <br>\nof the text I am trying to read, forcing me to move the mouse.</p>\n<p>As a workaround, I discovered that turning off \"tooltip-mode\" removes <br>\nthe gigantic tooltips and instead displays the text in the minibuffer, <br>\nwhich is less intrusive.</p>\n<p>The yellow highlight can be removed by customizing the appropriate face. <br>\nUnfortunately, the syntax highlighting of the normal text (foreground <br>\ncolour) still disappears on mouseover...</p>\n<p>Alex</p>",
        "id": 294134842,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660844014
    },
    {
        "content": "<p>From: David Aspinall &lt;<a href=\"mailto:David.Aspinall@ed.ac.uk\">David.Aspinall@ed.ac.uk</a>&gt;</p>\n<blockquote>\n<p>This didn't help me. As I understand it, switching off \"Full Annotation\" should prevent saving (and displaying) the prover output. But even when disabled, I still get the tooltips, and they normally sit right in front of the text I am trying to read, forcing me to move the mouse.</p>\n</blockquote>\n<p>I see your point -- when \"full annotation\" is switched off, they're only added for incrementally processed steps and won't be removed from already processed portions of the script.  It might be better to have an option to prevent adding them altogether.</p>\n<blockquote>\n<p>As a workaround, I discovered that turning off \"tooltip-mode\" removes the gigantic tooltips and instead displays the text in the minibuffer, which is less intrusive.</p>\n</blockquote>\n<p>You can also customize tooltip-delay and tooltip-short-delay.  </p>\n<p>Or use your finger to point at what you're reading, 8-).</p>\n<blockquote>\n<p>The yellow highlight can be removed by customizing the appropriate face. Unfortunately, the syntax highlighting of the normal text (foreground colour) still disappears on mouseover...</p>\n</blockquote>\n<p>This is by poor/old design in the Emacs display engine, which replaces (rather than merges) the mouse-over face with the underlying one which doesn't work well with font lock.  You see the same thing in Emacs native modes, e.g. Info.  I reported it as an Emacs bug a while ago.</p>\n<ul>\n<li>D.</li>\n</ul>",
        "id": 294134849,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660844016
    },
    {
        "content": "<p>From: Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt;<br>\nI have something like this in my <br>\n$ISABELLE_HOME_USER/etc/proofgeneral-settings.el, but you can also use the <br>\ncustomization menu in Emacs:</p>\n<p>(setq mac-option-modifier nil)</p>\n<p>Makarius</p>",
        "id": 294134870,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660844022
    },
    {
        "content": "<p>From: Christoph Sprenger &lt;<a href=\"mailto:sprenger@inf.ethz.ch\">sprenger@inf.ethz.ch</a>&gt;<br>\nDear Brian and Makarius,</p>\n<p>thank you for your helpful suggestions regarding the Emacs-specific  <br>\nproblems 1) and 2).</p>\n<p>@Brian regarding backspace problem:<br>\nSetting normal-erase-is-backspace to On solves my problem.</p>\n<p>@Makarius regarding modifier keys:<br>\nYour command switches off the interpretation of the Option key by  <br>\nEmacs, which is good. But I also and had to set mac-command-modifier  <br>\nto meta in order to restore things to \"normal\". I did this via the  <br>\nmenus, so my .emacs now contains</p>\n<p>(custom-set-variables<br>\n   ...<br>\n  '(ns-alternate-modifier (quote none))<br>\n  '(ns-command-modifier (quote meta))<br>\n   ...<br>\n)</p>\n<p>Here, ... denotes other settings and \"ns-command-modifier\" is a  <br>\nsynonym for \"mac-command-modifier\" and similarly for the other.</p>\n<p>Best,<br>\nChristoph</p>",
        "id": 294134894,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660844028
    },
    {
        "content": "<p>From: Christoph Sprenger &lt;<a href=\"mailto:sprenger@inf.ethz.ch\">sprenger@inf.ethz.ch</a>&gt;</p>\n<blockquote>\n<blockquote>\n<p>This didn't help me. As I understand it, switching off \"Full  <br>\nAnnotation\" should prevent saving (and displaying) the prover  <br>\noutput. But even when disabled, I still get the tooltips, and they  <br>\nnormally sit right in front of the text I am trying to read,  <br>\nforcing me to move the mouse.</p>\n</blockquote>\n<p>I see your point -- when \"full annotation\" is switched off, they're  <br>\nonly added for incrementally processed steps and won't be removed  <br>\nfrom already processed portions of the script.  It might be better  <br>\nto have an option to prevent adding them altogether.</p>\n</blockquote>\n<p>Exactly.</p>\n<blockquote>\n<blockquote>\n<p>As a workaround, I discovered that turning off \"tooltip-mode\"  <br>\nremoves the gigantic tooltips and instead displays the text in the  <br>\nminibuffer, which is less intrusive.</p>\n</blockquote>\n<p>You can also customize tooltip-delay and tooltip-short-delay.</p>\n<p>Or use your finger to point at what you're reading, 8-).</p>\n</blockquote>\n<p>I have set these two variables to a longer delay (5s) for now, which  <br>\nhelps.</p>\n<blockquote>\n<blockquote>\n<p>The yellow highlight can be removed by customizing the appropriate  <br>\nface. Unfortunately, the syntax highlighting of the normal text  <br>\n(foreground colour) still disappears on mouseover...</p>\n</blockquote>\n<p>This is by poor/old design in the Emacs display engine, which  <br>\nreplaces (rather than merges) the mouse-over face with the  <br>\nunderlying one which doesn't work well with font lock.  You see the  <br>\nsame thing in Emacs native modes, e.g. Info.  I reported it as an  <br>\nEmacs bug a while ago.</p>\n</blockquote>\n<p>I have currently set the following variables</p>\n<p>proof-command-mouse-highlight-face<br>\n  proof-mouse-highlight-face<br>\n  proof-region-mouse-highlight-face</p>\n<p>to the same color (lightblue in my case) as</p>\n<p>proof-locked-face</p>\n<p>In this way, the previous MTV-style flickering while moving the mouse  <br>\nis reduced to the disappearing syntax highlighting, which I find less  <br>\ndistracting.</p>\n<p>Thank you all for your helpful hints.</p>\n<p>Best,<br>\nChristoph</p>",
        "id": 294134913,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660844034
    }
]