[
    {
        "content": "<p>From: Damien Doligez &lt;<a href=\"mailto:damien.doligez@inria.fr\">damien.doligez@inria.fr</a>&gt;<br>\nResearch team: Tools for Proofs, MSR-INRIA Joint Centre</p>\n<p>The Microsoft Research-INRIA Joint Centre is offering a 2-year<br>\nposition for a post-doctoral researcher to work on a proof development<br>\nenvironment for TLA+ in the Tools for Proofs project-team (see<br>\n<a href=\"http://www.msr-inria.inria.fr\">http://www.msr-inria.inria.fr</a>).</p>\n<p>Research Context</p>\n<p>TLA+ is a language for formal specifications and proofs designed by<br>\nLeslie Lamport.  It is based on first-order logic, set theory,<br>\ntemporal logic, and a module system.  While the specification part of<br>\nTLA+ has existed for several years, the proof language is more recent,<br>\nand we want to develop tools for writing and checking proofs.</p>\n<p>The main program of our development environment is called the Proof<br>\nManager (PM).  The PM translates TLA+ source files to low-level proofs<br>\nthat are checked by Isabelle.  To this end, the PM calls the Zenon<br>\nautomatic theorem prover to fill in the \"trivial\" details omitted from<br>\nproofs at the source level.  Within the Isabelle framework we have an<br>\naxiomatization of TLA+ (Isabelle/TLA+).  Isabelle provides high<br>\nassurance by checking all the proofs provided by the user or by Zenon.<br>\nThe PM also has an interface to CVC3, which provides a stronger<br>\nautomatic prover, but with lower assurance of correctness.</p>\n<p>The current version of the PM handles only the \"action\" part of TLA+:<br>\nfirst-order formulas with primed and unprimed variables; where a<br>\nvariable is considered as unrelated to its primed version.  This<br>\nallows us to translate first-order formulas to first-order formulas,<br>\nwithout the overhead associated to an encoding of temporal logic into<br>\nfirst-order logic.  This part of TLA+ is already useful for proving<br>\nsafety properties.</p>\n<p>Description of the activity of the post-doc</p>\n<p>The task devoted to the post-doc will be to extend the proof manager<br>\nto deal with the temporal part of TLA+.  To this end, he will<br>\nhave to define a new translation into Isabelle to handle the temporal<br>\noperators, in a way that enables the re-use of non-temporal theorems<br>\nproved with the simple translation.  He will also have to implement<br>\nthis new translation and the interface between the two translations.</p>\n<p>Skills and profile of the candidate</p>\n<p>We are looking for a candidate with skills in some or all of the<br>\nfollowing subjects: parsing and compilation, logic and set theory,<br>\nIsabelle, OCaml, Eclipse and Java.  Moreover, the applicant must have<br>\na good command of the English language.</p>\n<p>Location</p>\n<p>The Microsoft Research-INRIA Joint Centre is located on the Campus of<br>\nINRIA Futurs, in South part of Paris, near the Le-Guichet RER<br>\nstation. The Tools for Proofs project-team is composed of Damien<br>\nDoligez, Leslie Lamport and Stephan Merz.</p>\n<p>Contact</p>\n<p>Candidates should send a resume and the name and e-mail address<br>\nof one or two references to Damien Doligez &lt;<a href=\"mailto:damien.doligez@inria.fr\">damien.doligez@inria.fr</a>&gt;.</p>",
        "id": 294078182,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660829714
    }
]