[
    {
        "content": "<p>From: Aleksy Schubert &lt;<a href=\"mailto:alx@mimuw.edu.pl\">alx@mimuw.edu.pl</a>&gt;<br>\n[apologies for cross posting]</p>\n<hr>\n<p>RDP 2015 Last Call for Workshops<br>\n(Rewriting, Deduction, and Programming, June-July 2015, Warsaw, Poland)</p>\n<hr>\n<p>RDP 2015 is the eighth edition of the International Conference on<br>\nRewriting, Deduction, and Programming, consisting of two main<br>\nconferences</p>\n<ul>\n<li>RTA (Rewriting Techniques and Applications)</li>\n<li>TLCA (Typed Lambda Calculi and Applications)</li>\n</ul>\n<p>Previous RDPs were held in 2003 in Valencia (Spain), 2004 in Aachen<br>\n(Germany), 2005 in Nara (Japan), 2007 in Paris (France), 2009 in<br>\nBrasilia (Brasil), 2011 in Novi Sad (Serbia), 2013 in Eindhoven (The<br>\nNetherlands).</p>\n<p>We solicit proposals for satellite workshops of RDP 2015 that are<br>\nrelated in topics to one or both of the RDP conferences.</p>\n<p>We plan the workshops to proceed for up to 2 days (possibilities of<br>\nlonger workshops should be discussed with the organisers). It is<br>\ntradition at RDP that attendance to workshops is open to participants<br>\nof parallel events, similar to the way FLoC workshops are run. There<br>\nwill be one day (Sunday, June 28, 2015) reserved for workshops only,<br>\nhowever, it will also be possible to run workshops on the other days<br>\nin parallel to one of the main conferences.</p>\n<p>RDP will provide the possibility to print workshop proceedings,<br>\ndetails of the procedure will be posted later by the local organising<br>\ncommittee. RDP will not be able to reimburse invited workshop speakers<br>\nfor travel or living expenses, though it may be possible to waive part<br>\nof the registration fees for invited speakers. The priority of RDP<br>\nwill be to keep registration fees for the conferences and workshops<br>\nlow.</p>\n<p>If you want to organise a workshop, please send the following<br>\ninformation to <a href=\"mailto:rdp15@mimuw.edu.pl\">rdp15@mimuw.edu.pl</a>:</p>\n<ul>\n<li>Workshop title and description of the topic</li>\n<li>Names and affiliations of the organisers</li>\n<li>Pointers to descriptions of previous editions of the workshop, if any</li>\n<li>Proposed workshop duration (from one day to two days)</li>\n<li>\n<p>Proposed format and agenda (for example, paper presentations,<br>\n   tutorials, demo sessions, etc.)</p>\n</li>\n<li>\n<p>Plans for invited speakers or special sessions (round-table<br>\n   discussion, tutorials, etc.)</p>\n</li>\n<li>\n<p>Estimate of the audience size</p>\n</li>\n<li>Procedures for selecting papers and participants</li>\n<li>\n<p>Plans for the publication of proceedings (informal proceedings<br>\n   distributed to participants, electronic journal, proceedings with<br>\n   separate selection process, etc.)</p>\n</li>\n<li>\n<p>Other potential organisational issues</p>\n</li>\n</ul>\n<p>IMPORTANT DATES</p>\n<p>Submission of workshop proposals:   November 18, 2014 (Tuesday)<br>\nNotification date:                  November 26, 2014 (Wednesday)<br>\nWorkshop dates:                     June 28-July 3, 2014 (Sunday-Friday)</p>\n<p>CONTACT INFORMATION</p>\n<p>Questions regarding workshop proposals should be sent to<br>\n<a href=\"mailto:rdp15@mimuw.edu.pl\">rdp15@mimuw.edu.pl</a>.</p>\n<p>RDP 2015 MAIN ORGANISER<br>\nAleksy Schubert <a href=\"http://www.mimuw.edu.pl/~alx/\">http://www.mimuw.edu.pl/~alx/</a><br>\nFaculty of Mathematics, Informatics and Mechanics<br>\nUniversity of Warsaw</p>",
        "id": 294321540,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660927054
    }
]