[
    {
        "content": "<p>From: <a href=\"mailto:leila@ufs.br\">leila@ufs.br</a><br>\nOur apologies if you have received multiple copies.</p>\n<hr>\n<p>SBMF 2010</p>\n<p>13th BRAZILIAN SYMPOSIUM ON FORMAL METHODS<br>\nNatal, Rio Grande do Norte, Brazil November 8-12, 2010</p>\n<p>SBMF 2010 is the thirteenth of a series of events devoted to the dissemination of the development and use of formal methods for the construction of high quality computational systems. It is now a well-established event, with a very good national and international reputation. SBMF is the main event on formal methods in Brazil, qualified as one of the high quality national events by Brazilian research agencies. Besides technical sessions, the symposium presents invited speakers from the international community. Publication of the proceedings in LNCS series of Springer are under definition.</p>\n<p>The symposium also includes two satellite events and a workshop on theses and dissertations (WTD) in formal methods. The WTD is a student forum for bringing together graduate students that research on topics related to formal methods. The aim of this meeting is to present and discuss the proposed contribution, preliminary results and possible directions for their research.</p>\n<p>In 2010, the SBMF will be held in the touristic town of Natal, in Rio Grande do Norte, Brazil. The event will be organized by the Informatics and Applied Mathematics Department of the Federal University of Rio Grande do Norte (UFRN).</p>\n<p>Invited Speakers (confirmed)</p>\n<p>Bill Roscoe (UK)<br>\nDavid Naumann (USA)</p>\n<p>Satellite events</p>\n<p>Workshop on B Dissemination<br>\nUsing Boogie 2 in the Verification of Spec# Programs</p>\n<p>Topics of interest</p>\n<p>The aim of this event is to provide an opportunity for researchers with a broad range of interests in formal methods to discuss recent developments in this field. The topics include, but are not limited to, the following:<br>\n\" Well-founded specification and design languages;<br>\n\" Formal aspects of popular languages and methodologies;<br>\n\" Logics and semantics of programming and specification languages;<br>\n\" Reusable domain theories;<br>\n\" Type systems and category theory in computer science;<br>\n\" Computational complexity of methods and models;<br>\n\" Computational models;<br>\n\" Rewriting systems;<br>\n\" Formal methods integration;<br>\n\" Formal methods for software/hardware development;<br>\n\" Formal methods applied to model-driven engineering;<br>\n\" Code generation;<br>\n\" Formal design methods;<br>\n\" Specification and modeling;<br>\n\" Abstraction, modularization and refinement techniques;<br>\n\" Program and test synthesis;<br>\n\" Techniques for correctness by construction;<br>\n\" Formal methods and models for objects, aspects and component systems;<br>\n\" Formal methods and models for real-time, hybrid and critical systems;<br>\n\" Formal methods and models for service-oriented systems;<br>\n\" Models of concurrency, security and mobility;<br>\n\" Model checking;<br>\n\" Theorem proving;<br>\n\" Static analysis;<br>\n\" Formal techniques for software testing;<br>\n\" Software certification;<br>\n\" Formal techniques for software inspection.<br>\n\" Teaching of, for and with formal methods;<br>\n\" Experience reports on the use of formal methods;<br>\n\" Industrial case studies;<br>\n\" Tools supporting the formal development of computational systems;<br>\n\" Development methodologies with formal foundations;<br>\n\" Software evolution based on formal methods.</p>\n<p>Papers with a strong emphasis on Formal Methods, whether practical or theoretical, are invited for submission.</p>\n<p>Relevant Dates<br>\n10/06/2010: Paper submission deadline<br>\n07/08/2010: Acceptance notification<br>\n21/08/2010: Camera-ready version due</p>\n<p>Instructions to prospective authors</p>\n<p>The following types of submissions are expected:</p>\n<p>Technical papers: Unpublished and original work that have clear contributions to the state of the art on the theory and practice of formal methods. Papers will be judged on the basis of originality, relevance, technical soundness and presentation quality. Papers must be written in English and not exceed 16 pages in the LNCS format (see<br>\n<a href=\"http://www.springer.com/lncs\">http://www.springer.com/lncs</a>).</p>\n<p>WTD papers: Master and PhD students are invited to submit papers that give a report on the research they are developing. The papers must correspond to individual work but may be co-authored by the advisor. Papers must be no longer than 8 pages, including all figures, tables and references. </p>\n<p>Every accepted paper MUST have at least one author registered to the symposium by the time the camera-ready paper is submitted; the author is also expected to attend the symposium and present the paper. Papers originally submitted in English MUST be presented in English. Papers can be submitted via the following link: <a href=\"http://www.easychair.org/conferences/?conf=sbmf2010\">http://www.easychair.org/conferences/?conf=sbmf2010</a></p>\n<p>Co-chairs and contact</p>\n<p>Leila Silva (Federal University of Sergipe) <br>\nJim Davies (University of Oxford)<br>\n<a href=\"mailto:sbmf2010@gmail.com\">sbmf2010@gmail.com</a></p>",
        "id": 294098942,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660833173
    }
]