[
    {
        "content": "<p>From: Alex Meyer &lt;<a href=\"mailto:alex153@outlook.lv\">alex153@outlook.lv</a>&gt;<br>\nI am aware of the Chapter \"6.2 Variations of backward vs. forward reasoning\" (with samples of forward proof style) of <a href=\"https://isabelle.in.tum.de/library/HOL/HOL-Isar_Examples/document.pdf\">https://isabelle.in.tum.de/library/HOL/HOL-Isar_Examples/document.pdf</a> but it is no answer for my question, because such reasoning requires the user to provide both premises and the consequences and Isabelle then just checks the suggested proof step. Of course, one should not ask to the proof assistant to generated something. But the following arguments are in favour for proof assistant to be creative/generative as well:</p>\n<p>*   Maybe internally the check of forward inference step is done using the generation of the consequence and then comparing the generated consequence with the provided consequence, so, maybe one can make the generated consquence explicit;<br>\n  *   <a href=\"https://www.isa-afp.org/entries/FOL_Seq_Calc1.html\">https://www.isa-afp.org/entries/FOL_Seq_Calc1.html</a> is example how the sequente calculus are formalized in the Isabelle and any sequent calculus provides direct means for forward reasoning, so, maybe it is possible to embed any sequence calculus in Isabelle and then do some forward reasoning with them (why to embed otherwise?).</p>\n<p>Alex</p>\n<p>A Sequent Calculus for First-Order Logic - Archive of Formal Proofs - isa-afp.org&lt;<a href=\"https://www.isa-afp.org/entries/FOL_Seq_Calc1.html\">https://www.isa-afp.org/entries/FOL_Seq_Calc1.html</a>&gt;<br>\nTitle: A Sequent Calculus for First-Order Logic: Author: Andreas Halkjær From: Contributors: Alexander Birch Jensen, Anders Schlichtkrull and Jørgen Villadsen: Submission date:<br>\n<a href=\"http://www.isa-afp.org\">www.isa-afp.org</a></p>\n<hr>\n<p>No: Alex Meyer<br>\nNosūtīts: otrdiena, 2019. gada 10. septembris 20:49<br>\nKam: <a href=\"mailto:cl-isabelle-users@lists.cam.ac.uk\">cl-isabelle-users@lists.cam.ac.uk</a> &lt;<a href=\"mailto:cl-isabelle-users@lists.cam.ac.uk\">cl-isabelle-users@lists.cam.ac.uk</a>&gt;<br>\nTēma: Getting the immediate consequences from applying some theorem or tactic, Isabelle/HOL for knowledge base completion and forward chaining?</p>\n<p>Hello!</p>\n<p>Isabelle, of course, is proof assistant and one declares theorem and tries to find the proof. That is fine. Enormous amount of formal knowledge (formalization of notions, concepts, rules and axioms, formally proved theorems and so on) is gathered in such way in Isabelle language and format (e.g. AFP). But is it possible to use all this wealth for forward reasoning, for calculation?</p>\n<p>Simple questions: is it possible to use Isabelle as calculator, e.g. to declare that x=4+5 and then try to find x? is it possible to calculate _immediate_ consequences for some set of axioms&amp;proved theorems and some valid rules, tactics? Of course, the complete set of consequences if infinite and contains a lot of garbage, but my question is about the immediate consequences.</p>\n<p>The method described in the article \"Guding inference in Relational Reinforcement Learning\" <a href=\"http://cll.stanford.edu/~langley/papers/icarus.rrl.ilp05.pdf\">http://cll.stanford.edu/~langley/papers/icarus.rrl.ilp05.pdf</a> is the reason why I am asking for such forward reasoning feature in Isabelle: external software (or even Isabelle tactics) can decide on the set of interesting premises (subset of already proved theorems and assumed facts) and on the promising theorems/rules/tactics and may all this information forward to the Isabelle and then Isabelle can make immediate consequences out, one step for forward reasoning. And then it is up to the external system to estimate the usefulness of acquired/deduced knowledge and to go forward (possibly useing reinforcement learning approach - neural or symbolic/relational).</p>\n<p>That is why the forward reasoning feature would be of importance for the Isabelle and it should be enabled somehow? Is it possible? It would be very sad to translate all the results of Isabelle formalization into other systems for doing forward reasoning (besides, I don't know any such system that can do it, although <a href=\"https://content.sciendo.com/view/journals/ausi/8/1/article-p41.xml\">https://content.sciendo.com/view/journals/ausi/8/1/article-p41.xml</a> \"Contralog: a Prolog conform forward-chaining environment and its application for dynamic programming and natural language parsing\" is example how forward inference is being enabled in Prolog, which is backward reasoning system originally as well, there are some other papers about Datalog syntax for Rete algorithm/forward reasoning from some more historic time as well).</p>\n<p>Well - maybe the overall vision is try to use Isabelle for encoding expert system and knowledge base. Isabelle is good at automating the logics (one can embedd them into) and that is why some mixing of logics is automatically enabled for such knowledge base. Of course, there is always the question about selection of premises and selection of applicable rules, but, as I said, that is up to the external system, possibly, neural-symbolic/neural agent that is learning/improving itself using reinforcement learning.</p>\n<p>Essentially - Isabelle orignially is about providing proof to some statement. But what about the use case when one is eager to deduce more or less all possible theorems for some concept? The forward reasoning to this interesting region of possible lemmas/theorems seems to be the right approach and exactly that is described in \"Guiding inference...\" paper and exactly that I am trying to do with Isabelle.</p>\n<p>Thanks, Alex</p>",
        "id": 294762570,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661200333
    },
    {
        "content": "<p>From: Walther Neuper &lt;<a href=\"mailto:walther.neuper@jku.at\">walther.neuper@jku.at</a>&gt;<br>\nHi Alex,</p>\n<p>Isabelle/Isar supported calculational proof from the beginning, see [2].</p>\n<p>Earliest support by theorem provers for calculations in a format close<br>\nto traditional paper&amp;pencil work seems to go back to Ralph-Johan Back.<br>\nHe calls this format \"structured derivation\" [1] and used PVS in the<br>\nbackground.</p>\n<p>A similar prototyping project uses Isabelle in the background [3].</p>\n<p>The ThEdu [4] workshop series pursues ideas you seem to be looking for.</p>\n<p>Hope this helps,</p>\n<p>Walther</p>\n<p>[1]<br>\n<a href=\"http://users.abo.fi/Ralph-Johan.Back/index.php?page=searchform.php&amp;menu=3\">http://users.abo.fi/Ralph-Johan.Back/index.php?page=searchform.php&amp;menu=3</a></p>\n<p>[2] <a href=\"https://link.springer.com/chapter/10.1007%2F3-540-44755-5_7\">https://link.springer.com/chapter/10.1007%2F3-540-44755-5_7</a></p>\n<p>[3] <a href=\"http://eptcs.web.cse.unsw.edu.au/paper.cgi?ThEdu17.6\">http://eptcs.web.cse.unsw.edu.au/paper.cgi?ThEdu17.6</a></p>\n<p>[4] <a href=\"https://www.uc.pt/en/congressos/thedu\">https://www.uc.pt/en/congressos/thedu</a></p>",
        "id": 294762604,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661200355
    }
]