[
    {
        "content": "<p>From: Christian Sternagel &lt;<a href=\"mailto:christian.sternagel@uibk.ac.at\">christian.sternagel@uibk.ac.at</a>&gt;<br>\nHi there,</p>\n<p>currently I'm the first time using Isabelle/HOL for writing a paper. <br>\nThanks to Alexander Krauss, most of my initial questions were resolved.</p>\n<p>Initially I wrote my paper as an Isabelle theory Paper.thy, depending on <br>\nmy actual Isabelle/HOL developments. At first, I just stated my lemmas <br>\nand filled the gaps with some \"glue text\" to explain everything. <br>\nAdditionally I set up a theory Setup.thy just for introducing notations <br>\nI wanted to use in the paper. At this stage everything worked fine.</p>\n<p>However, I also wanted to give a textual sketch of every proof that was <br>\nused for my lemmas. My Idea was to redo every proof that I wanted to <br>\ndescribe inside Paper.thy. Then I wanted to hide all Isar commands <br>\n(using (<em>&lt;</em>) and (<em>&gt;</em>)), replace them by \"glue text\" and refer to <br>\nintermediate formulas, e.g., instead of</p>\n<p>have \"A\" by (auto simp: very powerful lemmas)<br>\n   hence \"B\" by (auto simp: even more powerful lemmas)</p>\n<p>I would like to have</p>\n<p>... we obtain A by using Lemmas x--y. From<br>\n  this we conclude B using ...</p>\n<p>What I tried to do was</p>\n<p>txt {* ... we obtain *}<br>\n   (<em>&lt;</em>)have(<em>&gt;</em>) \"A\" by %invisible (auto ...)<br>\n   txt {* by using Lemmas x--y. From this we conclude *}<br>\n   (<em>&lt;</em>)hence(<em>&gt;</em>) \"B\" by %invisible (auto ...)<br>\n   txt {* using ... *}</p>\n<p>The result looks horrible :) and furthermore, no notations from <br>\nSetup.thy are used. Hence my question: Is there a (preferably easy and <br>\nnice) way to do what I want? What do others do in such situations?</p>\n<p>Maybe I should also give at least one reason, why I want to do what I <br>\nshowed above. Of course, I would like to rely on Isabelle to check all <br>\nmy displayed formulas in the background. Additionally, I do not want the <br>\nreader (and especially the reviewer) to see any difference to a paper, <br>\njust typeset with LaTeX without using Isabelle. My fear is, that <br>\nreviewers wouldn't like to have to read Isabelle proofs (this surely <br>\ndepends on where you send your paper).</p>\n<p>cheers</p>\n<p>chris</p>",
        "id": 294098528,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660833049
    },
    {
        "content": "<p>From: Lawrence Paulson &lt;<a href=\"mailto:lp15@cam.ac.uk\">lp15@cam.ac.uk</a>&gt;<br>\nI prefer to keep my papers and my proofs quite separate. Sometimes I use Isabelle to generate laTeX material, which I process in various ways and insert into documents.</p>\n<p>This approach allows you to use integrated TeX environments and have full control over the appearance.<br>\nLarry Paulson</p>",
        "id": 294098595,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660833074
    },
    {
        "content": "<p>From: Norbert Schirmer &lt;<a href=\"mailto:schirmer@in.tum.de\">schirmer@in.tum.de</a>&gt;<br>\nHi Christian,</p>\n<p>one way to achieve what you want is basically the same approach as you have done for your Paper.thy, just applied within an Isar-proof. You basically hide all the real Isar commands with (<em>&lt;</em>) ... (<em>&gt;</em>) and then afterwards write one txt with antiquotations e.g. to the 'haves' inside.</p>\n<p>For example</p>\n<p>...<br>\n(<em>&lt;</em>)<br>\nfrom X Y<br>\nhave p1: \"...\"<br>\n  by auto<br>\n(<em>&gt;</em>)<br>\ntxt {* From @{thm[source] X} and  @{thm[source] Y} we trivially obtain @{thm p1}. *}<br>\n...</p>\n<p>With this approach you get your syntax tricks from Setup.thy applied and still can safely quote formal stuff.</p>\n<p>Cheers,</p>\n<p>Norbert</p>",
        "id": 294098614,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660833080
    },
    {
        "content": "<p>From: Jesper Bengtson &lt;<a href=\"mailto:jesperb@it.uu.se\">jesperb@it.uu.se</a>&gt;<br>\nGreetings Chris</p>\n<p>I'm currently writing my thesis and trying out the Isabelle-tex capabilities. I am also completely new to this, but I've found a way to display the proofs in a way that I like.</p>\n<p>My problem was that I wanted the Isabelle-Isar code in my papers, but I also wanted the nicely generated tex-syntax for my object logic, as I don't want the readers to have to parse weird ascii-xsymbol syntax when reading the proofs.</p>\n<p>Anyway, I don't know what your Setup.thy theory looks like, but if it's anything like mine then you have a bunch of abbreviations from your Isabelle expressions to tex-code..... with these \\&lt;^raw:..&gt; constructs spliced in to get the proper look that you want.</p>\n<p>What you can then do is to write these latex commands in stead of your object logic. The abbreviations will translate it back to the corresponding logic that Isabelle understands, and your scripts will still be fully verified, although completely unreadable at a source code level. They will look nice in print though.</p>\n<p>For example, you can have:</p>\n<p>from A B C have \"tex code\" by (rule D)<br>\nmoreover from ...</p>\n<p>You can then comment out the (rule D) part and replace it with txt {* Lemma \\ref{mylatexreference} *} if you want, or just add as a comment which lemma you mean by (rule D).</p>\n<p>This is not exactly pretty, but it works. What would be nice is if all object logic formulae could be passed through the tex-code generator, but I have been told that this is technically very difficult.</p>\n<p>Best of luck</p>\n<p>/Jesper</p>",
        "id": 294098657,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660833096
    }
]