[
    {
        "content": "<p>From: Walther Neuper &lt;<a href=\"mailto:wneuper@ist.tugraz.at\">wneuper@ist.tugraz.at</a>&gt;<br>\nDeadline extended: Call for Abstracts an Posters</p>\n<hr>\n<p>eduTPS: \"Justifying (in) Math\"<br>\n           Working Group on Education and TP Technology</p>\n<hr>\n<p>at CADGME 2016<br>\n            September 7-10, 2016, Targu Mures, Romania<br>\n<a href=\"https://cadgme.ms.sapientia.ro/\">https://cadgme.ms.sapientia.ro/</a></p>\n<hr>\n<p>New Deadline:<br>\n  Abstracts: May 2, 2016<br>\n  Posters:   May 2, 2016</p>\n<p>The abstracts of contributed talks and posters will be published on the<br>\nconference proceedings website. The length is maximum 300 words.<br>\nAbstracts and posters should be submitted in as unformatted texts on the<br>\nEasy Chair system: <a href=\"https://easychair.org/conferences/?conf=cadgme2016\">https://easychair.org/conferences/?conf=cadgme2016</a></p>\n<p>Aims of the working group eduTPS:</p>\n<p>Mathematics is not only calculating, numeric and symbolic calculation,<br>\nnot only explaining with figures --- the distiguishing feature of math<br>\nis justifying and deducing properties of mathematical objects and<br>\noperations on firm grounds of logics.<br>\nSo Computer Algebra Systems (CAS) model calculation, Dynamic Geometry<br>\nSystems (DGS) model figures --- and (Computer) Theorem Provers (TPS)<br>\nmodel deduction and reasoning, mechanised by formal logic.</p>\n<p>TPS are widely unknown despite the fact, that recent advances in<br>\nmathematics could not have been done without them (e.g. mechanised<br>\nproofs of the Four Colour Theorem, of the Kepler Conjecture, etc.), that<br>\nTPS are becoming indispensable in verification of requirements on<br>\ncomplex technical systems (e.g. google car) and despite the fact, that<br>\nleading TPS have math mechanised from first principles (axioms) to all<br>\nundergraduate math and beyond.<br>\nSo the working group \"eduTPS: justifying math\" addresses a wide range of<br>\ntopics, from educational concepts of reasoning, explaining and<br>\njustifying and from respective classroom experience on the one side to<br>\ntechnical concepts and software tools, which mechanise and support these<br>\nmathematical activities, on the other side.</p>\n<p>We elicit contributions from educators to the educational side as well<br>\nas TP experts to the technical side --- the working group shall<br>\ninteractively elaborate on the connections between the two sides,<br>\nconnections which are not yet clarified to a considerable extent.<br>\nNarrowing the apparent gap between TP technology and educational<br>\npractice (and theory!) concerns the distinguishing essence of<br>\nmathematics and may well lead to considerable innovations in how we<br>\nteach and learn mathematics in the future.</p>\n<p>Points of interest include:</p>\n<p>* Adaption of TP -- concepts and technologies for education: knowledge<br>\n    representation, simplifiers, reasoners; undefinednes, level of<br>\n    abstraction, etc.</p>\n<p>* Requirements on software support for reasoning -- reasoning appears<br>\n    as the most advanced method of human thought, so at which age<br>\n    which kind of support by TP should be provided?</p>\n<p>* Automated TP in geometry -- relating intuitive evidence with logical<br>\n    rigor: specific provers, adaption of axioms and theorems, visual<br>\n    proofs, etc.</p>\n<p>* TP components in SW for engineers -- Formal Methods<br>\n    increasingly advance into engineering practice, so educational<br>\n    software based on TP components could anticipate that advancement.</p>\n<p>* Levels of authoring -- in order to cope with generality of TP:<br>\n    experts adapt to specifics of countries or levels, teachers adapt<br>\n    to courses and students.</p>\n<p>* Adaptive dialogues, students modeling and learning paths -- services<br>\n    for user guidance provided by TP technology: which interfaces<br>\n    enable flexible generation of adaptive user guidance?</p>\n<p>* Next-step-guidance -- suggesting a next step when a student gets<br>\n    stuck in problem solving: which computational methods can extend<br>\n    TP for that purpose?</p>\n<p>* TP as unifying foundation -- for the integration of technologies<br>\n like CAS, DGS, Spreadsheets etc: interfaces for unified support of<br>\n    reasoning?</p>\n<p>* Continuous tool chains -- for mathematics education from high-school<br>\n    to university, from algebra and geometry to graph theory, from<br>\neducational tools to professional tools for engineers and<br>\n    scientists.</p>\n<p>Programme Committee:</p>\n<p>Zoltán Kovács, Johannes Kepler University, Austria<br>\n  Filip Maric, University of Belgrade, Serbia<br>\n  Walther Neuper, Graz University of Technology, Austria (co-chair)<br>\n  Pavel Pech, University of South Bohemia, Czech Republic<br>\n  Pedro Quaresma, University of Coimbra, Portugal (co-chair)<br>\n  Judit Robu, Babeş-Bolyai University Cluj, Romania<br>\n  Vanda Santos, CISUC, Portugal<br>\n  Róbert Vajda, University of Szeged, Hungary<br>\n  Wolfgang Windsteiger, Johannes Kepler University, Austria</p>",
        "id": 294671635,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661173562
    }
]