[
    {
        "content": "<p>From: Moa Johansson &lt;<a href=\"mailto:moa.johansson@chalmers.se\">moa.johansson@chalmers.se</a>&gt;<br>\nChalmers is hiring PhD students in the Functional Programming group,<br>\nto work on topics such as domain-specific languages, compilers,<br>\ntesting, automated reasoning, computer linguistics, and more.</p>\n<p>Read the announcement here:</p>\n<p><a href=\"http://www.chalmers.se/en/about-chalmers/vacancies/Pages/default.aspx?rmpage=job&amp;rmjob=900&amp;rmlang=UK\">http://www.chalmers.se/en/about-chalmers/vacancies/Pages/default.aspx?rmpage=job&amp;rmjob=900&amp;rmlang=UK</a></p>\n<p>The application deadline is 2012-12-12. Please pass this on to<br>\ninterested students.</p>\n<hr>\n<p>PhD student positions in Functional Programming</p>\n<p>The Department has 76 faculty members and enrolls about 70 PhD<br>\nstudents from more than 30 countries. The research spans the whole<br>\nspectrum, from theoretical underpinnings to applied systems<br>\ndevelopment. There is extensive national and international<br>\ncollaboration with academia and industry all around the world.</p>\n<p>Information about the division</p>\n<p>The Functional Programming group at Chalmers is a world-leading<br>\nresearch group with an outstanding track record in research, and an<br>\nexcellent network of collaborators in both academia and industry. The<br>\ngroup has done ground breaking work in embedded domain specific<br>\nlanguages (DSLs) and in software testing (where work on QuickCheck has<br>\nbeen hugely influential both inside and outside the functional<br>\nprogramming community). We are collaborating with Ericsson to develop<br>\nFeldspar, a DSL for Digital Signal Processing algorithm development.<br>\nWe are also working on DSLs for programming GPUs and for FPGA<br>\nprogramming. We have obtained a large grant from the Swedish Strategic<br>\nResearch Agency to work on Resource Aware Functional Programming, and<br>\nthis project brings together DSLs and testing. It also allows us to<br>\nhave a steady flow of interesting visitors. In a new EU project,<br>\nPROWESS, we will work on new techniques for modelling and<br>\nproperty-based testing in web services. We also have a strong interest<br>\nin automated theorem proving. With four professors and five assistant<br>\nprofessors, the group enjoys critical mass, and provides the ideal<br>\nresearch environment for doctoral studies in Functional Programming.</p>\n<p>Job description</p>\n<p>The PhD students will join the Functional Programming group and<br>\ncontribute to its research in the general area of Functional<br>\nProgramming. The selection of specific research projects for the<br>\npresent positions will take into account both the interests of the new<br>\nstudents and the research agenda of the group. There will be ample<br>\nopportunities for collaboration with the group's academic and<br>\nindustrial contacts.</p>\n<p>The job is a full time employment, limited to five years. 80% of the<br>\nworking time is devoted to research studies, and the remaining 20% to<br>\nother duties, mainly teaching. It is expected that the student will<br>\nobtain the PhD within the five-year period.</p>\n<p>Qualifications</p>\n<p>Applicants should have a Master’s Degree or corresponding (Sw.<br>\ncivilingenjörsexamen) in Computer Science, Computer Engineering, or in<br>\na related discipline. Strong research interest and relevant research<br>\ntrack record must be well documented in the application. A genuine<br>\ninterest and curiosity in Functional Programming and excellent<br>\nanalytical and communication skills, orally as well as literally, are<br>\nneeded.</p>\n<p>In particular, we welcome applicants with documented interest in<br>\ndomain-specific languages, software testing and specification, or<br>\nautomated theorem proving.</p>\n<p>You may apply even though you might not have completed your degree<br>\nyet, but expect to do so before the position starts. Knowledge of<br>\nSwedish is not a prerequisite for applying since English is our<br>\nworking language for research, and we publish internationally. Both<br>\nSwedish and English are used in undergraduate courses. Half of our<br>\nresearchers and PhD students at the department come from more than 30<br>\ndifferent countries.</p>",
        "id": 294226791,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660900373
    }
]