[
    {
        "content": "<p>From: Stephan Merz &lt;<a href=\"mailto:Stephan.Merz@loria.fr\">Stephan.Merz@loria.fr</a>&gt;<br>\nAs part of INRIA's 2009 campaign for recruiting post-doctoral <br>\nresearchers, the Mosel team in Nancy is looking to hire somebody on the <br>\ntopic:</p>\n<p>Efficient proof synthesis, compression and reconstruction of proofs from <br>\nSMT solvers</p>\n<p>The objective of our work is the construction of a verification <br>\nenvironment that integrates specialized automated reasoners within an <br>\ninteractive reasoning framework. We intend to demonstrate that one can <br>\nin this way significantly raise the degree of automation for the <br>\nverification of complex systems and thus contribute to make deductive <br>\nverification techniques economically viable. In order to ensure the <br>\noverall correctness of a proof, we are interested in a skeptical <br>\napproach to combining reasoners. We rely on automated reasoning tools <br>\nthat produce justifications which can be certified by the interactive <br>\nproof assistant. In this way, both the result of the external reasoner <br>\nand the translations between the different syntactic representations are <br>\nverified. Contrary to proof search, proof checking is of low polynomial <br>\ncomplexity. We have gained some initial experience with this approach <br>\nwhen we combined Isabelle/HOL with SAT solvers and with the SMT solver <br>\nhaRVey (the ancestor of our solver, veriT) for fragments of first-order <br>\nlogic, including equality reasoning. However, many research questions <br>\nremain open in order to make that idea scale to industrially relevant <br>\nverification problems. The goal of the post-doctoral research proposed <br>\nhere is to address some of the scientific and technological issues in <br>\norder to make the approach more robust, efficient, and scalable.</p>\n<p>Proof generation and certification need to be extended beyond the <br>\nfragments of first-order logic that we can currently handle. In <br>\nparticular, proofs of Skolemization, quantified theories, and arithmetic <br>\n(over the integers, reals, and potentially bit vectors) must be <br>\nincluded; extensions to fragments of higher-order logic are also of <br>\ninterest. We are aiming at the definition of a generic and extensible <br>\nproof format that is independent of a specific automatic prover and <br>\ninteractive proof assistant.</p>\n<p>The issue of scalability is of concern because proof obligations that <br>\narise from verification problems are often large formulas, usually in <br>\nrestricted first-order theories; correspondingly, they generate long <br>\nproofs. Modern automatic provers are optimized for handling such <br>\nformulas, but interactive proof assistants focus primarily on <br>\nexpressive, higher-order logical languages, for which elementary <br>\nproblems such as unification or matching are computationally expensive. <br>\nA promising approach may be to explore reflection techniques in order to <br>\nproduce a verified and efficient proof certifier. On a more theoretical <br>\nlevel it will be interesting to investigate the trade-off between <br>\ngenerating a fully detailed proof, which is easy to check but large, and <br>\na more compact proof certificate that guides certification but requires <br>\nthe certifier to regenerate parts of the proof. For example, decision <br>\nprocedures for certain fragments of arithmetic are so efficient that it <br>\nwill certainly be preferable to let the certifier recreate a proof of <br>\nsub-formulas falling into such fragments. Little is known about the <br>\nproof sizes for first-order theories in general, and reconstruction of <br>\nsuch proofs from compact certificates.</p>\n<p>The research on proof representation and certification should be <br>\nvalidated by an implementation for combining veriT, and possibly Spass, <br>\nwith Isabelle and Coq. In this way, the added value of using an <br>\nintegrated verification tool can be measured, and practical experiences <br>\nwith the proposed proof format can be performed. Our main interest is in <br>\nthe verification of distributed algorithms, including TLA+ <br>\nspecifications of concurrent algorithms.</p>\n<p>The research directions mentioned above are indicative of our interests <br>\nin this field; the precise subjects of research will be determined <br>\njointly with the candidate. Part of this work will be carried out in <br>\ncontact with the Isabelle group in Munich, with our partners of the ANR <br>\nproject DECERT, the TLA+ prover project at the INRIA-MSR joint lab, and <br>\nwith other international research teams.</p>\n<p>The candidate must have experience in interactive and/or automatic <br>\ntheorem proving. He or she should be interested in combining <br>\nfoundational research on calculi and logics with hands-on <br>\nimplementation. The main languages of implementation are C and ML.</p>\n<p>Further details:</p>\n<p>Duration: 12 months<br>\nStarting date: Between 1 Oct 2009 and 31 Dec 2009<br>\nWorking place: INRIA Nancy &amp; LORIA, equipe Mosel</p>\n<p>The position is an INRIA-postdoc position and candidate must fulfill<br>\nthe formal requirements found at<br>\n<a href=\"http://www.inria.fr/travailler/opportunites/postdoc/postdoc.en.html\">http://www.inria.fr/travailler/opportunites/postdoc/postdoc.en.html</a>.<br>\nIn particular, the candidate should have defended a doctorate or Ph.D. <br>\nin May 2008 or later. If the Ph.D. is not defended at the application <br>\ndate, you should clearly point out the defense date and the composition <br>\nof thesis jury.</p>\n<p>Applications should be made via the above web site before June 30, 2009. <br>\n  Late applications may also be considered if the position is not filled.)</p>\n<p>Please contact Stephan Merz (<a href=\"mailto:Stephan.Merz@loria.fr\">Stephan.Merz@loria.fr</a>) and/or Pascal <br>\nFontaine (<a href=\"mailto:Pascal.Fontaine@loria.fr\">Pascal.Fontaine@loria.fr</a>) for details about the position.<br>\n<a href=\"/user_uploads/14278/pMFrScJMgiUrFYxblK8IaFzE/Stephan_Merz.vcf\">Stephan_Merz.vcf</a></p>",
        "id": 294074631,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660828377
    }
]