[
    {
        "content": "<p>From: AARON CRIGHTON &lt;<a href=\"mailto:crightoa@mcmaster.ca\">crightoa@mcmaster.ca</a>&gt;<br>\n---------- Forwarded message ---------<br>\nFrom: AARON CRIGHTON &lt;<a href=\"mailto:crightoa@mcmaster.ca\">crightoa@mcmaster.ca</a>&gt;<br>\nDate: Thu, May 30, 2019 at 7:15 PM<br>\nSubject: p-adic numbers and model theory in Isabelle<br>\nTo: &lt;<a href=\"mailto:cl-isabelle-users@lists.cam.ac.uk\">cl-isabelle-users@lists.cam.ac.uk</a>&gt;</p>\n<p>Hello everyone,</p>\n<p>I am working on a project this summer to formalize some basic results of<br>\np-adic model theory in Isabelle, and have some questions about the best way<br>\nto go about some aspects of it.</p>\n<p>As far as I can tell, it is not possible to define each p-adic field as a<br>\ntype in Isabelle, because of the dependence on the prime parameter p.<br>\nInstead we have opted to construct the p-adic integers using records, as an<br>\ninverse limit of finite rings in the HOL algebra library, and the p-adic<br>\nfield as the fraction field of the p-adic integers.</p>\n<p>Our eventual goal is to prove that the first-order theory of the p-adics in<br>\na certain first order language admits quantifier elimination, but before<br>\ndoing this we need to decide on a formalism for talking about first-order<br>\nlanguages and interpretations. I understand that one approach is to define<br>\na first-order language recursively as a datatype as is done for Presburger<br>\narithmetic here:</p>\n<p><a href=\"http://isabelle.in.tum.de/~nipkow/pubs/lpar05.pdf\">http://isabelle.in.tum.de/~nipkow/pubs/lpar05.pdf</a></p>\n<p>As of now, I'm not sure whether this approach, or defining a record and<br>\nlocale for general first-order languages and semantics in the style of the<br>\nHOL algebra library would be the best approach. My intuition is that the<br>\nlatter approach would make it easier to develop general facts about<br>\nfirst-order model theory, of which the p-adic example would be a special<br>\ncase, but perhaps this would also be possible when constructing languages<br>\nat the type level as well?</p>\n<p>I apologize if my questions aren't completely clear, and I'm happy to<br>\nprovide more information if that would make it easier to understand my<br>\nquestion.</p>\n<p>Best wishes,</p>\n<p>Aaron Crighton</p>",
        "id": 294756044,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661197535
    },
    {
        "content": "<p>From: José Manuel Rodriguez Caballero &lt;<a href=\"mailto:josephcmac@gmail.com\">josephcmac@gmail.com</a>&gt;<br>\nDear Aaron,<br>\n   You could also define the p-adic numbers as the completion of the rational numbers with respect to the topology of a non-Archimedean absolute value (Ostrowski's theorem).  The p-adic integers are just the ball of radius 1. This definition is independent of p. Indeed, for your project in model theory the number p is just a distraction: the non-Archimedean property of the norm is the essential feature. In this way, the analogy with real numbers is stronger.</p>\n<p>In my own research I am formalizing a functional analysis over the complex numbers, but it would be nice to generalize my results to a algebraic structures over an arbitrary topological field, in order to include the p-adic numbers, e.g., Hilbert snd Banach spaces over the p-adic numbers.</p>\n<p>It would be nice to develop a software in order to automatically generalize proofs in Isabelle in cases where the generalization is trivial: the user should only take care when the generalization is non-trivial.</p>\n<p>Kind Regards,<br>\nJosé M.<br>\n<a href=\"https://www.pc.ut.ee/en/jose-manuel-rodriguez-caballero\">https://www.pc.ut.ee/en/jose-manuel-rodriguez-caballero</a></p>\n<p>Sent from my iPhone</p>",
        "id": 294756077,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661197553
    },
    {
        "content": "<p>From: Manuel Eberl &lt;<a href=\"mailto:eberlm@in.tum.de\">eberlm@in.tum.de</a>&gt;<br>\nThat seems like a reasonable thing to do, although you may want to<br>\nconsider formalising a generalisation of this instead (e.g. formalising<br>\nlimits in general and maybe going to the more general setting of a<br>\nDiscrete Valuation Ring).</p>\n<p>By the way, Jeremy Sylvestre is also currently working on a<br>\nformalisation of p-adics. If I recall correctly, his idea was not to use<br>\nHOL-Algebra but to do it with types. He also wanted to construct the<br>\nring of adeles directly using Laurent series and then carve out p-adics<br>\nas needed. I didn't quite understand why he wants to do it that way, but<br>\nI don't know much about p-adic numbers.</p>\n<p>In any case, if one were not to use HOL-Algebra, it should be fairly<br>\nstraightforward to construct the type of p-adic numbers in Isabelle<br>\nusing a similar trick that John Harrison uses to encode n-dimensional<br>\nvectors (real ^ 'n) or that René Thiemann et al. used to encode finite<br>\nfields of prime characteristic p. One could define e.g. a type 'p adic,<br>\nwhere 'p is a finite type with \"p\" elements. The main issue with that is<br>\nthat /using/ this type becomes somewhat painful when the type parameter<br>\np is not fixed but depends on some term. It can be done using Isabelle's<br>\nTypes-to-Sets mechanism, and Thiemann et al. have done it.</p>\n<p>It's not entirely clear to me which way is better. I think I have a<br>\nslight preference for following the standard mathematical approach,<br>\nwhich is what you are planning to do – but, as I said, some things might<br>\nbe fairly easy to generalise, in which case I think they should be<br>\ngeneralised.</p>\n<p>Cheers,</p>\n<p>Manuel</p>",
        "id": 294757436,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661198136
    },
    {
        "content": "<p>From: \"Thiemann, René\" &lt;<a href=\"mailto:Rene.Thiemann@uibk.ac.at\">Rene.Thiemann@uibk.ac.at</a>&gt;<br>\nDear Aaron,</p>\n<p>as Manuel already indicated, we (Jose, Sebastiaan, Akihisa and myself) did some <br>\nformalization with algorithms in GF(p), both via types and via records. <br>\nIf you’re interested, just write me an email and I can give you access to an <br>\nupcoming journal paper where several details on the various formalizations of GF(p) <br>\nare described in detail.</p>\n<p>Cheers,<br>\nRené</p>",
        "id": 294758705,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661198572
    }
]