[
    {
        "content": "<p>From: Gerwin Klein &lt;<a href=\"mailto:gerwin.klein@nicta.com.au\">gerwin.klein@nicta.com.au</a>&gt;<br>\nWe are pleased to announce two new entires in the Archive of Formal Proofs <br>\n[http://afp.sf.net]:</p>\n<p>Benjamin Porter:<br>\nCauchy's Mean Theorem and the Cauchy-Schwarz Inequality <br>\n[http://afp.sf.net/entries/ClockSynchInst.shtml]</p>\n<p>Abstract:<br>\n This document presents the mechanised proofs of two popular theorems<br>\n attributed to Augustin Louis Cauchy - Cauchy's Mean Theorem and the<br>\n Cauchy-Schwarz Inequality. </p>\n<p>and</p>\n<p>Damián Barsotti: <br>\nInstances of Schneider's generalized protocol of clock synchronization.<br>\n[http://afp.sf.net/entries/ClockSynchInst.shtml]</p>\n<p>Abstract:<br>\n F. B. Schneider (\"Understanding protocols for Byzantine clock<br>\n synchronization'') generalizes a number of protocols for Byzantine<br>\n fault-tolerant clock synchronization and presents a uniform proof<br>\n for their correctness. In Schneider's schema, each processor<br>\n maintains a local clock by periodically adjusting each value to one<br>\n computed by a convergence function applied to the readings of all<br>\n the clocks. Then, correctness of an algorithm, i.e. that the<br>\n readings of two clocks at any time are within a fixed bound of each<br>\n other, is based upon some conditions on the convergence function. To<br>\n prove that a particular clock synchronization algorithm is correct<br>\n it suffices to show that the convergence function used by the<br>\n algorithm meets Schneider's conditions.<br>\n Using the theorem prover Isabelle, we formalize the proofs that the<br>\n convergence functions of two algorithms, namely, the Interactive<br>\n Convergence Algorithm (ICA) of Lamport and Melliar-Smith and the<br>\n Fault-tolerant Midpoint algorithm of Lundelius-Lynch , meet<br>\n Schneider's conditions.  Furthermore, we experiment on handling some<br>\n parts of the proofs with fully automatic tools like ICS and<br>\n CVC-lite.<br>\n These theories are part of a joint work with Alwen Tiu and Leonor<br>\n P. Nieto \"Verification of Clock Synchronization Algorithms:<br>\n Experiments on a combination of deductive tools'' in proceedings of<br>\n AVOCS 2005 (<a href=\"http://users.rsise.anu.edu.au/~tiu/clocksync.pdf\">http://users.rsise.anu.edu.au/~tiu/clocksync.pdf</a>). In this<br>\n work the  correctness of  Schneider schema was also verified using<br>\n Isabelle (available at <a href=\"http://afp.sourceforge.net/entries/GenClock.shtml\">http://afp.sourceforge.net/entries/GenClock.shtml</a>).</p>\n<p>Cheers,<br>\nGerwin</p>",
        "id": 293904962,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660745681
    },
    {
        "content": "<p>From: \"Klein, Gerwin (Data61, Kensington NSW)\" &lt;<a href=\"mailto:Gerwin.Klein@data61.csiro.au\">Gerwin.Klein@data61.csiro.au</a>&gt;<br>\nThere are two new AFP entries available by Andreas V. Hess, Sebastian Mödersheim and Achim D. Brucker</p>\n<p>Stateful Protocol Composition and Typing<br>\n<a href=\"https://www.isa-afp.org/entries/Stateful_Protocol_Composition_and_Typing.html\">https://www.isa-afp.org/entries/Stateful_Protocol_Composition_and_Typing.html</a></p>\n<p>We provide in this AFP entry several relative soundness results for security protocols. In particular, we prove typing and compositionality results for stateful protocols (i.e., protocols with mutable state that may span several sessions), and that focuses on reachability properties. Such results are useful to simplify protocol verification by reducing it to a simpler problem: Typing results give conditions under which it is safe to verify a protocol in a typed model where only \"well-typed\" attacks can occur whereas compositionality results allow us to verify a composed protocol by only verifying the component protocols in isolation. The conditions on the protocols under which the results hold are furthermore syntactic in nature allowing for full automation. The foundation presented here is used in another entry to provide fully automated and formalized security proofs of stateful protocols.</p>\n<p>Automated Stateful Protocol Verification<br>\n<a href=\"https://www.isa-afp.org/entries/Automated_Stateful_Protocol_Verification.html\">https://www.isa-afp.org/entries/Automated_Stateful_Protocol_Verification.html</a></p>\n<p>In protocol verification we observe a wide spectrum from fully automated methods to interactive theorem proving with proof assistants like Isabelle/HOL. In this AFP entry, we present a fully-automated approach for verifying stateful security protocols, i.e., protocols with mutable state that may span several sessions. The approach supports reachability goals like secrecy and authentication. We also include a simple user-friendly transaction-based protocol specification language that is embedded into Isabelle.</p>\n<p>Enjoy!<br>\nGerwin</p>",
        "id": 294829408,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661245917
    }
]