[
    {
        "content": "<p>From: <a href=\"mailto:serge.autexier@dfki.de\">serge.autexier@dfki.de</a><br>\nCICM 2014 - Conferences on Intelligent Computer Mathematics<br>\n      7-11 July 2014 at the University of Coimbra, Portugal<br>\n<a href=\"http://www.cicm-conference.org/2014\">http://www.cicm-conference.org/2014</a></p>\n<p>* * *  Announcement of Invited Speakers  * * * </p>\n<ul>\n<li>\n<ul>\n<li>\n<ul>\n<li>Call for Work-in-Progress Papers -- Deadline June 1 * * *</li>\n</ul>\n</li>\n</ul>\n</li>\n</ul>\n<hr>\n<p>As   computers   and   communications  technology   advance,   greater<br>\nopportunities arise  for intelligent mathematical  computation.  While<br>\ncomputer  algebra, automated  deduction,  mathematical publishing  and<br>\nnovel user interfaces individually have long and successful histories,<br>\nwe are  now seeing  increasing opportunities  for synergy  among these<br>\nareas.  CICM  2014 offers  a venue  to discuss  these areas  and their<br>\nsynergy.</p>\n<p>The conference will take place at the University of Coimbra, Portugal,<br>\nand consists of four tracks:</p>\n<ul>\n<li>\n<p>Calculemus, Chair: James Davenport</p>\n</li>\n<li>\n<p>Digital Mathematical Libraries (DML), Chair: Petr Sojka</p>\n</li>\n<li>\n<p>Mathematical Knowledge Management (MKM), Chair: Josef Urban</p>\n</li>\n<li>\n<p>Systems and Projects, Chair: Alan Sexton</p>\n</li>\n</ul>\n<p>As  in previous  years, there  will be  a Doctoral  Programme for  the<br>\nmentoring of Doctoral students and several co-located workshops.</p>\n<ul>\n<li>MathUI 2014: Mathematical User Interfaces</li>\n<li>OpenMath Workshop 2014</li>\n<li>The Notion of Proof 2014</li>\n<li>ThEdu 2014: TP Components for Educational Software</li>\n<li>Doctoral Programme</li>\n</ul>\n<p>All of these are now accepting contributions.  Please see the web site<br>\nfor their calls for submissions.</p>\n<p>The  overall  programme is  organised  by  the General  Program  Chair<br>\nStephen Watt.</p>\n<hr>\n<p>CICM Invited Talks</p>\n<hr>\n<ul>\n<li>\n<p>Yves Bertot, INRIA<br>\n  A naive view of homotopy type theory and its relation to <br>\n  the calculus of constructions </p>\n</li>\n<li>\n<p>Jaime Carvalho e Silva, U Coimbra<br>\n  What international studies say about the importance and limitations<br>\n  of using computers to teach mathematics in secondary schools</p>\n</li>\n<li>\n<p>Antonio Leal Duarte, U Coimbra [Joint Speaker with ADG 2014]<br>\n  Teaching Tiles</p>\n</li>\n<li>\n<p>Herbert Van de Sompel, Los Alamos Natioanl Laboratory<br>\n  Towards robust hyperlinks for web-based scholarly communication   </p>\n</li>\n<li>\n<p>Eric Weisstein, Wolfram|Alpha<br>\n  Computable data, mathematics, and digital libraries <br>\n  in Mathematica and Wolfram|Alpha</p>\n</li>\n</ul>\n<hr>\n<p>Work-in-Progress Call-for-Papers</p>\n<hr>\n<p>Work-in-progress submissions are  intended to provide a  forum for the<br>\npresentation of original work that is not (yet) in a suitable form for<br>\nsubmission as a  full or system description paper.  This includes work<br>\nin progress  and emerging trends.   Papers may  be on any  CICM topic,<br>\nincluding those from Calculemus, DML, MKM and Systems and Projects.</p>\n<p>Accepted work-in-progress  papers will be presented  at the conference<br>\nas  short   teaser  talks   and  as  posters.    The  work-in-progress<br>\nproceedings  will   be  published  digitally  in   the  CEUR  Workshop<br>\nProceedings series (<a href=\"http://CEUR-WS.org\">CEUR-WS.org</a>).</p>\n<p>WiP  papers  should  be  prepared in  LaTeX  and  formatted  according<br>\nSpringer's  LNCS   series  (the  corresponding  style   files  can  be<br>\ndownloaded     from    <a href=\"http://www.springer.de/comp/lncs/authors.html\">http://www.springer.de/comp/lncs/authors.html</a>).<br>\nPapers should be between 5 and 10 pages in length.</p>\n<p>By submitting  a paper  the authors  agree that if  it is  accepted at<br>\nleast one of the authors will attend the conference to present it.</p>\n<hr>\n<p>Work-in-Progress Submission Particulars</p>\n<hr>\n<p>WiP paper submission deadline        :    1 June 2014<br>\nWiP paper notification of acceptance :   15 June 2014<br>\nWiP Camera ready copies due          :   20 June 2014<br>\nConference                           : 7-11 July 2014</p>\n<p>Electronic submission is done through Easychair at</p>\n<p><a href=\"https://www.easychair.org/conferences/?conf=cicm2014wip\">https://www.easychair.org/conferences/?conf=cicm2014wip</a></p>\n<p>Note that this is different from the main CICM submission page.</p>\n<p>==========<br>\nCalculemus<br>\n==========</p>\n<p>Calculemus   2014  invites   the  submission   of  original   research<br>\ncontributions to be considered for publication and presentation at the<br>\nconference. Calculemus  is a  series of  conferences dedicated  to the<br>\nintegration  of  computer  algebra   systems  (CAS)  and  systems  for<br>\nmechanised  reasoning  like  interactive   proof  assistants  (PA)  or<br>\nautomated theorem  provers (ATP).  Currently, symbolic  computation is<br>\ndivided into several (more  or less) independent branches: traditional<br>\nones  (e.g., computer  algebra and  mechanised reasoning)  as well  as<br>\nnewly emerging ones (on  user interfaces, knowledge management, theory<br>\nexploration, etc.) The main concern  of the Calculemus community is to<br>\nbring these developments  together in order to  facilitate the theory,<br>\ndesign,  and  implementation   of  integrated  mathematical  assistant<br>\nsystems  that  will  be  used routinely  by  mathematicians,  computer<br>\nscientists and  all others who need  computer-supported mathematics in<br>\ntheir every day business.</p>\n<p>All  topics  in  the  intersection of  computer  algebra  systems  and<br>\nautomated  reasoning systems  are  of interest  for Calculemus.  These<br>\ninclude but are not limited to:</p>\n<ul>\n<li>Automated theorem proving in computer algebra systems.</li>\n<li>Computer algebra in theorem proving systems.</li>\n<li>Adding reasoning capabilities to computer algebra systems.</li>\n<li>Adding computational capabilities to theorem proving systems.</li>\n<li>\n<p>Theory, design and implementation of interdisciplinary systems for<br>\n  computer mathematics.</p>\n</li>\n<li>\n<p>Case studies and applications that involve a mix of computation and<br>\n  reasoning.</p>\n</li>\n<li>\n<p>Case studies in formalization of mathematical theories.</p>\n</li>\n<li>Representation of mathematics in computer algebra systems.</li>\n<li>Theory exploration techniques.</li>\n<li>Combining methods of symbolic computation and formal deduction.</li>\n<li>\n<p>Input languages, programming languages, types and constraint languages,<br>\n  and modeling languages for mathematical assistant systems.</p>\n</li>\n<li>\n<p>Homotopy type theory.</p>\n</li>\n<li>Infrastructure for mathematical services.</li>\n</ul>\n<p>===<br>\nDML<br>\n===</p>\n<p>Mathematicians dream of a digital archive containing all peer-reviewed<br>\nmathematical literature ever published, properly linked, validated and<br>\nverified.   It is  estimated that  the entire  corpus of  mathematical<br>\nknowledge  published over  the centuries  does not  exceed 100,000,000<br>\npages,   an   amount   easily  manageable   by   current   information<br>\ntechnologies.</p>\n<p>Track objective  is to provide  a forum for development  of math-aware<br>\ntechnologies, standards, algorithms and formats towards fulfillment of<br>\nthe  dream  of global  digital  mathematical  library (DML).  Computer<br>\nscientists  (D)  and librarians  of  digital  age (L)  are  especially<br>\nwelcome to  join mathematicians  (M) and discuss  many aspects  of DML<br>\npreparation.</p>\n<p>Track topics are  all topics of mathematical  knowledge management and<br>\ndigital  libraries  applicable  in  the context  of  DML  building  --<br>\nprocessing of math knowledge expressed in scientific papers in natural<br>\nlanguages, namely:</p>\n<ul>\n<li>Math-aware text mining (math mining) and MSC classification</li>\n<li>Math-aware representations of mathematical knowledge</li>\n<li>Math-aware computational linguistics and corpora</li>\n<li>Math-aware tools for [meta]data and fulltext processing</li>\n<li>Math-aware OCR and document analysis</li>\n<li>Math-aware information retrieval</li>\n<li>Math-aware indexing and search</li>\n<li>Authoring languages and tools</li>\n<li>MathML, OpenMath, TeX and other mathematical content standards</li>\n<li>Web interfaces for DML content</li>\n<li>Mathematics on the web, math crawling and indexing</li>\n<li>Math-aware document processing workflows </li>\n<li>Archives of written mathematics</li>\n<li>DML management, business models</li>\n<li>DML rights handling, funding, sustainability </li>\n<li>DML content acquisition, validation and curation </li>\n</ul>\n<p>===<br>\nMKM<br>\n===</p>\n<p>Mathematical  Knowledge Management  is an  interdisciplinary field  of<br>\nresearch in the intersection of mathematics, computer science, library<br>\nscience, and scientific publishing. The objective of MKM is to develop<br>\nnew and better ways  of managing sophisticated mathematical knowledge,<br>\nbased on innovative technology of  computer science, the Internet, and<br>\nintelligent   knowledge  processing.   MKM   is   expected  to   serve<br>\nmathematicians,  scientists,   and  engineers  who  produce   and  use<br>\nmathematical  knowledge; educators  and students  who teach  and learn<br>\nmathematics;   publishers  who   offer   mathematical  textbooks   and<br>\ndisseminate   new    mathematical   results;   and    librarians   and<br>\nmathematicians who catalog and organize mathematical knowledge.</p>\n<p>The conference is concerned with all aspects of mathematical knowledge<br>\nmanagement. A non-exclusive list of important topics includes:</p>\n<ul>\n<li>Representations of mathematical knowledge</li>\n<li>Authoring languages and tools</li>\n<li>Repositories of formalized mathematics</li>\n<li>Deduction systems</li>\n<li>Mathematical digital libraries</li>\n<li>Diagrammatic representations</li>\n<li>Mathematical OCR</li>\n<li>Mathematical search and retrieval</li>\n<li>Math assistants, tutoring and assessment systems</li>\n<li>MathML, OpenMath, and other mathematical content standards</li>\n<li>Web presentation of mathematics</li>\n<li>Data mining, discovery, theory exploration</li>\n<li>Computer algebra systems</li>\n<li>Collaboration tools for mathematics</li>\n<li>Challenges and solutions for mathematical workflows</li>\n</ul>\n<p>====================<br>\nSystems and Projects<br>\n====================</p>\n<p>The  Systems and  Projects  track of  the  Conferences on  Intelligent<br>\nComputer Mathematics is  a forum for presenting  available systems and<br>\nnew and ongoing  projects in all areas and topics  related to the CICM<br>\nconferences:</p>\n<ul>\n<li>Deduction and Computer Algebra (Calculemus)</li>\n<li>Digital Mathematical Libraries (DML)</li>\n<li>Mathematical Knowledge Management (MKM)</li>\n</ul>\n<p>The track aims  to provide an overview of the  latest developm<br>\n[message truncated]</p>",
        "id": 294278267,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660919493
    }
]