[
    {
        "content": "<p>From: Cezary Kaliszyk &lt;<a href=\"mailto:cezarykaliszyk@gmail.com\">cezarykaliszyk@gmail.com</a>&gt;<br>\nDear all,</p>\n<p>Is it possible to redefine the outer-syntax keyword \"theorem\"<br>\nor hook into it?</p>\n<p>I am in the process of defining a new object logic. There,<br>\nI would like the keyword \"theorem\" to analyze the user-given<br>\nstatement, and add assumptions to it.</p>\n<p>I have so far been working with a different outer-syntax keyword<br>\n(\"mytheorem\"), but I wonder if it would also be possible to use the<br>\nexisting<br>\nkeywords \"theorem\", \"lemma\" etc.</p>\n<p>Regards,</p>\n<p>Cezary</p>",
        "id": 294657941,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661168822
    },
    {
        "content": "<p>From: Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt;<br>\nOn Tue, 20 Oct 2015, Cezary Kaliszyk wrote:</p>\n<blockquote>\n<p>Is it possible to redefine the outer-syntax keyword \"theorem\"<br>\nor hook into it?</p>\n</blockquote>\n<p>Not any more.  See this NEWS item in Isabelle2015:</p>\n<ul>\n<li>Outer syntax commands are managed authentically within the theory<br>\ncontext, without implicit global state. Potential for accidental<br>\nINCOMPATIBILITY, make sure that required theories are really imported.</li>\n</ul>\n<p>The keyword \"authentic\" is Isabelle jargon.  It means, formal entities are <br>\nreally what they are, and cannot be redefined dynamically in a later <br>\ncontext by re-using an existing name.</p>\n<p>It has required many years to get there -- the command table was one of <br>\nthe last hold-outs of non-authentic things, more like a LISP toplevel than <br>\nsomething derived from ML.  The change means it is now as serious, as e.g. <br>\nthe consts table or the fact table.  (It is hard to believe today that the <br>\nfact name space was non-authentic until 2007).</p>\n<p>Whenever we made such steps towards a more serious formal environment, <br>\nthere was a lot of resistance, especially from power-users who found it <br>\nuseful to do odd things when nobody was looking.  And every time the <br>\ntightening of the system revealed embarassing situations in some <br>\napplications.</p>\n<blockquote>\n<p>I am in the process of defining a new object logic. There, I would like <br>\nthe keyword \"theorem\" to analyze the user-given statement, and add <br>\nassumptions to it.</p>\n</blockquote>\n<p>There is nothing special about the keyword \"theorem\", it just happens to <br>\nbe a predefined specification element in Isabelle/Pure. It should be <br>\npossible to invent another name for another concept, and evade that.</p>\n<p>Even better, one could think about general ways to augment statements by <br>\nadditional context material, then it would work everywhere where \"prop\" <br>\nentities may occur, not just a few commands that are somehow \"patched\".</p>\n<p>E.g. you could try to put this into Trueprop-like syntax tricks.</p>\n<p>Makarius</p>",
        "id": 294658069,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661168867
    }
]