[
    {
        "content": "<p>From: Mikhail Chekhov &lt;<a href=\"mailto:mikhail.chekhov.w@gmail.com\">mikhail.chekhov.w@gmail.com</a>&gt;<br>\nDear All,</p>\n<p>I am still a relatively new user of Isabelle and this is the first time I<br>\nam going through the process of adapting any remotely serious previous work<br>\nto the new release. I have a question with regard to how the changes are<br>\ndocumented in the NEWS.</p>\n<p>Do all undocumented (in the NEWS) changes in the Isabelle/ML infrastructure<br>\ncorrespond exclusively either to the</p>\n<p>- improvement of the efficiency<br>\n   - changes to the structure and naming conventions of the public interface<br>\n   - introduction of the new functionality/features<br>\n   - withdrawal of components from the public interface</p>\n<p>?</p>\n<hr>\n<p>Background</p>\n<p>I noticed that there has been a substantial number of changes to the<br>\nIsabelle/ML infrastructure between Isabelle2019 and Isabelle2020 release<br>\ncandidates. I would like to understand whether or not there is any<br>\ncriterion for when a change needs to be documented in the NEWS and when it<br>\ndoes not need to be documented. In my previous post (<br>\n<a href=\"https://lists.cam.ac.uk/pipermail/cl-isabelle-users/2020-April/msg00027.html\">https://lists.cam.ac.uk/pipermail/cl-isabelle-users/2020-April/msg00027.html</a>)<br>\nI commented on a NEWS entry that was concerned with a change in one<br>\nparticular Isabelle/ML function. However, having analyzed changes more<br>\nthoroughly, I realized that this entry was concerned only with one out of a<br>\nsubstantial number of Isabelle/ML functions that were moved and/or renamed<br>\nand/or changed in some other way. However, none of these changes seem to<br>\nhave been documented in the NEWS.</p>\n<p>Some examples of such seemingly undocumented (in the NEWS) changes include:</p>\n<p>- Facts.name_of_ref =&gt; Facts.ref_name<br>\n   - Thm.name_derivation: string -&gt; thm -&gt; thm  =&gt; Thm.name_derivation:<br>\n   string * Position.T -&gt; thm -&gt; thm</p>\n<p>- Drule.RNS =&gt; Basic_Thm.RSN<br>\n   - ...</p>\n<p>Of course, in most cases, it is sufficiently easy to trace these changes<br>\nand adapt your own work to them. My primary concern is how much should one<br>\nrely on the NEWS when adapting to the changes? For example, is it<br>\nanticipated that if I rely on an invariant established based on the<br>\nanalysis of the implementation of an Isabelle/ML function (e.g. thm-&gt;thm)<br>\nin Isabelle2019, then this invariant will still hold in Isabelle2020,<br>\nprovided that my analysis is correct and nothing is mentioned about this<br>\nfunction in the NEWS?</p>\n<p>Kind Regards,<br>\nMikhail Chekhov</p>",
        "id": 294826699,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661244785
    },
    {
        "content": "<p>From: Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt;<br>\nThe NEWS file says \"history of user-relevant changes\". Things that are missing<br>\nare either not relevant to general users of Isabelle/ML or somehow irrelevant<br>\n(trivial).</p>\n<p>A change in the signature (without change of meaning) is rarely documented:<br>\nthe ML compiler will tell you about the change and you can make it happy on<br>\nthe spot, e.g. Thm.name_derivation above.</p>\n<p>A change in the semantics will never happen without a change in the signature.<br>\nUsually it will get a new name, and if relevant a notice in NEWS.</p>\n<p>Sometimes changes rolling over your applications merely indicate odd uses of<br>\ninternal names. E.g. Basic_Thm.RSN is nothing you would ever write in user<br>\nspace. The standard name is just \"RSN\" (infix) or \"op RSN\" (prefix) and that<br>\ndid not change.</p>\n<p>Makarius</p>",
        "id": 294826793,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661244822
    }
]