[
    {
        "content": "<p>From: mailing-list anonymous &lt;<a href=\"mailto:mailing.list.anonymous@gmail.com\">mailing.list.anonymous@gmail.com</a>&gt;<br>\nDear All,</p>\n<p>I would like to understand if it would be feasible for me to propose my own<br>\ncontributions to HOL. I have read the section \"Publish contributions as an<br>\nexternal\" on the Isabelle community wiki (<br>\n<a href=\"https://isabelle.in.tum.de/community/Publish_contributions_as_an_external\">https://isabelle.in.tum.de/community/Publish_contributions_as_an_external</a>).<br>\nI am also aware of the mailing list <a href=\"mailto:isabelle-dev@in.tum.de\">isabelle-dev@in.tum.de</a>. However, this<br>\nis a general question about the possibility of a contribution being<br>\nconsidered, given certain specific circumstances. Thus, I believe that it<br>\nmay be more useful to this mailing list, rather than <a href=\"mailto:isabelle-dev@in.tum.de\">isabelle-dev@in.tum.de</a>.<br>\nOtherwise, of course, please suggest to forward it to <a href=\"mailto:isabelle-dev@in.tum.de\">isabelle-dev@in.tum.de</a><br>\n.</p>\n<p>My primary concern is that I am not affiliated with an academic group or a<br>\ncompany that works with Isabelle/HOL on a regular basis. I have an<br>\nimpression that all of the existing contributions to HOL were made by<br>\npeople who are, somehow, officially affiliated with the Isabelle community.<br>\nThus, I would like to assess whether or not my contributions would be<br>\nconsidered on this basis. Of course, I am also aware of the existence of<br>\nthe AFP. However, I believe, some of the theorems that I would like to<br>\npropose naturally extend some of the theories that are already available in<br>\nHOL and, most likely, are not suitable to be published as an independent<br>\nAFP library.</p>\n<p>To be more specific, I would like to provide several examples of the<br>\ncontributions that I would like to propose.  At the moment, HOL-Algebra<br>\ncontains the theory IntRing.thy that contains the lemmas \"ZFact_zero:<br>\n\"carrier (ZFact 0) = (⋃a. {{a}})\"\" and \"ZFact_one: \"carrier (ZFact 1) =<br>\n{UNIV}\"\". However, it does not seem to contain a lemma that could describe<br>\nthe carrier of a more general quotient ring \"ZFact (m::int)\" (e.g. \"0 &lt; m<br>\n⟹ carrier (ZFact m) = {X. ∃n ∈ {0..&lt;m}. X = {x. m dvd (x - n)}}\"). Also, I<br>\nwas not able to find a relatively standard textbook theorem that<br>\ncharacterises a cyclic group in terms of the quotient group \"add_monoid<br>\n(ZFact m)\" (e.g. \"finite (carrier G) ⟹ order G = m ⟹ ∃a ∈ carrier G.<br>\ncarrier G = {a[^]i | i::int. i ∈ UNIV} ⟹ add_monoid (ZFact m) ≅ G\"). Some<br>\nof the potential contributions are not independent theorems, but minor<br>\nextensions of the existing lemmas in \"HOL\", e.g. lemma \"ord_dvd_pow_eq_1\"<br>\nin \"Algebra-Multiplicative_Group\" shows that  \"finite (carrier G)\", \"a ∈<br>\ncarrier G\" and \"a [^] k = 𝟭\" together imply \"ord a dvd k\", where \"k\" is of<br>\nthe type \"nat\". However, this lemma holds even if \"k\" is any number of the<br>\ntype \"int\" (the existing proof would need to be amended to take into<br>\naccount the negative values of k).</p>\n<p>Thank you</p>\n<p>(I would prefer not to disclose my contact details publicly for the reasons<br>\nof privacy and as a measure against spam)</p>",
        "id": 294746209,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661193550
    },
    {
        "content": "<p>From: José Manuel Rodriguez Caballero &lt;<a href=\"mailto:josephcmac@gmail.com\">josephcmac@gmail.com</a>&gt;</p>\n<blockquote>\n<p>\"mailing-list anonymous\" wrote:<br>\nI would like to understand if it would be feasible for me to propose my own<br>\ncontributions to HOL.</p>\n</blockquote>\n<p>If some of your results are related to number theory, you could include<br>\nyour contributions in my project of a library \"number theory miscellany\".<br>\nHere is my repository :<br>\n<a href=\"https://github.com/josephcmac/Folklore-and-miscellaneous-results-in-number-theory\">https://github.com/josephcmac/Folklore-and-miscellaneous-results-in-number-theory</a></p>\n<p>But, you should include in the file either your name or a pseudonym, in<br>\norder to distinguish your contributions from my contributions. Maybe you<br>\nprefer your own miscellany, e.g., \"general miscellany\", \"topology<br>\nmiscellany\", etc. In my case, my main motivation to contribute, beside the<br>\npleasure of proving some truth, is to increase my CV, because some<br>\nreviewers of important journals, e.g., American Mathematical Monthly, said<br>\nto me that my proofs are too long to be checked and that they are annoying<br>\nfor the readers (someone is confusing mathematics with comic strips). I am<br>\nsuccessfully proving the theorems from my Master Memoir in Isabelle one by<br>\none (work-in-progress). My first version is rather non-algorithmic, but I<br>\nhave the project to include an algorithmic version in order to do explicit<br>\ncomputations.</p>\n<p>\"mailing-list anonymous\" wrote:</p>\n<blockquote>\n<p>My primary concern is that I am not affiliated with an academic group or a<br>\ncompany that works with Isabelle/HOL on a regular basis. I have an<br>\nimpression that all of the existing contributions to HOL were made by<br>\npeople who are, somehow, officially affiliated with the Isabelle community.</p>\n</blockquote>\n<p>Me neither, nevertheless, the Isabelle community, at least in my case, was<br>\nthe most open research community that I have ever met. Other research<br>\ncommunities, like the communities of pure mathematics, are rather closed<br>\nand mathematicians in general do not read the works of outsiders (they have<br>\nnot time for that), e.g., the old Gauss did not read the work of the young<br>\nAbel, because he assumed that it was wrong, the old Cauchy did not read the<br>\nwork of the young Galois, etc. Proof assistants are the key for an outsider<br>\nto become an insider, because the computer guarantee  that the result is<br>\nfine, even if the proof is very complex. Nevertheless, I advice you to<br>\nbecome part of something and to change when you will be ready: the academic<br>\ngrowth is step by step.</p>\n<p>Kind Regards,<br>\nJosé M.</p>",
        "id": 294746220,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661193557
    },
    {
        "content": "<p>From: Paulo Emílio de Vilhena &lt;<a href=\"mailto:pevilhena2@gmail.com\">pevilhena2@gmail.com</a>&gt;<br>\nHello,</p>\n<p>I’m not answering your question, but since you are working on HOL-Algebra I<br>\nwould like to point out a github repository where we propose not only to<br>\nextend this library with new theories but also to revise old ones. For<br>\ninstance, we already have one of the mentioned theorems you were looking<br>\nfor: it is the lemma mod_ring from the theory Int_Ring (note the underline)<br>\nstated as</p>\n<p>lemma (in int_ring) mod_ring:</p>\n<p>assumes \"a ∈ carrier R - { 𝟬 }\"</p>\n<p>shows \"carrier (R Quot (PIdl a)) = (λi. PIdl a +&gt; ⟦ i ⟧) ` {0..&lt; ¦<br>\nint_repr a ¦}\"</p>\n<p>It’s overly complicated for now, because it’s stated for all rings<br>\nisomorphic to the ring of integers, but you can easily instantiate it for<br>\nZ. We also have a theory called Multiplicative_Group_Revised where I<br>\nstarted an analogous development of Multiplicative_Group but more concise<br>\nsince it reuses previous developments from cycles and permutations.</p>\n<p>Other than that, there are theories on algebraic numbers, field extensions<br>\nand division of polynomials. Our most impressive result is the existence of<br>\nthe algebraic closure of a field. Here is the link for the repository in<br>\ncase you want to check it out: <a href=\"https://github.com/DeVilhena-Paulo/GaloisCVC4\">https://github.com/DeVilhena-Paulo/GaloisCVC4</a></p>\n<p>Thanks,</p>\n<p>Paulo.</p>\n<p>Message: 5</p>",
        "id": 294746228,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661193562
    },
    {
        "content": "<p>From: Tobias Nipkow &lt;<a href=\"mailto:nipkow@in.tum.de\">nipkow@in.tum.de</a>&gt;<br>\nYou do not have to be affiliated with anybody to contribute to Isabelle/HOL <br>\ntheories but there is no well-established process for contributing. For small <br>\namendments you can either send them to this mailing list or contact individuals, <br>\nlike the web page says that you found.</p>\n<p>Larger contributions require more interaction with people who feel responsible <br>\nfor some area. In the case of Algebra, Paulo has already indicated that there <br>\nare parellel developments that you may be able to liaise with.</p>\n<p>Tobias<br>\n<a href=\"/user_uploads/14278/AnplYKY5evOTyq_rO2QarfZ2/smime.p7s\">smime.p7s</a></p>",
        "id": 294746249,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661193575
    },
    {
        "content": "<p>From: mailing-list anonymous &lt;<a href=\"mailto:mailing.list.anonymous@gmail.com\">mailing.list.anonymous@gmail.com</a>&gt;<br>\nDear All,</p>\n<p>In what follows, I address everyone who replied to my email (not in any<br>\nparticular order).</p>\n<p>To Tobias Nipkow,</p>\n<p>Thank you for your reply. I am glad that it is potentially possible for me<br>\nto make contributions to HOL. However, of course, given that potentially<br>\nanyone can make a contribution, it would be nice if there was a<br>\nwell-established process for making contributions.</p>\n<p>To Paulo Emílio de Vilhena,</p>\n<p>Thank you for your response and for providing the link to the repository<br>\nGaloisCVC4. I have several questions about the repository:</p>\n<ol>\n<li>\n<p>I would like to confirm that, while the main purpose of the project<br>\nGaloisCVC4 is the development of Galois Theory in the context of<br>\nHOL-Algebra, you are also making changes to HOL-Algebra that are not<br>\ndirectly related to the main line of the development of the project<br>\nGaloisCVC4, i.e. you may consider adding to the repository any established<br>\nresults from algebra or making minor amendments/extensions of the existing<br>\ntheorems that do not contribute to the main line of the development.</p>\n</li>\n<li>\n<p>Furthermore, I would like to understand if your intention is to<br>\nintegrate GaloisCVC4 with HOL-Algebra or publish it in the context of the<br>\nAFP.</p>\n</li>\n<li>\n<p>Also, I would like to understand if you intend to discontinue the work<br>\non the project after a certain deadline or after you achieve certain<br>\nmilestones.</p>\n</li>\n<li>\n<p>If my understanding of the dual purpose (see clause 1) of the project<br>\nGaloisCVC4 is correct, would you, potentially, accept pull requests from<br>\nexternal contributors?</p>\n</li>\n</ol>\n<p>Also, thank you for pointing out the existence of the (Isabelle)<br>\ngeneralisation of the proof of the characterisation of the carrier of Z/mZ.<br>\nI only wish I knew about the existence of GaloisCVC4 earlier.</p>\n<p>To José Manuel Rodriguez Caballero,</p>\n<p>Thank you for your reply and for providing the link to your repository. It<br>\nis good to know about the existence of this repository because it seems<br>\nthat there is no mention of it in the AFP at the moment (although I cannot<br>\nbe entirely certain). The lemmas that I have mentioned in my question may<br>\nfit within the context of the repository. However, they are also very<br>\nclosely related to the existing Isabelle theories within HOL-Algebra, as<br>\nconfirmed by Paulo Emílio de Vilhena, who has already proven a<br>\ngeneralisation of one of the theorems that I mentioned in my question in<br>\nthe context of an ongoing development of HOL-Algebra (unfortunately, I was<br>\nnot aware of this development before asking the question). Regardless, if<br>\npossible, I would appreciate if you could reconfirm that potentially you<br>\ncould accept pull requests from external contributors. Nevertheless, I have<br>\nto admit, that it is unlikely that I will produce any further proofs of<br>\nresults that are related to number theory in the near future.</p>\n<p>With regard to non-technical part of your answer, previously, I used a<br>\npseudonym xanonec on this mailing list. I also use it on Stack Overflow.<br>\nHowever, it seems that mailing-list-anonymous is slightly more<br>\n'professional' in some sense. Also, I am only trying to hide my real<br>\ncontact details/identity from third parties (especially spam lists/online<br>\nscam/etc). There is a good reason why there is a variety of privacy<br>\nsettings available on the websites like LinkedIn and Facebook and it is<br>\npossible to control who can see your posts/profile/personal information.<br>\nHowever, unfortunately, mailing lists do not provide such options and,<br>\nfurthermore, all posts can be found via Google. In general, I prefer the<br>\nwebsite Stack Overflow to mailing lists. However, it seems that Isabelle<br>\ncommunity is not very active on Stack Overflow, because some of the<br>\nquestions that I tried to ask there were left without a reply/comments for<br>\ndays. Nevertheless, I was able to obtain a reply to the same questions<br>\nusing this mailing list within hours.</p>\n<p>Thank you</p>",
        "id": 294746279,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661193587
    },
    {
        "content": "<p>From: Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt;<br>\nSee README_REPOSITORY. In particular:</p>\n<p>\"\"\"<br>\nContent discipline</p>\n<hr>\n<p>The following principles should be kept in mind when producing<br>\nchangesets that are meant to be published at some point.</p>\n<p>* The author of changes needs to be properly identified, using<br>\n    [ui]username configuration as described above.</p>\n<p>While Mercurial also provides means for signed changesets, we want<br>\n    to keep things simple and trust that users specify their identity<br>\n    correctly (and uniquely).<br>\n\"\"\"</p>\n<p>It means you need to disclose your real name when submitting changesets.<br>\n(This is not Wikipedia where anonymous entities are allowed to do<br>\nstrange things in the dark.)</p>\n<p>Moreover it should be clear that any contribution is subject to the<br>\nexisting BSD-style license scheme of the Isabelle sources: without<br>\namendments nor exceptions.</p>\n<p>Makarius</p>",
        "id": 294746366,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661193611
    },
    {
        "content": "<p>From: José Manuel Rodriguez Caballero &lt;<a href=\"mailto:josephcmac@gmail.com\">josephcmac@gmail.com</a>&gt;</p>\n<blockquote>\n<p>mailing-list anonymous:<br>\nRegardless, if<br>\npossible, I would appreciate if you could reconfirm that potentially you<br>\ncould accept pull requests from external contributors.</p>\n</blockquote>\n<p>Sure, everybody is welcome to contribute to the miscellany in number theory<br>\n(I am myself external). Also, if another person want to create another<br>\nproject about miscellany, e.g., miscellany in topology, I will be glad to<br>\ncontribute. I think that the best way to contribute is to make some link in<br>\ngithub. I have not experience about using github (maybe you have more<br>\nexperience than myself in this topic). My official formation was in pure<br>\nmathematics, the computer sciences that I am doing is self-taught.</p>\n<p>mailing-list anonymous:</p>\n<blockquote>\n<p>It is good to know about the existence of this repository because it seems<br>\nthat there is no mention of it in the AFP at the moment (although I cannot<br>\nbe entirely certain)</p>\n</blockquote>\n<p>I have the project to submit my results to AFP in the future, after proving<br>\nALL the theorems from my Master Memoir. These theorems were new in the<br>\nliterature, here is the video-abstract of my last publication (my goal is<br>\nto formalize everything until this level):<br>\n<a href=\"https://www.youtube.com/watch?v=Ms9lrm4wLDQ\">https://www.youtube.com/watch?v=Ms9lrm4wLDQ</a></p>\n<div class=\"youtube-video message_inline_image\"><a data-id=\"Ms9lrm4wLDQ\" href=\"https://www.youtube.com/watch?v=Ms9lrm4wLDQ\"><img src=\"https://uploads.zulipusercontent.net/16e7d664ba2eaa3ed07599e36f3de94569654dda/68747470733a2f2f692e7974696d672e636f6d2f76692f4d73396c726d34774c44512f64656661756c742e6a7067\"></a></div><p>I have not problem to include other peoples as coauthors, because this is<br>\nthe spirit of miscellany. I do not say that my theory is miscellany, what I<br>\nsay is that my theory is so powerful that it can be used in order to prove<br>\nmiscellany results in number theory, e.g., unexpected connections between<br>\nthe semi-perimeter of a Pythagorean triangle and 2-densely divisible<br>\nnumbers.</p>\n<p>mailing-list anonymous:</p>\n<blockquote>\n<p>With regard to non-technical part of your answer, previously, I used a<br>\npseudonym xanonec on this mailing list.</p>\n</blockquote>\n<p>Ok, you could write in your Isabelle file \"xanonec\" or just your name if<br>\nyou want to be recognized. If your write \"mailing-list anonymous\" in your<br>\nIsabelle file, people evidently will think that there was a mistake of<br>\ncopy-paste. Also, the problem of calling yourself \"anonymous\" is that<br>\nanother person can call himself/herself \"anonymous\" too: it is like the guy<br>\ncalled \"Anonymous\" to whom many quotations are attributed. The name is just<br>\na mask, so being anonymous is to put your mask out.</p>\n<p>Kind Regards,<br>\nJosé M.</p>",
        "id": 294746384,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661193618
    },
    {
        "content": "<p>From: Paulo Emílio de Vilhena &lt;<a href=\"mailto:pevilhena2@gmail.com\">pevilhena2@gmail.com</a>&gt;<br>\nHi,</p>\n<p>1.</p>\n<p>You are right about this. While my goal was the development of Galois<br>\n   Theory, the project was actually born as an attempt from me and Martin<br>\n   Baillon to reduce the amount of changes to HOL-Algebra we were both making<br>\n   independently.<br>\n   2.</p>\n<p>The idea is to integrate the material which could be considerate as<br>\n   fundamental to any development in algebra and publish in the context of the<br>\n   AFP more specific material. We already have a big part of our material in<br>\n   the library and recent releases of Isabelle will come with some of my<br>\n   revised theories and sophisticated tricks such as Weak_Morphisms.thy.<br>\n   3.</p>\n<p>The project was the subject of an internship in the ALEXANDRIA team,<br>\n   supervised by Larry Paulson. The internship is already over and it is not<br>\n   being trivial to find time to work on the project, but I do intend to<br>\n   continue. The Galois correspondence theorem is certainly a milestone, but<br>\n   there is a lot of work to be done on the library itself. I think it’s<br>\n   preferable to progress horizontally in a proper way than to quickly prove<br>\n   profound statements in a formalism that nobody will be able to use.<br>\n   4.</p>\n<p>Contributions are welcome :) I’m quite jealous with my theories and<br>\n   proofs, I must say, but if you have well-founded contributions to make, I<br>\n   will probably accept. By well-founded I mean that it should have at least a<br>\n   minimal explanation on why such a modification would make sense. For the<br>\n   moment, there are two theories in need of revision/development that may<br>\n   interest you: Int_Ring.thy and Multiplicative_Group_Revised.thy. Int_Ring,<br>\n   because I think that talking about rings isomorphic to Z only complicate<br>\n   things and I did that to overcome a problem which does not exist anymore,<br>\n   so merging Int_Ring and IntRing is something desirable.<br>\n   Multiplicative_Group_Revised should just be continued.</p>\n<p>Lastly, I would like to thank you for your interest on the project, I hope<br>\nyou will be able to find and use what you need in GaloisCVC4. If you have<br>\nany suggestions or if you find that something in our formalism was not well<br>\nthought, I’m always keen to discuss.</p>\n<p>Paulo.</p>",
        "id": 294746401,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661193625
    },
    {
        "content": "<p>From: mailing-list anonymous &lt;<a href=\"mailto:mailing.list.anonymous@gmail.com\">mailing.list.anonymous@gmail.com</a>&gt;<br>\nDear All,</p>\n<p>I would like to thank everyone who replied to my original query. I believe<br>\nthat my question was answered in full and I would like to propose (without<br>\nbeing insistent) to close this topic. I would also like to make several<br>\nconcluding remarks in response to the replies in Digest Vol 160, Issue 15.<br>\nHowever, please note that I may leave further comments on this topic<br>\nwithout a reply.</p>\n<p>To Makarius,</p>\n<p>Thank you for your comment. Of course, it was not my intention to ask<br>\nwhether or not I am allowed to change or ignore any of the documented<br>\npractices for making a contribution to Isabelle/HOL. My primary concern was<br>\nwhether or not my contributions would be considered if I was to propose<br>\nthem while not working under the supervision of one of the existing regular<br>\nco-developers of Isabelle/HOL and while not being affiliated to a<br>\nresearch group that regularly works with Isabelle/HOL (at the moment,<br>\nIsabelle/HOL is merely one of my past-time hobbies). I believe that this<br>\nissue has not been documented anywhere. However, as I mentioned in my<br>\noriginal query, I formed an impression that all of the contributions to HOL<br>\nwere made by established academics in the areas of logic/formal<br>\nverification/mathematics or students working under their supervision. Thus,<br>\nI wanted to ensure that if I was going to make a proposal, it would not be<br>\nignored/rejected because of the aforementioned circumstances.</p>\n<p>As a side note, based on the replies given by Paulo Emílio de Vilhena (see<br>\nbelow), if I decide to submit my contributions to the community, it is<br>\nlikely that I will try to do so indirectly through the repository<br>\nGaloisCVC4 (also, see the next section in my reply).</p>\n<p>To Makarius and José Manuel Rodriguez Caballero,</p>\n<p>I have no intention to hide my identity from the regular users of this<br>\nmailing list. However, I would prefer to remain anonymous to the general<br>\npublic. Of course, anyone who needs to know my name/contact details for any<br>\ngood reason can inquire about them in a personal email (with the<br>\nunderstanding that they are not to be shared without my consent). Also, of<br>\ncourse, it is in my interest to associate my name with my contributions if<br>\nthey are to be accepted (whether they are contributions to Isabelle/HOL or<br>\na private repository of an academic).</p>\n<p>To Paulo Emílio de Vilhena,</p>\n<p>Thank you for the detailed reply.</p>\n<p>I would like to make several comments with regard to clause 4 in your reply:</p>\n<ol>\n<li>\n<p>Firstly, given that you have already introduced (or seem to be working<br>\non) a significant number of the contributions that I was going to propose,<br>\nit seems now that it is slightly less likely that I will make any attempts<br>\nto make contributions in the very near future.</p>\n</li>\n<li>\n<p>I have a certain amount of experience in computer programming and I am<br>\nfamiliar with the feeling that one can get when an external entity with<br>\nless experience is trying to 'sabotage' your code base or your intended<br>\ndirection for the development. Luckily, at least, it is nearly impossible<br>\nto introduce errors/bugs in Isabelle theorems. If I will ever make an<br>\nattempt to make a contribution, then I will also make every attempt to<br>\nensure that it is either peripheral to the main line of the development or,<br>\nat least, it is very unlikely to have any negative impact on the main line<br>\nof the development. Of course, I would submit a pull request on GitHub and<br>\nyou are welcome to reject it if you decide that it is not suitable<br>\n(obviously, if you do decide to reject it, I will appreciate any<br>\nconstructive feedback).<br>\nIf there was an active issue tracker for the project, I would also be glad<br>\nto look into the problems that you would like to be solved, but you believe<br>\nthat they have a low priority (i.e. the problems that you would not want to<br>\nspend your time on). However, most certainly, I cannot guarantee my<br>\ncommitment (as I mentioned somewhere in this reply, at the moment,<br>\nIsabelle/HOL is merely one of my past-time hobbies). Thus, please do not<br>\nstart an issue tracker on my behalf :).</p>\n</li>\n<li>\n<p>\"I think that talking about rings isomorphic to Z only complicate<br>\nthings...\". I cannot imagine that anyone who is able to understand the<br>\ncontent of HOL-Algebra will not be able to specialise theorems in Int_Ring<br>\nto their needs. However, most certainly, it would be useful not to expect<br>\nthe users to specialise the results to Z in almost every individual library<br>\nthat uses Int_Ring (in all probability, Z would be a very common<br>\napplication of theorems in Int_Ring).</p>\n</li>\n</ol>\n<p>To José Manuel Rodriguez Caballero,</p>\n<p>Thank you for providing further information and for the confirmation that<br>\nyou may be able to accept pull requests. Based on the latest reply by Paulo<br>\nEmílio de Vilhena, it seems that it is much more likely that I will be<br>\n(potentially) submitting my contributions to GaloisCVC4, because, I<br>\nbelieve, my (potential) contributions are more suitable for a library that<br>\nis closely associated with HOL-Algebra than a library in the area of number<br>\ntheory. However, if any of my contributions will be rejected (for any<br>\nreason other than the quality of my proofs or originality) or if I will<br>\never formalise anything that may be more suitable for your repository, I<br>\nwill let you know.</p>\n<p>Thank you</p>",
        "id": 294746435,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661193645
    }
]