[
    {
        "content": "<p>From: Aart Middeldorp &lt;<a href=\"mailto:aart.middeldorp@uibk.ac.at\">aart.middeldorp@uibk.ac.at</a>&gt;<br>\nThe Computational Logic research group is looking for a postdoctoral<br>\nresearcher in connection with the FWF (Austrian Science Fund) project<br>\n\"FORTissimo: Automating the First-Order Theory of Rewriting\". The project<br>\nruns for 3 years starting from 1 September 2017. Salary is paid according<br>\nto the FWF funding scheme for postdocs (40 hours) and amounts to<br>\napproximately EUR 50K per year (gross).</p>\n<p>Candidates must hold a PhD degree in computer science or mathematics.<br>\nKnowledge of automata theory and rewriting is helpful, experience with<br>\nand a liking of working with proof assistants (preferably Isabelle/HOL) is<br>\ndesirable. Candidates close to obtaining a PhD degree are also invited to<br>\napply. Knowledge of German is not required.</p>\n<p>The main task of a successful applicant will be to collaborate with other<br>\nproject members in order to extend the Isabelle Formalization of Rewriting<br>\nwith the decision procedure for the first-order theory of rewriting for<br>\nleft-linear and right-ground rewrite systems.</p>\n<p>Applications (including CV and names and contact details of two references)<br>\nmust be send by email to Aart Middeldorp no later than 1 August 2017. Informal<br>\ninquiries are welcome.</p>\n<p>The city of Innsbruck, which hosted the Olympic Winter Games in 1964,<br>\n1976 and 2012 (YOG), is superbly located in the beautiful surroundings<br>\nof the Tyrolean Alps. The combination of the Alpine environment and<br>\nurban life in this historic town provides a high quality of living. The<br>\nComputational Logic in Innsbruck is one of the leading research groups in<br>\nthe area of rewriting and formalization in the world.</p>\n<p>Further information is available from the following links:</p>\n<p>FORTissimo:<br>\n<a href=\"http://cl-informatik.uibk.ac.at/research/projects/fortissimo/\">http://cl-informatik.uibk.ac.at/research/projects/fortissimo/</a><br>\nComputational Logic:<br>\n<a href=\"http://cl-informatik.uibk.ac.at/\">http://cl-informatik.uibk.ac.at/</a><br>\nUniversity of Innsbruck:<br>\n<a href=\"http://www.uibk.ac.at/\">http://www.uibk.ac.at/</a><br>\nCity of Innsbruck:<br>\n<a href=\"http://www.innsbruck.at/\">http://www.innsbruck.at/</a></p>",
        "id": 294712916,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661182787
    }
]