[
    {
        "content": "<p>From: Thomas Sewell &lt;<a href=\"mailto:thomas.sewell@nicta.com.au\">thomas.sewell@nicta.com.au</a>&gt;<br>\nA note of caution.</p>\n<p>The if_split/split_if rule caused some headaches for us in l4v, and is<br>\nglobally removed from the split set for a number of the theories (which<br>\ncauses secondary headaches). It's possible if_split_asm would be the<br>\nsame, though, as you've probably observed, if statements in assumptions<br>\nare probably a lot rarer than in conclusions in any case.</p>\n<p>Cheers,<br>\n     Thomas.</p>\n<hr>\n<p>The information in this e-mail may be confidential and subject to legal professional privilege and/or copyright. National ICT Australia Limited accepts no liability for any damage caused by this email or its attachments.</p>",
        "id": 294669176,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661172862
    },
    {
        "content": "<p>From: Tobias Nipkow &lt;<a href=\"mailto:nipkow@in.tum.de\">nipkow@in.tum.de</a>&gt;<br>\nCurrently simp/auto split if-then-else terms if they occur in the conclusion by <br>\ndefault but not if they occur in the assumptions of a goal. The motivation was <br>\nthe following: inductive proofs of propositions involving \"if\" often go astray <br>\nif the \"if\" in the IH is split. However, this situation is not very frequent <br>\n(the \"if\" is typically hidden in some definition) but I frequently need to <br>\nmodify my simp/auto calls with</p>\n<p>split: if_split_asm (* was named split_if_asm until recently *)</p>\n<p>Hence I intend to enable \"if_split_asm\" by default, just like \"if_split\", and <br>\nwould like your feedback on this, if you have any.</p>\n<p>Why is this not clear cut? According to my tests, the effect is largely positive <br>\n(see below). But there is the following usage aspect:</p>\n<p>Realizing that if_split_asm should be added is much easier than realizing that <br>\nit should be removed: the presence of \"if\" in an assumption is the indicator.</p>\n<p>Of course this only applies if the user is aware of the existence of if_split_asm!</p>\n<p>The empirical side look like this. I have converted all of HOL (locally) with <br>\nthe following results:</p>\n<ul>\n<li>The number of lines mentioning if_split_asm has dropped from 334 to 112.</li>\n<li>\n<p>The number of lines deleting if_split_asm has gone up from 18 to 54</p>\n</li>\n<li>\n<p>In about 15 theories if_split_asm had to be disabled globally because it broke <br>\ntoo much. Typically these are long apply-style proofs.</p>\n</li>\n<li>\n<p>Otherwise local \"split del\" modifiers did the job.</p>\n</li>\n<li>\n<p>In a few places proofs became simpler.</p>\n</li>\n</ul>\n<p>In the AFP I only tested 2 articles.<br>\nLaunchbury: the 4 occurrences of if_split_asm could be removed, that's all.<br>\nJinja: the 56 occurrences of if_split_asm could be removed, 1 local split del <br>\nhad to be added.</p>\n<p>Any views?</p>\n<p>Tobias<br>\n<a href=\"/user_uploads/14278/0BiXJxmSJvwlrMQCSYe6KKvu/smime.p7s\">smime.p7s</a></p>",
        "id": 294670470,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661173249
    }
]