[
    {
        "content": "<p>From: Anduo Wang &lt;<a href=\"mailto:anduo@seas.upenn.edu\">anduo@seas.upenn.edu</a>&gt;<br>\nPlease ignore the previous email, and read the following CFP for WRiPE 2011<br>\ninstead.</p>\n<hr>\n<p>1st International Workshop on Rigorous Protocol Engineering (WRiPE 2011)<br>\nCo-located with the 19th IEEE International Conference on Network Protocols<br>\n(ICNP 2011)<br>\n<a href=\"http://wripe11.cis.upenn.edu/\">http://wripe11.cis.upenn.edu/</a></p>\n<p>WRiPE is an inter-disciplinary workshop that will bring together researchers<br>\nfrom the networking, formal methods and programming languages communities.<br>\nICNP started nearly twenty years ago as a conference focused on the<br>\napplication of formal methods to the design and analysis of protocols<br>\nprimarily from the telecommunication space. This initial focus on formal<br>\nmethods has diminished over the years as ICNP has shifted towards research<br>\non Internet protocols. The aim of WRiPE is to reinvigorate and revitalize<br>\nthe application of formal methods to the design and analysis of network<br>\nprotocols.</p>\n<p>We think the time is ripe for this type of workshop because (1) verification<br>\ntechniques have matured greatly in the last few decades, (2) verification<br>\ntools such as model checkers, theorem provers, and SAT/SMT solvers have<br>\nattracted a sizable user base, and (3) such techniques and tools have not<br>\ntraditionally been applied to network protocols (in particular IP, which is<br>\nnow the dominant networking technology).</p>\n<p>By network protocols, we include traditional IP routing protocols, wireless<br>\nmulti-hop routing, BGP policies, transport protocols, application-layer<br>\noverlay networks, and enterprise and data center networks. These may also<br>\ninclude security extensions to these protocols, e.g. IPSec and Secure BGP,<br>\nas well as protocols developed using emerging software router platforms such<br>\nas OpenFlow. By verification technique, we mean any rigorous method of<br>\ndemonstrating<br>\nthat an implementations satisfies a given specification, or that reliable<br>\nconclusions can be extracted from measurements.</p>\n<p>Topics of interest include, but are not limited to, the following:</p>\n<ul>\n<li>\n<p>Correct-by-Construction methods: meta-model frameworks (logics, algebras,<br>\ncalculi, etc.) for Internet protocols</p>\n</li>\n<li>\n<p>Applications of model checkers, theorem provers, and SAT/SMT solvers to<br>\nInternet protocol design.</p>\n</li>\n<li>\n<p>Domain specific languages (declarative, functional, or logic-based) that<br>\nraise the level of abstraction in Internet protocol development.</p>\n</li>\n<li>\n<p>Formal-methods based techniques for run-time verification and testing of<br>\nInternet protocols.</p>\n</li>\n<li>\n<p>Combining model checking and theorem proving for verifying<br>\nInternet protocols.</p>\n</li>\n<li>\n<p>Model finding techniques for network configuration.</p>\n</li>\n</ul>\n<p>Submission guidelines</p>\n<p>Paper submission will not be blind. The submissions will indicate the names<br>\nor affiliations of the authors in the paper. Please do not submit<br>\nabbreviated versions of journal or conference papers. In particular,<br>\nsubmissions to WRiPE must not be concurrent with a substantially similar<br>\nsubmission to a conference or workshop, including condensed versions of work<br>\nthat has been submitted and is currently under review. We do encourage<br>\nsubmissions of work-in-progress based on novel and interesting ideas.<br>\nSubmitted papers must be no longer than six (6) pages in double-column<br>\nformat with standard margins (i.e., at least one inch all around) and<br>\nat least a 10 point font. This length includes everything: figures, tables,<br>\nreferences, appendices and so forth. Longer submissions will not be<br>\nreviewed. Papers should include a title; full list of authors, their<br>\norganizations and email addresses; and an abstract of fewer than 200 words.</p>\n<p>Important Dates</p>\n<ul>\n<li>Submission deadline for papers      June 11, 2011.</li>\n<li>Notification to authors     July 30, 2011.</li>\n<li>Camera ready due    Aug 20, 2011.</li>\n<li>Workshop date               Oct 17, 2011</li>\n</ul>\n<p>Program Committee co-Chairs</p>\n<ul>\n<li>Tim Griffin, Cambridge University</li>\n<li>Boon Thau Loo, University of Pennsylvania</li>\n</ul>\n<p>Program Committee</p>\n<ul>\n<li>Edwin Brady, University of St Andrews</li>\n<li>Randy Bush, Internet Initiative Japan</li>\n<li>Ana Cavalli, TELECOM SudParis</li>\n<li>Nate Foster, Cornell University</li>\n<li>Alexander Gurney, University of Pennsylvania</li>\n<li>Mike Gordon, Cambridge University</li>\n<li>Stephane Grumbach, INRIA</li>\n<li>Ranjit Jhala, UC San Diego</li>\n<li>Anil Madhavapeddy, Cambridge University</li>\n<li>Jennifer Rexford, Princeton University</li>\n<li>Matthew Roughan, University of Adelaide</li>\n<li>Georg Struth, University of Sheffield</li>\n<li>Walter Willinger AT&amp;T Labs Research</li>\n<li>Pamela Zave, AT&amp;T Labs Research</li>\n</ul>",
        "id": 294134296,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660843851
    }
]