[
    {
        "content": "<p>From: Joao Marcos &lt;<a href=\"mailto:botocudo@gmail.com\">botocudo@gmail.com</a>&gt;<br>\nFourth Workshop on Logical and Semantic Frameworks, with Applications<br>\n28th June, 2009 - Brasília, Brazil</p>\n<p>Call for Papers<br>\nScope<br>\nLogical and semantic frameworks are formal languages used to represent<br>\nlogics, languages and systems. These frameworks provide foundations for<br>\nformal specification of systems and programming languages, supporting tool<br>\ndevelopment and reasoning.</p>\n<p>The objective of this one-day workshop is to put together theoreticians and<br>\npractitioners to promote new techniques and results, from the theoretical<br>\nside, and feedback on the implementation and use of such techniques and<br>\nresults, from the practical side.</p>\n<p>Topics of interest to this forum include, but are not limited to:</p>\n<p>a.. Logical frameworks<br>\n  a.. Proof theory<br>\n  b.. Type theory<br>\n  c.. Automated deduction<br>\n b.. Semantic frameworks<br>\n  a.. Specification languages and meta-languages<br>\n  b.. Formal semantics of languages and systems<br>\n  c.. Computational and logical properties of semantic frameworks<br>\n  a.. Implementation of logical and/or semantic frameworks<br>\n c.. Applications of logical and/or semantic frameworks<br>\nLSFA'09 also aims to be a forum for presenting and discussing work in<br>\nprogress, and therefore to provide feedback to authors on their preliminary<br>\nresearch. Submissions to the workshop will in the form of full papers. The<br>\nproceedings are produced only after the meeting, so that authors can<br>\nincorporate this feedback in the published papers.</p>\n<p>Invited Speakers<br>\nThere will be three invited talks. The following talks have already been<br>\nconfirmed. Delia Kesner (PPS, CNRS and Universite Paris-Diderot)<br>\n    Title: Theory and Practice of First-Class Patterns<br>\n    Jonathan Seldin (University of Lethbridge, Canada)<br>\n    Title: TBA<br>\n    Luis Fariñas de Cerro (Université Paul Sabatier -- Toulose III,<br>\nFrance)<br>\n    Title: TBA</p>\n<p>Program Committee<br>\n Mauricio Ayala-Rincón (University of Brasília, Brazil), co-chair<br>\n    Fairouz Kamareddine (Heriot-Watt University, Edinburgh, UK), co-chair<br>\n    Serge Autexier (DFKI, Bremen, Germany)<br>\n    Benjamin Rene Callejas Bedregal (Federal University of Rio Grande do<br>\nNorte, Brazil)<br>\n    Mario Benevides (Federal University of Rio de Janeiro, Brazil)<br>\n    Guilherme Bittencourt (Federal University of Santa Catarina, Brazil)<br>\n    Christiano Braga (Universidad Complutense de Madrid, Spain)<br>\n    Andreas Brunner (Federal University of Bahia, Brazil)<br>\n    Marcelo Coniglio (State University of Campinas, Brazil)<br>\n    Clare Dixon (University of Liverpool, UK)<br>\n    Gilles Dowek (École Polytechnique, France)<br>\n    William Farmer (McMaster University, Hamilton, Ontario, Canada)<br>\n    Marcelo Finger (University of São Paulo, Brazil)<br>\n    Edward Hermann Haeusler (PUC Rio, Brazil)<br>\n    Tudor Jebelean (RISC Johannes Kepler University, Austria)<br>\n    Manfred Kerber (The University of Birmingham, UK)<br>\n    Luis C. Lamb (Federal University of Rio Grande do Sul, Brazil)<br>\n    Daniel Leivant (Indiana University, USA)<br>\n    João Marcos (Federal University of Rio Grande do Norte, Brazil)<br>\n    Ana Teresa de Castro Martins (Federal University of Ceará, Brazil)<br>\n    Dale Miller (INRIA, France)<br>\n    Flávio Leonardo Cavalcanti de Moura (University of Brasília, Brazil)<br>\n    Luca Paolini (Università di Torino, Italy)<br>\n    Alberto Pardo (Universidad de la República, Uruguay)<br>\n    Elaine Pimentel (Federal University of Minas Gerais, Brazil)<br>\n    Ruy de Queiroz (Federal University of Pernambuco, Brazil)<br>\n    Simona Ronchi della Rocca (Università di Torino, Italy)<br>\n    Amr Sabry (Indiana University, USA)<br>\n    Christian Urban (TUM, Germany)<br>\n    Freek Wiedijk (Radboud Universiteit, The Netherlands)</p>\n<p>Organizing Committee<br>\n    Cláudia Nalon (University of Brasília, Brazil), Local Chair<br>\n    Elaine Pimentel (Federal University of Minas Gerais, Brazil)<br>\n    Edward Hermann Haeusler (PUC Rio, Brazil)<br>\n    Mauricio Ayala-Rincon (University of Brasília, Brazil)<br>\n    Guilherme Albuquerque Pinto (University of Brasília, Brazil)</p>\n<p>Dates and Submission<br>\n    Paper submission: 3rd April, 2009<br>\n    Author notification: 15th May, 2009<br>\n    Camera ready: 31st May, 2009</p>\n<p>Contributions should be written in English and submitted in the form full<br>\npapers with at most 16 pages. They must be unpublished and not submitted<br>\nsimultaneously for publication elsewhere. The submission should be in the<br>\nform of a PDF file uploaded to LSFA'09 page at EasyChair until the<br>\nsubmission deadline by midnight, Central European Standard Time (GMT+1).</p>\n<p>The papers should be prepared in latex using Elsevier ENTCS style. Please<br>\nsee the Instructions for Preparing Files for Preliminary Versions<br>\nInstructions for styles and examples. The file entcs.cls is also available<br>\nhere. The prentcsmacro.sty file will be available soon.</p>\n<p>The workshop pre-proceedings, containing the reviewed papers, will be<br>\nhanded-out at workshop registration and the proceedings will be published as<br>\na volume of ENTCS.</p>\n<p>After the workshop, according to the quantity and quality of selected<br>\npapers, the authors will be invited to submit full versions of their works<br>\nthat will be also reviewed to high standards. A special issue of LSFA'06<br>\nappeared in the Journal of Algorithms and currently a special issue of<br>\nLSFA'07 is being processed and will appear in The Logical Journal of the<br>\nIGPL.</p>\n<p>At least one of the authors should register at the conference. The paper<br>\npresentation should be in English.</p>\n<p>Contact Information<br>\nFor more information please contact the organizers.</p>\n<p>The web page of the event can be reached at:</p>\n<p><a href=\"http://lsfa09.cic.unb.br\">http://lsfa09.cic.unb.br</a></p>",
        "id": 294073621,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660828058
    }
]