[
    {
        "content": "<p>From: Marsha Chechik &lt;<a href=\"mailto:chechik@cs.toronto.edu\">chechik@cs.toronto.edu</a>&gt;<br>\nAppologies if you receive multiple copies of this announcement.<br>\nFor information on commercial demos and exhibits, please read on.</p>\n<hr>\n<p>Call for Posters &amp; Research Tool Demonstrations<br>\n   14th International Formal Methods Symposium (FM'06)<br>\n           McMaster University, Hamilton, Canada<br>\n                  August 21-27, 2006<br>\n<a href=\"http://fm06.mcmaster.ca\">http://fm06.mcmaster.ca</a></p>\n<p>FM'06 is the fourteenth in a series of symposia organized by Formal<br>\nMethods Europe, an independent association whose aim is to stimulate<br>\nthe use of, and research on, formal methods for software development.<br>\nThe symposia have been notably successful in bringing together<br>\ninnovators and practitioners in precise mathematical methods for<br>\nsoftware development, industrial users as well as researchers.</p>\n<p>Tools are central to the success of formal methods in practice.<br>\nHence, tool demonstrations will have a prominent role in the<br>\nconference. Demonstrators will be expected to present their tools<br>\nduring specially-designated time that will be scheduled into the<br>\nconference program.  Tool demonstrations should be accompanied<br>\nby a poster.  In addition, a collection of short papers (2-3<br>\npages), for every accepted tool demonstration, will be published as a<br>\ntechnical report and available to conference attendees.  The authors<br>\nmaintain copyright on their written tool description.</p>\n<p>We solicit proposals for tool demonstrations related to automated<br>\nreasoning using formal methods.  Tools can range from alpha-versions<br>\nto fully developed products that are being prepared for<br>\ncommercialization. Products that are currently being commercialized<br>\nwill not be accepted as subjects of demonstrations (see call for<br>\ncommercial exhibits and tool demonstrations). Research tool<br>\ndemonstrations are not intended to be sales pitches, and should<br>\nconsequently highlight technical contributions. For further<br>\nclarification, please contact the tool demonstrations chair.</p>\n<p>Priority will be given to tools based on sound, rigorous research<br>\nresults to support the automation of analysis and/or verification of<br>\nsoftware or hardware systems.</p>\n<p>We also solicit posters describing late-breaking results related to<br>\nthe theme of the conference.  Like tool demonstrations, accepted<br>\nposters will be accompanied by a short paper published as a technical<br>\nreport and available to conference attendees.  Poster presenters are<br>\nexpected to be available during a specially-scheduled time during the<br>\nconference to present their work.</p>\n<p>Review Process</p>\n<p>The Posters &amp; Demos Committee will review each submission using<br>\nthe standard FM criteria: originality and importance of contribution,<br>\nsoundness of rationale or demonstration, quality of written and<br>\ngraphic presentation, and appropriate consideration of relevant<br>\nliterature.</p>\n<p>Equipment</p>\n<p>Demonstrators are expected to provide their own equipment.</p>\n<p>How to submit</p>\n<p>Submissions of proposals for posters &amp; tool demonstrations must:</p>\n<p>For demos:</p>\n<p>* be no more than 3 pages in LNCS format, describing the<br>\ntechnology or approach, what is the research that has gone into the<br>\ntool, how it relates to other industrial or research efforts,<br>\nincluding references, and what are the expected benefits.</p>\n<p>* have an appendix (not included in the 3-page count) that<br>\nprovides a detailed description of how the presentation would be<br>\nconducted (possibly illustrated with a number of snapshots),<br>\ninformation on tool availability and maturity, and the URL of a<br>\nweb-page for the tool (if one exists).</p>\n<p>For Posters:</p>\n<p>* be no more than 3 pages in LNCS format, describing the<br>\napproach, how it relates to other industrial or research efforts,<br>\nincluding references, and what are the expected benefits.</p>\n<p>For Demos and Posters:</p>\n<p>* be sent to by email to Marsha Chechik (chechik at cs dot toronto dot edu)<br>\nby the Posters &amp; Demos submission deadline.  Please begin the subject<br>\nline with \"FM 2006 Demo\" or \"FM 2006 Poster\".</p>\n<p>Accepted Posters and Demonstrations</p>\n<p>Accepted posters and demonstrations will be published as short papers<br>\nin a special technical report, available to conference attendees.<br>\nIn addition, the authors should be available for answering questions<br>\nor demonstrating their tools at scheduled times during the conference.</p>\n<p>Important Dates<br>\nSubmission deadline:<br>\n    May 26, 2006.<br>\nAuthor notification:<br>\n    June 12, 2006.<br>\nCamera-ready papers:<br>\n    June 22, 2006.</p>\n<p>Tool Demo &amp; Poster Chair<br>\nMarsha Chechik<br>\nDepartment of Computer Science<br>\nUniversity of Toronto<br>\nToronto, Ontario Canada</p>\n<hr>\n<p>Call for Commercial Exhibits and Tool Demonstrations<br>\n        14th International Formal Methods Symposium (FM'06)<br>\n              McMaster University, Hamilton, Canada<br>\n                      August 21-27, 2006<br>\n<a href=\"http://fm06.mcmaster.ca\">http://fm06.mcmaster.ca</a></p>\n<p>FM'06 is the fourteenth in a series of symposia organized by Formal<br>\nMethods Europe, an independent association whose aim is to stimulate<br>\nthe use of, and research on, formal methods for software development.<br>\nThe symposia have been notably successful in bringing together<br>\ninnovators and practitioners in precise mathematical methods for<br>\nsoftware development, industrial users as well as researchers.<br>\nAttendance will include roughly 250 researchers and practitioners from<br>\nindustry and academia.  This is the first time FM is held in North America.</p>\n<p>Exhibition and commercial tool demonstration space is available and<br>\nwill be accessible to attendees for the duration of the conference<br>\n(August 21-27, 2006.).  One-day attendance is also available.</p>\n<p>For a nominal cost, the conference will provide space for a booth and<br>\na demo, as well as an opportunity to present the tool at lunch time<br>\nduring the Industry Day (August 23, 2006), and once as a parallel<br>\ntrack to the technical paper session.  Interested exhibitors should<br>\ncontact Marsha Chechik (chechik at cs dot toronto dot edu) for payment details<br>\nand to request any special space or demonstration needs.</p>\n<p>Important Dates</p>\n<p>Application due         May 26,  2006<br>\n    Full Payment Due            June 23, 2006</p>",
        "id": 293905065,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660745707
    }
]