[
    {
        "content": "<p>From: n s &lt;<a href=\"mailto:nedsri1988@gmail.com\">nedsri1988@gmail.com</a>&gt;<br>\n-<br>\nI was working through a couple of the examples in the tutorial A Proof <br>\nAssistant for Higher-Order Logic 2015, particularly 2.5.6 Case Study: <br>\nBoolean Expressions and ran into a problem. Without repeating the entire <br>\ncontents of that section, the case study introduces a type definition <br>\nfor boolean expressions, and a way of evaluating them in the usual <br>\nmanner. Then it introduces a more efficient representation of boolean <br>\nexpressions as if-then-else expressions. A lemma shows that evaluating a <br>\nstandard boolean expression is equivalent to evaluating its if-then-else <br>\nform. Then the next part of the tutorial introduces normalization of <br>\nif-then-else expressions which removes if-then-else expressions in the <br>\n\"if\" part. The exercise here is to show that evaluating the normalized <br>\nif-then-else epxression is equivalent to evaluating the original <br>\nif-then-else expression.<br>\nTrying<br>\n     theorem \"valif (norm b) env = valif b env\"<br>\n     apply (induct_tac b)<br>\n     apply (auto)<br>\nleaves 8 subgoals.<br>\nThe tutorial says that the proof is canonical, provided we first show <br>\nthe following simplification lemma, which also helps to understand what <br>\nnormif does:<br>\n     lemma [simp]:<br>\n          \"∀t e. valif (normif b t e) env = valif (IF b t e) env\"<br>\nIsabelle is able to prove the lemma, but unfortunately it appears to <br>\nhave no impact on the proof of the theorem, which is still stuck with 8 <br>\nsubgoals. I am able to prove the theorem by hand using structural <br>\ninduction, applying the theorem to the subparts t and e. Any ideas why <br>\nits stuck?</p>\n<p>thanks!</p>\n<p>(I am running Isabelle 2015)</p>",
        "id": 294670722,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661173322
    },
    {
        "content": "<p>From: Corey Richardson &lt;<a href=\"mailto:corey@octayn.net\">corey@octayn.net</a>&gt;<br>\nYou may find it useful to compare your theory to the theory the tutorial is<br>\ngenerated from. This is present in </p>\n<p>$ISABELLE_HOME/src/Doc/Tutorial/Ifexpr/Ifexpr.thy<br>\n<a href=\"/user_uploads/14278/wNh5PTKdQZqoj80EK5G2QQCe/signature.asc\">signature.asc</a></p>",
        "id": 294670754,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661173329
    }
]