[
    {
        "content": "<p>From: Oliver Kullmann &lt;<a href=\"mailto:O.Kullmann@swansea.ac.uk\">O.Kullmann@swansea.ac.uk</a>&gt;<br>\nHello,</p>\n<p>I hope you don't mind the following (second) call for papers (see<br>\nattachment for the full text; my apologies in case you<br>\nobtain this letter several times; you have been addressed<br>\nby this e-mail since you have had some contacts with the<br>\nSAT community in the past).</p>\n<p>SAT 2009 - 12th International Conference on Theory<br>\nand Applications of Satisfiability Testing<br>\n  Second Call for Papers<br>\n  June 30 - July 3, 2009, Swansea, United Kingdom<br>\n<a href=\"http://cs.swan.ac.uk/~csoliver/SAT2009/index.html\">http://cs.swan.ac.uk/~csoliver/SAT2009/index.html</a></p>\n<ul>\n<li>\n<p>The International Conference on Theory and Applications of<br>\n  Satisfiability Testing is the primary annual meeting for researchers<br>\n  studying the propositional satisfiability problem (SAT). SAT'09 is<br>\n  the twelfth SAT conference. SAT'09 features the SAT competition, the<br>\n  the Pseudo-Boolean evaluation, and the MAX-SAT evaluation.</p>\n</li>\n<li>\n<p>The topics of the conference span practical and<br>\n  theoretical research on SAT and its applications and include, but are<br>\n  not limited to, proof systems, proof complexity, search algorithms,<br>\n  heuristics, analysis of algorithms, hard instances, randomised<br>\n  formulae, problem encodings, industrial applications, solvers,<br>\n  simplifiers, tools, case studies and empirical results. SAT is<br>\n  interpreted in a rather broad sense: besides propositional<br>\n  satisfiability, it includes the domain of quantified boolean<br>\n  formulae (QBF), constraints programming techniques (CSP) for<br>\n  word-level problems and their propositional encoding and<br>\n  particularly satisfiability modulo theories (SMT).</p>\n</li>\n<li>\n<p>Important dates:  Abstract submission due: 20 Feb 2009;<br>\n  Paper submission: 27 Feb 2009; Notification: 29 Mar 2009.</p>\n</li>\n</ul>\n<p>With best regards</p>\n<p>Oliver Kullmann and the team for SAT 2009 in Swansea<br>\n<a href=\"/user_uploads/14278/GApiYBPnKGhSva-vCYv3hdhd/sat09-cfp2.txt\">sat09-cfp2.txt</a></p>",
        "id": 294070067,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660826849
    }
]