[
    {
        "content": "<p>From: Sun Jun &lt;<a href=\"mailto:sunjun@sutd.edu.sg\">sunjun@sutd.edu.sg</a>&gt;<br>\nCALL FOR INDUSTRY TRACK PAPERS</p>\n<p>FM2014 is the nineteenth in a series of symposia organized by Formal Methods Europe,<br>\nan independent association whose aim is to stimulate the use of, and research on,<br>\nformal methods for software development. The symposia have been notably successful<br>\nin bringing together innovators and practitioners in precise mathematical methods<br>\nfor software and systems development, industrial users, as well as researchers.<br>\nThe industry track of FM 2014 welcomes papers describing industrial applications<br>\nof formal methods, experience with introducing formal methods in industry, tool<br>\nusage reports, experiments with challenge problems. Authors are encouraged to<br>\nexplain how the use of formal methods has overcome problems, lead to improvements<br>\nin design or provided new insights.</p>\n<p>PAPER SUBMISSION</p>\n<p>Industry track papers should not exceed 15 pages (including appendices and<br>\nreferences). Accepted papers will be published in the Symposium Proceedings, to<br>\nappear in Springer's Lecture Notes in Computer Science. Submitted papers should<br>\ndescribe, in English, have not been published or submitted elsewhere concurrently<br>\nfor publication, and should be in Springer's format. All submissions will be<br>\nevaluated by at least three members of the industry track program committee.<br>\nPapers should be submitted through the FM 2014 EasyChair web site:<br>\n<a href=\"http://www.easychair.org/conferences/?conf=fm2014\">http://www.easychair.org/conferences/?conf=fm2014</a></p>\n<p>IMPORTANT DATES</p>\n<ul>\n<li>Industry Track Submission: January 16, 2014</li>\n<li>Industry Track Notification: February 16, 2014</li>\n<li>Camera-ready: February 25, 2014</li>\n<li>Main Conference Date: May 14-16, 2014</li>\n</ul>\n<p>FM 2014 ORGANIZING COMMITTEES</p>\n<p>General Chair<br>\nJin Song Dong, National University of Singapore, Singapore.</p>\n<p>Program Committee Co-Chairs<br>\nCliff B Jones, Newcastle University, United Kindom.<br>\nPekka Pihlajasaari, Data Abstraction (Pty) Ltd, South Africa.<br>\nJun Sun, Singapore University of Technology and Design, Singapore.</p>\n<p>Doc Symposium Chair<br>\nAnnabelle McIver, Macquarie University, Australia.</p>\n<p>Workshop Chair<br>\nShengchao Qin, University of Teesside, United Kindom.</p>\n<p>Publicity Chair<br>\nJonathan Bowen, London South Bank University, United Kindom.<br>\nKenji Taguchi, AIST, Japan.</p>\n<p>INDUSTRY TRACK PROGRAM COMMITTEE</p>\n<ul>\n<li>Jun Sun, Singapore University of Technology and Design, Singapore.</li>\n<li>Cliff Jones, Newcastle University, United Kingdom.</li>\n<li>Pekka Pihlajasaari, Data Abstraction (Pty) Ltd, South Africa.</li>\n<li>Michael Holloway, NASA, United States.</li>\n<li>Ralf Huuck, NICTA, Australia.</li>\n<li>Ewen Denney, SGT/NASA Ames, United States.</li>\n<li>Jim Grundy, Intel Corporation, United States.</li>\n<li>Hongjun Zheng, MathWorks, United States.</li>\n<li>Wolfgang Grieskamp, Google, United States.</li>\n<li>Cristina Cifuentes, Oracle, Australia.</li>\n<li>Jon Burton, Praxis, United Kingdom.</li>\n</ul>\n<p>This email may contain confidential and/or proprietary information that is exempt from disclosure under applicable law and is intended for receipt and use solely by the addressee(s) named above. If you are not the intended recipient, you are notified that any use, dissemination, distribution, or copying of this email, or any attachment, is strictly prohibited. Please delete the email immediately and inform the sender. Thank You</p>",
        "id": 294259559,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660913873
    }
]