[
    {
        "content": "<p>From: Peter Sewell &lt;<a href=\"mailto:Peter.Sewell@cl.cam.ac.uk\">Peter.Sewell@cl.cam.ac.uk</a>&gt;<br>\nWe're advertising several positions, as below - if you know suitable<br>\ncandidates, please pass this on. Thanks - Peter</p>\n<p>Research Associates/Senior Research Associates in Rigorous Engineering for<br>\nMainstream Systems (Fixed Term), University of Cambridge</p>\n<p>Research Associate £32,816 - £40,322 or Senior Research Associate £41,526 -<br>\n£52,559</p>\n<p>Fixed-term: The funds for these posts are available for 2 years in the<br>\nfirst instance, with a possibility of extension.</p>\n<p>Are you interested in developing and applying semantics and verification<br>\ntechniques to improve the foundations and security of mainstream computer<br>\nsystems? We are looking for multiple postdoctoral researchers to do exactly<br>\nthat, in two related projects:</p>\n<p>(1) CHERI verification. CHERI (<br>\n<a href=\"https://www.cl.cam.ac.uk/research/security/ctsrd/cheri/\">https://www.cl.cam.ac.uk/research/security/ctsrd/cheri/</a>) extends<br>\nconventional Instruction-Set Architectures (ISAs) with architectural<br>\ncapabilities, for fine-grained memory protection and scalable software<br>\ncompartmentalization. CHERI allows memory-unsafe programming languages, eg<br>\nC and C++, to be adapted to protect against many currently widely exploited<br>\nsecurity vulnerabilities. CHERI is a hardware/software/semantics co-design<br>\nproject, combining computer architecture, systems software, security, and<br>\nsemantics.</p>\n<p>In October 2019, Arm announced Morello (<br>\n<a href=\"https://www.cl.cam.ac.uk/research/security/ctsrd/cheri/cheri-morello.html\">https://www.cl.cam.ac.uk/research/security/ctsrd/cheri/cheri-morello.html</a>),<br>\nan experimental CHERI-extended ARMv8-A processor, to be available from late<br>\n2021. Morello is part of the UKRI £187M Digital Security by Design<br>\nChallenge (DSbD), supported by the UK Industrial Strategy Challenge Fund<br>\nand over £50M from Arm. Morello will support industrial-scale evaluation of<br>\nCHERI, with a view to mass-market adoption - which would transform the<br>\nsecurity landscape.</p>\n<p>We have previously developed rigorous engineering methods (<br>\n<a href=\"https://www.cl.cam.ac.uk/research/security/ctsrd/cheri/cheri-formal.html\">https://www.cl.cam.ac.uk/research/security/ctsrd/cheri/cheri-formal.html</a>)<br>\nto precisely define the CHERI ISA, for CHERI-MIPS and CHERI-RISC-V<br>\nvariants, and to prove (in Isabelle) that they satisfy key intended<br>\nsecurity properties (<a href=\"https://www.cl.cam.ac.uk/techreports/UCAM-CL-TR-940.pdf\">https://www.cl.cam.ac.uk/techreports/UCAM-CL-TR-940.pdf</a><br>\n).</p>\n<p>We are now collaborating with Arm and researchers at Edinburgh to do the<br>\nsame for the full Morello CHERI ARMv8 ISA, building on our Sail ARMv8-A ISA<br>\nsemantics (<a href=\"https://www.cl.cam.ac.uk/~pes20/sail/\">https://www.cl.cam.ac.uk/~pes20/sail/</a>), and to study the<br>\nsemantics and security of higher-level languages and system software above<br>\nCHERI, building on our Cerberus C semantics (<br>\n<a href=\"https://www.cl.cam.ac.uk/~pes20/cerberus/\">https://www.cl.cam.ac.uk/~pes20/cerberus/</a>). This verification could improve<br>\nthe security of all Arm mobile device software.</p>\n<p>(2) Arm system software verification. We have an ongoing project, in<br>\ncollaboration with Google and with researchers at multiple institutions, to<br>\nestablish correctness and security properties of key system software above<br>\nthe ARMv8-A ISA semantics (<a href=\"https://www.cl.cam.ac.uk/~pes20/sail/\">https://www.cl.cam.ac.uk/~pes20/sail/</a>),<br>\nintegrated with the ARMv8-A concurrency architecture (including both the<br>\nprevious \"user-mode\" models and the system concurrency semantics, being<br>\ndeveloped in collaboration with Arm) (<br>\n<a href=\"https://www.cl.cam.ac.uk/~pes20/armv8-mca/\">https://www.cl.cam.ac.uk/~pes20/armv8-mca/</a>).</p>\n<p>We are looking for postdocs to contribute to all aspects of both projects.<br>\nYou should have a strong background in semantics and verification, the<br>\nmotivation and flexibility to develop practical ways to use them at scale<br>\nfor real systems, and experience in one or more of:</p>\n<ul>\n<li>interactive theorem proving, in Coq, HOL4, and/or Isabelle</li>\n<li>program logics</li>\n<li>low-level system software</li>\n<li>programming language semantics and type systems</li>\n<li>program analysis</li>\n<li>hardware verification</li>\n<li>functional programming</li>\n</ul>\n<p>We are also seeking candidates with a research engineering focus, to assist<br>\nin the development of robust and widely usable tools based on the above.<br>\nFor this, you should have experience in functional programming, especially<br>\nOCaml.</p>\n<p>There might also be the possibility of internship or PhD positions; for<br>\nthese contact Prof. Sewell.</p>\n<p>For more details of our recent work, see (<a href=\"https://www.cl.cam.ac.uk/~pes20/\">https://www.cl.cam.ac.uk/~pes20/</a>),<br>\nand especially REMS (<a href=\"https://www.cl.cam.ac.uk/~pes20/rems/index.html\">https://www.cl.cam.ac.uk/~pes20/rems/index.html</a>).</p>\n<p>The positions are available to start as soon as possible. For candidates<br>\nwith substantial relevant expertise, we may be able to appoint at the<br>\nSenior Research Associate level.</p>\n<p>Further details may be obtained from Prof. Peter Sewell,<br>\n<a href=\"mailto:Peter.Sewell@cl.cam.ac.uk\">Peter.Sewell@cl.cam.ac.uk</a></p>\n<p>Click the 'Apply' button at (<a href=\"http://www.jobs.cam.ac.uk/job/24501/\">http://www.jobs.cam.ac.uk/job/24501/</a>) to apply<br>\nonline.</p>\n<p>You will need to upload a full curriculum vitae (CV) and a covering letter<br>\noutlining your interests, potential contributions, and relevant past<br>\nexperience; you should also include the contact details for at least 2<br>\nreferees.</p>\n<p>Please quote reference NR21859 on your application and in any<br>\ncorrespondence about this vacancy.</p>\n<p>The University actively supports equality, diversity and inclusion and<br>\nencourages applications from all sections of society.</p>\n<p>The University has a responsibility to ensure that all employees are<br>\neligible to live and work in the UK.</p>",
        "id": 294767476,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661202610
    }
]