[
    {
        "content": "<p>From: Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt;<br>\nApple has release OSX 10.10 Yosemite 10 days ago.</p>\n<p>As usual my first reaction to operation system releases is to ignore them <br>\nfor serious work.  But to see how Isabelle works with it, I have made a <br>\nfresh test installation today.</p>\n<p>In contrast to one private report off-list, I did not encounter any <br>\nproblems so far, using the official Isabelle2014 distribution as is. <br>\nThis is no proof of absence of problems: a new OS release normally needs <br>\nsome months to stabilize.</p>\n<p>Latest Java 8 (e.g. 8u25) seems to have substantial problems with OSX <br>\n10.10 -- e.g. see the activity on <br>\n<a href=\"http://sourceforge.net/p/jedit/mailman/jedit-devel\">http://sourceforge.net/p/jedit/mailman/jedit-devel</a> -- but we are using the <br>\nmore conservative Java 7u67 in Isabelle2014.</p>\n<p>If there are further observations about OSX Yosemite, problem reports, <br>\nworkarounds etc. please contribute to this thread.</p>\n<p>Makarius</p>\n<hr>\n<p><a href=\"http://stop-ttip.org\">http://stop-ttip.org</a>  737,302 people so far</p>\n<hr>",
        "id": 294318344,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660926171
    },
    {
        "content": "<p>From: Lawrence Paulson &lt;<a href=\"mailto:lp15@cam.ac.uk\">lp15@cam.ac.uk</a>&gt;<br>\nMy attempt to upgrade to Yosemite on one of my three machines was a disaster. The “upgraded” machine could no longer drive its own display. Apparently the presence of certain software (TeXLive, MacPorts) causes great complications. I had to wipe the hard drive and then reinstall everything using Migration Assistant. Make sure you have an up-to-date backup before attempting this upgrade, or wait for the next point release of Yosemite.</p>\n<p>Larry Paulson</p>",
        "id": 294318455,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660926202
    }
]