[
    {
        "content": "<p>From: Christoph Sprenger &lt;<a href=\"mailto:sprenger@inf.ethz.ch\">sprenger@inf.ethz.ch</a>&gt;<br>\nPh.D. Research Project at ETH Zurich on<br>\nSecurity Modeling and Analysis in Cyber-physical Systems<br>\nProf. David Basin and Prof. Srdjan Capkun, ETH Zurich</p>\n<p>Cyber-physical systems are systems in which computational and physical<br>\nelements are tightly coupled. Due to this coupling, their failure can<br>\nhave catastrophic health, safety, environmental, or economic<br>\nconsequences. For example, the failure of a power distribution network<br>\ncan leave parts of a country or continent without<br>\nelectricity. Cyber-physical systems operate in increasingly adversarial<br>\nenvironments where they are subject to targeted attacks.  Hence these<br>\nsystems are part of our critical infrastructures and must be protected<br>\nfrom both unintentionally and intentionally induced failures.</p>\n<p>ETH Zurich, together with ABB Corporate Research in Switzerland, is<br>\nseeking to hire a researcher who will carry out research on methods for<br>\nthe design and analysis of security architectures for the security of<br>\nelectricity (power) grid systems.  This includes: developing foundations<br>\nfor modeling the structure and behavior of cyber-physical systems,<br>\ndeveloping models of existing and planned power grid systems, developing<br>\ntechniques to support the analysis of models (e.g., carrying out risk<br>\nanalysis), and validating the approach taken through case studies.</p>\n<p>The project will run for approximately 3 years and provides the<br>\npossibility of carrying out a Ph.D. during this period. As part of this<br>\nproject, the Ph.D. student will spend time at ABB learning about the<br>\nsystems under consideration and state-of-the-art approaches to their<br>\ndesign and analysis.</p>\n<p>The PhD student will be a paid employee of ETH Zurich. Salary and<br>\nemployment conditions are attractive. ETH Zurich regulations require<br>\ndoctoral students to hold a Master's or equivalent degree (e.g. Diplom).</p>\n<p>Zurich is a diverse and multicultural city, which is consistently rated<br>\namong the best cities in the world in which to live. We favor the same<br>\nsort of diversity that defines Zurich's cultural makeup and encourage<br>\nanyone matching the profile above to apply, regardless of where you  <br>\nare from.</p>\n<p>Applications should include a curriculum vitae, a brief description of<br>\nresearch interests, transcripts of grades, and, if possible,<br>\npublications, and letters of recommendation from teachers or<br>\nemployers. Applications and inquiries should be sent by email to:<br>\n<a href=\"mailto:infsec.positions@inf.ethz.ch\">infsec.positions@inf.ethz.ch</a></p>\n<p>ETH Zurich specifically encourages women to apply with a view towards<br>\nincreasing the proportion of female researchers.</p>",
        "id": 294143712,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660846758
    }
]