[
    {
        "content": "<p>From: Tobias Nipkow &lt;<a href=\"mailto:nipkow@in.tum.de\">nipkow@in.tum.de</a>&gt;<br>\nby Joachim Breitner</p>\n<p>In his dissertation, Olin Shivers introduces a concept of control flow<br>\ngraphs for functional languages, provides an algorithm to statically<br>\nderive a safe approximation of the control flow graph and proves this<br>\nalgorithm correct. In this research project, Shivers' algorithms and<br>\nproofs are formalized using the logic HOLCF in theorem prover Isabelle.</p>\n<p><a href=\"http://afp.sourceforge.net/entries/Shivers-CFA.shtml\">http://afp.sourceforge.net/entries/Shivers-CFA.shtml</a></p>\n<p>Enjoy!</p>",
        "id": 294121859,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660840091
    },
    {
        "content": "<p>From: Brian Huffman &lt;<a href=\"mailto:brianh@cs.pdx.edu\">brianh@cs.pdx.edu</a>&gt;<br>\nIt is great to see new AFP entries using HOLCF. This one is a nice<br>\nexample of how HOLCF can be used for part of a development where much<br>\nof it is done directly in ordinary Isabelle/HOL; in this case the HOL<br>\nset type is made into a cpo, so that 'fixrec' can be used for<br>\nrecursive definitions of sets.</p>\n<p>I'd like to encourage more of this kind of cross-over between<br>\nIsabelle/HOL and HOLCF, and remind all the potential users of HOLCF<br>\nout there that the barrier to entry is probably not as high as you<br>\nthink: HOLCF is just a library of definitions, theorems and packages<br>\nthat you can import from Isabelle/HOL if you need it; you don't have<br>\nto abandon all of your Isabelle/HOL theories if you want to try using<br>\nHOLCF.</p>\n<p>Keeping this in mind, I'd like to respectfully request that HOLCF not<br>\nbe referred to as a \"logic\" -- this seems to imply (incorrectly) that<br>\nHOLCF uses a different logic than Isabelle/HOL. (This mistaken belief<br>\nhas probably scared off more than a few potential HOLCF users.) HOLCF<br>\nis no more a distinct logic than are HOL-Word, HOL-Algebra,<br>\nHOL-Multivariate_Analysis, HOL-Nominal, or any of the other<br>\nseparately-compilable libraries bundled with Isabelle/HOL. I'd much<br>\nprefer having HOLCF referred to as a \"library\".</p>\n<p>Thanks!</p>\n<ul>\n<li>Brian</li>\n</ul>",
        "id": 294121873,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660840097
    },
    {
        "content": "<p>From: Tobias Nipkow &lt;<a href=\"mailto:nipkow@in.tum.de\">nipkow@in.tum.de</a>&gt;<br>\nHi Brian, that was my doing, I slipped that into Joachim's abstract to<br>\ncall attention to the fact that he is using HOLCF. I agree with you and<br>\nfelt a little uneasy about the \"logic\" myself but used it because that's<br>\nthe traditional reading of the L in LCF (which I would indeed call a<br>\nlogic). But in HOLCF \"library\" is not a bad reading. Maybe even Library<br>\nof Continuous Functions? Will reword the abstract.</p>\n<p>Tobias</p>",
        "id": 294121901,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660840106
    },
    {
        "content": "<p>From: Brian Huffman &lt;<a href=\"mailto:brianh@cs.pdx.edu\">brianh@cs.pdx.edu</a>&gt;<br>\nI suppose it's not necessary to completely avoid the term \"logic\", and<br>\nwe probably don't need to retroactively change what any acronyms stand<br>\nfor. But it would be good to distinguish between \"logic\" and<br>\n\"formalization of a logic\".</p>\n<p>For example, HOLCF is a formalization <em>of</em> LCF <em>in</em> Isabelle/HOL. This<br>\nis really just like the situation with HOL-Nominal: While nominal<br>\nlogic is a real logic, HOL-Nominal is a formalization <em>of</em> nominal<br>\nlogic <em>in</em> Isabelle/HOL.</p>\n<p>It is a more obvious that HOL-Nominal is built in Isabelle/HOL, since<br>\n\"HOL-\" is a prefix of its name. (Also, it helps that HOL-Nominal<br>\nresides in a subdirectory of src/HOL in the distribution, instead of<br>\nbeing adjacent to ZF, FOL, etc. which really are distinct logics from<br>\nHOL.) Maybe the same things could help clear up the confusion with<br>\nHOLCF? Moving the HOLCF directory would be easy to do. But instead of<br>\njust \"HOLCF\", maybe it could be labeled as \"HOL-HOLCF\", or \"HOL-LCF\",<br>\nor \"HOL-CF\"? I suppose I shouldn't take a name-change lightly, though,<br>\nsince \"HOLCF\" is a recognized brand. Any suggestions?</p>\n<ul>\n<li>Brian</li>\n</ul>",
        "id": 294121909,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660840109
    },
    {
        "content": "<p>From: Jasmin Blanchette &lt;<a href=\"mailto:jasmin.blanchette@gmail.com\">jasmin.blanchette@gmail.com</a>&gt;<br>\nThe name HOLCF is nice and established, and the main issue is the confusing directory structure. Fixing the directory structure would yield \"~~/src/HOL/HOLCF\" and \"HOL-HOLCF\".</p>\n<p>Jasmin</p>",
        "id": 294121930,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660840115
    },
    {
        "content": "<p>From: Brian Huffman &lt;<a href=\"mailto:brianh@cs.pdx.edu\">brianh@cs.pdx.edu</a>&gt;<br>\nHaving the heap image named \"HOL-HOLCF\" sounds good to me; I will<br>\ncontinue to use just the name \"HOLCF\" in all the internal<br>\ndocumentation, though.</p>\n<p>I would also like to address the positioning of HOLCF in the online<br>\ndocumentation. Currently it is listed on each of these pages:</p>\n<p><a href=\"http://isabelle.in.tum.de/documentation.html\">http://isabelle.in.tum.de/documentation.html</a><br>\n<a href=\"http://isabelle.in.tum.de/dist/library/index.html\">http://isabelle.in.tum.de/dist/library/index.html</a></p>\n<p>where all of the other entries are really distinct logics. (Some are<br>\nbuilt as extensions of others - ZF extends FOL, for example - but none<br>\nare <em>conservative</em> extensions like HOLCF.)</p>\n<p>Really, HOLCF should be listed next to HOL-Nominal, etc. here:</p>\n<p><a href=\"http://isabelle.in.tum.de/dist/library/HOL/index.html\">http://isabelle.in.tum.de/dist/library/HOL/index.html</a></p>\n<ul>\n<li>Brian</li>\n</ul>",
        "id": 294121963,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660840128
    },
    {
        "content": "<p>From: Tobias Nipkow &lt;<a href=\"mailto:nipkow@in.tum.de\">nipkow@in.tum.de</a>&gt;<br>\nIt would also solve my problem that I tend to forget to test HOLCF after<br>\nchanging HOL.</p>\n<p>Tobias</p>\n<p>Jasmin Blanchette schrieb:</p>",
        "id": 294122003,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660840140
    },
    {
        "content": "<p>From: Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt;<br>\nThese categories are exactly correlated with the directory structure. <br>\nToplevel entries show up in the 2 upper index files, sub-sessions of these <br>\nin the lower one.</p>\n<p>Changes of the toplevel structure always require various manual adaptions <br>\nin administrative scripts, that might also take some time to stabilize. <br>\nWhatever is done should we well thought out, and happen not too shortly <br>\nbefore a release deadline.</p>\n<p>Makarius</p>",
        "id": 294122390,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660840238
    }
]