[
    {
        "content": "<p>From: Stephan Merz &lt;<a href=\"mailto:Stephan.Merz@loria.fr\">Stephan.Merz@loria.fr</a>&gt;<br>\nInria is a French research institute in computer science and applied mathematics with 8 research centers around France. It will recruit 20 junior researchers in 2013.</p>\n<p>The Inria Nancy - Grand Est research center invites applications for 3 tenured junior researcher positions (CR2). We are particularly interested in developing the following research topics:</p>\n<p>* Impact of Internet and computer security issues on everyday life<br>\n   * Image, robotics and instrumentation for health and assistance to dependent people<br>\n   * Coupling and integrating methods for advanced solving in numerical engineering<br>\n   * Knowledge modeling for the design of individualized educational software</p>\n<p>However, all outstanding applications will be considered and thoroughly evaluated. The application deadline is February 18, 2013.</p>\n<p>Research must be carried out within one of the existing research teams of Inria Nancy - Grand Est, see</p>\n<p><a href=\"http://www.inria.fr/en/research/research-teams/find-a-team/(center)/1166\">http://www.inria.fr/en/research/research-teams/find-a-team/(center)/1166</a> or<br>\n<a href=\"http://www.inria.fr/en/centre/nancy/research\">http://www.inria.fr/en/centre/nancy/research</a></p>\n<p>Candidates are expressly invited to contact the leader of the team in which they want to apply.</p>\n<p>Among the features of the competition:</p>\n<p>* Candidates must hold a PhD or an equivalent degree.<br>\n   * The competition being tough, one to two years of postdoctoral research experience is a significant plus.<br>\n   * Inria welcomes and encourages applications of foreign candidates. Proficiency in French is not required.<br>\n   * Inria promotes scientific excellence as well as software development and transfer of technology and knowledge.</p>\n<p>For more and to download application file, please visit</p>\n<p><a href=\"http://www.inria.fr/en/institute/recruitment/offers/young-graduate-scientist/competitive-selection-2013\">http://www.inria.fr/en/institute/recruitment/offers/young-graduate-scientist/competitive-selection-2013</a></p>\n<p>Candidates looking for additional information about the competition or Inria Nancy - Grand Est should contact</p>\n<p>Michael Rusinowitch &lt;<a href=\"mailto:michael.rusinowitch@inria.fr\">michael.rusinowitch@inria.fr</a>&gt; or Sylvain Petitjean &lt;<a href=\"mailto:sylvain.petitjean@inria.fr\">sylvain.petitjean@inria.fr</a>&gt;</p>\n<p>I will also be happy to answer informal inquiries, in particular for candidates wishing to join the VeriDis team (<a href=\"http://veridis.loria.fr/\">http://veridis.loria.fr/</a>).</p>\n<p>Best regards,</p>\n<p>Stephan Merz</p>",
        "id": 294229848,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660901892
    }
]