[
    {
        "content": "<p>From: Florian Haftmann &lt;<a href=\"mailto:florian.haftmann@informatik.tu-muenchen.de\">florian.haftmann@informatik.tu-muenchen.de</a>&gt;<br>\nHi Patrick,</p>\n<p>as a convenience, note that usually is it most appropriate to post<br>\ngeneric questions to the <a href=\"mailto:isabelle-users@cl.cam.ac.uk\">isabelle-users@cl.cam.ac.uk</a> mailing list.</p>\n<blockquote>\n<p>i'm coming with my mail to you because i have a problem and question<br>\nabout Isabelle prover.i've read you books and papers about Isabelle's<br>\nLogic HOL, and old Introduction to Isabelle, but i don't understand :</p>\n</blockquote>\n<p>You should definitely stay away from these two manuals ;-) which are<br>\nreally outdated;  the definite entrance point to get a little acquainted<br>\nwith HOL is the \"Tutorial on Isabelle/HOL\".</p>\n<blockquote>\n<p>1- About the installation, i've try to install Isabelle on my computer,<br>\nbut it is so difficult to me.It is ask me  \"Emacs package\" and when i<br>\ninstall Emacs package, it is look about Emacs version: i don't<br>\nundrestand why and how can i do to have a complete Isabelle's<br>\ninstallation? the OS on my computer is Ubuntu.</p>\n</blockquote>\n<p>Hmmm... the GNU emacs coming with Ubuntu should be suitable (AFAIK at<br>\nleast since version 8.04 -- you can find out your version using \"less<br>\n/etc/issue\" on the shell).  A \"sudo apt-get install emacs\" should do the<br>\njob.</p>\n<blockquote>\n<p>2- what is proofGeneral? Isawin? and what is their utility on Isabelle<br>\nprocess?</p>\n</blockquote>\n<p>ProofGeneral is an extension to emacs which provides a simple user<br>\ninterface to isabelle.  The other possibility is to work on a tty<br>\ncommand line interface; I'm almost sure this is not what you want...</p>\n<blockquote>\n<p>3- my next question is about HOL which is using in Isabelle.i don't know<br>\nif HOL is a Theorie or an logic using to developpe theories?</p>\n</blockquote>\n<p>HOL is short for Higher-Order Logic and is one of the calculi the<br>\nIsabelle Distribution is equipped with;  it is the most popular and of<br>\nIsabelle logics and sometimes even used synonymously, but be aware that<br>\nthere are other implementations of HOL around.</p>\n<p>To answer your question in particular: in Isabelle there is no<br>\ndifference between theories which \"implement\" a logic and theories which<br>\n\"build upon\" an implemented logic -- technically they are the same.  As<br>\nthe tutorial says, for beginners the way to start is to use the existing<br>\nprecompiled HOL session and base the first development on it:</p>\n<p>theory Foo<br>\n    imports Main<br>\n    begin</p>\n<p>...</p>\n<blockquote>\n<p>4-my last preocupation is aboutTactic and Tactical, Goal and Subgoal</p>\n</blockquote>\n<p>Dont't hesitate to ask further questions.</p>\n<p>Hope this helps<br>\n    Florian<br>\n<a href=\"/user_uploads/14278/tsF0K0NHDRe02TTqN9nX9_Nk/signature.asc\">signature.asc</a></p>",
        "id": 294079472,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660830161
    }
]