[
    {
        "content": "<p>From: Devrim Ünal &lt;<a href=\"mailto:devrimunal@gmail.com\">devrimunal@gmail.com</a>&gt;<br>\nHello,</p>\n<p>I'm new to the list so this is probably a well known fact but I could<br>\nnot find any information...<br>\nI want to run Isabelle over some theories developed by another<br>\nresearcher. I downloaded<br>\nthe theories but can not run them in Isabelle 2008.</p>\n<p>They are of the form</p>\n<p>theory Basic_Op_Rules = Basic_Inf_Rules :</p>\n<p>section {* Basic properies *}</p>\n<p>lemmas kbox = K_BOX[THEN temp_mp];</p>\n<p>lemmas kpbox = K_PBOX[THEN temp_mp];</p>\n<p>theorem box1 : \" H |- BOX(NEXTA A) -&gt; BOX(A -&gt; NEXTA A) \"<br>\napply(rule kbox);<br>\napply(rule MWeak);<br>\napply(rule Nec1);<br>\napply(rule t);<br>\ndone</p>\n<p>...</p>\n<p>Any comments on how I can run/convert them so that they work in Isabelle 2008?</p>\n<p>Thanks a lot.<br>\nDevrim</p>",
        "id": 294066526,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660825634
    },
    {
        "content": "<p>From: Tjark Weber &lt;<a href=\"mailto:tjark.weber@gmx.de\">tjark.weber@gmx.de</a>&gt;<br>\nDevrim,</p>\n<p>converting theories can be a daunting task (especially if they are very<br>\nold or very large).  You can try running \"isatool fixheaders\", but if<br>\nyou still get error messages afterward that you cannot fix easily, I<br>\nhave another suggestion: how about installing the version of Isabelle<br>\nthat these theories were originally developed for?  Old Isabelle<br>\nreleases are available from<br>\n<a href=\"http://www.cl.cam.ac.uk/research/hvg/Isabelle/download_past.html\">http://www.cl.cam.ac.uk/research/hvg/Isabelle/download_past.html</a></p>\n<p>Best,<br>\nTjark</p>",
        "id": 294066564,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660825647
    },
    {
        "content": "<p>From: Jeremy Dawson &lt;<a href=\"mailto:jeremy@rsise.anu.edu.au\">jeremy@rsise.anu.edu.au</a>&gt;<br>\nTjark Weber wrote:<br>\nThis is, at best, only a partial solution.  I've done a mass of work <br>\nrecently in Isabelle2005 because it's built on other stuff which works <br>\non Isabelle2005.  But what happens when I want to combine it with <br>\nsomeone else's theories which are written in Isabelle2007?  This looks <br>\nlike being a serious problem for me. </p>\n<p>On a similar theme, I have been recently helping a colleague who wants <br>\nto get some familiarity with Isabelle.  He found some tutorial material <br>\non the web somewhere, but it didn't work.  Why? Because it was written <br>\nbefore the changes made in Isabelle2007.  We had to revert to <br>\nIsabelle2005 to run it.</p>\n<p>Yesterday, he was trying to run a different lot of tutorial material <br>\nwhich he had found somewhere.  It didn't work either, because it used a <br>\nform of syntax I've never seen before.  I would guess it's Isabelle2008 <br>\n(which I've never used).  (It's primrec statement is totally different <br>\nfrom anything I've seen in the last 10 years).</p>\n<p>These issues seem to be capable of causing massive and unnecessary <br>\ndifficulties.</p>\n<p>Jeremy</p>",
        "id": 294066578,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660825653
    },
    {
        "content": "<p>From: Amine Chaieb &lt;<a href=\"mailto:ac638@cam.ac.uk\">ac638@cam.ac.uk</a>&gt;<br>\nIsabelle's documentation, including tutorials, is tested in every <br>\nrelease and even in every development snapshot. The documentation files <br>\nare generated from Isabelle, and they actually go through the Isabelle <br>\nKernel to check the proved theorems and the syntax etc...</p>\n<p>Amine.</p>\n<p>Jeremy Dawson wrote:</p>",
        "id": 294066611,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660825667
    },
    {
        "content": "<p>From: Jeremy Dawson &lt;<a href=\"mailto:jeremy@rsise.anu.edu.au\">jeremy@rsise.anu.edu.au</a>&gt;<br>\nAmine Chaieb wrote:<br>\nDear Amine,</p>\n<p>I'm not sure precisely what your point is, but let me assure I'm not <br>\ndenying that for each theory file my colleague found on the web, there <br>\nis a version of Isabelle in which it runs successfully.</p>\n<p>Nor was I asserting that either or both the theory files he found was <br>\ntaken out of an Isabelle release. </p>\n<p>Regards,</p>\n<p>Jeremy Dawson</p>\n<p>PS.  Anyway, what aspects of the documentation are actually tested?  I <br>\nnotice that the Isabelle2008 documentation refers to a significant <br>\nnumber of functions which don't seem to exist in the actual Isabelle2008 <br>\n(eg, context, update_thy, byev, findI, get_thm, brs), unless they're <br>\nhidden in some structure - but if that is so, the documentation should <br>\nsay so.</p>",
        "id": 294066700,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660825689
    }
]