[
    {
        "content": "<p>From: Peter Lammich &lt;<a href=\"mailto:lammich@in.tum.de\">lammich@in.tum.de</a>&gt;<br>\nHi,</p>\n<p>In Isabelle, each method also comes with a short documentation text. <br>\nIs there a way to attach such a documentation text to methods defined<br>\nvia Eisbach, or is the feature of having a short documentation text for<br>\nmethods considered deprecated?</p>",
        "id": 294652174,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661166548
    },
    {
        "content": "<p>From: Daniel Matichuk &lt;<a href=\"mailto:daniel.matichuk@nicta.com.au\">daniel.matichuk@nicta.com.au</a>&gt;<br>\nHi Peter,</p>\n<p>There is currently no way to add documentation text to Eisbach methods. I don't think the feature is considered deprecated, it was just overlooked for the first release.<br>\nI believe the canonical syntax for this is simply an optional string at the end of the declaration (e.g. named_theorems). I'll look into it.</p>\n<p>Regards,<br>\nDan</p>\n<hr>\n<p>The information in this e-mail may be confidential and subject to legal professional privilege and/or copyright. National ICT Australia Limited accepts no liability for any damage caused by this email or its attachments.</p>",
        "id": 294652352,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661166619
    },
    {
        "content": "<p>From: Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt;<br>\nI had a very brief look.  There is a syntax problem that prevents to <br>\nfollow the canonical form: the method body consists of \"args\" without <br>\nrequiring delimeters.  E.g. it is possible to define</p>\n<p>method a = rule refl</p>\n<p>A post-fix description does not fit into that model: it is unclear where <br>\nthe method expression ends and the description starts.</p>\n<p>Even a stricter method body that demands parentheses would render the <br>\nsyntax somewhat fragile, e.g. unclear errors with partial input.</p>\n<p>I am unsure about the practical relevance of that.  Descriptions are only <br>\navailable in rare situations, mainly historical accidents that were <br>\npropagated from the original attribute and method concepts.</p>\n<p>Makarius</p>",
        "id": 294664854,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661171359
    }
]