[
    {
        "content": "<p>From: Andrei Popescu &lt;<a href=\"mailto:andrei.h.popescu@gmail.com\">andrei.h.popescu@gmail.com</a>&gt;<br>\nCertified Programs and Proofs (CPP) is an international conference on<br>\npractical and theoretical topics in all areas that consider formal<br>\nverification and certification as an essential paradigm for their work. CPP<br>\nspans areas of computer science, mathematics, logic, and education.</p>\n<p>CPP 2021 will be held on 18-19 January 2021 and will be co-located with<br>\nPOPL 2021. CPP 2021 is sponsored by ACM SIGPLAN, in cooperation with ACM<br>\nSIGLOG.</p>\n<p>NEWS</p>\n<ul>\n<li>\n<p>Due to the COVID-19 situation, it is currently uncertain whether CPP 2021<br>\nwill be a physical conference in Copenhagen, Denmark or a virtual one.</p>\n</li>\n<li>\n<p>The submission deadline is one month earlier than usual.</p>\n</li>\n</ul>\n<p>IMPORTANT DATES</p>\n<ul>\n<li>\n<p>Abstract Deadline: 16 September 2020 at 23:59 AoE (UTC-12h)</p>\n</li>\n<li>\n<p>Paper Submission Deadline: 22 September 2020 at 23:59 AoE (UTC-12h)</p>\n</li>\n<li>\n<p>Notification (tentative): 19 November 2020</p>\n</li>\n<li>\n<p>Camera Ready Deadline (tentative): 10 December 2020</p>\n</li>\n<li>\n<p>Conference: 18-19 January 2021</p>\n</li>\n</ul>\n<p>Deadlines expire at the end of the day, anywhere on earth. Abstract and<br>\nsubmission deadlines are strict and there will be no extensions.</p>\n<p>TOPICS OF INTEREST</p>\n<p>We welcome submissions in research areas related to formal certification of<br>\nprograms and proofs. The following is a non-exhaustive list of topics of<br>\ninterest to CPP:</p>\n<ul>\n<li>\n<p>certified or certifying programming, compilation, linking, OS kernels,<br>\nruntime systems, security monitors, and hardware;</p>\n</li>\n<li>\n<p>certified mathematical libraries and mathematical theorems;</p>\n</li>\n<li>\n<p>proof assistants (e.g, ACL2, Agda, Coq, Dafny, F*, HOL4, HOL Light,<br>\nIdris, Isabelle, Lean, Mizar, Nuprl, PVS, etc);</p>\n</li>\n<li>\n<p>new languages and tools for certified programming;</p>\n</li>\n<li>\n<p>program analysis, program verification, and program synthesis;</p>\n</li>\n<li>\n<p>program logics, type systems, and semantics for certified code;</p>\n</li>\n<li>\n<p>logics for certifying concurrent and distributed systems;</p>\n</li>\n<li>\n<p>mechanized metatheory, formalized programming language semantics, and<br>\nlogical frameworks;</p>\n</li>\n<li>\n<p>higher-order logics, dependent type theory, proof theory, logical<br>\nsystems, separation logics, and logics for security;</p>\n</li>\n<li>\n<p>verification of correctness and security properties;</p>\n</li>\n<li>\n<p>formally verified blockchains and smart contracts;</p>\n</li>\n<li>\n<p>certificates for decision procedures, including linear algebra,<br>\npolynomial systems, SAT, SMT, and unification in algebras of interest;</p>\n</li>\n<li>\n<p>certificates for semi-decision procedures, including equality,<br>\nfirst-order logic, and higher-order unification;</p>\n</li>\n<li>\n<p>certificates for program termination;</p>\n</li>\n<li>\n<p>formal models of computation;</p>\n</li>\n<li>\n<p>mechanized (un)decidability and computational complexity proofs;</p>\n</li>\n<li>\n<p>formally certified methods for induction and coinduction;</p>\n</li>\n<li>\n<p>integration of interactive and automated provers;</p>\n</li>\n<li>\n<p>logical foundations of proof assistants;</p>\n</li>\n<li>\n<p>applications of AI and machine learning to formal certification;</p>\n</li>\n<li>\n<p>user interfaces for proof assistants and theorem provers;</p>\n</li>\n<li>\n<p>teaching mathematics and computer science with proof assistants.</p>\n</li>\n</ul>\n<p>SUBMISSION GUIDELINES</p>\n<p>Prior to the paper submission deadline, the authors should upload their<br>\nanonymized paper in PDF format through the HotCRP system at</p>\n<p><a href=\"https://cpp2021.hotcrp.com\">https://cpp2021.hotcrp.com</a></p>\n<p>The submissions must be written in English and provide sufficient detail to<br>\nallow the program committee to assess the merits of the contribution. They<br>\nmust be formatted following the ACM SIGPLAN Proceedings format using the<br>\nacmart style with the sigplan option, which provides a two-column style,<br>\nusing 10 point font for the main text, and a header for double blind review<br>\nsubmission, i.e.,</p>\n<p>\\documentclass[sigplan,10pt,anonymous,review]{acmart}\\settopmatter{printfolios=true,printccs=false,printacmref=false}</p>\n<p>The submitted papers should not exceed 12 pages, including tables and<br>\nfigures, but excluding bibliography and clearly marked appendices. The<br>\npapers should be self-contained without the appendices. Shorter papers are<br>\nwelcome and will be given equal consideration. Submissions not conforming<br>\nto the requirements concerning format and maximum length may be rejected<br>\nwithout further consideration.</p>\n<p>CPP 2021 will employ a lightweight double-blind reviewing process. To<br>\nfacilitate this, the submissions must adhere to two rules:</p>\n<p>(1) author names and institutions must be omitted, and</p>\n<p>(2) references to authors’ own related work should be in the third person<br>\n(e.g., not \"We build on our previous work ...\" but rather \"We build on the<br>\nwork of ...\").</p>\n<p>The purpose of this process is to help the PC and external reviewers come<br>\nto an initial judgment about the paper without bias, not to make it<br>\nimpossible for them to discover the authors if they were to try. Nothing<br>\nshould be done in the name of anonymity that weakens the submission or<br>\nmakes the job of reviewing it more difficult. In particular, important<br>\nbackground references should not be omitted or anonymized. In addition,<br>\nauthors are free to disseminate their ideas or draft versions of their<br>\npapers as usual. For example, authors may post drafts of their papers on<br>\nthe web or give talks on their research ideas. POPL has answers to<br>\nfrequently asked questions addressing many common concerns:<br>\n<a href=\"https://popl20.sigplan.org/track/POPL-2020-Research-Papers#Submission-and-Reviewing-FAQ\">https://popl20.sigplan.org/track/POPL-2020-Research-Papers#Submission-and-Reviewing-FAQ</a></p>\n<p>We encourage the authors to provide any supplementary material that is<br>\nrequired to support the claims made in the paper, such as proof scripts or<br>\nexperimental data. This material must be uploaded at submission time, as an<br>\narchive, not via a URL. Two forms of supplementary material may be<br>\nsubmitted:</p>\n<p>(1) Anonymous supplementary material is made available to the reviewers<br>\nbefore they submit their first-draft reviews.</p>\n<p>(2) Non-anonymous supplementary material is made available to the reviewers<br>\nafter they have submitted their first-draft reviews and have learned the<br>\nidentity of the authors.</p>\n<p>Please use anonymous supplementary material whenever possible, so that it<br>\ncan be taken into account from the beginning of the reviewing process.</p>\n<p>The submitted papers must adhere to the SIGPLAN Republication Policy (<br>\n<a href=\"https://www.sigplan.org/Resources/Policies/Republication/\">https://www.sigplan.org/Resources/Policies/Republication/</a>) and the ACM<br>\nPolicy on Plagiarism (<a href=\"https://www.acm.org/publications/policies/plagiarism\">https://www.acm.org/publications/policies/plagiarism</a>).<br>\nConcurrent submissions to other conferences, journals, workshops with<br>\nproceedings, or similar forums of publication are not allowed. The PC<br>\nchairs should be informed of closely related work submitted to a conference<br>\nor journal in advance of submission. One author of each accepted paper is<br>\nexpected to present it at the (possibly virtual) conference.</p>\n<p>PUBLICATION, COPYRIGHT AND OPEN ACCESS</p>\n<p>The CPP proceedings will be published by the ACM, and authors of accepted<br>\npapers will be required to choose one of the following publication options:</p>\n<p>(1) Author retains copyright of the work and grants ACM a non-exclusive<br>\npermission-to-publish license and, optionally, licenses the work under a<br>\nCreative Commons license.</p>\n<p>(2) Author retains copyright of the work and grants ACM an exclusive<br>\npermission-to-publish license.</p>\n<p>(3) Author transfers copyright of the work to ACM.</p>\n<p>For authors who can afford it, we recommend option (1), which will make the<br>\npaper Gold Open Access, and also encourage such authors to license their<br>\nwork under the CC-BY license. ACM will charge you an article processing fee<br>\nfor this option (currently, US$700), which you have to pay directly with<br>\nthe ACM.</p>\n<p>For everyone else, we recommend option (2), which is free and allows you to<br>\nachieve Green Open Access, by uploading a preprint of your paper to a<br>\nrepository that guarantees permanent archival such as arXiv or HAL. This is<br>\nanyway a good idea for timely dissemination even if you chose option 1.<br>\nEnsuring timely dissemination is particularly important for this edition,<br>\nsince, because of the very tight schedule, the official proceedings might<br>\nnot be available in time for CPP.</p>\n<p>The official CPP 2021 proceedings will also be available via SIGPLAN<br>\nOpenTOC (<a href=\"http://www.sigplan.org/OpenTOC/#cpp\">http://www.sigplan.org/OpenTOC/#cpp</a>).</p>\n<p>For ACM’s take on this, see their Copyright Policy (<br>\n<a href=\"http://www.acm.org/publications/policies/copyright-policy\">http://www.acm.org/publications/policies/copyright-policy</a>) and Author<br>\nRights (<a href=\"http://authors.acm.org/main.html\">http://authors.acm.org/main.html</a>).</p>\n<p>PROGRAM COMMITTEE</p>\n<p>Cătălin Hriţcu, Inria Paris, France (co-chair)</p>\n<p>Andrei Popescu, Middlesex University London, UK (co-chair)</p>\n<p>Reynald Affeldt, National Institute of Advanced Industrial Science and<br>\nTechnology (AIST), Japan</p>\n<p>June Andronick, CSIRO's Data61 and UNSW, Australia</p>\n<p>Arthur Azevedo de Amorim, Carnegie Mellon University, USA</p>\n<p>Joachim Breitner, DFINITY Foundation, Germany</p>\n<p>Jesper Cockx, TU Delft, Netherlands</p>\n<p>Cyril Cohen, Université Côte d’Azur, Inria, France</p>\n<p>Nils Anders Danielsson, University of Gothenburg / Chalmers University of<br>\nTechnology, Sweden</p>\n<p>Brijesh Dongol, University of Surrey, UK</p>\n<p>Floris van Doorn, University of Pittsburgh, USA</p>\n<p>Yannick Forster, Saarland University, Germany</p>\n<p>Shilpi Goel, Centaur Technology, Inc., USA</p>\n<p>Chung-Kil Hur, Seoul National University, South Korea</p>\n<p>Moa Johansson, Chalmers University of Technology, Sweden</p>\n<p>Ekaterina Komendantskaya, Heriot-Watt University, UK</p>\n<p>Angeliki Koutsoukou-Argyraki, University of Cambridge, UK</p>\n<p>Robert Y. Lewis, Vrije Universiteit Amsterdam, Netherlands</p>\n<p>Hongjin Liang, Nanjing University, China</p>\n<p>Andreas Lochbihler, Digital Asset GmbH, Switzerland</p>\n<p>Petar Maksimović, Imperial College London, UK</p>\n<p>William Mansky, University of Illinois at Chicago, USA</p>\n<p>Anders Mörtberg, Stockholm University, Sweden</p>\n<p>Sam Owre, SRI International, USA</p>\n<p>Karl Palmskog, KTH Royal Institute of Technology, Sweden</p>\n<p>Johannes Åman Pohjola, CSIRO's Data61 / University of New South Wales,<br>\nAustralia</p>\n<p>Damien Pous, CNRS, ENS Lyon, France</p>\n<p>Tahina Ramananandro, Microsoft Research, USA</p>\n<p>Ilya Sergey, Yale-NUS College and National University of Singapore,<br>\nSingapore</p>\n<p>Natarajan Shankar, SRI International, USA</p>\n<p>Kathrin Stark, Princeton University, USA</p>\n<p>René Thiemann, University of Innsbruck, Austria</p>\n<p>Amin Timany, Aarhus University, Denmark</p>\n<p>Josef Urban, Czech Technical University in Prague, Czech Republic</p>\n<p>Christoph Weidenbach, MPI-INF, Germany</p>\n<p>Freek Wiedijk, R<br>\n[message truncated]</p>",
        "id": 294827095,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661244964
    }
]