[
    {
        "content": "<p>From: Dale Miller &lt;<a href=\"mailto:dale@lix.polytechnique.fr\">dale@lix.polytechnique.fr</a>&gt;<br>\nTwo postdoctoral positions and two PhD student positions are available<br>\nwithin the LIX laboratory of Ecole Polytechnique.  These positions,<br>\nwhich are supported by the ERC Advanced Grant ProofCert, are offered<br>\nby the Parsifal research team at INRIA-Saclay.</p>\n<p>The scientific goal of ProofCert is to design a framework for proof<br>\ncertificates that can capture the proof evidence within all major<br>\ntheorem provers while also being checkable by a simple, declarative<br>\nproof checker.  We are looking for people with a range of interests<br>\nand expertise, ranging from proof theory, linear logic, and the<br>\nlambda-calculus to automated deduction and logic and functional<br>\nprogramming.</p>\n<p>If you are interested in a PhD position, submit a</p>\n<p>- cover letter with your CV,<br>\n  - pdf files (or links) to material you have written, and<br>\n  - names of 2-3 people willing to write a recommendation letter for you.</p>\n<p>If you are interested in a postdoctoral position, submit a</p>\n<p>- cover letter with (links to) your CV and publication list.<br>\n    Additional material, such as letters of recommendation, will be<br>\n    requested as necessary.</p>\n<p>- Candidates who do not have a PhD at the time of their application<br>\n    should provide their planned defense date and the composition of<br>\n    the thesis committee.</p>\n<p>All inquiries and application material should be sent to Dale Miller<br>\n(dale.miller at <a href=\"http://inria.fr\">inria.fr</a>).  We hope to have positions start in October<br>\n2014 but there is some flexibility with the exact start dates.</p>\n<p>We plan to make decisions on these position as early as April 21, 2014<br>\nand will continue until the positions are filled.</p>\n<p>For more information about ProofCert, Parsifal, and LIX, see<br>\n<a href=\"http://team.inria.fr/parsifal/\">http://team.inria.fr/parsifal/</a>.</p>",
        "id": 294271215,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660917305
    }
]