[
    {
        "content": "<p>From: Peter Lammich &lt;<a href=\"mailto:lammich@in.tum.de\">lammich@in.tum.de</a>&gt;<br>\nHi,</p>\n<p>induction on custom data types may still produce constants like<br>\nBasic_BNFs.snds, and these have no default simplifier setup. <br>\n(I reported this behaviour to Dmitry privately some time ago, and just<br>\nstumbled over it accidentally, hoping it would long be fixed)</p>\n<p>Things like thm Basic_BNFs.snds.simp should be in the default simpset,<br>\nor rules like <br>\n\"Basic_BNFs.snds (n, T) = {T}\"</p>",
        "id": 294662705,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661170536
    },
    {
        "content": "<p>From: Dmitriy Traytel &lt;<a href=\"mailto:traytel@inf.ethz.ch\">traytel@inf.ethz.ch</a>&gt;<br>\nHi Peter,</p>\n<p>Basic_BNFs.snds is a set function for products, and therefore it naturally (i.e. like for any other type) occurs in induction rules whenever the user write the product types in a datatype declaration explicitly (as opposed to using multiple constructor arguments). </p>\n<p>But indeed there should be simp rules. The rules are in principle there:</p>\n<p>thm prod_set_simps<br>\nthm sum_set_simps</p>\n<p>However, we (Jasmin and me) have always been very conservative about default rule. I’m pretty sure there are more such “safe\" rules that are not registered by default.</p>\n<p>The attached patch, which currently runs on the testboard (<a href=\"https://ci.isabelle.systems/jenkins/job/isabelle-testboard-makeall/53/\">https://ci.isabelle.systems/jenkins/job/isabelle-testboard-makeall/53/</a>), makes them simp rules. However, with the testboard still not testing the AFP and isatest testing isabelle-release, we are in the unfortunate situation that it is not possible to test the AFP, unless we do it on our own machines. I currently do not have the hardware at hand to build the big guys from the AFP, although I have good hope that the patch does not break anything. If somebody can confirm that, than we could push it (but it is not a very important thing, since it is easy to add simp rules locally).</p>\n<p>Dmitriy<br>\n<a href=\"/user_uploads/14278/IlXyatF58S8ziQic-tAFJKHw/prod_sum_set_simps.patch\">prod_sum_set_simps.patch</a></p>",
        "id": 294662822,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661170567
    }
]