[
    {
        "content": "<p>From: Freek Wiedijk &lt;<a href=\"mailto:freek@cs.ru.nl\">freek@cs.ru.nl</a>&gt;<br>\nCall for Papers<br>\n ACL2 2011: 10th International Workshop on the ACL2 Theorem Prover<br>\n                          and Its Applications<br>\n             3-4 November 2011, Austin, TX, USA<br>\n<a href=\"http://www.cs.ru.nl/~julien/acl2-11/\">http://www.cs.ru.nl/~julien/acl2-11/</a></p>\n<p>-----</p>\n<p>Important dates</p>\n<hr>\n<p>Abstract submission: 13 June2011<br>\nPaper submission: 20 June 2011<br>\nAuthor notification: 25 July 2011<br>\nFinal version: 02 September 2011</p>\n<p>Scope of the workshop</p>\n<hr>\n<p>ACL2 2011 is a major forum for the users of the ACL2 theorem proving<br>\nsystem to present research related to the ACL2 theorem prover and its<br>\napplications. ACL2 2011 is the tenth in the series of workshops, occurring<br>\nat approximately 18-month intervals. ACL2 is a state-of-the-art automated<br>\nreasoning system, the latest in the Boyer-Moore family of theorem provers,<br>\nfor which its authors received the 2005 ACM Software Systems Award.<br>\nACL2 2011 is planned as a two-day workshop to be held in Austin, TX, USA,<br>\non 3-4 November 2011. ACL2 2011 is affiliated with FMCAD 2011, the<br>\neleventh International Conference on Formal Methods in Computer Aided<br>\nDesign (<a href=\"http://www.cs.utexas.edu/users/ragerdl/fmcad11/\">http://www.cs.utexas.edu/users/ragerdl/fmcad11/</a>). In addition to paper<br>\npresentations, ACL2 2011 is anticipated to include several rump sessions<br>\ndiscussing ongoing research. We invite submission of papers on any topic<br>\nrelated to ACL2 and its applications. We strongly encourage the participation<br>\nof users of other theorem provers and researchers and practitioners interested<br>\nin theorem proving technology.</p>\n<p>Paper categories</p>\n<hr>\n<p>Papers presented at the workshop will be assigned to one of the following<br>\ncategories. At the time of submission, please indicate to which category you<br>\nthink your paper belongs. If you are not sure about the category for your<br>\npaper, simply submit the paper to the \"Other\" category.</p>\n<p><strong> Wizard spells </strong> (new)</p>\n<p>Let the wizards reveal their spells!  Wizard spell papers must present<br>\ndetailed proof techniques. They illustrate the use of ACL2 features, general<br>\nproof patterns, and advanced proof strategies. The objectives are to help<br>\nnew users, to share the expertise of ACL2 \"power users\", and hopefully to inspire<br>\nand help other users.</p>\n<p><strong> Applications </strong></p>\n<p>Applications have played an important role in the development of ACL2.  ACL2<br>\n2011 welcomes papers reporting about user experiences in hardware and software<br>\nverification, formalization of mathematics, teaching, but also in emerging or<br>\nnovel areas.</p>\n<p><strong> What's new ? </strong></p>\n<p>Papers of this category will present updates about the ACL2 systems and related<br>\nsystems, like ACL2s, ACL2(r) or ACL2(h). Papers may present new system capabilities,<br>\nfeatures, or interfaces.</p>\n<p><strong> Other </strong></p>\n<p>All papers that do not fit in any of the above categories belong to this category.</p>\n<p><strong> Short and long papers </strong></p>\n<p>In all categories, ACL2 2011 welcomes long (10 pages) and short (4 pages) papers.</p>\n<p>Paper submission</p>\n<hr>\n<p>Submissions must be made electronically in PDF format through Easy Chair.<br>\nThe corresponding webpage can be found on the ACL2 2011 website.<br>\nSubmissions must use ACM SIG Proceedings format with letter-size paper<br>\n(see <a href=\"http://www.acm.org/sigs/pubs/proceed/template.html\">http://www.acm.org/sigs/pubs/proceed/template.html</a>). The<br>\nproceedings are expected to be published in the ACM Digital Library (pending).<br>\nAuthors may assume that the audience has a working knowledge of ACL2's<br>\nsyntax, basic commands, and modeling techniques. Papers should contain a<br>\nshort abstract of about 150 words, clearly stating the contribution of the<br>\nsubmission. Papers should be self-contained, but we strongly encourage<br>\nauthors to follow the tradition (where applicable) of providing ACL2 \"books\",<br>\nor script files, with instructions for their execution. For accepted papers, these<br>\nbooks will be mirrored from the ACL2 Home Page and included in the future<br>\nACL2 distributions. At least one author of each accepted paper will be required<br>\nto register for the workshop and present the paper. Authors of accepted papers<br>\nare expected to present their papers at the conference and will be required to<br>\nsign copyright release forms. All submissions must be written in English.</p>\n<p>Important dates AOE (Anywhere On Earth)</p>\n<hr>\n<p>Abstract Submission: 13 June 2011<br>\nPaper Submission: 20 June 2011<br>\nAuthor Notification: 25 July 2011<br>\nFinal Version: 02 September 2011<br>\nWorkshop:  03-04 November 2011</p>\n<p>Web page</p>\n<hr>\n<p><a href=\"http://www.cs.ru.nl/~julien/acl2-11/\">http://www.cs.ru.nl/~julien/acl2-11/</a></p>\n<p>Conference co-chairs</p>\n<hr>\n<p>David S. Hardin (Rockwell Collins)<br>\nJulien Schmaltz (Open University of the Netherlands)</p>\n<p>Program Committee</p>\n<hr>\n<p>John Cowles  (Univ. Wyoming, USA)<br>\nMike Gordon (Cambridge Univ., UK)<br>\nDavid Greve (Rockwell Collins, USA)<br>\nDavid Hardin (Rockwell Collins, USA)<br>\nWarren Hunt (UT Austin, USA)<br>\nMatt Kaufmann (UT Austin, USA)<br>\nPanagiotis Manolios (Northeastern Univ., USA)<br>\nFrancisco-Jesus Martin-Mateos (Univ. of Sevilla, Spain)<br>\nJohn Matthews (Galois, USA)<br>\nCesar Munoz (NASA, USA)<br>\nRex Page  (Univ. of Oklahoma, USA)<br>\nLaurence Pierre  (TIMA Labs., France)<br>\nSandip Ray (UT Austin, USA)<br>\nDavid Russinoff (AMD, USA)<br>\nJun Sawada (IBM, USA)<br>\nJulien Schmaltz (Open Universiteit, The Netherlands)<br>\nNatarajan Shankar (SRI, USA)<br>\nSol Swords (Centaur, USA)<br>\nFreek Wiedijk (Radboud Univ. Nijmegen, The Netherlands)</p>",
        "id": 294136110,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660844384
    }
]