[
    {
        "content": "<p>From: Esseger &lt;<a href=\"mailto:esseger@free.fr\">esseger@free.fr</a>&gt;<br>\nI am having a problem with sublocales as follows.</p>\n<p>Suppose I have a locale AAA (with two parameters M and T), in which I <br>\ndefined a lot of objects. I have proved that AAA is a sublocale of a <br>\nlocale BBB. I am proving a theorem in AAA. During the proof, I construct <br>\ntwo objects M2 and T2, and I can prove \"AAA M2 T2\". Then, I would like <br>\nto apply to M2 and T2 a theorem of BBB. I tried two approaches:</p>\n<p>1) interpret AAA M2 T2</p>\n<p>to get all the theorems of AAA and BBB for M2 T2. However, there are a <br>\nlot of name clashes, between all the objects already defined in the <br>\nambient AAA M T, and the new AAA M2 T2, so this command is rejected.</p>\n<p>2) have \"BBB M2 T2\"</p>\n<p>If I could deduce this from \"AAA M2 T2\", then I could apply the theorems <br>\nof BBB to M2 T2. However, I did not find how to prove this using the <br>\nalready proved \"sublocale AAA \\subseteq BBB\"</p>\n<p>To get 1) to work, I would for instance need all objects in AAA M2 T2 to <br>\nbe prefixed automatically by something, say, to distinguish them from <br>\nAAA M T.</p>\n<p>To get 2) to work, I would need to have a lemma saying that \"AAA M2 T2 <br>\n==&gt; BBB M2 T2\". Is a lemma like this available somewhere once the <br>\nsublocale inclusion is proved?</p>\n<p>Anyway, any hints on better methods, or best practice, are welcome!</p>\n<p>Best,<br>\nEsseger</p>",
        "id": 294657592,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661168695
    },
    {
        "content": "<p>From: Andreas Lochbihler &lt;<a href=\"mailto:andreas.lochbihler@inf.ethz.ch\">andreas.lochbihler@inf.ethz.ch</a>&gt;<br>\nDear Esseger,</p>\n<ol>\n<li>Interpretations can be given name prefixes to avoid clashes. For example,</li>\n</ol>\n<p>interpretation prefix!: AAA M2 T2</p>\n<ol start=\"2\">\n<li>Unfortunately, the sublocale command does not export the rule for showing the locale <br>\npredicate of superlocales. Consequently, I recommend to first prove sublocale proof <br>\nobligation in a lemma and then use the lemma for discharging the goal in the sublocale <br>\ncommand. Here's an example:</li>\n</ol>\n<p>context AAA begin<br>\nlemma BBB: \"BBB M T\" &lt;proof&gt;<br>\nsublocale BBB M T by(rule BBB)<br>\nend</p>\n<p>Hope this helps,<br>\nAndreas</p>",
        "id": 294657643,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661168707
    },
    {
        "content": "<p>From: Esseger &lt;<a href=\"mailto:esseger@free.fr\">esseger@free.fr</a>&gt;<br>\nLe 14/10/2015 08:20, Andreas Lochbihler a écrit :</p>\n<blockquote>\n<p>Dear Esseger,</p>\n<ol>\n<li>Interpretations can be given name prefixes to avoid clashes. For<br>\nexample,</li>\n</ol>\n<p>interpretation prefix!: AAA M2 T2</p>\n</blockquote>\n<p>That's exactly what I need, thanks a lot.</p>\n<blockquote>\n<ol start=\"2\">\n<li>Unfortunately, the sublocale command does not export the rule for<br>\nshowing the locale predicate of superlocales. Consequently, I recommend<br>\nto first prove sublocale proof obligation in a lemma and then use the<br>\nlemma for discharging the goal in the sublocale command. Here's an example:</li>\n</ol>\n<p>context AAA begin<br>\nlemma BBB: \"BBB M T\" &lt;proof&gt;<br>\nsublocale BBB M T by(rule BBB)<br>\nend</p>\n</blockquote>\n<p>This is what I was doing, but it was getting tedious as in my use case <br>\nthere is a chain of inclusions, so having a lemma for each inclusion was <br>\nreally not convenient.</p>\n<p>Best,<br>\nEsseger</p>",
        "id": 294657660,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661168713
    }
]