[
    {
        "content": "<p>From: Gudmund Grov &lt;<a href=\"mailto:ggrov@staffmail.ed.ac.uk\">ggrov@staffmail.ed.ac.uk</a>&gt;<br>\n--- apologies for multiple postings ---</p>\n<p>The mathematical reasoning research group in the School of Informatics at the University of Edinburgh <br>\nis advertising for a PhD funded by the EPSRC project \"AI4FM: Using AI to aid automation of proof search <br>\nin Formal Methods\". The proposed topic of the PhD is \"The Productive Use of Failure in Formal Methods\".</p>\n<p>** DESCRIPTION</p>\n<p>The task allocated to this PhD will be to analyse ways in which proof attempts fail and are subsequently repaired.<br>\nThis analysis will be realised in a generic, strategy language for describing and classifying common forms of failure<br>\nand repair. The strategy language will, in turn, be used, firstly, to describe how experts recover from failure and, <br>\nsecondly, to guide recovery during automated proof search of related proofs. Example failed proofs will be harvested <br>\nfrom (a) the data from the toolset of Rodin formal methods system, (b) the manual, expert proof attempts on source <br>\ntheorems and (c) failed applications to target theorems of proof strategies abstracted from manual expert proofs of<br>\nsource theorems. Examples of repaired proof attempts will be harvested from the expert's work on failures of both <br>\ntypes (b) and (c). This work will enhance the abilities of our prototype so it can benefit from initially failed proof <br>\nattempts as well as successful ones.</p>\n<p>** DEGREE OF DIFFICULTY </p>\n<p>A challenging project that requires mathematical sophistication, analytic skills and creativity in constructing the strategy language.</p>\n<p>** BACKGROUND NEEDED</p>\n<p>A background in mathematics, logic or formal methods is required to provide the necessary mathematical maturity to undertake this project.</p>\n<p>** CONTACT</p>\n<p>If you have any queries, please contact:</p>\n<ul>\n<li>Gudmund Grov: <a href=\"mailto:ggrov@inf.ed.ac.uk\">ggrov@inf.ed.ac.uk</a> , or</li>\n<li>Alan Bundy: <a href=\"mailto:bundy@inf.ed.ac.uk\">bundy@inf.ed.ac.uk</a>.</li>\n</ul>\n<p>Please use our Schools PhD application page (see below) for applications.</p>\n<p>** SOME LINKS</p>\n<ul>\n<li>\n<p>A description of the proposed PhD project: <br>\n<a href=\"http://wcms.inf.ed.ac.uk/pgrguide/prospectus/projects-container/the-productive-use-of-failure-in-formal-methods\">http://wcms.inf.ed.ac.uk/pgrguide/prospectus/projects-container/the-productive-use-of-failure-in-formal-methods</a></p>\n</li>\n<li>\n<p>The web page for the AI4FM project: <br>\n<a href=\"http://www.ai4fm.org/\">http://www.ai4fm.org/</a></p>\n</li>\n<li>\n<p>Our School's PhD application page: <br>\n<a href=\"http://www.inf.ed.ac.uk/postgraduate/phd.html\">http://www.inf.ed.ac.uk/postgraduate/phd.html</a></p>\n</li>\n</ul>\n<p>** IMPORTANT DATES</p>\n<p>There is no deadline for this application, but we do recommended candidates to apply as soon as possible since the position may<br>\nbe allocated without further notice.</p>\n<p>We are fairly flexible on the starting date, but would ideally like it to start between October 2010 and April 2011.</p>\n<p>** ABOUT THE RESEARCH INSTITUTION AND RESEARCH GROUP</p>\n<p>The Edinburgh School of Informatics obtained the highest volume of 4* activity in its unit of assessment in<br>\nRAE 2008. It contains world-class research groups in the areas of theoretical computer science, artificial<br>\nintelligence and cognitive science.</p>\n<p>The Mathematical Reasoning Group in the School of Informatics has been engaged on the computational<br>\nanalysis, development and application of mathematical reasoning processes and their interactions since the<br>\nmid 1970s (<a href=\"http://dream.inf.ed.ac.uk/\">http://dream.inf.ed.ac.uk/</a>). Its work is characterised by its unique blend of computational theory<br>\nwith artificial intelligence. It has pioneered work on proof planning, tactic learning, and ontology construction<br>\nand evolution.</p>",
        "id": 294108951,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660836144
    }
]