[
    {
        "content": "<p>From: Burkhart Wolff &lt;<a href=\"mailto:Burkhart.Wolff@lri.fr\">Burkhart.Wolff@lri.fr</a>&gt;<br>\nThe CNAM (Conservatoire National des Arts et Métiers) opens a position of<br>\n\"Maître de Conférences\" (associate professor) in Computer Science with<br>\nspecific reference to \"advanced programming techniques, software<br>\nengineering and formal methods\".  Research will be conducted within<br>\nteam CPR of the CEDRIC lab, while teaching will be carried out within<br>\nthe Computer Science Department.</p>\n<p>Fluency in French is required for the position (in particular,<br>\nteaching is in French). Moreover, in order to apply, the candidate must<br>\nbe \"qualified\". Information regarding the French Qualification<br>\nprocedure can be found on the GALAXIE web site:</p>\n<p><a href=\"https://www.galaxie.enseignementsup-recherche.gouv.fr/ensup/cand_qualification.htm\">https://www.galaxie.enseignementsup-recherche.gouv.fr/ensup/cand_qualification.htm</a></p>\n<p>For more information about the CEDRIC lab (and the CNAM institution):</p>\n<p><a href=\"http://cedric.cnam.fr\">http://cedric.cnam.fr</a></p>\n<p>The detailed announcement (in french) follows.</p>\n<hr>\n<p>Un poste de maître de conférences en informatique (section 27) est<br>\nouvert au concours au Cnam à Paris, avec affectation au laboratoire<br>\nCEDRIC (EA 4629).</p>\n<p>Voici le profil détaillé :</p>\n<ul>\n<li>Recherche</li>\n</ul>\n<p>Le candidat recruté sera intégré à l'équipe CPR du CEDRIC.</p>\n<p>La thématique de l'équipe CPR se situe principalement dans le<br>\ndomaine des méthodes dites « formelles » : les membres de l'équipe<br>\ndéveloppent des méthodes, techniques et outils pour produire des<br>\nsystèmes et des logiciels à haut degré de confiance en matière de<br>\nsûreté et de sécurité.</p>\n<p>Les méthodes formelles sont essentiellement appliquées à la<br>\nconception, au développement et à la vérification de systèmes<br>\ncritiques. Dans ce contexte, les domaines d'expertise de l'équipe CPR<br>\nconcernent les méthodes déductives (et par extension les assistants<br>\nde preuve), la sémantique des langages de programmation, les<br>\nsystèmes de types et les techniques de preuve de programme.</p>\n<p>Le recrutement devra donc en priorité renforcer un de ces domaines.<br>\nToutefois le poste est aussi ouvert à tout jeune chercheur pouvant<br>\ncontribuer à un des autres thèmes actuellement développés dans<br>\nl'équipe.</p>\n<ul>\n<li>Enseignement</li>\n</ul>\n<p>Le candidat devra s'intégrer à l'équipe ayant en charge les<br>\nenseignements fondamentaux et avancés en algorithmique,<br>\nprogrammation, informatique théorique, et autour des méthodes<br>\nformelles pour la vérification des logiciels.</p>\n<p>Il prendra part aux enseignements dans ces thèmes à tous les<br>\nniveaux, et notamment en premier cycle, et interviendra aussi dans des<br>\nUE avancées sur la sûreté de fonctionnement du Master Systèmes<br>\nEmbarqués, Mobiles et Sûrs. Il prendra en charge une partie des<br>\nresponsabilités administratives et/ou pédagogiques liées à ces<br>\nenseignements, en particulier dans le cadre ce Master.</p>\n<p>Le candidat aura une bonne connaissance théorique et pratique des<br>\nprincipaux paradigmes de programmation (fonctionnelle, impérative,<br>\nobjet) et saura manifester un intérêt pour les difficultés<br>\npédagogiques associées. Enfin, une première expérience dans<br>\nl'enseignement de la programmation avancée Java ou du génie logiciel<br>\n(plateforme J2EE, environnements de modélisation et programmation<br>\nintégrés, patrons, approche à base de composants, etc) sera très<br>\nappréciée.</p>\n<ul>\n<li>Contacts recherche et enseignement :</li>\n</ul>\n<p>Tristan Crolard &lt;<a href=\"mailto:tristan.crolard@cnam.fr\">tristan.crolard@cnam.fr</a>&gt; (responsable de l'équipe CPR)<br>\nPierre-Henri Cubaud &lt;<a href=\"mailto:pierre-henri.cubaud@cnam.fr\">pierre-henri.cubaud@cnam.fr</a>&gt; (directeur du CEDRIC)<br>\nIsabelle Wattiau &lt;<a href=\"mailto:isabelle.wattiau@cnam.fr\">isabelle.wattiau@cnam.fr</a>&gt; (directeur du département<br>\ninformatique).</p>",
        "id": 294669190,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661172871
    }
]