[
    {
        "content": "<p>From: Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt;<br>\nSecond CALL FOR PAPERS</p>\n<p>Special issue on Programming Languages and Mechanized Mathematics Systems</p>\n<p>Journal of Automated Reasoning</p>\n<p>[See HTML version at <a href=\"http://www.cas.mcmaster.ca/~carette/jplmms/cfp.html\">http://www.cas.mcmaster.ca/~carette/jplmms/cfp.html</a> ]</p>\n<p>Context</p>\n<p>This special issue is focused on the intersection of programming<br>\n   languages (PL) and mechanized mathematics systems (MMS). The latter<br>\n   category subsumes present-day computer algebra systems (CAS),<br>\n   interactive proof assistants (PA), and automated theorem provers (ATP),<br>\n   all heading towards fully integrated mechanized mathematical assistants<br>\n   that are expected to emerge eventually.</p>\n<p>The two subjects of PL and MMS meet in many interesting ways, in<br>\n   particular in the following main topics of this journal issue.</p>\n<p>* Dedicated input languages for MMS: covers all aspects of languages<br>\n       intended for the user to deploy or extend the system, both<br>\n       algorithmic and declarative ones. Typical examples are tactic<br>\n       definition languages such as Ltac in Coq, mathematical proof<br>\n       languages as in Mizar or Isar, or specialized programming languages<br>\n       built into CA systems. Of particular interest are the semantics of<br>\n       those languages, especially when current ones are untyped.</p>\n<p>* Mathematical modeling languages used for programming: covers the<br>\n       relation of logical descriptions vs. algorithmic content. For<br>\n       instance the logic of ACL2 extends a version of Lisp, that of Coq<br>\n       is close to Haskell, and some portions of HOL are similar to ML and<br>\n       Haskell, while Maple tries to do both simultaneously. Such<br>\n       mathematical languages offer rich specification capabilities, which<br>\n       are rarely available in regular programming languages. How can<br>\n       programming benefit from mathematical concepts, without limiting<br>\n       mathematics to the computational worldview?</p>\n<p>* Programming languages with mathematical specifications: covers<br>\n       advanced \"mathematical\" concepts in programming languages that<br>\n       improve the expressive power of functional specifications, type<br>\n       systems, module systems etc. Programming languages with dependent<br>\n       types are of particular interest here, as is intensionality vs<br>\n       extensionality.</p>\n<p>* Language elements for program verification: covers specific means<br>\n       built into a language to facilitate correctness proofs using MMS.<br>\n       For example, logical annotations within programs may be turned into<br>\n       verification conditions to be solved in a proof assistant<br>\n       eventually. How need MMS and PL to be improved to make this work<br>\n       conveniently and in a mathematically appealing way?</p>\n<p>These topics have been addressed in the PLMMS 2007<br>\n<a href=\"http://www.cas.mcmaster.ca/plmms07/\">http://www.cas.mcmaster.ca/plmms07/</a> and PLMMS 2008<br>\n<a href=\"http://events.cs.bham.ac.uk/cicm08/workshops/plmms/\">http://events.cs.bham.ac.uk/cicm08/workshops/plmms/</a> workshops<br>\n   (associated with Calculemus <a href=\"http://www.calculemus.net/\">http://www.calculemus.net/</a>). While the<br>\n   journal issue emerges from that community, submission is open to<br>\n   everyone interested in any of these topics!</p>\n<p>Submission</p>\n<p>Manuscripts should not have been previously published in archival<br>\n   journals nor have been submitted to, or be in consideration for, any<br>\n   journal or conference. Significantly revised and enhanced papers<br>\n   published in workshop or conference proceedings are welcome. All<br>\n   submissions will be reviewed according to scholarly standards for<br>\n   scientific journal publications. See also the general JAR submission<br>\n   policies.</p>\n<p>We suggest a page limit of approximately 25 pages, using the LaTeX<br>\n   macros ftp://ftp.springer.de/pub/tex/latex/svjour3/global/<br>\n   provided by Springer. Instead of using the Springer online<br>\n   submission system, please submit papers in PDF through EasyChair<br>\n<a href=\"http://www.easychair.org/conferences/?conf=jplmms2008\">http://www.easychair.org/conferences/?conf=jplmms2008</a></p>\n<p>Important dates</p>\n<p>* Submission deadline: 10th November 2008.<br>\n     * Notification: January 16th 2009.<br>\n     * Final versions: March 30th 2009.</p>\n<p>Editors of the special issue</p>\n<p>* Jacques Carette (McMaster University, Canada)<br>\n     * Makarius Wenzel (Technische Universitaet Muenchen, Germany)<br>\n     * Freek Wiedijk   (Radboud University Nijmegen, Netherlands)</p>",
        "id": 294067693,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660826021
    }
]