[
    {
        "content": "<p>From: Gopalan Nadathur &lt;<a href=\"mailto:gopalan@cs.umn.edu\">gopalan@cs.umn.edu</a>&gt;<br>\nPostdoctoral Opportunity at the University of Minnesota</p>\n<p>Applications are invited for a one-year postdoctoral position, possibly<br>\nextendable into a second year, at the University of Minnesota related to an<br>\nNSF-funded project entitled \"A Higher-Order Framework for Meta-Theoretic<br>\nReasoning.\" The position is available immediately and reviews of<br>\napplications will be conducted as they are received.</p>\n<p>The project within which the appointment is to be made concerns the further<br>\ndevelopment of a logic that incorporates a treatment of fixed-point<br>\ndefinitions and the enhancement of the capabilities of the Abella proof<br>\nassistant (see http:\\\\abella-prover.org) that is based on this logic. One<br>\nparticular extension to the underlying logic that is being investigated is<br>\nthe addition of predicate quantification. The research group is also<br>\ninterested in building into the Abella system the capability to reason<br>\nabout specifications written in linear logic and dependently typed lambda<br>\ncalculi, and in demonstrating the benefits of the system in tasks such as<br>\ncompiler verification.</p>\n<p>To be suitable for the position, the candidate should be broadly conversant<br>\nwith the areas of computational logic and programming languages and should<br>\nhave the mathematical and programming skills necessary for conducting<br>\nresearch in them. Prior exposure to a proof  assistant or logical framework<br>\nsuch as Coq, Isabelle or Abella, programming experience with a functional<br>\nlanguage such as OCaml, an understanding of proof theoretic treatments of<br>\naspects such as induction and co-induction, and familiarity with issues<br>\nrelated to proof search in sequent calculi and other similar logical<br>\nsystems would be needed for participating in the research at the<br>\nappropriate  level. For more details about the necessary background and<br>\npossible topics of research within the project, please feel free to contact<br>\nme (Gopalan Nadathur) via email at <a href=\"mailto:ngopalan@umn.edu\">ngopalan@umn.edu</a>.</p>\n<p>To view the official announcement for this position, please visit the URL<br>\n<a href=\"https://hr.myu.umn.edu/jobs/ext/330828\">https://hr.myu.umn.edu/jobs/ext/330828</a>.<br>\nThis link also provides details about how to apply and serves as the portal<br>\nfor applications. The application process will require you to submit a<br>\nletter indicating your interest, a current CV, one or two of your papers<br>\nbroadly related to the topics of research and the names and contact details<br>\nfor two references who might be contacted as part of the application review<br>\nprocess. Note that a prerequisite for employment is a doctoral degree in<br>\nComputer Science or closely related field.</p>",
        "id": 294757770,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661198269
    },
    {
        "content": "<p>From: Gopalan Nadathur &lt;<a href=\"mailto:gopalan@cs.umn.edu\">gopalan@cs.umn.edu</a>&gt;<br>\nPostdoctoral Opportunity at the University of Minnesota</p>\n<p>Applications are invited for a postdoctoral position at the University of<br>\nMinnesota related to an NSF-funded project entitled \"A Higher-Order<br>\nFramework for Meta-Theoretic Reasoning.\" The position is available<br>\nimmediately and is expected to be of duration of one to two years.<br>\nApplications will be reviewed and acted upon as soon as they are received.</p>\n<p>The project within which the appointment is to be made concerns the further<br>\ndevelopment of a proof environment for reasoning about relational<br>\nspecifications that supports the so-called higher-order abstract syntax<br>\napproach. A key component of this environment is the Abella proof assistant<br>\n(see <a href=\"http://abella-prover.org\">http://abella-prover.org</a>), which is based on a logic that incorporates<br>\na treatment of fixed-point definitions. One thrust for ongoing work is the<br>\nenhancement of the underlying logic, for example through the addition of<br>\npredicate quantification. The research group is also interested in building<br>\ninto the Abella system the capability to reason about specifications<br>\nwritten in linear logic and dependently typed lambda calculi, and in<br>\ninvestigating the benefits of the system in tasks such as compiler<br>\nverification.</p>\n<p>To participate successfully in the research outlined above, you would need<br>\nto be broadly conversant with the areas of computational logic and<br>\nprogramming languages and to have the mathematical and programming skills<br>\nnecessary for conducting original work in these areas. Prior exposure to a<br>\nproof  assistant or logical framework such as Coq, Isabelle or Abella,<br>\nprogramming experience with a functional language such as OCaml, an<br>\nunderstanding of proof theoretic treatments of aspects such as induction<br>\nand co-induction, and familiarity with issues related to proof search in<br>\nsequent calculi and other similar logical systems would help in engaging<br>\nimmediately with the research problems of interest.</p>\n<p>To view the official announcement for this position, please visit the URL<br>\n<a href=\"https://hr.myu.umn.edu/jobs/ext/330828\">https://hr.myu.umn.edu/jobs/ext/330828</a>.<br>\nThis site also provides details such as the required qualifications for the<br>\nposition and serves as the portal for applications. To complete an<br>\napplication, you would need to submit a letter indicating your interest in<br>\nthe position, a current CV, one or two papers broadly related to the topics<br>\nof research and the names and contact details of two people who are willing<br>\nto serve as your references in the review process.</p>\n<p>Please do not hesitate to contact me if you are interested in the position<br>\nbut would like answers prior to applying to questions related to matters<br>\nsuch as the expectations, possible projects, and the suitability of your<br>\nqualifications for the position. The best way to reach me would be via<br>\nemail sent to <a href=\"mailto:ngopalan@umn.edu\">ngopalan@umn.edu</a>.<br>\n-Gopalan Nadathur</p>",
        "id": 294763151,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661200617
    }
]