[
    {
        "content": "<p>From: Marta Kwiatkowska &lt;<a href=\"mailto:M.Z.Kwiatkowska@cs.bham.ac.uk\">M.Z.Kwiatkowska@cs.bham.ac.uk</a>&gt;<br>\n[Apologies for multiple mailing.]</p>\n<p>UNIVERSITY OF OXFORD</p>\n<p>Mathematical and Physical Sciences Division<br>\nOxford University Computing Laboratory</p>\n<p>in association with Magdalen College</p>\n<p><a href=\"http://web.comlab.ox.ac.uk/oucl/jobs/ul-magd.html\">http://web.comlab.ox.ac.uk/oucl/jobs/ul-magd.html</a></p>\n<p>UNIVERSITY LECTURESHIP IN COMPUTER SCIENCE<br>\nApplications are invited for a University Lectureship in Computer<br>\nScience. The successful candidate will also be appointed to a<br>\nSupernumerary non-stipendiary and non-tutorial Fellowship at Magdalen<br>\nCollege. The University salary will be on a scale up to £51,095 per<br>\nannum. Details of the Department, the College and further details of the<br>\nUniversity post are given in the Further Particulars.</p>\n<p>The lecturer will be a member of the Computing Laboratory, and will<br>\ncontribute to the activities of the Quantitative Analysis and<br>\nVerification group led by Professor Marta Kwiatkowska. The Department<br>\nwelcomes applications from any area of Automated Verification, but<br>\nparticularly encourages those whose research interests are concerned<br>\nwith theoretical foundations, implementation and application of<br>\nautomated verification techniques interpreted broadly, including model<br>\nchecking, software verification, mechanised reasoning, model checking<br>\nfor real-time and/or probabilistic systems, and quantitative analysis<br>\nmethods. The appointee will also be expected to have the ability to<br>\nteach effectively over a wide range of topics in the Computer Science<br>\nsyllabus at Oxford, not exclusively in the area of their research expertise.</p>\n<p>The closing date for applications is Friday 30th March 2007.</p>\n<p>For further information, including full details of the application<br>\nprocedure and selection criteria are given in the further particulars<br>\nbelow, which are also available via email request to <a href=\"mailto:qv-lect@comlab.ox.ac.uk\">qv-lect@comlab.ox.ac.uk</a></p>\n<p>Further particulars and Selection Criteria of the post in association<br>\nwith Magdalen College<br>\n(<a href=\"http://web.comlab.ox.ac.uk/oucl/jobs/ul-magd_fps.pdf\">http://web.comlab.ox.ac.uk/oucl/jobs/ul-magd_fps.pdf</a>)<br>\nOxford University is an Equal Opportunities Employer.</p>",
        "id": 294047458,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660817903
    }
]