[
    {
        "content": "<p>From: John Wickerson &lt;<a href=\"mailto:jpw48@cam.ac.uk\">jpw48@cam.ac.uk</a>&gt;<br>\nDear Isabelle,</p>\n<p>Suppose I want a datatype for finitely-branching trees. I might write something like this:</p>\n<p>datatype 'a mytree = Lf 'a | Br \"('a mytree) fset\"</p>\n<p>where fset is the type of finite sets (defined by quotienting lists up to permutations and duplications). This doesn't work, because fset is not a datatype. The usual way to handle this is to use lists instead of fsets, but then deciding the equivalence of trees is more complicated than just checking equality of terms.</p>\n<p>Does there exist a way of making datatypes such as mytree? Is anybody working on such a thing? I feel it would be rather useful. I'm imagining an extension to the datatype package that allows the user to provide their own proof that the datatype is admissible -- rather like the way inductive definitions can be annotated with monotonicity lemmas, or the way functions can be annotated with a custom proof of termination.</p>\n<p>Best wishes,<br>\nJohn</p>",
        "id": 294231721,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660902838
    },
    {
        "content": "<p>From: Jasmin Blanchette &lt;<a href=\"mailto:jasmin.blanchette@gmail.com\">jasmin.blanchette@gmail.com</a>&gt;<br>\nDear John,</p>\n<blockquote>\n<p>Suppose I want a datatype for finitely-branching trees. I might write something like this:</p>\n<p>datatype 'a mytree = Lf 'a | Br \"('a mytree) fset\"</p>\n<p>where fset is the type of finite sets (defined by quotienting lists up to permutations and duplications). This doesn't work, because fset is not a datatype. The usual way to handle this is to use lists instead of fsets, but then deciding the equivalence of trees is more complicated than just checking equality of terms.</p>\n<p>Does there exist a way of making datatypes such as mytree?</p>\n</blockquote>\n<p>In the repository version of Isabelle, and in the forthcoming Isabelle2013 (expected to come out in February), there's a definitional package for defining such types. The \"BNF\" package (BNF = Bounded Natural Functor) provides a command called \"data\" that generates all the characteristic lemmas you would expect from \"datatype\". It works as you would expect:</p>\n<p>data 'a mytree = Lf 'a | Br \"('a mytree) fset\"</p>\n<p>The long-term goal (for Isabelle2015 maybe) is to replace the existing \"datatype\" command.</p>\n<blockquote>\n<p>Is anybody working on such a thing? I feel it would be rather useful. I'm imagining an extension to the datatype package that allows the user to provide their own proof that the datatype is admissible -- rather like the way inductive definitions can be annotated with monotonicity lemmas, or the way functions can be annotated with a custom proof of termination.</p>\n</blockquote>\n<p>Yes, this is exactly how the package work. You can register custom BNFs, as long as they have some properties; some type constructors (functors) are pre-registered, notably \"fset\"; and the \"data\" and \"codata\" commands introduce new inductive and coinductive datatypes (e.g. lazy lists) and registers them as BNFs. Another advantage of the BNF package is that it can be used within local contexts (e.g. locales).</p>\n<p>The following papers describe the package in more detail:</p>\n<p><a href=\"http://www21.in.tum.de/~blanchet/lics2012-codat.pdf\">http://www21.in.tum.de/~blanchet/lics2012-codat.pdf</a><br>\n<a href=\"http://www21.in.tum.de/~blanchet/codata_wit.pdf\">http://www21.in.tum.de/~blanchet/codata_wit.pdf</a></p>\n<p>Please let us [*] know if you have further questions. The package is brand new, and we'll happily help you get started with it.</p>\n<p>Regards,</p>\n<p>Jasmin</p>\n<p>[*] Dmitriy Traytel &lt;<a href=\"mailto:traytel@in.tum.de\">traytel@in.tum.de</a>&gt;, Andrei Popescu &lt;<a href=\"mailto:popescua@in.tum.de\">popescua@in.tum.de</a>&gt;, and me</p>",
        "id": 294231738,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660902842
    }
]