[
    {
        "content": "<p>From: Lawrence Paulson &lt;<a href=\"mailto:lp15@cam.ac.uk\">lp15@cam.ac.uk</a>&gt;<br>\nA trivial suggestion: The State panel should be docked to the bottom and not to the right.<br>\nLarry</p>",
        "id": 294661715,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661170151
    },
    {
        "content": "<p>From: Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt;<br>\nCan you provide reasons for that suggestion?</p>\n<p>Historically, I used to have main output at the bottom over many years, <br>\nbut various side-conditions have changed.  E.g. the 16x9 TV screen format <br>\nprovides a lot of unused space on the right (for proper text lines of max. <br>\n80-100 chars).  More and more Isabelle/jEdit users have switched to that <br>\narrangement for Output in recent years (with slighly decreased font size). <br>\nI've merely picked up this trends myself, and find it quite convenient.</p>\n<p>In Isabelle2016-RC1 the State panel takes that slot by default, and Output <br>\nat the bottom. Thus both panels can be open or closed indepedently.</p>\n<p>In any case, rearrangement of dockables is trivial in jEdit, and <br>\npersistent, too.</p>\n<p>Section 3.2 and 3.3 in <br>\n<a href=\"http://isabelle.in.tum.de/website-Isabelle2016-RC1/dist/Isabelle2016-RC1/doc/jedit.pdf\">http://isabelle.in.tum.de/website-Isabelle2016-RC1/dist/Isabelle2016-RC1/doc/jedit.pdf</a> <br>\nprovide a few more words on that topic, also some pictures: figure 3.3 and <br>\n3.4. (That is my ancient Mac Book Pro <em>without</em> 16x9 display.)</p>\n<p>Makarius</p>",
        "id": 294661748,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661170168
    },
    {
        "content": "<p>From: Lawrence Paulson &lt;<a href=\"mailto:lp15@cam.ac.uk\">lp15@cam.ac.uk</a>&gt;<br>\nThe obvious reason is that the output of the State panel needs a horizontal window. I imagine that most users will keep this window open all the time, and we can save them the trouble of having to re-dock it manually.</p>\n<p>Everybody has their own style, and I almost never display the Output panel, since error messages can easily be viewed right in the main panel.</p>\n<p>Larry</p>",
        "id": 294661795,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661170186
    },
    {
        "content": "<p>From: Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt;<br>\nWhat is the format and resolution of your display?</p>\n<p>Makarius</p>",
        "id": 294661901,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661170210
    },
    {
        "content": "<p>From: Lawrence Paulson &lt;<a href=\"mailto:lp15@cam.ac.uk\">lp15@cam.ac.uk</a>&gt;<br>\nI am thinking of my laptop, which I use for most proofs. It is a 15 inch MacBook Pro. The screen is big enough for a substantial main window and a column on the right, perfect for panels such as Documentation, Sidekick, Theories and the ever-useful Timing.</p>\n<p>With the latest models, the screen has very high resolution, but one can’t read microscopic fonts. Laptops are still widely used, I think.</p>\n<p>Larry</p>",
        "id": 294661947,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661170228
    },
    {
        "content": "<p>From: Jasmin Blanchette &lt;<a href=\"mailto:jasmin.blanchette@inria.fr\">jasmin.blanchette@inria.fr</a>&gt;<br>\nLarry wrote:</p>\n<blockquote>\n<p>With the latest models, the screen has very high resolution, but one can’t read microscopic fonts. Laptops are still widely used, I think.</p>\n</blockquote>\n<p>Irrespective of this, even on a station, I find that it's easier to move my eyes up and down than left and right.</p>\n<p>And when faced with a long goal, one surely wants to avoid wrapping as much as possible. This means taking the full screen width, not just half of it.</p>\n<p>I know some people who e.g. edit their LaTeX document on the left half of their screen and look at the result on the right. I don't like doing that, and for this reason I keep both windows superimposed and continuously switch between them.</p>\n<p>Jasmin</p>",
        "id": 294661958,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661170235
    },
    {
        "content": "<p>From: Lars Hupel &lt;<a href=\"mailto:hupel@in.tum.de\">hupel@in.tum.de</a>&gt;<br>\nI don't care so much about the defaults, but here's another data point<br>\nfrom my setup. I'm sympathetic for having state/output at the bottom.</p>\n<p>(On a dual monitor setup, I undock the output panel and use it full<br>\nscreen on the second monitor.)<br>\n<a href=\"/user_uploads/14278/dPRzFSYoW5WjErLMIrmIWWTU/Screenshot_20160119_122335.png\">Screenshot_20160119_122335.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/14278/dPRzFSYoW5WjErLMIrmIWWTU/Screenshot_20160119_122335.png\" title=\"Screenshot_20160119_122335.png\"><img src=\"/user_uploads/14278/dPRzFSYoW5WjErLMIrmIWWTU/Screenshot_20160119_122335.png\"></a></div>",
        "id": 294662008,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661170254
    },
    {
        "content": "<p>From: bnord &lt;<a href=\"mailto:bnord01@gmail.com\">bnord01@gmail.com</a>&gt;<br>\nI second both points, also the vertical alignment allows you to scroll <br>\nthe main buffer to a position where you have the relevant part of your <br>\nproof script only an inch away from the output, which is not possible in <br>\nthe horizontal alignment where you always have to move your eyes over <br>\nthe entire screen width.</p>\n<p>Best<br>\n   Benedikt</p>",
        "id": 294662024,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661170261
    },
    {
        "content": "<p>From: Tobias Nipkow &lt;<a href=\"mailto:nipkow@in.tum.de\">nipkow@in.tum.de</a>&gt;<br>\nOn 19/01/2016 12:24, bnord wrote:</p>\n<blockquote>\n<p>Am 19.01.16 um 12:15 schrieb Jasmin Blanchette:</p>\n<blockquote>\n<p>Larry wrote:</p>\n<blockquote>\n<p>With the latest models, the screen has very high resolution, but one can’t<br>\nread microscopic fonts. Laptops are still widely used, I think.<br>\nIrrespective of this, even on a station, I find that it's easier to move my<br>\neyes up and down than left and right.</p>\n</blockquote>\n<p>And when faced with a long goal, one surely wants to avoid wrapping as much as<br>\npossible. This means taking the full screen width, not just half of it.<br>\nI second both points, also the vertical alignment allows you to scroll the main<br>\nbuffer to a position where you have the relevant part of your proof script only<br>\nan inch away from the output, which is not possible in the horizontal alignment<br>\nwhere you always have to move your eyes over the entire screen width.</p>\n</blockquote>\n</blockquote>\n<p>This ability to align text in both buffers and compare it is what I find most <br>\nuseful.</p>\n<p>Tobias</p>\n<blockquote>\n<p>Best<br>\n   Benedikt</p>\n<p><a href=\"/user_uploads/14278/K5hZLx6JFR5rSt9RRP6S0Ise/smime.p7s\">smime.p7s</a></p>\n</blockquote>",
        "id": 294662066,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661170272
    },
    {
        "content": "<p>From: Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt;<br>\nWe are back to field one of the game.</p>\n<p>The most widely used Laptops (for more than 3 years) have a 16x9 TV <br>\nscreen.  The lines for that are far too wide for text, although people <br>\nsometimes mistake the TV format to produce unreadable 250 characters per <br>\nline.</p>\n<p>When used properly, a 16x9 display consists of two full-width text <br>\ndisplays side by side. This explains the position of the proof state panel <br>\n(and other important \"dynamic\" panels like \"Theories\" or \"Timing\").</p>\n<p>Nobody is forced to use that default.  It is just for people who don't <br>\nlook closely by themselves.</p>\n<p>Changing these things is rather trivial, and actually explained in the <br>\nIsabelle/jEdit manual (with an explicit reference to the jEdit <br>\ndocumentation).</p>\n<p>Now we are back to the more fundamental question if anybody reads <br>\ndocumentation at all. There should probably be also a video presentation.</p>\n<p>Makarius</p>",
        "id": 294662080,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661170278
    },
    {
        "content": "<p>From: bnord &lt;<a href=\"mailto:bnord01@gmail.com\">bnord01@gmail.com</a>&gt;<br>\nDear Makarius,</p>\n<p>the documentation is really well done and I relay appreciate the amount <br>\nof work you put into it!</p>\n<p>However the honest answer is probably that only a very small percentage <br>\nwill \"look into\" the documentation and an even smaller percentage of <br>\nthose people will actually \"read it\"t. This doesn't mean that the <br>\ndocumentation is bad or unnecessary, but we've all been educated to <br>\nexpect software (especially GUIs) to work intuitively and be able to get <br>\nit to do what we want by try and error and only refer to the <br>\ndocumentation if we really care and can't get it done otherwise, which, <br>\nfor most other software, leads to disappointment, because, if the <br>\ndeveloper didn't put effort into making things intuitive, he often also <br>\ndidn't put effort into documenting them.</p>\n<p>I personally dislike video presentations, because it's hard to figure <br>\nout whether they cover what you're interested in, without actually <br>\nwatching them and then they're often either too slow or too fast.</p>\n<p>Best<br>\n   Benedikt</p>",
        "id": 294662091,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661170286
    },
    {
        "content": "<p>From: Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt;<br>\nI know what you mean.</p>\n<p>I've actually read one (!) textbook about UI design: \"About Face 3\". It <br>\ntells many such stories.</p>\n<p>My own experience as someone hopping between the many UI frameworks of <br>\nLinux, Windows, Mac OS X: Intuitive is what you know already.  What you <br>\ndon't know is unintuitive.</p>\n<p>Confronted with funny GUI elements like the dockables in jEdit, I would <br>\nfirst try a single left click, a single right click, a double click, and <br>\nwatch carefully what happens.  On Linux and Windows this quickly exposes <br>\nthe dockable control menu (right click) to move it into a different <br>\ncorner or let it float.  So I guess it requires about 10 seconds to learn <br>\nthat trick.</p>\n<p>On Mac OS X: What is a right click? (My own OS X preferences enable all 3 <br>\nmouse buttons, but that is hardly a common default).</p>\n<p>Here we see a bias of the jEdit developers (and Java AWT/Swing) to <br>\n\"standard\" GUI behaviour of Windows (and imitations of the same in Linux).</p>\n<p>Makarius</p>",
        "id": 294662103,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661170290
    },
    {
        "content": "<p>From: Jasmin Blanchette &lt;<a href=\"mailto:jasmin.blanchette@inria.fr\">jasmin.blanchette@inria.fr</a>&gt;<br>\nMakarius wrote:</p>\n<blockquote>\n<p>Nobody is forced to use that default.  It is just for people who don't look closely by themselves.</p>\n<p>Changing these things is rather trivial, and actually explained in the Isabelle/jEdit manual (with an explicit reference to the jEdit documentation).</p>\n<p>Now we are back to the more fundamental question if anybody reads documentation at all.</p>\n</blockquote>\n<p>You asked a few emails ago:</p>\n<blockquote>\n<p>Can you provide reasons for that suggestion [changing the default position]?</p>\n</blockquote>\n<p>And now we give you reasons for changing the default (in Isabelle, not on our machines), and you tell us we should read the documentation. There is a disconnect between what you asked for, what you got from us, and how you reacted to it.</p>\n<p>I am not adamant about how Isabelle's default should be -- nobody seems to be on this list, as long as there is a way to override it.</p>\n<p>Jasmin</p>",
        "id": 294662115,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661170296
    },
    {
        "content": "<p>From: Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt;<br>\nI am not sure what I've actually got.</p>\n<p>Is there a problem for seasoned OS X users to guess how jEdit dockables <br>\nare moved around?  This is a plain question, not a rhetoric one. (I am not <br>\na seasoned OS X user, although I am occasionally running it for 10 years.)</p>\n<p>The point of the default arrangement is to make it work out-of-the box for <br>\nmost users, beginners and experts alike.  It is the result of the past 3 <br>\nyears looking closely what beginners and experts have, or could have.</p>\n<p>Makarius</p>",
        "id": 294662129,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661170302
    },
    {
        "content": "<p>From: Lawrence Paulson &lt;<a href=\"mailto:lp15@cam.ac.uk\">lp15@cam.ac.uk</a>&gt;<br>\nI would say it’s not about how to move things around, but how the defaults should be, especially since State is a new panel. As others have noted, putting it at the bottom has a number of advantages, and I can’t see any advantages of putting it at the right. The out-of-the-box defaults are pretty good, I think they could be even better.</p>\n<p>Larry</p>",
        "id": 294662139,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661170309
    },
    {
        "content": "<p>From: Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt;<br>\nIn this proposal, what is the canonical place for the Output dockable?</p>\n<p>Makarius</p>",
        "id": 294662170,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661170321
    },
    {
        "content": "<p>From: Lawrence Paulson &lt;<a href=\"mailto:lp15@cam.ac.uk\">lp15@cam.ac.uk</a>&gt;<br>\nI don’t mind, as I almost never use it. I use the red underlines to examine error messages. But personally I have it on the bottom as well.<br>\nLarry</p>",
        "id": 294662222,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661170327
    },
    {
        "content": "<p>From: bnord &lt;<a href=\"mailto:bnord01@gmail.com\">bnord01@gmail.com</a>&gt;<br>\nEven though I highly prefer having the state output at the bottom due to <br>\nthe previously stated reasons I would maybe consider not having it the <br>\ndefault for the following reason:<br>\nFor beginners visibility is more important than comfort.</p>\n<p>In the current (2015) default setting the output panel is conflicting <br>\nwith the Sledgehammer panel. I have observed students (which in my <br>\nexperience sadly rely a lot on sledgehammer) become oblivious of the <br>\nproof state and try to create proofs by just typing in stuff and running <br>\nsledgehammer.  They get completely lost when you tell them to look at <br>\ntheir proof state to and try to understand why things don't work.</p>\n<p>If the horizontal alignment helps to have all panels visible at all <br>\ntimes I'm in favour of having this the default as non-beginners can <br>\nstill change this to their desire.<br>\nIf the same can be achieved with the vertical alignment I'm in favour of <br>\nthis because it's more comfortable and puts the most important panel <br>\n(IMHO) at the most prominent place.</p>\n<p>Best<br>\n   Benedikt</p>",
        "id": 294662237,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661170334
    },
    {
        "content": "<p>From: Jasmin Blanchette &lt;<a href=\"mailto:jasmin.blanchette@inria.fr\">jasmin.blanchette@inria.fr</a>&gt;</p>\n<blockquote>\n<p>Is there a problem for seasoned OS X users to guess how jEdit dockables are moved around?  This is a plain question, not a rhetoric one. (I am not a seasoned OS X user, although I am occasionally running it for 10 years.)</p>\n</blockquote>\n<p>I've been using OS X exclusively since 2008 and I don't know how to move the State panel to the bottom. (I haven't read the docs either; I've enabled the \"Proof state\" feature to get the old school behavior.) I don't see any grip on the panel which I could use to move it around, so I don't know where to click (seriously). I should indicate that I'm using the Macish style whereby the jEdit menu bar is merged with the Mac menu bar.</p>\n<p>I don't use that many applications, but those I use (e.g., Preview, Skim, Apple Mail, iTunes, Safari, Keynotes) have no dockable panels. Apple probably don't like them.</p>\n<blockquote>\n<p>The point of the default arrangement is to make it work out-of-the box for most users, beginners and experts alike.  It is the result of the past 3 years looking closely what beginners and experts have, or could have.</p>\n</blockquote>\n<p>I can only speak for myself, but it does feel suboptimal to put contents that has a large horizontal component and (usually) a small vertical component in an area that has, in the best case, a squarish shape, and in the worst case much more vertical space than horizontal space.</p>\n<p>Jasmin</p>",
        "id": 294662251,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661170339
    },
    {
        "content": "<p>From: bnord &lt;<a href=\"mailto:bnord01@gmail.com\">bnord01@gmail.com</a>&gt;<br>\nIt's hidden under the not very descriptive triangle-down symbol, maybe <br>\nsomething like [1] would be more intuitive.</p>\n<p>[1] <br>\n<a href=\"http://www.iconarchive.com/show/farm-fresh-icons-by-fatcow/layout-content-icon.html\">http://www.iconarchive.com/show/farm-fresh-icons-by-fatcow/layout-content-icon.html</a></p>",
        "id": 294662263,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661170346
    },
    {
        "content": "<p>From: bnord &lt;<a href=\"mailto:bnord01@gmail.com\">bnord01@gmail.com</a>&gt;<br>\nI tried leave the old habits of the 2 buffer approach behind me and <br>\nadopt a new layout. I tried to create the following layout but failed to <br>\nplace several panels always visibly docked at the right, is this <br>\npossible? I don't like having to switch between tabs.</p>\n<p>|   sidekick<br>\n  main  |---------------<br>\n        |  sledgehammer<br>\n-------|---------------<br>\n  state |  output</p>",
        "id": 294662280,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661170356
    },
    {
        "content": "<p>From: Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt;<br>\nNo, that is actually an FAQ on this mailing list.  The default Dockable <br>\nWindow Manager only allows one active dockbale per docking area.</p>\n<p>Internally, there is a more generic \"service\" interface, to plug-in <br>\ndifferent dockable window managers; this was done once with the MyDoggy <br>\nplugin.  Both MyDoggyPlugin and the original MyDoggy project are inactive, <br>\nthough.</p>\n<p>There should be more modern and active docking frameworks on the free <br>\nJava/Swing market, but it requires some time to look around, and then more <br>\ntime to make it work as a usable jEdit plugin.</p>\n<p>Such a project could be done by any Java Swing enthusiast, and submitted <br>\nto the jEdit project at Sourceforge.  It would be a great step forwards.</p>\n<p>Makarius</p>",
        "id": 294662283,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661170358
    },
    {
        "content": "<p>From: bnord &lt;<a href=\"mailto:bnord01@gmail.com\">bnord01@gmail.com</a>&gt;<br>\nThanks that's unfortunate. While the environment allows for only 3 <br>\nactive panels (I don't think one would want to put one on the top and <br>\nleft also) one should probably avoid separating things like <br>\noutput/state/sledgehammer etc. to different panels. I might look into <br>\nfinding other docking frameworks but I doubt that I'll find the time to <br>\nintegrate them.</p>\n<p>Best<br>\n    Benedikt</p>",
        "id": 294662299,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661170367
    },
    {
        "content": "<p>From: \"Eugene W. Stark\" &lt;<a href=\"mailto:isabelle-users@starkeffect.com\">isabelle-users@starkeffect.com</a>&gt;<br>\nIf I put two panels side-by-side on my laptop, my aging eyes are too<br>\nfeeble to be able read the contents.  So mine is another vote for a<br>\nhorizontal Output panel.</p>\n<p>It would be very helpful if an undocked Output panel could be made so<br>\nthat it is not \"always on top\".  Is this possible (on Ubuntu/Unity)?<br>\nI didn't see how to do it, but if I could do it I would arrange the<br>\nwindows to be overlapping and I would raise and lower the one I want<br>\nto see.</p>\n<p>- Gene Stark</p>",
        "id": 294662323,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661170376
    },
    {
        "content": "<p>From: Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt;<br>\nThere is a hardwired policy in Java/AWT, which is implicitly exposed by <br>\nthe classes JFrame vs. JDialog.  An application has to make a choice which <br>\none to use.  I've made that choice for JDialog some years ago, when it <br>\nbecame apparent that JFrame can lead to situations where windows become <br>\ninaccessible on certain platforms with certain window managers, especially <br>\nwith full-screen mode.</p>\n<p>So with a choice between slightly inconvenient window stacking versus <br>\ninoperable windows, I've taken the slight inconvenience.</p>\n<p>To really solve that problem, one probably needs to avoid AWT, and go for <br>\nJavaFX.  That might actually work, because FX allows to integrate <br>\nAWT/Swing panels within its GUI containers, but I have no experience with <br>\nthat.</p>\n<p>Makarius</p>",
        "id": 294662421,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661170425
    },
    {
        "content": "<p>From: Simon Wimmer &lt;<a href=\"mailto:wimmersimon@gmail.com\">wimmersimon@gmail.com</a>&gt;<br>\nAnother way is to use Control+Click on the text selector text \"State\" of<br>\nthe state panel, keeping the mouse button pressed, and selecting one of the<br>\n\"Dock at x\" options (the same options are in the triangle menu). However,<br>\nthis is not really more intuitive, I guess.</p>",
        "id": 294664202,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661171101
    }
]