[
    {
        "content": "<p>From: \"Schmaltz, J.\" &lt;<a href=\"mailto:j.schmaltz@tue.nl\">j.schmaltz@tue.nl</a>&gt;<br>\n<strong>*</strong><strong>*</strong><strong>*</strong><strong>**  DATE 15  Call for Papers  – D4 Topic Formal Methods and System Verification </strong><strong>*</strong><strong>*</strong><strong>*</strong>*</p>\n<p>Design Methods and Tools Track @ DATE 2015<br>\nGrenoble, France - March 9-13, 2015</p>\n<p>IMPORTANT DATES:<br>\nSubmission by Sunday September 14, 2014, 23:59:59 CET<br>\nNotification of Acceptance November 07, 2014</p>\n<p>The Design, Automation and Test in Europe conference and exhibition is the main European event bringing together designers and design automation users, researchers and vendors, as well as specialists in the hardware and software design, test and manufacturing of electronic circuits and systems.  The Design Methods and Tools Track is devoted to design automation and design tools for electronic and embedded systems. Emphasis is on methods and tools related to the use of computers in designing products. This includes designer feedback on existing design methods and tools as well as to initiate discussions on requirements of future system architectures, design flows and environments The Formal Methods and System Verification topic (D4) is one of the thirteen topics foreseen in the Design Methods and Tools Track.</p>\n<p>This five-day event consists of a conference with plenary keynotes, regular papers, interactive presentations, panels and hot-topic sessions, tutorials, master courses and workshops.  The scientific conference is complemented by a commercial exhibition showing the state-of-the-art in design and test tools, methodologies, IP and design services.  Both the conference and the exhibition, together with the many user group meetings, fringe meetings, university booth and social events offer a wide variety of opportunities to meet and exchange information. </p>\n<p>TOPIC DESCRIPTION</p>\n<p>The Formal Methods and System Verification Track (D4) is devoted to the presentation and discussion of state-of-the-art advances in the theory and practice of formal verification methods. Topics of interest include, but are not limited to:</p>\n<ul>\n<li>\n<p>Formal verification and specification techniques including equivalence checking, model checking, symbolic simulation, theorem-proving, abstraction and refinement techniques, and real time verification.</p>\n</li>\n<li>\n<p>Technologies supporting formal verification, including SMT, SAT, BDD, ATPG, and related work.</p>\n</li>\n<li>\n<p>Applications of formal and semi-formal techniques to verify functional and non-functional aspects of hardware and software systems.  This includes practical applications and case-studies about verification of IPs, SoCs, cores and real-time/embedded systems.</p>\n</li>\n<li>\n<p>Verification in practice, namely the integration of verification into the design flow.</p>\n</li>\n<li>\n<p>Applications of formal and semi-formal techniques into new and challenging areas, like multi-core and parallel architectures,<br>\nasynchronous designs, analog and mixed-signal designs, power modelling and analysis, hardware and software security, etc.</p>\n</li>\n</ul>\n<p>TOPIC TECHNICAL COMMITTEE</p>\n<p>Jason Baumgartner, IBM Corporation (chair)          Armin Biere, Universitaet Linz<br>\nPer Bjesse, Synopsys                            Gianpiero Cabodi, Politecnico di Torino<br>\nAlessandro Cimatti, Fondazione Bruno Kessler        Barbara Jobstmann, EPFL, Jasper DA, CNRS/Verimag <br>\nKatell Morin-Allory, TIMA Laboratory                Julien Schmaltz, Eindhoven University of Technology (co-chair)<br>\nChristoph Scholl, Albert-Ludwigs-University Freiburg    Daryl Stewart, ARM </p>\n<p>SUBMISSION INSTRUCTIONS</p>\n<p>All manuscripts must be submitted electronically before Sunday September 14, 2014 23:59:59 CET, following the instructions on the conference Web page:</p>\n<p><a href=\"http://www.date-conference.com\">www.date-conference.com</a></p>\n<p>The accepted file format is PDF.  Any other format and manuscripts received in hard-copy form will not be processed.<br>\nPapers can be submitted for either formal oral presentation or for interactive presentation.  Oral presentations require novel and complete research work supported by experimental results. Interactive presentations are expected to articulate emerging and future design, verification and test problems including work in progress and identify open problems that merit innovative future research.  These presentations are given on a laptop in a face-to-face discussion area.<br>\nSubmissions should not exceed 6 pages in length for oral-presentation papers and 4 pages in length for interactive-presentation papers, and should be formatted as close as possible to the final format: A4 or letter sheets, double column, single spaced, Times or equivalent font of minimum 10pt (templates are available on the DATE Web site for your convenience). To permit blind review, submissions should not include the author names.  Any submission not in line with the above rules will be discarded.<br>\nAll papers will be evaluated with regard to their suitability for the conference, originality, and technical soundness.  The Programme Committee reserves the right to reorient oral-presentation papers to interactive-presentation and vice versa, to obtain the most suitable presentation format.</p>",
        "id": 294292537,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660923924
    }
]