[
    {
        "content": "<p>From: Thomas Sewell &lt;<a href=\"mailto:Thomas.Sewell@nicta.com.au\">Thomas.Sewell@nicta.com.au</a>&gt;<br>\nIs there any simple way to deactivate multithreading in Isabelle? I'm using Isabelle 2009-1 with PolyML 5.3, and I'm seeing multithreading for the first time.</p>\n<p>Multithreading seems to be mildly useful on my desktop machine at work, with cpu usage of 110-150% of one core being reported. On my desktop machine at home, though, it seems to cause random and unrepeatable build failures. More than 5  different attempts to build the HOL image failed 5 different ways, sometimes with a meaningful but unexpected exception being reported and sometimes with no explanation.</p>\n<p>I've discovered the way to make progress is to tie up the other cores with useless work. These days I use a busy loop written in 10 lines of C code, although the original discovery involved Unreal Tournament. Interestingly PolyML's CPU usage still peaks at around 120% of one core - it must be getting CPU quota for 2 or 3 threads while my busy loop gets less. Curiously, this does not seem to create a problem, or at least, it's not so likely.</p>\n<p>Anyway, is there an environment variable or ML reference I can tweak to disable threading for more reliable builds?</p>\n<p>Yours,<br>\n    Thomas.</p>",
        "id": 294099936,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660833460
    },
    {
        "content": "<p>From: Jasmin Blanchette &lt;<a href=\"mailto:jasmin.blanchette@gmail.com\">jasmin.blanchette@gmail.com</a>&gt;<br>\nI've seen it done as follows:</p>\n<p>ML {* Multithreading.max_threads := 1 *}<br>\nML {* Goal.parallel_proofs := 0 *}</p>\n<p>Jasmin</p>",
        "id": 294099965,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660833468
    },
    {
        "content": "<p>From: Gerwin Klein &lt;<a href=\"mailto:gerwin.klein@nicta.com.au\">gerwin.klein@nicta.com.au</a>&gt;<br>\nThe options -M and -q in isabelle usedir govern the settings for multithreading.</p>\n<p>Putting in your ~/.isabelle/etc/settings</p>\n<p>ISABELLE_USEDIR_OPTIONS=\"-M 1 -q 0\"</p>\n<p>should do what you want. Random crashes on HOL are still disconcerting, though.</p>\n<p>Cheers,<br>\nGerwin</p>",
        "id": 294099981,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660833473
    },
    {
        "content": "<p>From: Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt;<br>\nIndeed, and it should not happen.  (Which does not mean that I did not see <br>\nall kinds of weird crashes in earlier versions of the system.)</p>\n<p>Can you give some details about your hardware and operating system?  It <br>\nmight be even a strange C library that is dynamically linked against our <br>\nprebuilt Poly/ML binaries.</p>\n<p>Since multithreading is already commonplace -- and the next version of the <br>\ntoplevel will not work without it -- one really needs to isolate the <br>\nremaining problems now.</p>\n<p>Makarius</p>",
        "id": 294100077,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660833487
    },
    {
        "content": "<p>From: Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt;<br>\nOn a dual-core machine you should normally see 160-180% CPU usage, unless <br>\nthe theories are pathologically sequential.  There is also a correllation <br>\nwith available heap space, and providing an adequate initial default can <br>\nmake a big difference, e.g. like this:</p>\n<p>ML_OPTIONS=\"-H 1000\"</p>\n<p>This assumes you have something like 2 GB of real memory.  The official <br>\ndefault is still targeting 512 MB, and it is probably time to adjust it to <br>\n1 GB real memory for the next release, or make the installation somehow <br>\nsmarter in detecting hardware resources.  (So far there is still the basic <br>\nassumption that power users understand Isabelle settings, which are <br>\nexplained in the Isabelle system manual.)</p>\n<p>Makarius</p>",
        "id": 294100114,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660833497
    }
]