[
    {
        "content": "<p>From: \"Thiemann, René\" &lt;<a href=\"mailto:Rene.Thiemann@uibk.ac.at\">Rene.Thiemann@uibk.ac.at</a>&gt;<br>\nDear all,</p>\n<p>those of you who have already updated to macOS Catalina might encounter the following problem:</p>\n<ul>\n<li>Starting Isabelle2019 is no longer permitted because it is not from a “verified developer”.</li>\n<li>The CTRL-open solution (still trust this app), is no longer available, instead one can now<br>\n  move Isabelle2019 to the trash.</li>\n</ul>\n<p>So, here is what worked on my machine:</p>\n<p>1) disable security checking<br>\nsudo spctl --master-disable</p>\n<p>2) Start Isabelle <br>\nisabelle jedit</p>\n<p>3) reenable security checking<br>\nsudo spctl --master-enable</p>\n<p>4) starting Isabelle still works</p>\n<p>I don’t know whether there are better solutions to the problem, <br>\nbut perhaps this is useful for some of you.</p>\n<p>Cheers,<br>\nRené</p>\n<p>PS: I did not yet test, whether other tools like z3, yices, etc. all work properly.<br>\nPPS: There was no problem with using a self-compiled Isabelle from the development-repository.</p>",
        "id": 294763859,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661200954
    },
    {
        "content": "<p>From: Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt;<br>\nJust for completeness also an answer on this old thread: \"sudo spctl<br>\n--master-disable\" works but is rather brutal, it disables Gatekeeper altogether.</p>\n<p>This hint occurs frequently on the web, probably because it was actually<br>\nrequired on beta versions of macOS Catalina.</p>\n<p>In the official release Apple made the \"security theater\" simpler (requiring<br>\nonly 5 clicks or so). See also <a href=\"https://isabelle.in.tum.de/installation.html\">https://isabelle.in.tum.de/installation.html</a></p>\n<p>\"\"\"</p>\n<p>1. Open <a href=\"http://Isabelle2019.app\">Isabelle2019.app</a> and Cancel the subsequent security dialog.<br>\n    2. Open Security &amp; Privacy in system preferences: section \"Allow apps ...\"<br>\nat the bottom should list the blocked application (see screenshot).</p>\n<p>3. Click Open Anyway and provide further confirmations as required.</p>\n<p>\"\"\"</p>\n<p>Makarius</p>",
        "id": 294766733,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661202303
    },
    {
        "content": "<p>From: Lawrence Paulson &lt;<a href=\"mailto:lp15@cam.ac.uk\">lp15@cam.ac.uk</a>&gt;<br>\nFunny, this is more than I had to do: I simply opened the new app (using right click; this is essential) and then dismissed the security dialogue.</p>\n<p>Larry</p>",
        "id": 294766794,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661202333
    },
    {
        "content": "<p>From: Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt;<br>\nMy first test was with the traditional right-clock Open, but it did not change<br>\nthe full security dialog sequence.</p>\n<p>Later I tried again with a regular \"Open\" that the behaviour remains the same.</p>\n<p>The overall conclusion: right now we don't have to do anything concerning<br>\n\"notarization\", but in future macOS releases it might become even more awkward<br>\nor impossible to avoid it.</p>\n<p>Makarius</p>",
        "id": 294766822,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661202346
    },
    {
        "content": "<p>From: Lawrence Paulson &lt;<a href=\"mailto:lp15@cam.ac.uk\">lp15@cam.ac.uk</a>&gt;<br>\nAfter another bit of testing, I think I’ve finally grasped the behaviour: you don’t get the option to override until you try to open the app for a second time.</p>\n<p>Larry</p>",
        "id": 294766831,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661202351
    },
    {
        "content": "<p>From: Burkhart Wolff &lt;<a href=\"mailto:wolff@lri.fr\">wolff@lri.fr</a>&gt;<br>\nI use isabelle under catalan for quite some Time.  I do not recall exactly how I started it for the first time(any later activation is different), but the essentials have been this : </p>\n<ul>\n<li>install isabelle as usual under the Applications folder</li>\n<li>select it directly</li>\n<li>then use some shift or shift alt or cmd shift alt  together with double click and a special dialog box of the type “do you really want to open this ?” Pops up. Clicking ok sends it into a state where the rest works normal.</li>\n</ul>\n<p>Hope that helps, and that someone can fill in my missing gaps.</p>\n<p>Bu</p>\n<p>Von meinem iPhone gesendet</p>",
        "id": 294766854,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661202360
    }
]