[
    {
        "content": "<p>From: Matthew Fernandez &lt;<a href=\"mailto:matthew.fernandez@nicta.com.au\">matthew.fernandez@nicta.com.au</a>&gt;<br>\nHi all,</p>\n<p>I'm one of those masochists that use a tiling window manager and have had issues making<br>\nIsabelle/jedit unusable that have been discussed on this list previously. I've been languishing in<br>\nProof General land for a while and today I inadvertently opened Isabelle/jedit to discover my<br>\nprevious GUI show stoppers are gone. In particular, if you full screen jedit (F11) in a tiling<br>\nwindow manager the cursor alignment issues also seem resolved.</p>\n<p>I don't know which Isabelle version bump was the cure and I suspect it was just a JRE increment, but<br>\nI just wanted to nudge anyone else in the same limbo to give Isabelle/jedit another try on the<br>\nlatest release.</p>\n<p>Thanks,<br>\nMatt</p>\n<p>P.S. Many thanks to David Greenaway for causing me to re-evaluate and realise this.</p>\n<hr>\n<p>The information in this e-mail may be confidential and subject to legal professional privilege and/or copyright. National ICT Australia Limited accepts no liability for any damage caused by this email or its attachments.</p>",
        "id": 294270529,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660917065
    },
    {
        "content": "<p>From: Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt;<br>\nOn Fri, 14 Feb 2014, Matthew Fernandez wrote:</p>\n<blockquote>\n<p>Isabelle/jedit to discover my previous GUI show stoppers are gone. In <br>\nparticular, if you full screen jedit (F11) in a tiling window manager <br>\nthe cursor alignment issues also seem resolved.</p>\n<p>I don't know which Isabelle version bump was the cure and I suspect it <br>\nwas just a JRE increment, but I just wanted to nudge anyone else in the <br>\nsame limbo to give Isabelle/jedit another try on the latest release.</p>\n</blockquote>\n<p>Nothing of that is speficic to Isabelle/jEdit or jEdit.  These are general <br>\nproblems of AWT/Swing versus X11 window managers, and major projects like <br>\nNetbeans, IntelliJ, Minecraft have the same problems with 50% of Linux <br>\ninstallations.</p>\n<p>Oracle is doing evasive maneuvers occasionally, so whenever there is a <br>\nchange it is due to the JDK version.  In Isabelle2013-2 that is jdk-7u40, <br>\nwhich is generally a very good one: it works very well on Windows and Mac <br>\nOS X (even with Retina), and quite reasonably on more than 50% of Linuxes.</p>\n<p>Anybody who feels like helping Oracle to make things better can <br>\nparticipate in the ongoing testing of jdk-8, see also <br>\n<a href=\"http://www.oracle.com/technetwork/java/javase/downloads/ea-jsp-142245.html\">http://www.oracle.com/technetwork/java/javase/downloads/ea-jsp-142245.html</a></p>\n<p>After installing it somewhere, the Isabelle settings environment needs to <br>\nbe informed about it, e.g. like this for Mac OS X (in <br>\n$ISABELLE_HOME_USER/etc/settings):</p>\n<p>ISABELLE_JDK_HOME=\"/Library/Java/JavaVirtualMachines/jdk1.8.0.jdk/Contents/Home\"</p>\n<blockquote>\n<p>Many thanks to David Greenaway for causing me to re-evaluate and realise <br>\nthis.</p>\n</blockquote>\n<p>Re-evaluation of Isabelle/jEdit is very important for every Isabelle <br>\nrelease.  Since the first public version in Isabelle2011-1 (October 2011), <br>\nevery following release step was so steep that I've got complaints from <br>\nIsabelle/jEdit users that they have to learn so many new things.</p>\n<p>Makarius</p>",
        "id": 294270554,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660917072
    },
    {
        "content": "<p>From: \"Jens-D. Doll\" &lt;<a href=\"mailto:jd@cococo.de\">jd@cococo.de</a>&gt;<br>\n-------------- from Makarius on Friday, 14 2014 -----------------------<br>\nAre you saying that there are principal deficiencies with (some) Linux  <br>\nversions or does it only concern  SWING in older JDKs on Linux?<br>\nJens</p>",
        "id": 294270587,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660917082
    },
    {
        "content": "<p>From: Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt;<br>\nThe problem is AWT + various X11 window managers (i.e. normally on Linux); <br>\nSwing is on top of AWT.  The situation for Java &lt;= 6 is rather bad, but <br>\nmuch better for Java 7 or 8.</p>\n<p>E.g. see the OpenJDK discussion <br>\n<a href=\"http://mail.openjdk.java.net/pipermail/awt-dev/2012-April/002556.html\">http://mail.openjdk.java.net/pipermail/awt-dev/2012-April/002556.html</a> <br>\nwhich was prompted by yet another fork of some well-known Linux desktop <br>\nenvironment. Whenever that happens there is one more \"choice\" of Linux <br>\ndiversity (i.e. more chaos), and one more step away from Linux as serious <br>\ndesktop OS.</p>\n<p>To some extent, recent JDK 7 and 8 have managed to catch up with various <br>\nwindow managers, and some others like xmonad have become more flexible to <br>\nactually support AWT.  Compared to Windows and Mac OS X, that is all still <br>\na bit fragile, though.  I am increasingly estranged from my home platform.</p>\n<p>Makarius</p>",
        "id": 294270649,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660917102
    }
]