[
    {
        "content": "<p>From: Gopalan Nadathur &lt;<a href=\"mailto:gopalan@cs.umn.edu\">gopalan@cs.umn.edu</a>&gt;<br>\nApplications are invited for a one-year postdoctoral position at the<br>\nUniversity of Minnesota related to an NSF-funded project entitled<br>\n\"Reasoning about Specifications of Computations.\" The position is<br>\navailable immediately: to guarantee consideration, applications must<br>\nbe received before September 7, 2012.</p>\n<p>The project within which the appointment is to be made concerns the<br>\nareas of computational logic and programming languages. To be suitable<br>\nfor the position, the candidate should be broadly conversant with the<br>\nissues in these areas and should have the mathematical and programming<br>\nskills necessary for conducting research in them. Moreover, with<br>\nsuitable mentoring, he/she should be capable of developing an<br>\nindependent research agenda that encompasses some of the following<br>\ntopics:</p>\n<ul>\n<li>\n<p>the design of logics for specifying computational systems and<br>\n   for reasoning about such specifications,</p>\n</li>\n<li>\n<p>the implementation of systems embodying such logics, and</p>\n</li>\n<li>\n<p>the use of the implemented systems in constructing actual<br>\n   specifications and reasoning about them.</p>\n</li>\n</ul>\n<p>Facility with proof assistants and logical frameworks such as Coq,<br>\nIsabelle and Twelf, an understanding of proof theoretic treatments of<br>\naspects such as induction and co-induction and familiarity with issues<br>\nrelated to proof search in sequent calculi and related logical systems<br>\nwould be needed for participating in the research at the appropriate<br>\nlevel. A specific focus for the project is the Abella system (see<br>\n<a href=\"http://abella.cs.umn.edu\">http://abella.cs.umn.edu</a>), developed originally at the University of<br>\nMinnesota and currently also the subject of work within the Parsifal<br>\nproject at Ecole Polytechnique and INRIA, Saclay. The ideal candidate<br>\nwould have an interest in further developing the capabilities of this<br>\nsystem and its applications during the appointment period.</p>\n<p>To apply for this position, go to the U of M Employment System at<br>\n<a href=\"https://employment.umn.edu/\">https://employment.umn.edu/</a> and search postings with req#: 179943. The<br>\nonline application process will require you to submit a current CV and<br>\na brief research statement that should describe past research and<br>\nfuture plans in a way that addresses appropriateness for the position<br>\nadvertised. Please also provide names, phone numbers and email<br>\naddresses of two or three references as part of this material; these<br>\nreferences may be contacted as part of the application review process.<br>\nNote that a prerequisite for employment is a doctoral degree in<br>\nComputer Science or closely related field.</p>\n<p>Interested individuals are encouraged to contact Gopalan Nadathur at<br>\n<a href=\"mailto:gopalan@cs.umn.edu\">gopalan@cs.umn.edu</a> for more information towards assessing the<br>\nsuitability of an application.</p>",
        "id": 294220591,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660897248
    },
    {
        "content": "<p>From: Gopalan Nadathur &lt;<a href=\"mailto:gopalan@cs.umn.edu\">gopalan@cs.umn.edu</a>&gt;<br>\nApplications are invited for a one-year postdoctoral position at the<br>\nUniversity of Minnesota related to an NSF-funded project entitled \"A<br>\nHigher-Order Framework for Meta-Theoretic Reasoning.\" The position is<br>\navailable immediately and reviews of applications will be conducted as they<br>\nare received.</p>\n<p>The project within which the appointment is to be made concerns the<br>\ndevelopment of a framework that supports the encoding of rule-based<br>\nrelational specifications and the process of reasoning about such<br>\nspecifications through the encoding. A defining characteristic of the<br>\nproject is its focus on the so-called higher-order abstract syntax approach<br>\nto representing objects that embody a binding structure. Ongoing work is<br>\naimed at developing systems for reasoning about specifications encoded in<br>\nlinear logic as well as in the dependently typed lambda calculus LF. The<br>\ngroup is also interested in furthering its earlier work that has<br>\ndemonstrated the benefits of higher-order representations of syntax in the<br>\nverification of compilers and transformers for functional programming<br>\nlanguages. Another direction of investigation is that of enhancing the<br>\nlogic underlying the  Abella proof assistant (see <a href=\"http://abella-prover.org\">http://abella-prover.org</a>)<br>\nwith the capability of predicate quantification and on exhibiting the<br>\nusefulness of such an enhancement through a collection of targeted<br>\nreasoning applications. The successful candidate will be expected to<br>\nparticipate in and help lead the work in some of these directions.</p>\n<p>To be suitable for the position, the candidate should be broadly conversant<br>\nwith the areas of computational logic and programming languages and should<br>\nhave the mathematical and programming skills necessary for conducting<br>\nresearch in them. Some particular facets that would be help in engaging<br>\nimmediately with the research problems are a prior exposure to a proof<br>\nassistant or logical framework such as Coq, Isabelle or Abella, programming<br>\nexperience with a functional language such as OCaml, an understanding of<br>\nproof theoretic treatments of aspects such as induction and co-induction,<br>\nand familiarity with issues related to proof search in sequent calculi and<br>\nsimilar logical systems.</p>\n<p>Please feel free to contact me (Gopalan Nadathur, <a href=\"mailto:ngopalan@umn.edu\">ngopalan@umn.edu</a>) for<br>\nmore details about the topics of research within the project, the necessary<br>\nbackground and other relevant details about the position. To view the<br>\nofficial announcement, please visit the URL</p>\n<p><a href=\"https://hr.myu.umn.edu/jobs/ext/330828\">https://hr.myu.umn.edu/jobs/ext/330828</a>.</p>\n<p>This site also provides details about how to apply and serves as the portal<br>\nfor applications. The application process will require you to submit a<br>\nletter indicating your interest, a current CV, one or two of your papers<br>\nbroadly related to the topics of research and the names and contact details<br>\nfor two references who might be contacted as part of the application review<br>\nprocess. Note that a prerequisite for employment is a doctoral degree in<br>\nComputer Science or closely related field.</p>\n<p>-Gopalan Nadathur</p>",
        "id": 294830110,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661246228
    }
]