[
    {
        "content": "<p>From: José Manuel Rodriguez Caballero &lt;<a href=\"mailto:josephcmac@gmail.com\">josephcmac@gmail.com</a>&gt;<br>\nA practical way to prevent cheating is to ask to the participants to upload<br>\na video of they solving the problem to youtube or a similar website (videos<br>\nuploaded 1/2 hour after the end of the competition will be ignored). Only<br>\nthe videos of the winners will be checked by humans, increasing the speed<br>\nof the films. For people with less economic resources, this option is<br>\nbetter than to travel to another continent in order to participate in a<br>\ncontest. This is just theory, in case someday something similar will be<br>\nimplemented.</p>\n<p>Kind Regards,<br>\nJosé M.</p>",
        "id": 294746773,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661193801
    },
    {
        "content": "<p>From: mailing-list anonymous &lt;<a href=\"mailto:mailing.list.anonymous@gmail.com\">mailing.list.anonymous@gmail.com</a>&gt;<br>\nDear All,</p>\n<p>Thank you for your replies with regard to my comment about proving contests<br>\nand please accept my apologies for resurrecting an old topic. I have to<br>\nadmit that my comment was written in awkward circumstances and,<br>\nunfortunately, did not convey its intended meaning. Moreover, the comment<br>\nmay have sounded slightly aggressive, which also was not my intention.<br>\nUnfortunately, in this comment, I failed to mention that, of course, I<br>\ncompletely support all proposals and existing contests in the areas of<br>\nformal proof and formal verification.</p>\n<p>I would also like to emphasize that my comment was made in relation to the<br>\nproposal of organizing the \"Internation Olympiad in Isabelle\" (or,<br>\nalternatively, \"Internation Olympiad in Formal Proof and Verification\")<br>\nthat was made by José Manuel Rodriguez Caballero and not in relation to any<br>\nother contest (i.e. a contest that bears a name that does not start with<br>\nthe phrase \"Internation Olympiad in...\"). To the best of my knowledge, all<br>\ninternational olympiads (i.e. all contests that bear names that start with<br>\nthe phrase \"International Olympiad in...\") require the presence of<br>\nparticipants on site and take many other steps to prevent cheating.<br>\nMoreover, it is likely to be very uncommon for participants to pay for<br>\ntheir travel expenses to international olympiads because they are usually<br>\nsponsored by their governments (even participants from less developed<br>\ncountries). However, of course, admission committees at universities and<br>\nemployers treat international olympiads much more seriously than all other<br>\nevents.</p>\n<p>Thank you</p>\n<p>A practical way to prevent cheating is to ask to the participants to upload</p>\n<blockquote>\n<p>a video of they solving the problem to youtube or a similar website (videos<br>\nuploaded 1/2 hour after the end of the competition will be ignored). Only<br>\nthe videos of the winners will be checked by humans, increasing the speed<br>\nof the films. For people with less economic resources, this option is<br>\nbetter than to travel to another continent in order to participate in a<br>\ncontest. This is just theory, in case someday something similar will be<br>\nimplemented.<br>\n</p>\n</blockquote>\n<p>Kind Regards,</p>\n<blockquote>\n<p>José M.</p>\n</blockquote>\n<p>Dear all,</p>\n<blockquote>\n<p>for our system, we foresee to also get other theorem provers on board.<br>\nFor each theorem prover, one needs to find a volunteer who is willing to<br>\nimplement a prover backend,<br>\nand who is willing to formulate the tasks for the theorem prover.</p>\n<p>As for most programming competitions, our main goal is to spark<br>\nmotivation. For this purpose, in my opinion, the<br>\nonly way is to host the competition online, as only then everyone has the<br>\npossibility to participate.</p>\n<p>I agree that if you want to hand out an important prize, you will always<br>\nneed to make sure that<br>\nthe person you give the prize to will be the one who actually solved the<br>\nproblems. However,<br>\nI believe this is already ten steps ahead of where we stand now.<br>\n</p>\n</blockquote>\n<p>Dear All,</p>\n<blockquote>\n<p>I would like to make several comments with regard to the proposal by José<br>\nManuel Rodriguez Caballero (as someone who participated in olympiads while<br>\nstudying at secondary school).<br>\nOf course, the olympiads in informatics can hardly be described as<br>\nolympiads that test the participants on their knowledge of the syntax of a<br>\nparticular programming language. The main challenge is the design of<br>\nalgorithms and not their implementation. The participants are allowed to<br>\nselect a programming language. While the choice is relatively narrow (C++,<br>\nPascal and Java), they seem to be working on expanding this choice (until<br>\nrecently the participants were allowed to use only C, C++ and Pascal).<br>\nWhile Isabelle is one of the most popular proof assistants, it is not the<br>\nonly available proof assistant. I believe that Coq is equivalently popular<br>\nand has nearly identical functionality (for example, there are more<br>\nquestions about Coq on Stack Overflow than about Isabelle). Of course,<br>\nthere are other well-known systems for proof verification.<br>\nPersonally, I prefer Isabelle and I would like to see it succeed. However,<br>\nif one was to organise an international olympiad that allows its<br>\nparticipants to use Isabelle, in my opinion, it would need to be an<br>\nolympiad in the proof verification/logic/formal methods and not an olympiad<br>\n\"in Isabelle\". From the start, it should allow the participants to use<br>\neither Isabelle or Coq. Also, of course, the tasks should reflect that the<br>\nparticipants are being tested on their knowledge of the methods that are<br>\ncommonly used for the formalisation of mathematics or formal proof of<br>\ncomputer programs and not the knowledge of the 'advanced features' of a<br>\ngiven proof assistant. Thus, the organisers would have to carefully select<br>\nthe subsets of the standard libraries that one is allowed to use during the<br>\nolympiad.<br>\nAlso, personally, in my view, participation over the internet should not<br>\nbe allowed, because it favours cheating. Being able to claim that one has a<br>\nprize in an olympiad in formal verification would provide an enormous<br>\ncompetitive advantage when one is applying to universities (and beyond).<br>\nThus, cheating must be eliminated at all costs. It may be best (for the<br>\nsake of humanity) not to organise such an olympiad at all, rather than<br>\nallowing the participation over the internet. Also, of course, there should<br>\nbe different olympiads for secondary school students and undergraduate<br>\nstudents.<br>\nThank you</p>\n</blockquote>",
        "id": 294746924,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661193863
    },
    {
        "content": "<p>From: José Manuel Rodriguez Caballero &lt;<a href=\"mailto:josephcmac@gmail.com\">josephcmac@gmail.com</a>&gt;</p>\n<blockquote>\n<p>mailing-list anonymous wrote:<br>\nI have to admit that my comment [concerning cheating in an olympiad by<br>\ninternet] was written in awkward circumstances and,<br>\nunfortunately, did not convey its intended meaning. Moreover, the comment<br>\nmay have sounded slightly aggressive, which also was not my intention.</p>\n</blockquote>\n<p>There is not aggressiveness in pointing out that there are people who cheat<br>\nin life: this is the reason why cryptography and security engineering<br>\nexist. In one phrase due to the great MILAN KUNDERA: Only animals were not<br>\nexpelled from Paradise. <a href=\"https://en.wikipedia.org/wiki/Milan_Kundera\">https://en.wikipedia.org/wiki/Milan_Kundera</a></p>\n<p>mailing-list anonymous wrote:</p>\n<blockquote>\n<p>Moreover, it is likely to be very uncommon for participants to pay for<br>\ntheir travel expenses to international olympiads because they are usually<br>\nsponsored by their governments (even participants from less developed<br>\ncountries)</p>\n</blockquote>\n<p>You already mentioned the possibility of individual people cheating. Well,<br>\nthere is the possibility of some governments cheating too. I have many<br>\nfriends who will start laughing if someone talks about the honesty of their<br>\ngovernments. I do not want to talk about politics. So, I leave it to your<br>\nimagination.</p>\n<p>Kind Regards,<br>\nJosé M.</p>",
        "id": 294746983,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661193894
    }
]