[
    {
        "content": "<p>From: Joshua Chen &lt;<a href=\"mailto:joshua.chen@uibk.ac.at\">joshua.chen@uibk.ac.at</a>&gt;<br>\nDear list,</p>\n<p>Can anyone explain the logic behind the behavior of the Isabelle/jEdit<br>\nautomatic indentation? I've never been able to figure it out and always<br>\nhave it disabled, from my point of view it indents and unindents with no<br>\nrhyme or reason. I'd be grateful to learn how to use it from those who<br>\nhave it happily turned on in their daily work...</p>\n<p>Best,<br>\nJosh</p>",
        "id": 294765428,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661201725
    },
    {
        "content": "<p>From: Lawrence Paulson &lt;<a href=\"mailto:lp15@cam.ac.uk\">lp15@cam.ac.uk</a>&gt;<br>\nIndentation is a matter of taste, but perhaps you are talking about this phenomenon:</p>\n<p>lemma \"((P ⟷ Q) ⟷ R) ⟷ (P ⟷ (Q ⟷ R))\"<br>\n  apply (intro iffI)<br>\n       apply simp_all<br>\n   apply blast <br>\n  apply blast <br>\n  done</p>\n<p>For apply-proofs, the indentation varies with the number of subgoals, the point being to inform the reader how many subgoals are present at that point in the proof. In the proof above, we can see that the first line generates many subgoals (six in fact) and the second line proves a bunch of them (four in fact), the remaining two proved one at a time. This information can be valuable when you are confronted with a proof that no longer works.</p>\n<p>Larry Paulson</p>",
        "id": 294765439,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661201732
    },
    {
        "content": "<p>From: Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt;<br>\nThe Isabelle/jEdit documentation has a few explanations about indentation.</p>\n<p>Ultimately this is a computer game, and the dynamics of it depends on<br>\nmany side-conditions how you work with it.</p>\n<p>The results should be crisp and clear for 98% of cases, following the<br>\nsemantics of the language, especially for proofs, especially structured<br>\nproofs in Isar.</p>\n<p>The less you invent diverging ideas about it, the better it will work.</p>\n<p>Makarius</p>",
        "id": 294765459,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661201740
    },
    {
        "content": "<p>From: Joshua Chen &lt;<a href=\"mailto:joshua.chen@uibk.ac.at\">joshua.chen@uibk.ac.at</a>&gt;</p>\n<blockquote>\n<p>The Isabelle/jEdit documentation has a few explanations about indentation.<br>\nIndeed, but unfortunately it's really too sketchy to be understandable<br>\nto someone who doesn't already have an idea of the answer.</p>\n</blockquote>\n<blockquote>\n<p>The less you invent diverging ideas about it, the better it will work.<br>\nNot to mention that sometimes one works on a new thing, and hence needs<br>\nto know the precise workings of things in order to reliably determine if<br>\nthe pre-existing order is suitable, or if one really needs to diverge<br>\nfrom canon. ;)</p>\n</blockquote>\n<p>Josh</p>\n<p>On 11/11/19 1:46 PM, Makarius wrote:</p>\n<blockquote>\n<p>On 11/11/2019 12:14, Joshua Chen wrote:</p>\n<blockquote>\n<p>Can anyone explain the logic behind the behavior of the Isabelle/jEdit<br>\nautomatic indentation? I've never been able to figure it out and always<br>\nhave it disabled, from my point of view it indents and unindents with no<br>\nrhyme or reason. I'd be grateful to learn how to use it from those who<br>\nhave it happily turned on in their daily work...<br>\nThe Isabelle/jEdit documentation has a few explanations about indentation.</p>\n</blockquote>\n<p>Ultimately this is a computer game, and the dynamics of it depends on<br>\nmany side-conditions how you work with it.</p>\n<p>The results should be crisp and clear for 98% of cases, following the<br>\nsemantics of the language, especially for proofs, especially structured<br>\nproofs in Isar.</p>\n<p>The less you invent diverging ideas about it, the better it will work.</p>\n<p>Makarius<br>\n</p>\n</blockquote>",
        "id": 294765471,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661201744
    },
    {
        "content": "<p>From: Joshua Chen &lt;<a href=\"mailto:joshua.chen@uibk.ac.at\">joshua.chen@uibk.ac.at</a>&gt;<br>\n(No offense intended Makarius, just teasing you a little) :p</p>\n<p>Josh</p>",
        "id": 294765494,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661201750
    },
    {
        "content": "<p>From: Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt;<br>\nWe also have this mailing list to work out the details that remain unclear.</p>\n<p>Which aspects precisely did you find confusing? The dynamics of<br>\nindentation, the result, or both? Proofs, specifications, something else?</p>\n<p>Makarius</p>",
        "id": 294765551,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661201763
    },
    {
        "content": "<p>From: Peter Lammich &lt;<a href=\"mailto:lammich@in.tum.de\">lammich@in.tum.de</a>&gt;</p>\n<blockquote>\n<p>lemma \"((P ⟷ Q) ⟷ R) ⟷ (P ⟷ (Q ⟷ R))\"<br>\n  apply (intro iffI)<br>\n       apply simp_all<br>\n   apply blast <br>\n  apply blast <br>\n  done</p>\n<p>For apply-proofs, the indentation varies with the number of subgoals,<br>\nthe point being to inform the reader how many subgoals are present at<br>\nthat point in the proof. In the proof above, we can see that the<br>\nfirst line generates many subgoals (six in fact) and the second line<br>\nproves a bunch of them (four in fact), the remaining two proved one<br>\nat a time. This information can be valuable when you are confronted<br>\nwith a proof that no longer works.</p>\n</blockquote>\n<p>This apply-indentation is, imho, also a matter of taste. I think it<br>\nlooks horrible. Unfortunately, the Isabelle indentation cannot be<br>\nconfigured, but if you enable it, you get it all. This is why I do not<br>\nuse it, though the indentation for the other commands is good. I use<br>\nthe generic \"simple indentation\" mode of jedit, which will just indent<br>\na new line to the indentation level of the last line.</p>\n<p>Peter</p>\n<blockquote>\n<p>Larry Paulson</p>\n<p>On 11 Nov 2019, at 11:14, Joshua Chen &lt;<a href=\"mailto:joshua.chen@uibk.ac.at\">joshua.chen@uibk.ac.at</a>&gt;</p>\n<blockquote>\n<p>wrote:</p>\n<p>Can anyone explain the logic behind the behavior of the<br>\nIsabelle/jEdit<br>\nautomatic indentation? I've never been able to figure it out and<br>\nalways<br>\nhave it disabled, from my point of view it indents and unindents<br>\nwith no<br>\nrhyme or reason. I'd be grateful to learn how to use it from those<br>\nwho<br>\nhave it happily turned on in their daily work...<br>\n</p>\n</blockquote>\n</blockquote>",
        "id": 294765579,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661201775
    },
    {
        "content": "<p>From: Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt;<br>\nThis is what the Isabelle/jEdit documentation says:</p>\n<p>➧[Semantic indentation] adds additional white space to unstructured<br>\nproof<br>\n    scripts via the number of subgoals. This requires information of ongoing<br>\n    document processing and may thus lag behind when the user is editing too<br>\n    quickly; see also option @{system_option_def \"jedit_script_indent\"} and<br>\n    @{system_option_def \"jedit_script_indent_limit\"}.</p>\n<p>For me the so-called \"apply-style proofs\" are not a proper part of the<br>\nfine Isar proof language and its high ambitions for style. Nonetheless,<br>\nI prefer to have that additional indentation enabled.</p>\n<p>Further note that recent updates on Isar (2015/2016) have introduced the<br>\n'subgoal' command that gives better structure and less extra indentation<br>\nto \"unstructured apply scripts\".</p>\n<p>Makarius</p>",
        "id": 294765585,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661201781
    },
    {
        "content": "<p>From: Peter Lammich &lt;<a href=\"mailto:lammich@in.tum.de\">lammich@in.tum.de</a>&gt;</p>\n<blockquote>\n<p>This is what the Isabelle/jEdit documentation says:</p>\n<p>➧[Semantic indentation] adds additional white space to<br>\nunstructured<br>\nproof<br>\n    scripts via the number of subgoals. This requires information of<br>\nongoing<br>\n    document processing and may thus lag behind when the user is<br>\nediting too<br>\n    quickly; see also option @{system_option_def<br>\n\"jedit_script_indent\"} and<br>\n    @{system_option_def \"jedit_script_indent_limit\"}.</p>\n<p>For me the so-called \"apply-style proofs\" are not a proper part of<br>\nthe<br>\nfine Isar proof language and its high ambitions for style. </p>\n</blockquote>\n<p>Fully agree, but apply scripts are very useful in certain situations,<br>\nwhere a simple proof can be done in a few straightforward steps, and an<br>\nIsar-script would mainly mean to copy around subgoals and thus<br>\nintroduce redundancy (goal-cases and symbolic names like goal3(42),<br>\nimho, is worse than apply scripts). </p>\n<p>Another very important part of apply scripts, that I feel is often<br>\nunder-estimated, is rapid prototyping of proofs. I use apply scripts a<br>\nlot for exploring proofs, including all nasty (improper in Isabelle<br>\nparlance) features like <br>\n\"case_tac [!] xs\" or \"rule_tac x=foo in exI\", and even \"back\". Once I<br>\nhave found a proof, I refactor it, either extracting lemmas or going to<br>\nan Isar-proof. </p>\n<p>Side-note: Winning verification competitions like VerifyThis would not<br>\nhave been possible without very dirty apply-scripts, as they can be<br>\nwritten much faster than Isar-proofs. For ProofGround, which was<br>\nfocused on a different type of problems, Manuel  apparently used Isar<br>\nfrom the beginning on, while I used apply-scripts, and both worked.</p>\n<blockquote>\n<p>Nonetheless,<br>\nI prefer to have that additional indentation enabled.<br>\nAs said, a matter of taste. I prefer a different indentation scheme, in<br>\nparticular when prototyping.</p>\n</blockquote>\n<blockquote>\n<p>Further note that recent updates on Isar (2015/2016) have introduced<br>\nthe<br>\n'subgoal' command that gives better structure and less extra<br>\nindentation<br>\nto \"unstructured apply scripts\".</p>\n</blockquote>\n<p>I actually use this a lot, and I think it is, next to Eisbach, one of<br>\nthe greatest features introduced to Isabelle regarding rapid-<br>\nprototyping capabilities. The only caveat is that it does not work when<br>\na schematic variable has to be instantiated. Luckily, this will not<br>\noccur very often for most proofs.</p>",
        "id": 294765594,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661201787
    },
    {
        "content": "<p>From: Lawrence Paulson &lt;<a href=\"mailto:lp15@cam.ac.uk\">lp15@cam.ac.uk</a>&gt;<br>\nHowever, if you want to submit an entry to the AFP, this style is mandatory. We are the guys who usually end up keeping all the entries running :-)</p>\n<p>Larry</p>",
        "id": 294765603,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661201793
    },
    {
        "content": "<p>From: Yakoub Nemouchi &lt;<a href=\"mailto:y.nemouchi@gmail.com\">y.nemouchi@gmail.com</a>&gt;<br>\nHi,</p>\n<p>I do agree with Peter on this.<br>\nThe so called apply-style proofs is very useful in identifying proof<br>\npatterns that can be hidden behind a method later.<br>\nIt is  very useful in teaching as well, since it make the proofs looks like<br>\na program with transitions steps  made over the proof context. Therefore,<br>\nit is easier for students with no formal background to learn it (Peter has<br>\na very successful experience by teaching Isabelle that way back in USA)!<br>\nAlso, it is useful for advanced semantic frameworks with large scale<br>\napplications.<br>\nFor example, projects such as Verisoft and seL4 have very large proofs that<br>\nuse apply-style proof. The proofs are ugly in this kind of projects because<br>\nof the complicated and low level memory models of those systems!<br>\nIn this kind of projects,  you want to save time, and it is  easier for<br>\nproof engineers to progress the proofs and at the same time identify proof<br>\npatterns with the so called \"apply-style proofs\" that can be hidden behind<br>\na single method later in the development.</p>\n<p>Best wishes,</p>\n<p>Yakoub.</p>",
        "id": 294765627,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661201804
    },
    {
        "content": "<p>From: Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt;</p>\n<blockquote>\n<p>On 12 Nov 2019, at 10:06, Peter Lammich &lt;<a href=\"mailto:lammich@in.tum.de\">lammich@in.tum.de</a>&gt; wrote:</p>\n<blockquote>\n<p>This apply-indentation is, imho, also a matter of taste. I think it<br>\nlooks horrible. Unfortunately, the Isabelle indentation cannot be<br>\nconfigured, but if you enable it, you get it all. This is why I do not<br>\nuse it, though the indentation for the other commands is good. I use<br>\nthe generic \"simple indentation\" mode of jedit, which will just indent<br>\na new line to the indentation level of the last line.</p>\n</blockquote>\n</blockquote>",
        "id": 294765629,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661201806
    },
    {
        "content": "<p>From: Joshua Chen &lt;<a href=\"mailto:josh@joshchen.io\">josh@joshchen.io</a>&gt;<br>\nFor type theory such a <code>schematic_subgoal</code> command is absolutely<br>\nindispensible, so allow me to point you to<br>\n<a href=\"https://github.com/jaycech3n/Isabelle-Spartan/blob/master/schematic_subgoal.ML\">https://github.com/jaycech3n/Isabelle-Spartan/blob/master/schematic_subgoal.ML</a><br>\n:)</p>\n<p>This is basically the subgoal command code copy-pasted, with a<br>\nsingle-line tweak to change the proof mode to schematic (and possibly a<br>\ncouple other small changes, I forget by now). It's been working fine for<br>\nme so far, though I'm sure more experienced people can tell me if<br>\nanything could go wrong...</p>\n<p>Josh</p>",
        "id": 294765676,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661201833
    },
    {
        "content": "<p>From: Wolfgang Jeltsch &lt;<a href=\"mailto:wolfgang-it@jeltsch.info\">wolfgang-it@jeltsch.info</a>&gt;<br>\nI tend to use proof method expressions in such situations. If there are<br>\nexactly two methods to apply where the first one introduces “boring”<br>\nsubgoals which are then discharged by the second one, I usually use<br>\n<code>by ⟨first-method⟩ ⟨second-method⟩</code>.</p>\n<p>All the best,<br>\nWolfgang</p>",
        "id": 294765699,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661201842
    },
    {
        "content": "<p>From: \"Klein, Gerwin (Data61, Kensington NSW)\" &lt;<a href=\"mailto:Gerwin.Klein@data61.csiro.au\">Gerwin.Klein@data61.csiro.au</a>&gt;<br>\nThis can work nicely on small goals, but if you start looking into verification of larger programs there is no really usable way around apply scripts in my opinion.   </p>\n<p>I don’t agree at all that apply scripts are less maintainable than Isar proofs in general. It is perfectly possible to write brittle and unmaintainable Isar proofs, and we do have some of these in the AFP (as well as in the seL4 verification). It is also perfectly possible to write nicely stable and maintainable apply scripts. I’ve maintained many of both over the last 15 years, and for both it takes work and some experience to write something maintainable.</p>\n<p>Not that our seL4 proofs are shining examples of maintainability, there are many things I’d like to improve, but there are over a million lines of apply scripts in them, and while an Isabelle update usually takes us a few weeks, that is a small amount of time compared to the size of the proof. The entire AFP is only about twice the size, and if you add up the update work the Isabelle team puts in incrementally over time, I bet it will be larger even though the AFP has a much higher percentage of Isar proofs. Isar proofs do not necessarily show a greater resilience to change than apply scripts, they just are vulnerable to different kinds of change. </p>\n<p>Isar as a language gives you mechanisms for writing proofs that are readable and understandable (which does tend to help with maintenance), but it is up to the user to actually do that properly, and it may not contribute to the purpose of the proof to be readable. There is often no point in making a proof in software verification specifically readable. There is often nothing interesting going on in vcg-style proofs, and their apply-script structure is usually obvious to someone who is used to them. This is different in mathematical-style proofs or maybe even for proofs about small interesting algorithms of some 10s of lines. </p>\n<p>Using goal-based indentation is one of the key things in keeping apply scripts maintainable over time. Unless you extensively use Eisbach or other means to make sure that scripts break when goals are solved/not solved when they should, you will waste a lot of time finding the apply command that went wrong if something breaks after an update (I certainly have wasted such time in proofs that haven’t followed the convention). </p>\n<p>Cheers,<br>\nGerwin</p>",
        "id": 294765716,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661201853
    },
    {
        "content": "<p>From: Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt;<br>\nWhen you say \"absolutely\" my first reflex is to try to disprove that,<br>\nand present a proof language with explicit structure <em>and</em> synthesized<br>\nparts in the reasoning.</p>\n<p>Of course that is non-trivial: it is an open research problem that I<br>\nleft over in 1999. I did not spend much thought on it in recent years --<br>\nin contrast to the other open research problem that is more important:<br>\nsoft types within Isar proofs.</p>\n<p>Just abstractly, scientific progress happens when you stop to accept<br>\nwell-established workarounds and rethink problems from the ground up.</p>\n<p>Makarius</p>",
        "id": 294765735,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661201861
    },
    {
        "content": "<p>From: Joshua Chen &lt;<a href=\"mailto:joshua.chen@uibk.ac.at\">joshua.chen@uibk.ac.at</a>&gt;<br>\nThe main thing is the dynamics—in particular in theory declarations but<br>\noutside proofs. This is what happens to me when full indentation is<br>\nturned on:</p>\n<ol>\n<li>\n<p>If I never manually insert indents, new lines are never automatically<br>\nindented. This is at first fine. However, once I go to manually insert<br>\nan indent, say on line n, complete the line, and press RETURN to start<br>\nline n+1, PIDE will immediately unindent line n (to the same level as<br>\nline (n-1)). I then have to go back up one line to tell it \"no, I<br>\nactually want line n indented!\".</p>\n</li>\n<li>\n<p>Now, suppose I've indented line n, have an empty line on line (n+1),<br>\nand want to start a new definition on line (n+2). Like so:</p>\n</li>\n</ol>\n<div class=\"codehilite\" data-code-language=\"Isabelle\"><pre><span></span><code><span class=\"k\">definition</span> <span class=\"n\">my_def</span> <span class=\"o\">::</span> <span class=\"s\">\"some_type\"</span>\n  <span class=\"kp\">where</span> <span class=\"s\">\"my_def == defn\"</span>\n\n<span class=\"k\">definition</span> <span class=\"n\">I_want_a_new_def_here</span>\n  <span class=\"ow\">...</span>\n</code></pre></div>\n<p>Now when I first begin <code>definition I_want_...</code>, PIDE automatically<br>\nindents to the same level as the \"where\" statement above it. This<br>\nshouldn't happen since I'm starting a completely new logical block with<br>\na new command, but it's not a big deal, I just immediately SHIFT+TAB to<br>\nunindent, right? But no, even after doing this, PIDE insists on<br>\nindenting (again!) after I RETURN to start line n+3.</p>\n<p>All this basically means I have to do a lot of up and down keypressing,<br>\nentering content on line (n+1) before PIDE will grudgingly accept the<br>\ncorrect indentation level for line n. This is not a matter of \"just<br>\nleave the automatic indentation to do its work\", because it always<br>\nblindly insists on following the indentation level of the previous line,<br>\nwhile making it very difficult to unindent.</p>\n<p>Josh</p>",
        "id": 294765817,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661201885
    }
]