[
    {
        "content": "<p>From: <a href=\"mailto:list-announcer@dbai.tuwien.ac.at\">list-announcer@dbai.tuwien.ac.at</a><br>\nFunded Doctoral Positions in Computer Science</p>\n<p>TU Wien, TU Graz, and JKU Linz are seeking exceptionally talented and<br>\nmotivated students for their joint doctoral program LogiCS. The LogiCS<br>\ndoctoral college focuses on interdisciplinary research topics covering</p>\n<p>(i) computational logic, and applications of logic to<br>\n(ii) databases and artificial intelligence as well as to<br>\n(iii) computer-aided verification.</p>\n<p>THE PROGRAM</p>\n<p>LogiCS is a doctoral college focusing on logic and its applications in<br>\ncomputer science. Successful applicants will work with and be<br>\nsupervised by leading researchers in the fields of computational<br>\nlogic, databases and knowledge representation, and computer-aided<br>\nverification.</p>\n<p>FACULTY MEMBERS</p>\n<p>M. Baaz     A. Biere  R. Bloem         A. Ciabattoni<br>\nU. Egly     T. Eiter  C. Fermueller    R. Grosu<br>\nA. Leitsch  M. Ortiz  R. Pichler       S. Szeider<br>\nH. Tompits  H. Veith  G. Weissenbacher</p>\n<p>The LogiCS faculty comprises 15 renowned researchers with strong<br>\nrecords in research, teaching and advising, complemented by 12<br>\nassociated members who further strengthen the research and teaching<br>\nactivities of the college.</p>\n<p>Details are provided on <a href=\"http://logic-cs.at/faculty/\">http://logic-cs.at/faculty/</a></p>\n<p>POSITIONS AND FUNDING</p>\n<p>We are looking for 1 doctoral students per faculty member, where 30%<br>\nof the positions are reserved for highly qualified female candidates.<br>\nThe doctoral positions are funded for a period of 3 years according to<br>\nthe funding scheme of the Austrian Science Fund (details:<br>\n<a href=\"http://www.fwf.ac.at/de/forschungsfoerderung/personalkostensaetze/\">http://www.fwf.ac.at/de/forschungsfoerderung/personalkostensaetze/</a>)<br>\nThe funding can be extended for one additional year contingent on a<br>\nplacement at one of our international partner institutions.</p>\n<p>CURRENT RESEACH AREAS</p>\n<p>At the moment we are particularly looking for people in the following areas:</p>\n<ul>\n<li>Answer Set Programming</li>\n<li>Concurrency</li>\n<li>Description Logic</li>\n<li>Database Theory</li>\n<li>Model Checking</li>\n<li>Proof Theory and Automated Deduction</li>\n<li>QBF Solving</li>\n</ul>\n<p>HOW TO APPLY</p>\n<p>Detailed information about the application process is available on the<br>\nLogiCS web-page</p>\n<p><a href=\"http://logic-cs.at/phd/\">http://logic-cs.at/phd/</a></p>\n<p>The applicants are expected to have completed an excellent diploma or<br>\nmaster's degree in computer science, mathematics, or a related field.<br>\nCandidates with comparable achievements will be considered on a<br>\ncase-by-case basis. Applications by the candidates need to be<br>\nsubmitted electronically.</p>\n<p>Next application Deadline: July 1, 2015.</p>\n<p>LOGIC IN AUSTRIA</p>\n<p>Austria has a highly active and successful logic in computer science community.<br>\nRecent activities include:</p>\n<p><a href=\"http://vsl2014.at\">vsl2014.at</a><br>\nVienna Summer of Logic, the Largest Conference in the History of Logic</p>\n<p><a href=\"http://www.arise.or.at\">www.arise.or.at</a><br>\nAustrian Research Network in Rigorous Systems Engineering</p>\n<p><a href=\"http://vcla.at\">vcla.at</a><br>\nVienna Center for Logic and Algorithms</p>\n<p><a href=\"http://kgs.logic.at\">kgs.logic.at</a><br>\nInternational Kurt Goedel Society</p>\n<p>HIGHEST QUALITY OF LIFE</p>\n<p>The Austrian cities Vienna, Graz, and Linz, located close to the Alps<br>\nand surrounded by beautiful nature, provide an exceptionally high<br>\nquality of life, with a vibrant cultural scene, numerous cultural<br>\nevents, world-famous historical sites, a large international<br>\ncommunity, a varied cuisine and famous coffee houses.</p>\n<p>For further information please contact:<br>\n<a href=\"mailto:info@logic-cs.at\">info@logic-cs.at</a></p>",
        "id": 294642162,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661162560
    }
]