[
    {
        "content": "<p>From: June Andronick &lt;<a href=\"mailto:June.Andronick@nicta.com.au\">June.Andronick@nicta.com.au</a>&gt;<br>\n[Apologies for multiple copies. Please forward to anyone interested.]</p>\n<p>Data61 Seeking Proof Engineers<br>\n==============================<br>\n(applications close 15 October 2015)<br>\n<a href=\"http://ssrg.nicta.com.au/jobs/proof-engineers2015\">http://ssrg.nicta.com.au/jobs/proof-engineers2015</a></p>\n<p>If only there was a place where I could prove theorems for money, change the<br>\nworld, and have fun while doing it...</p>\n<p>Sounds too good to exist?</p>\n<p>In the Trustworthy Systems team at Data61, formerly known as NICTA, that's<br>\nwhat we do for a living. We are the creators of seL4, the world's first fully<br>\nformally verified operating system kernel with extreme performance and strong<br>\nsecurity &amp; correctness proofs. Our highly international team is located on<br>\nthe UNSW campus, close to the beautiful beaches of sunny Sydney, Australia,<br>\none of the world's most liveable cities.</p>\n<p>We are looking for multiple motivated entry-level proof engineers who want to<br>\njoin our team, move things forward, and have global impact. We are expanding<br>\nour team, because seL4 is going places. There are active projects around the<br>\nworld in</p>\n<p>- Automotive - because cars have been hacked enough<br>\n  - Aviation - for more security and safety for autonomous vehicles<br>\n  - Connected consumer devices - with security built in from the start<br>\n  - SCADA - for more secure intelligent industrial control automation<br>\n  - Spaceflight, autonomous and crewed - because awesome</p>\n<p>To make these projects successful, we need to scale formal verification.<br>\nYou would</p>\n<p>- work on industrial-scale formal proofs in Isabelle/HOL<br>\n  - help to extend and improve existing proofs or verify new features in seL4<br>\n  - contribute to improved proof automation and better reasoning techniques<br>\n  - apply formal proof to real-world systems and tools</p>\n<p>To apply for this position, you should possess a significant subset of the<br>\nfollowing skills.</p>\n<p>- functional programming in a language like Haskell, ML, or OCaml<br>\n  - first-order or higher-order formal logic<br>\n  - basic experience in C<br>\n  - ability and desire to quickly learn new techniques<br>\n  - undergraduate degree in Computer Science, Mathematics, or similar<br>\n  - ability and desire to work in a larger team</p>\n<p>If you additionally have experience</p>\n<p>- in software verification with an interactive theorem prover such as<br>\n    Isabelle/HOL or Coq, and/or</p>\n<p>- with operating systems and microkernels</p>\n<p>you should definitely apply!</p>\n<p>If you have the right skills and background, we can provide training on the job.<br>\nContinual learning is a central component of everything we do. You will work<br>\nwith a unique world-leading combination of OS and formal methods experts,<br>\nstudents at undergraduate and PhD level, engineers, and researchers from 5<br>\ncontinents, speaking over 15 languages. Trustworthy Systems is a fun,<br>\ncreative, and welcoming workplace with full health insurance and flexible<br>\nhours &amp; work arrangements.</p>\n<p>We value diversity in all forms and welcome applications from people<br>\nof all ages, including people with a disability, and those who identify as<br>\nLGBTIQ. See <a href=\"http://ssrg.nicta.com.au/diversity/\">http://ssrg.nicta.com.au/diversity/</a> for more information.</p>\n<p>The salary range for this position is AUD 65,000 to 90,000 for recent<br>\ngraduates, depending on experience and qualification.</p>\n<p>Apply by sending your CV, undergraduate transcript (if applicable), two<br>\nreferences, and cover letter to &lt;<a href=\"mailto:gerwin.klein@nicta.com.au\">gerwin.klein@nicta.com.au</a>&gt; and<br>\n&lt;<a href=\"mailto:june.andronick@nicta.com.au\">june.andronick@nicta.com.au</a>&gt;.</p>\n<p>This round of applications closes 15 October 2015.</p>\n<p>The seL4 code and proof are open source. Check them out at<br>\n<a href=\"https://github.com/seL4\">https://github.com/seL4</a></p>\n<p>More information about NICTA's Trustworthy Systems team at<br>\n<a href=\"http://ssrg.nicta.com.au\">http://ssrg.nicta.com.au</a></p>\n<p>Still studying? We also have internship opportunities!<br>\n<a href=\"http://ssrg.nicta.com.au/students/\">http://ssrg.nicta.com.au/students/</a></p>",
        "id": 294654778,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661167580
    }
]