[
    {
        "content": "<p>From: \"Ridgway, John V. E.\" &lt;<a href=\"mailto:John.Ridgway@trincoll.edu\">John.Ridgway@trincoll.edu</a>&gt;<br>\nThis seems like a really simple question, but I can't find an answer in the documentation anywhere.  Maybe I'm just looking in the wrong places.  If so, can somebody give me a pointer?</p>\n<p>I am working on a proof, of a fairly complex lemma, and at one point I enter</p>\n<p>apply(auto)</p>\n<p>Isabelle then thinks for a while and gives me back a list of the remaining goals.  I then enter</p>\n<p>apply(force)</p>\n<p>and the first of the remaining goals is discharged.  I was under the impression (apparently incorrect) that apply(auto) was essentially the same as apply(force) except that it was applied to all goals.  Is this wrong?  Furthermore, at another place in the proof, when I try apply(auto) it ends me up with a goal of False, whereas when I try apply(force)+ I don't have the patience to wait for it to finish...</p>\n<p>Also, can someone characterize the difference between intro, intro!, and intro?; likewise, elim, elim!, and elim?.</p>\n<p>Another issue I'm having is that I have a rule that is declared simp that is not being used.  I can force it with apply(subst ...) but I'd really like it to be done automatically.  I suspect that there's an issue that it's buried too deep.  The rule is:</p>\n<p>lemma popframecx_newframecx_same [simp]: \"<br>\n  \\&lt;lbrakk&gt; (ctrltoprimmech (exntoctrlmech cx), R_cx) \\&lt;in&gt; validmechanism \\&lt;rbrakk&gt;<br>\n    \\&lt;Longrightarrow&gt; <br>\n  popframecx cx (newframecx cx F R_cx) = Some (F, R_cx)\"</p>\n<p>and the goal it's not being applied in is:</p>\n<p>\\&lt;exists&gt;aa b. popframecx (relatedexceptionhandler a)<br>\n                  (newframecx (relatedexceptionhandler a) (Restore r R_r)<br>\n                    (newframecx (relatedexceptionhandler a) (Replace (ctrltoprimmech (conttoctrlmech a)) R_a) R_cx)) =<br>\n                 Some (aa, b)</p>\n<p>If this is indeed a case of the simplification just being too buried, how can I request that Isabelle look deeper?  If that isn't the case, then why does apply(subst popframecx_newframecx_same) work when simp doesn't?  And yes, the premise of popframecx_newframecx_same can be solved by apply(simp).</p>\n<p>Am I making myself clear?  More importantly perhaps, is there some piece of documentation available that would clarify all of this for me?</p>\n<p>Thank you for your attention, and apologies for troubling you if this is a silly question.</p>\n<p>Peace</p>\n<ul>\n<li>John</li>\n</ul>",
        "id": 294160310,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660852889
    },
    {
        "content": "<p>From: Lawrence Paulson &lt;<a href=\"mailto:lp15@cam.ac.uk\">lp15@cam.ac.uk</a>&gt;<br>\nThe intention of auto is to do all possible obvious steps to all goals, and return whatever is left over. And auto is supposed to return fairly quickly.</p>\n<p>The intention of force is to throw everything at the first goal, and never give up until it is proved.</p>\n<p>Larry Paulson</p>",
        "id": 294160314,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660852891
    },
    {
        "content": "<p>From: Ramana Kumar &lt;<a href=\"mailto:rk436@cam.ac.uk\">rk436@cam.ac.uk</a>&gt;<br>\nThat might mean your goal is unprovable (and you should double-check your<br>\ntheorem statement...).<br>\n(It could also mean that there are contradictions in your assumptions or<br>\ncontext somewhere that auto hasn't noticed.)<br>\nI guess apply(force) in that place is \"never giving up\" (as Larry said)<br>\ntrying to prove an unprovable goal, and therefore running forever.</p>",
        "id": 294160345,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660852899
    },
    {
        "content": "<p>From: Lars Noschinski &lt;<a href=\"mailto:noschinl@in.tum.de\">noschinl@in.tum.de</a>&gt;<br>\nHave you looked at the simplifier trace, whether it tries to apply said <br>\nrule? The trace can be enabled by adding \"using [[simp_trace]]\") before <br>\napplying simp. To see how the simplifier handles conditional rules. You <br>\nmight want to increase the tracing depth with \"using <br>\n[[simp_trace_depth_limit=n]]\" for some appropriate value of n.</p>\n<p>-- Lars</p>",
        "id": 294160371,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660852910
    }
]