[
    {
        "content": "<p>From: Gerwin Klein &lt;<a href=\"mailto:gerwin.klein@nicta.com.au\">gerwin.klein@nicta.com.au</a>&gt;<br>\n[Note: Submission Deadline is 19 September 2012,<br>\nAbstract Deadline is 14 September 2012]</p>\n<p>7th Systems Software Verification Conference (SSV 2012)<br>\n                November 28--30, 2012<br>\n                  Sydney, Australia</p>\n<p><a href=\"http://www.ssv-conference.org/\">http://www.ssv-conference.org/</a></p>\n<p>*Scope</p>\n<p>Industrial-strength software analysis and verification has advanced in<br>\nrecent years through the introduction of model checking, automated and<br>\ninteractive theorem  proving, and static analysis  techniques, as well<br>\nas correctness  by design,  correctness by contract,  and model-driven<br>\ndevelopment.  However, many techniques  are working  under restrictive<br>\nassumptions that are invalidated  by complex embedded systems software<br>\nsuch  as  operating  system  kernels,  low-level  device drivers,  or<br>\nmicrocontroller code.</p>\n<p>The  aim  of  this  workshop  is to  bring  together researchers  and<br>\ndevelopers  from  both  academia  and  industry who  are facing  real<br>\nsoftware and real  problems with the goal of  finding real, applicable<br>\nsolutions.  By  “real” we  mean  problems  such  as time-to-market  or<br>\nreliability that the  industry is facing. A real  solution is one that<br>\nis applicable to the problem in industry and not one that only applies<br>\nto an abstract, academic, toy version  of it. In this workshop we will<br>\ndiscuss software  analysis and development techniques  and tools; this<br>\nforum will  serve as  a platform to  discuss open problems and future<br>\nchallenges in dealing with existing and upcoming systems-level code.</p>\n<p>Topics include, but are not restricted to:<br>\n    • Model checking<br>\n    • Automated and interactive theorem proving<br>\n    • Static analysis<br>\n    • Automated testing<br>\n    • Model-driven development<br>\n    • Embedded systems development<br>\n    • Programming languages<br>\n    • Verifying compilers<br>\n    • Software certification<br>\n    • Software tools<br>\n    • Experience reports</p>\n<p>*Submissions</p>\n<p>Submissions must  be made electronically through  the EasyChair system<br>\n(<a href=\"https://www.easychair.org/conferences/?conf=ssv2012\">https://www.easychair.org/conferences/?conf=ssv2012</a>)  until September<br>\n19th,  2012.  Papers should  be  up  to 10  pages  in  pdf format  and<br>\nformatted  in EPTCS  style. Additional  details  may be included in a<br>\nclearly marked appendix,  which will be read at  the discretion of the<br>\nprogram committee.   All will be  subject to peer review under normal<br>\nconference  standards.   Experience  reports  and papers  on work  in<br>\nprogress    are   welcome   as    long   as    there   is    a clear<br>\ncontribution.  Submissions which  are based  or discuss  a non-trivial<br>\npiece of software are required to make all those non-standard software<br>\nparts  available, which  a referee  may need,  in order  to check the<br>\nclaims of the submission.</p>\n<p>Submitted papers  must not  have previously appeared  in a journal or<br>\nconference  with published  proceedings and  must not  be concurrently<br>\nsubmitted to  any other peer-reviewed  workshop, symposium, conference<br>\nor archival  journal. Any partial  overlap with any such published or<br>\nconcurrently submitted paper must be clearly indicated.</p>\n<p>*Publication </p>\n<p>The proceedings will be published with EPTCS (<a href=\"http://eptcs.org\">http://eptcs.org</a>).</p>\n<p>*Important Dates</p>\n<p>Abstract Submission: September 14, 2012<br>\nPaper Submission: September 19, 2012<br>\nNotification: October 19, 2012<br>\nConference: November 28–30, 2012</p>\n<p>*Location</p>\n<p>The workshop will be held in Sydney, Australia at NICTA NRL Laboratory.</p>\n<p>*Organization</p>\n<p>Organizing Committee and PC Chairs<br>\n    • F. Cassez, NICTA, Sydney, Australia<br>\n    • R. Huuck, NICTA and UNSW, Sydney, Australia<br>\n    • G. Klein, NICTA and UNSW, Sydney, Australia<br>\n    • B. Schlich, ABB Corporate Research, Ladenburg, Germany</p>\n<p>Program Committee<br>\n    • Cyrille Artho, AIST, RISEC, Japan<br>\n    • Stefan Berghofer, Secunet, Germany<br>\n    • Frédéric Boniol, ONERA, France<br>\n    • Alessandro Coglio, Kestrel, USA<br>\n    • Joe Hurd, Intel, USA<br>\n    • Stefan Kowalewski, RWTH Aachen University, Germany<br>\n    • Thomas Kropf, Robert Bosch GmbH &amp; U. of Tübingen, Germany<br>\n    • Kim G. Larsen, CISS, Aalborg University, Denmark<br>\n    • Toby Murray, NICTA, Sydney, Australia<br>\n    • Jan Peleska, Verified Systems International GmbH and<br>\n            University of Bremen, Germany<br>\n    • John Regehr, University of Utah, USA<br>\n    • Natarajan Shankar, SRI, USA<br>\n    • Zhong Shao, Yale, USA<br>\n    • Konrad Slind, Rockwell Collins, USA<br>\n    • Jun Sun, National University of Singapore, Singapore</p>",
        "id": 294223609,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660898793
    }
]