[
    {
        "content": "<p>From: Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt;<br>\nOn Fri, 29 Jan 2016, Eugene W. Stark wrote:</p>\n<blockquote>\n<p>Since I started using Isabelle/JEdit (under Ubuntu), I have had issues <br>\nwith the Search/Replace dialog.  One that occurs very frequently is the <br>\n\"Window must not be zero\" exception.  I just downloaded Isabelle2016-RC2 <br>\nand since it has happened now nearly immediately with that, I am <br>\nreporting it.  The stack trace is shown below.  I don't have a <br>\ndeterministic way to repeat it -- it just happens often while doing <br>\nsearch and replace, perhaps associated with the \"No more matches found, <br>\ncontinue from the beginning\" dialog.</p>\n</blockquote>\n<p>Yes, looking at the corresponding Java sources of jEdit, it is indeed the <br>\n\"keepsearching\" dialog.  But I don't think that jEdit is at fault.</p>\n<blockquote>\n<p>java.lang.IllegalArgumentException: Window must not be zero<br>\n  at sun.awt.X11.WindowPropertyGetter.&lt;init&gt;(WindowPropertyGetter.java:56)</p>\n</blockquote>\n<p>Browsing through the world wild web, this exception occurs frequently in <br>\ntrackers of Java/AWT/Swing projects like Netbeans, without any solution. <br>\nThey usually say \"wontfix\" and point fingers back to Oracle.</p>\n<p>It might be indeed one of these standard X11 window manager problems. The <br>\nIsabelle2016-RC2 Installation page specifies this intentionally as <br>\nfollows: \"Proper Window manager / Desktop environment that works with <br>\nJava/AWT/Swing\".</p>\n<p>You could try your luck openjdk-7 or openjdk-8 from the Ubuntu repository. <br>\nThe resulting main directory is something like <br>\n/usr/lib/jvm/java-7-openjdk-amd64</p>\n<p>It needs to be put in two places:</p>\n<p>(1) $ISABELLE_HOME_USER/etc/settings:</p>\n<p>ISABELLE_JDK_HOME=\"/usr/lib/jvm/java-7-openjdk-amd64\"</p>\n<p>(2) $ISABELLE_HOME/Isabelle2016-RC2.run near the end:</p>\n<p>exec \"/usr/lib/jvm/java-7-openjdk-amd64/jre/bin/java\" \\<br>\n       ...</p>\n<p>For this Isabelle release, there is still a choice between Java 7 and 8 (I <br>\nthink).  We need to bundle Java 8 by default, since Oracle no longer <br>\nprovides updates to its Java 7 distribution.  It is unclear to me, which <br>\none is worse or better.</p>\n<p>Makarius</p>",
        "id": 294664046,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661171033
    },
    {
        "content": "<p>From: \"Eugene W. Stark\" &lt;<a href=\"mailto:isabelle-users@starkeffect.com\">isabelle-users@starkeffect.com</a>&gt;<br>\nI guess I will try what you suggest, however as additional data points<br>\nI was able to recreate the situation when I reloaded the same files,<br>\nboth on Isabelle2016-RC2 and -RC1.</p>\n<p>The situation seemed to be triggered by \"Enter MATCH...\" spew spamming<br>\nthe output window.  Apparently there was enough of it so that it filled<br>\nthe JVM heap and perhaps caused continuous GC (speculation).<br>\nEventually, poly became quiescent and presumably stopped sending output<br>\nto JEdit, but as I noted, JEdit did not recover, and after many minutes<br>\nI ended up killing it from the shell.</p>\n<p>I also noticed upon restarting after killing that the first time JEdit<br>\nis restarted, it generates a \"Failed to load Plugin\" message, and does not<br>\nproperly initialize.  Upon exiting and starting once again, it starts<br>\nnormally.  So there is some state information that is retained somewhere<br>\nthat prevents normal starting the first time after a crash or kill.</p>\n<p>- Gene Stark</p>",
        "id": 294664122,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661171052
    },
    {
        "content": "<p>From: Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt;<br>\nI guess it actually refers to the thread \"JEdit lockup with Java at 100% <br>\nCPU\".</p>\n<p>Since \"Enter MATCH ...\" is a formal \"tracing\" message, it should be <br>\nthrottled according to system option editor_tracing_messages (default <br>\n1000), which is accessible in Plugin Options / Isabelle / General.</p>\n<p>Did you change that option?</p>\n<p>Another question is where these masses of \"Enter MATCH ...\" messages are <br>\nproduced. It is normally some bad situation that can be avoided.</p>\n<p>Makarius</p>",
        "id": 294664137,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661171057
    }
]