[
    {
        "content": "<p>From: <a href=\"mailto:Gerwin.Klein@data61.csiro.au\">Gerwin.Klein@data61.csiro.au</a><br>\nThe AFP is now available for Isabelle2017.</p>\n<p>With the new release two new entries from the development version have become available from the front page on <a href=\"https://www.isa-afp.org/\">https://www.isa-afp.org/</a></p>\n<p>Dictionary Construction<br>\nby Lars Hupel</p>\n<p>Isabelle's code generator natively supports type classes. For targets that do not have language support for classes and instances, it performs the well-known dictionary translation, as described by Haftmann and Nipkow. This translation happens outside the logic, i.e., there is no guarantee that it is correct, besides the pen-and-paper proof. This work implements a certified dictionary translation that produces new class-free constants and derives equality theorems.</p>\n<p><a href=\"https://www.isa-afp.org/entries/Dict_Construction.html\">https://www.isa-afp.org/entries/Dict_Construction.html</a></p>\n<p>Stone-Kleene Relation Algebras<br>\nby Walter Guttmann</p>\n<p>We develop Stone-Kleene relation algebras, which expand Stone relation algebras with a Kleene star operation to describe reachability in weighted graphs. Many properties of the Kleene star arise as a special case of a more general theory of iteration based on Conway semirings extended by simulation axioms. This includes several theorems representing complex program transformations. We formally prove the correctness of Conway's automata-based construction of the Kleene star of a matrix. We prove numerous results useful for reasoning about weighted graphs.</p>\n<p><a href=\"https://www.isa-afp.org/entries/Stone_Kleene_Relation_Algebras.html\">https://www.isa-afp.org/entries/Stone_Kleene_Relation_Algebras.html</a></p>\n<p>With Isabelle2017's new session-qualified theory imports it has now become easier to refer to AFP entries in your own developments and for AFP entries to refer to each other. We have updated the instructions on the AFP website accordingly.</p>\n<p>The AFP now contains over 1.7 million lines of proof with over 100,000 lemmas in 377 articles from 266 authors. Keep them coming!</p>\n<p>Enjoy!<br>\nGerwin</p>",
        "id": 294721282,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661184904
    }
]