[
    {
        "content": "<p>From: Lawrence Paulson &lt;<a href=\"mailto:lp15@cam.ac.uk\">lp15@cam.ac.uk</a>&gt;<br>\nIt is time to begin the process of selecting a host for ITP 2011, the International Conference on Interactive Theorem Proving. </p>\n<p>Following tradition from TPHOLs, the hosts of the previous conference (ITP 2010) are running the process. There are two phases: solicitation of bids and voting. This message concerns the first phase. A long-standing TPHOLs convention is that the conference should be held in a continent different from the location of the previous meeting, and therefore no bids to host ITP 2011 in Europe will be accepted. Based on ITP and TPHOLs history, ITP 2011 will likely be held in July, August or September. (The ACL2 Workshop has taken place at various times of year.)</p>\n<p>Bids should be sent to <a href=\"mailto:itp10@easychair.org\">itp10@easychair.org</a> and should include at least<br>\nthe following information:</p>\n<ul>\n<li>name and email address of a contact person</li>\n<li>names of other people involved</li>\n<li>address of website for the bid</li>\n<li>approximate dates of the conference</li>\n<li>structure (e.g., k workshop days and n days of presentations followed by excursion...)</li>\n<li>advantages of the proposed venue</li>\n</ul>\n<p>An example of a previous winning bid is here: <a href=\"http://web2.comlab.ox.ac.uk/oucl/conferences/TPHOLs2005/bid.html\">http://web2.comlab.ox.ac.uk/oucl/conferences/TPHOLs2005/bid.html</a></p>\n<p>Deadline for all bids is Monday, 4 January 2010. Shortly after that, the bids will be made public and the voting phase will take place.  The people eligible to vote are those who are seriously thinking of attending ITP 2011. The voting system used will be Single Transferable Vote between all received bids.</p>\n<p>(Note: ACL2 papers will be welcome at ITP 2011, regardless of whether<br>\nor not there is a separate ACL2 workshop in 2011.)</p>\n<p>Matt Kaufmann and Larry Paulson</p>",
        "id": 294092124,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660832185
    },
    {
        "content": "<p>From: Lawrence Paulson &lt;<a href=\"mailto:lp15@cam.ac.uk\">lp15@cam.ac.uk</a>&gt;<br>\nHello,</p>\n<p>We received no bids for hosting ITP 2011.  Therefore, we will also<br>\nentertain bids to host ITP 2011 in Europe, in spite of our previous<br>\nrestriction against that.</p>\n<p>If you might be interested in hosting (whether in Europe or not),<br>\nplease send a reply only to <a href=\"mailto:itp10@easychair.org\">itp10@easychair.org</a>, no later than<br>\nWednesday of next week, January 13, just to let us know that you are<br>\nconsidering it.</p>\n<p>Matt Kaufmann and Larry Paulson</p>\n<p>-------- Start of forwarded message -------</p>",
        "id": 294099038,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660833197
    }
]