[
    {
        "content": "<p>From: Stephan Merz &lt;<a href=\"mailto:Stephan.Merz@loria.fr\">Stephan.Merz@loria.fr</a>&gt;<br>\nCALL FOR PAPERS</p>\n<p>8th International Conference on Integrated Formal Methods (iFM 2010)</p>\n<p>October 11-14, 2010, Nancy, France</p>\n<p><a href=\"http://ifm2010.loria.fr/\">http://ifm2010.loria.fr/</a></p>\n<p>Applying formal methods may involve the modeling of different aspects of a system that are expressed through different paradigms. Correspondingly, different analysis techniques will be used to examine differently modeled system views, different kinds of properties, or simply in order to cope with the       sheer complexity of the system. The iFM conference series seeks to further research into the combination of (formal and semi-formal) methods for system development, regarding modeling and analysis, and covering all aspects from language design through verification and analysis techniques to tools and their integration into software engineering practice.</p>\n<p>Areas of interest include but are not limited to:</p>\n<ul>\n<li>Integration of formal modeling and analysis methods</li>\n<li>Integration of formal and semi-formal modeling and analysis methods</li>\n<li>Integration of formal methods into software engineering practice</li>\n<li>Semantics, Logics, Type systems</li>\n<li>Verification, Model checking, Static analysis, Theorem proving</li>\n<li>Refinement, Model transformations</li>\n<li>Tools, Experience reports, Case studies</li>\n</ul>\n<p>Invited Speakers:</p>\n<ul>\n<li>Christel Baier, TU Dresden</li>\n<li>John Fitzgerald, Newcastle University</li>\n<li>Rajeev Joshi, Laboratory for Reliable Software, JPL</li>\n</ul>\n<p>iFM 2010 solicits high quality papers reporting research results and/or experience reports related to the overall theme of method integration. All papers must be original, unpublished, and not submitted for publication elsewhere. Submission will be electronically as PDF or Postscript, using the Springer  LNCS format. Papers should not exceed 15 pages in length. Each paper will undergo a thorough review process. The conference proceedings will be published by Springer Verlag in the LNCS series.</p>\n<p>Important Dates:</p>\n<ul>\n<li>Abstract submission: May 14, 2010</li>\n<li>Full paper submission: May 21, 2010</li>\n<li>Notification: July 4, 2010</li>\n<li>Final version: July 18, 2010</li>\n</ul>\n<p>Contact: <a href=\"mailto:ifm2010@loria.fr\">ifm2010@loria.fr</a></p>",
        "id": 294102694,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660834264
    }
]