[
    {
        "content": "<p>From: \"Farquhar, Colin I\" &lt;<a href=\"mailto:cif30@hw.ac.uk\">cif30@hw.ac.uk</a>&gt;<br>\nDear Isabelle List,</p>\n<p>I'm having some trouble getting the information I need from some proof terms. Specifically, I'm trying to find the sub-goals generated by each rule application. Take for example the lemma below:</p>\n<p>lemma test: \"A ⟶ A ⟶ A ∧ A\"<br>\n  apply (rule impI)<br>\n  apply (rule impI)<br>\n  apply (rule conjI)<br>\n  apply assumption<br>\n  apply assumption<br>\n  done</p>\n<p>The \"full_prf\" command gives the proof term thm.HOL.impI ⋅ ?A ⋅ ?A ⟶ ?A ∧ ?A ∙ (ΛH: ?A. thm.HOL.impI ⋅ ?A ⋅ ?A ∧ ?A ∙ (ΛHa: ?A. conjI ⋅ ?A ⋅ ?A ∙ H ∙ H)). While this does show what I'm looking for, I'm trying to present it in a different format. I have already written functions which look at the nuts and bolts of a proof term and extract information about the rules used, but I can't find the equivalent information about the goals. I've looked at the construction of full_prf and followed the chain of functions back a few steps, but haven't had much luck. I believe the information I'm looking for is used in the reconstruction of the proof, but haven't found it yet. Am I looking in the right place? If not, can anyone give me a nudge in the right direction?</p>\n<p>Thanks for any help you can offer.</p>\n<p>Colin Farquhar</p>\n<hr>\n<p>Sunday Times Scottish University of the Year 2011-2013<br>\nTop in the UK for student experience<br>\nFourth university in the UK and top in Scotland (National Student Survey 2012)</p>\n<p>We invite research leaders and ambitious early career researchers to <br>\njoin us in leading and driving research in key inter-disciplinary themes. <br>\nPlease see <a href=\"http://www.hw.ac.uk/researchleaders\">www.hw.ac.uk/researchleaders</a> for further information and how<br>\nto apply.</p>\n<p>Heriot-Watt University is a Scottish charity<br>\nregistered under charity number SC000278.</p>",
        "id": 294279780,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660919962
    }
]