[
    {
        "content": "<p>From: <a href=\"mailto:Ian.Horrocks@comlab.ox.ac.uk\">Ian.Horrocks@comlab.ox.ac.uk</a><br>\nOXFORD UNIVERSITY COMPUTING LABORATORY</p>\n<p>Fully Funded D.Phil (PhD) Studentship</p>\n<p>Project: ConDOR: Consequence-Driven Ontology Reasoning</p>\n<p>The Knowledge Representation and Reasoning Group is offering a fully funded D. Phil (PhD) position at Oxford University's Computing Laboratory. The post is funded by EPSRC as part of the ConDOR project [1]. The aim of the project is to investigate alternative kinds of \"consequence driven\" reasoning procedures for widely used knowledge representation formalisms, including the W3C's OWL ontology language [2].</p>\n<p>The studentship is fully funded (at EU fees level), and includes a stipend of at least 12,940 per year as well as provision for travel to conferences. Students admitted with a start date between 1st January and 1st October, 2009 will receive a guarantee of 3 years funding. The successful candidate will join an internationally renowned research group [2] working on a cutting edge research problem in an attractive and stimulating environment within one of the worlds leading universities and computer science departments [3].</p>\n<p>Further details, including eligibility requirements and application are available from [4]. Prospective candidates are also welcome to contact Dr Yevgeny Kazakov (<a href=\"mailto:yevgeny.kazakov@comlab.ox.ac.uk\">yevgeny.kazakov@comlab.ox.ac.uk</a>) or Prof Ian Horrocks (<a href=\"mailto:ian.horrocks@comlab.ox.ac.uk\">ian.horrocks@comlab.ox.ac.uk</a>) for further information about the project and/or the post.</p>\n<p>The closing date for applications is Tuesday 20th January 2009.</p>\n<p>Oxford University is and Equal Opportunities Employer.</p>\n<p>[1] <a href=\"http://web.comlab.ox.ac.uk/projects/ConDOR/index.html\">http://web.comlab.ox.ac.uk/projects/ConDOR/index.html</a><br>\n[2] <a href=\"http://en.wikipedia.org/wiki/Web_Ontology_Language\">http://en.wikipedia.org/wiki/Web_Ontology_Language</a><br>\n[3] <a href=\"http://web.comlab.ox.ac.uk/\">http://web.comlab.ox.ac.uk/</a><br>\n[4] <a href=\"http://web.comlab.ox.ac.uk/news/56-full.html\">http://web.comlab.ox.ac.uk/news/56-full.html</a></p>",
        "id": 294069218,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660826589
    }
]