[
    {
        "content": "<p>From: \"Alan P. Sexton\" &lt;<a href=\"mailto:A.P.Sexton@cs.bham.ac.uk\">A.P.Sexton@cs.bham.ac.uk</a>&gt;<br>\n[Apologies for duplicate postings]</p>\n<p>The 9th International Conference on<br>\n      MATHEMATICAL KNOWLEDGE MANAGEMENT</p>\n<p>MKM 2010</p>\n<p><a href=\"http://cicm2010.cnam.fr/mkm/\">http://cicm2010.cnam.fr/mkm/</a></p>\n<p>CNAM, Paris, France, 8th-10th July 2010</p>\n<p>CALL FOR PAPERS</p>\n<p>Mathematical Knowledge Management is an innovative field at the<br>\nintersection of mathematics, computer science, library science, and<br>\nscientific publishing. Its development is driven, on the one hand, by<br>\nnew technological possibilities which computer science, the Internet,<br>\nand intelligent knowledge processing offer, and, on the other hand, by<br>\nthe increasing demand by engineers and scientists for new techniques to<br>\nhelp in producing, transmitting, consuming, and managing sophisticated<br>\nmathematical knowledge.</p>\n<p>The conference is concerned with all aspects of mathematical knowledge<br>\nmanagement. Topics covered include, but are not limited to:.</p>\n<ul>\n<li>Representations of mathematical knowledge</li>\n<li>Repositories of formalized mathematics</li>\n<li>Mathematical digital libraries</li>\n<li>Diagrammatic representations</li>\n<li>Multi-modal representations</li>\n<li>Mathematical OCR</li>\n<li>Mathematical search and retrieval</li>\n<li>Deduction systems</li>\n<li>Math assistants, tutoring and assessment systems</li>\n<li>Authoring languages and tools</li>\n<li>MathML, OpenMath, and other mathematical content standards</li>\n<li>Web presentation of mathematics</li>\n<li>Data mining, discovery, theory exploration</li>\n<li>Computer algebra systems</li>\n<li>Collaboration tools for mathematics</li>\n<li>Challenges and solutions for mathematical workflows</li>\n</ul>\n<p>MKM 2010 welcomes research papers and workshop proposals with links to<br>\nthe above topics. The conference proceedings will be published in the<br>\nSpringer-Verlag series Lecture Notes in Artificial Intelligence (LNAI).</p>\n<p>More information about the MKM conference series can be found at the MKM<br>\nInterest Group Webpage: <a href=\"http://www.mkm-ig.org/\">http://www.mkm-ig.org/</a></p>\n<p>Submission Categories<br>\n=====================</p>\n<p>Papers may be submitted in one of three categories: full papers, short<br>\npapers or system descriptions.</p>\n<p>Both full papers and system descriptions should not exceed 15 pages,<br>\nmust be original and not be submitted for consideration elsewhere. Full<br>\nor system description papers that are accepted will be published in the<br>\nconference proceedings. A submission not accepted as a full paper or<br>\nsystem description will automatically be considered as a short paper.</p>\n<p>Short papers are of a less formal nature. They are intended to provide a<br>\nforum for the presentation and discussion of works in progress or ideas<br>\nthat are not (yet) in a suitable form for submission as a full or system<br>\ndescription paper. They may be up to 5 pages in LNCS style. Depending on<br>\nthe number of short papers accepted, presentation may be as a short talk<br>\nor as a poster. It will be at the discretion of the programme committee<br>\nto decide whether individual short papers will be accepted for<br>\npresentation only or for presentation and publication in the conference<br>\nproceedings.</p>\n<p>The development of working systems in the field of Mathematical<br>\nKnowledge Management is a major undertaking of significant value to our<br>\ncommunity. Papers describing such systems, however, are particularly<br>\ndifficult to compare to non-system development based research with<br>\nrespect to criteria common in reviewing. For this reason, papers in the<br>\nsystem description category will be considered separately and an<br>\nevaluation of their special contribution with be taken into account in<br>\nthe review process.</p>\n<p>Review Process<br>\n==============</p>\n<ul>\n<li>\n<p>Authors must submit an abstract by the abstract submission date.</p>\n</li>\n<li>\n<p>The full paper, of any of the three categories, should be received by<br>\n  the paper submission date.</p>\n</li>\n<li>\n<p>Authors will then be sent initial reviews of their submissions.</p>\n</li>\n<li>\n<p>Authors then have the option of, within one week, submitting a single<br>\n  response to the reviews, limited to 500 words, in which they can<br>\n  clarify any issues or anser any questions that the reviewers had about<br>\n  their submission. This response can be submitted only once and cannot<br>\n  thereafter be resubmitted or modified.</p>\n</li>\n<li>\n<p>Final reviews and acceptance rejection decisions will be sent to the<br>\n  authors by the final notification date.</p>\n</li>\n</ul>\n<p>Important Dates<br>\n===============</p>\n<p>Abstract Submission:     Wed, February 24th, 2010<br>\nPaper  Submission:       Wed, March 3rd, 2010<br>\nInitial Reviews Sent:    Wed, March 31st, 2010 <br>\nAuthor's Response Due:   Wed, April 7th, 2010<br>\nNotification:            Wed, April 14th, 2010 <br>\nCamera-ready Papers:     Wed, April 28th, 2010<br>\nConference:              8th-10th July 2010</p>\n<p>Proceedings<br>\n===========</p>\n<p>The proceedings of the conference will be published as a volume in the<br>\nseries Lecture Notes in Artificial Intelligence (LNAI) by<br>\nSpringer-Verlag.</p>\n<p>Submission Details<br>\n==================</p>\n<p>By submitting a paper the authors agree that if it is accepted at least<br>\none of the authors will attend the conference to present it.</p>\n<p>All submissions (except workshop proposals) must be formatted according<br>\nto the guidelines used by Springer Verlag for their LNCS and LNAI<br>\nseries. This format can be found at<br>\n<a href=\"http://www.springer.com/computer/lncs?SGWID=0-164-7-72376-0\">http://www.springer.com/computer/lncs?SGWID=0-164-7-72376-0</a></p>\n<p>Submission website:<br>\n<a href=\"http://www.easychair.org/conferences/?conf=mkm10\">http://www.easychair.org/conferences/?conf=mkm10</a></p>",
        "id": 294098059,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660832918
    }
]