[
    {
        "content": "<p>From: Christian Urban &lt;<a href=\"mailto:urbanc@in.tum.de\">urbanc@in.tum.de</a>&gt;<br>\nCall for Papers</p>\n<p>4rd Informal ACM SIGPLAN Workshop on Mechanizing Metatheory<br>\nEdinburgh, Scotland</p>\n<p>Co-located with ICFP'09.<br>\n<a href=\"http://www.cis.upenn.edu/~sweirich/wmm/\">http://www.cis.upenn.edu/~sweirich/wmm/</a></p>\n<p>Important Dates</p>\n<ul>\n<li>Submission deadline: 19 June 2009</li>\n<li>Author Notification: 24 July 2009</li>\n<li>Workshop: 4 September 2009</li>\n</ul>\n<p>Workshop Description</p>\n<p>Researchers in programming languages have long felt the need for tools<br>\nto help formalize and check their work. With advances in language<br>\ntechnology demanding deep understanding of ever larger and more complex<br>\nlanguages, this need has become urgent. There are a number of automated<br>\nproof assistants being developed within the theorem proving community<br>\nthat seem ready or nearly ready to be applied in this domain-yet,<br>\ndespite numerous individual efforts in this direction, the use of proof<br>\nassistants in programming language research is still not commonplace:<br>\nthe available tools are confusingly diverse, difficult to learn,<br>\ninadequately documented, and lacking in specific library facilities<br>\nrequired for work in programming languages.</p>\n<p>The goal of this workshop is to bring together researchers who have<br>\nexperience using automated proof assistants for programming language<br>\nmetatheory, and those who are interested in using tool support for<br>\nformalizing their work. One starting point for discussion will be the<br>\nobstacles that hinder mechanization (whether they be pragmatic or<br>\ntechnical), and what users and developers can do to overcome them.</p>\n<p>Format</p>\n<p>The workshop will consist of presentations by the participants, selected<br>\nfrom submitted abstracts. It will focus on providing a fruitful<br>\nenvironment for interaction and presentation of ongoing work.<br>\nParticipants are invited to submit working notes, source files, and<br>\nabstracts for distribution to the attendees, but as the workshop has no<br>\nformal proceedings, contributions may still be submitted for publication<br>\nelsewhere. (See the SIGPLAN republication policy for more details.)</p>\n<p>Scope</p>\n<p>The scope of the workshop includes, but is not limited to:</p>\n<ul>\n<li>\n<p>Tool demonstrations: proof assistants, logical frameworks,<br>\n   visualizers, etc.</p>\n</li>\n<li>\n<p>Libraries for programming language metatheory.</p>\n</li>\n<li>Formalization techniques, especially with respect to binding issues.</li>\n<li>Analysis and comparison of solutions to the POPLmark challenge.</li>\n<li>Examples of formalized programming language metatheory.</li>\n<li>Proposals for new challenge problems that benchmark programming<br>\n   language work.</li>\n</ul>\n<p>Submission Guidelines</p>\n<p>Email submissions to urbanc AT <a href=\"http://in.tum.de\">in.tum.de</a>. Submissions should be no<br>\nlonger than two pages in PDF and printable on A4 sized paper.<br>\nPersons for whom this poses a hardship should contact the program<br>\nchair.</p>\n<p>Conference Organization</p>\n<p>Program Committee</p>\n<ul>\n<li>Nick Benton, Microsoft Research Cambridge</li>\n<li>Olivier Danvy, University of Aarhus</li>\n<li>Daniel Licata, Carnegie Mellon University</li>\n<li>Francois Pottier, INRIA Paris-Rocquencourt</li>\n<li>Christian Urban, TU Munich (chair)</li>\n</ul>\n<p>Workshop Organizers</p>\n<ul>\n<li>Karl Crary, Carnegie Mellon University</li>\n<li>Michael Norrish, National ICT Australia</li>\n<li>Stephanie Weirich, University of Pennsylvania</li>\n</ul>\n<p>Previous Workshops</p>\n<ul>\n<li>Victoria, 2008</li>\n<li>Freiburg, 2007</li>\n<li>Portland, 2006</li>\n</ul>",
        "id": 294074876,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660828463
    }
]