[
    {
        "content": "<p>From: Lawrence Paulson &lt;<a href=\"mailto:lp15@cam.ac.uk\">lp15@cam.ac.uk</a>&gt;<br>\nDear all,</p>\n<p>I am reviewing a paper which includes an Isabelle/HOL 2005<br>\nformalization and I want to verify the formalization myself. The<br>\nformalization consists of six files xxx.{thy,ML}, yyy.{thy,ML} and<br>\nzzz.{thy,ML}. I have no prior experience with the Isabelle proof<br>\nassistant.</p>\n<p>Three questions:</p>\n<ul>\n<li>\n<p>How do I install Isabelle/HOL 2005 and use it to verify the<br>\nformalization? My available platforms are OS X and Linux.</p>\n</li>\n<li>\n<p>My background in interactive theorem proving is with Coq. In Coq one<br>\ncan add additional axioms in one's formalization. Can one do something<br>\nsimilar in Isabelle/HOL and if so how do I check what (if any) axioms<br>\nhave been added? (That is, how do I check that the authors of the<br>\npaper have not \"cheated\" in their proofs.)</p>\n</li>\n<li>\n<p>Anything else I should think of?</p>\n</li>\n</ul>\n<p>Best regards,</p>\n<p>Anonymous Reviewer</p>",
        "id": 294674846,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661174598
    },
    {
        "content": "<p>From: Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt;<br>\nAs a long-standing release manager of Isabelle, I want to take the<br>\nopportunity to point out some tautologies:</p>\n<p>* Only the latest Isabelle release is officially supported.</p>\n<p>* The last 2-3 Isabelle releases may still work without further ado,<br>\nand people are welcome to ask questions about them on this mailing list<br>\n(when they say explicitly which version they mean).</p>\n<p>* Much older Isabelle versions often do not work on current operating<br>\nsystems. This is perfectly normal for a complex system that is merely<br>\n\"archived\" (according to the terminology on the Isabelle website), but<br>\nnot actively maintained over time.</p>\n<p>Note that companies like Oracle ask $$$ to continue particular Java<br>\nversions over more than 2 years, for customers who are incapable to get<br>\nonto release trains.</p>\n<p>Makarius</p>",
        "id": 294675302,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661174761
    }
]