[
    {
        "content": "<p>From: Ian Stark &lt;<a href=\"mailto:Ian.Stark@ed.ac.uk\">Ian.Stark@ed.ac.uk</a>&gt;<br>\nTwo Funded PhD Positions at University of Edinburgh<br>\n     Formal Verification of Security Properties for ARM Microcontrollers</p>\n<p>We invite applications for two fully-funded PhD studentships to study the <br>\nformal specification and verification of security features for systems built <br>\nusing ARM microcontrollers.</p>\n<p>Deadline:    31st July 2017 or until posts filled<br>\nStarting date:   Flexible (usual entry Sept 2017/Jan 2018)<br>\nStudentship:     Full tuition fees for UK/EU students, 3.5 years<br>\n                  Stipend of approximately £14,000 per year<br>\n                  Additional £3,500 per year and ARM internship<br>\nRequirements:    Good degree, BSC in Computer Science or similar (2.1 minimum)<br>\n                  Aptitude for subject area (logic, semantics, theorem proving)</p>\n<p>For non UK/EU students, additional fees apply.  Scholarships to cover the <br>\nadditional fees are not generally available.</p>\n<p>The positions are held in the Centre for Doctoral Training in Pervasive <br>\nParallelism at the University of Edinburgh and as part of the Security and <br>\nPrivacy group in Informatics.</p>\n<p>See below for descriptions of the projects.  Details of the research are <br>\nflexible depending on the candidate's interests and background, and ARM's <br>\nprogress and priorities at the time of starting.</p>\n<p>For more information about the studentships, the CDT and the Security and <br>\nPrivacy group go to:</p>\n<p><a href=\"http://pervasiveparallelism.inf.ed.ac.uk/industry-studentships\">http://pervasiveparallelism.inf.ed.ac.uk/industry-studentships</a></p>\n<p><a href=\"http://web.inf.ed.ac.uk/security-privacy\">http://web.inf.ed.ac.uk/security-privacy</a></p>\n<p>If you are interested then please contact the project supervisors to discuss <br>\ninformally before application:</p>\n<p>* Ian Stark (<a href=\"mailto:Ian.Stark@ed.ac.uk\">Ian.Stark@ed.ac.uk</a>)<br>\n  * Brian Campbell (<a href=\"mailto:Brian.Campbell@ed.ac.uk\">Brian.Campbell@ed.ac.uk</a>)<br>\n  * David Aspinall (<a href=\"mailto:David.Aspinall@ed.ac.uk\">David.Aspinall@ed.ac.uk</a>)</p>\n<p>Formal Specification and Proofs for TrustZone in ARMv8-M</p>\n<hr>\n<p>The increasing complexity and connectivity in microcontroller devices has <br>\nprompted the development of protection mechanisms to improve reliability and <br>\nsecurity. ARM's TrustZone for ARMv8-M provides a separate \"secure world\" <br>\nexecution mode to enable features such as secure firmware updates, safe <br>\nintegration of code from multiple suppliers and controlled access to <br>\nprivileged peripherals. It is designed in a different way to TrustZone on <br>\nother ARM architectures, with greater hardware support for resource-light <br>\nmicrocontrollers.</p>\n<p>This project will study the low-level instruction set design of TrustZone for <br>\nARMv8-M, creating formal specifications to describe the security properties <br>\nthat hold at the instruction level and proofs that these provide the intended <br>\nprotection against low-level attacks. The specifications will also aim to <br>\nprovide a basis for higher-level proofs about the security properties of <br>\nsoftware that runs in the secure world.</p>\n<p>Formal Verification of Security Properties of the mbed OS uVisor</p>\n<hr>\n<p>The mbed OS uVisor is a core security component for ARM's mbed IoT platform. <br>\nIt creates isolated security domains on Cortex M3, M4 and M7 microcontrollers <br>\nwith a Memory Protection Unit (MPU). The MPU provides a small number of memory <br>\nregions of limited size. On top of these the uVisor provides a more flexible <br>\ncompartmentalisation using separate security domains (\"Secure Boxes\"), <br>\nconfigured with suitable Access Control Lists.</p>\n<p>This project will apply machine-assisted theorem-proving to help define and <br>\nthen verify correctness and security properties of the uVisor implementation. <br>\nThis will build on previous work that has constructed instruction set models <br>\nand decompilation techniques, and extend it with formal modelling of exception <br>\nhandling and memory protection. Example verification goals include correctness <br>\naspects, such as ensuring that MPU regions get correctly reallocated on demand <br>\n(ensuring progress/availability), or higher-level properties such as <br>\ncontrol-flow integrity (ensuring certain attacks are not possible in client <br>\ncode).</p>\n<p>About the University of Edinburgh</p>\n<hr>\n<p>The University of Edinburgh School of Informatics brings together world-class <br>\nresearch groups in computer science, artificial intelligence and cognitive <br>\nscience.  It is the largest Informatics or Computer Science department in <br>\nEurope.  It houses a number of specialised centres and subgroups, including <br>\nthe ARM Centre of Excellence working on a number of collaborations.  The <br>\nSecurity and Privacy group is forms the core of the University's Academic <br>\nCentre of Excellence in Cyber Security Research, which one recognition in <br>\n2017.</p>\n<p>We welcome applications from members of groups traditionally under-represented <br>\nin the field.  In 2013 (renewed 2016), the School of Informatics received an <br>\nAthena Swan Silver Award, in recognition of its commitment to advancing the <br>\ncareers of women in science, technology, engineering, maths and medicine <br>\n(STEMM) employment in higher education and research.</p>\n<p>For more information about Edinburgh and studying here, see these pages:</p>\n<p>* Explore Edinburgh: <a href=\"http://www.ed.ac.uk/about/city\">http://www.ed.ac.uk/about/city</a></p>\n<p>* Overview for prospective postgraduates: <a href=\"http://www.ed.ac.uk/schools-departments/informatics/postgraduate\">http://www.ed.ac.uk/schools-departments/informatics/postgraduate</a></p>",
        "id": 294712941,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661182799
    }
]