[
    {
        "content": "<p>From: <a href=\"mailto:Jeremy.Gibbons@comlab.ox.ac.uk\">Jeremy.Gibbons@comlab.ox.ac.uk</a><br>\nHaskell 2010</p>\n<p>ACM SIGPLAN Haskell Symposium 2010<br>\n                     Baltimore MD, United States<br>\n                         30th September, 2010</p>\n<p>CALL FOR PAPERS</p>\n<p><a href=\"http://www.haskell.org/haskell-symposium/2010/\">http://www.haskell.org/haskell-symposium/2010/</a></p>\n<p>The ACM SIGPLAN Haskell Symposium 2010 will be co-located with the<br>\n   2010 International Conference on Functional Programming (ICFP), in<br>\n   Baltimore, Maryland.</p>\n<p>The purpose of the Haskell Symposium is to discuss experiences with<br>\n   Haskell and future developments for the language. The scope of the<br>\n   symposium includes all aspects of the design, semantics, theory,<br>\n   application, implementation, and teaching of Haskell.</p>\n<p>Topics of interest include, but are not limited to:</p>\n<p>* Language Design, with a focus on possible extensions and<br>\n       modifications of Haskell as well as critical discussions of the<br>\n       status quo;</p>\n<p>* Theory, such as formal treatments of the semantics of the present<br>\n       language or future extensions, type systems, and foundations<br>\n       for program analysis and transformation;</p>\n<p>* Implementations, including program analysis and transformation,<br>\n       static and dynamic compilation for sequential, parallel, and<br>\n       distributed architectures, memory management as well as foreign<br>\n       function and component interfaces;</p>\n<p>* Tools, in the form of profilers, tracers, debuggers,<br>\n       pre-processors, and suchlike;</p>\n<p>* Functional Pearls, being elegant, instructive examples of using<br>\n       Haskell;</p>\n<p>* Applications, Practice, and Experience, using Haskell for<br>\n       scientific and symbolic computing, database, multimedia and Web<br>\n       applications, and so forth, as well as general experience with<br>\n       Haskell in education and industry.</p>\n<p>Papers in the latter two categories need not necessarily report<br>\n   original research results; they may instead, for example, report<br>\n   practical experience that will be useful to others, reusable<br>\n   programming idioms, or elegant new ways of approaching a<br>\n   problem. (More advice appears on the symposium webpage.)  <br>\n   The key criterion for such a paper is that it makes a<br>\n   contribution from which other Haskellers can benefit. It is not<br>\n   enough simply to describe a program!</p>\n<p>Before 2008, the Haskell Symposium was known as the Haskell<br>\n   Workshop.  The name change reflects both the steady increase of<br>\n   influence of the Haskell Workshop on the wider community, as well as<br>\n   the increasing number of high quality submissions. The selection<br>\n   process is highly competitive.  After eleven Haskell Workshops<br>\n   between 1995 and 2007, the first Haskell Symposium was held in<br>\n   Victoria in 2008, and the second in Edinburgh in 2009.</p>\n<p>Submission Details</p>\n<p>* Submission Deadline: Monday, 14th June 2010, 15:00 UTC<br>\n     * Author Notification: Monday, 12th July 2010<br>\n     * Final Papers Due   : Monday, 2nd August 2010</p>\n<p>Submitted papers should be in portable document format (PDF),<br>\n   formatted using the ACM SIGPLAN style guidelines<br>\n   (<a href=\"http://www.acm.org/sigs/sigplan/authorInformation.htm\">http://www.acm.org/sigs/sigplan/authorInformation.htm</a>). The text<br>\n   should be in a 9pt font in two columns; the length is restricted to<br>\n   12 pages, except for \"Applications, Practice, and Experience\"<br>\n   papers, which are restricted to 6 pages. Each submission must<br>\n   adhere to SIGPLAN's republication policy, as explained on the web.<br>\n   Violation risks summary rejection of the offending submission.<br>\n   Accepted papers will be published by the ACM and will appear in the<br>\n   ACM Digital Library.</p>\n<p>In addition, we solicit proposals for system demonstrations, based<br>\n   on running (perhaps prototype) software rather than necessarily on<br>\n   novel research results. Proposals are limited to 2-page abstracts,<br>\n   in the same ACM format as papers, and should explain why a<br>\n   demonstration would be of interest to the Haskell community. They<br>\n   will be assessed for relevance by the PC; accepted proposals will<br>\n   be published on the Symposium website, but not formally published<br>\n   in the proceedings.</p>\n<p>Links</p>\n<p>* <a href=\"http://www.haskell.org/haskell-symposium\">http://www.haskell.org/haskell-symposium</a>, <br>\n       the permanent homepage of the Haskell Symposium.</p>\n<p>* <a href=\"http://www.haskell.org/haskell-symposium/2010\">http://www.haskell.org/haskell-symposium/2010</a>, <br>\n       the 2010 Haskell Symposium web page.</p>\n<p>* <a href=\"http://www.icfpconference.org/icfp2010\">http://www.icfpconference.org/icfp2010</a>, <br>\n       the ICFP 2010 web page.</p>\n<p>Programme Committee</p>\n<p>* Jeremy Gibbons, University of Oxford (chair)<br>\n     * James Cheney, University of Edinburgh<br>\n     * Duncan Coutts, Well-Typed LLP<br>\n     * Sharon Curtis, Oxford Brookes University<br>\n     * Fritz Henglein, Kobenhavns Universitet<br>\n     * Tom Schrijvers, Katholieke Universiteit Leuven<br>\n     * Chung-chieh Shan, Rutgers - The State University of New Jersey<br>\n     * Martin Sulzmann, Informatik Consulting Systems AG<br>\n     * Wouter Swierstra, Vector Fabrics<br>\n     * Peter Thiemann, Universitaet Freiburg<br>\n     * Andrew Tolmach, Portland State University<br>\n     * Malcolm Wallace, University of York</p>",
        "id": 294100483,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660833603
    }
]