[
    {
        "content": "<p>From: Thomas Genet &lt;<a href=\"mailto:thomas.genet@irisa.fr\">thomas.genet@irisa.fr</a>&gt;<br>\nCall for Participation: Programming Languages Mentoring Workshop - a <br>\nPOPL workshop.</p>\n<p>CALL FOR PARTICIPATION</p>\n<p>SIGPLAN Programming Languages Mentoring Workshop, San Diego, USA</p>\n<p>Tuesday January 21, 2014</p>\n<p>Co-located with POPL 2014</p>\n<p>PLMW web page: <a href=\"http://plmw2014.inria.fr/\">http://plmw2014.inria.fr/</a></p>\n<p>After the resounding success of the first two Programming Languages<br>\nMentoring Workshops at POPL 2012 and POPL 2013, we proudly announce the<br>\n3rd SIGPLAN Programming Languages Mentoring Workshop (PLMW), co-located<br>\nwith POPL 2014 and organised by Amal Ahmed, Benjamin C. Pierce, and Alan<br>\nSchmitt.</p>\n<p>The purpose of this mentoring workshop is to encourage graduate<br>\nstudents and senior undergraduate students to pursue careers in<br>\nprogramming language research. This workshop will provide technical<br>\nsessions on cutting-edge research in programming languages, and<br>\nmentoring sessions on how to prepare for a research career. We will<br>\nbring together leaders in programming language research from academia<br>\nand industry to give talks on their research areas. The workshop will<br>\nengage students in a process of imagining how they might contribute to<br>\nour research community.</p>\n<p>We especially encourage women and underrepresented minority students<br>\nto attend PLMW.</p>\n<p>This workshop is part of the activities surrounding POPL, the Symposium<br>\non Principles of Programming Languages, and takes place the day before<br>\nthe main conference. One goal of the workshop is to make the POPL<br>\nconference more accessible to newcomers. We hope that participants will<br>\nstay through the entire conference.</p>\n<p>A number of sponsors have generously donated scholarship funds for<br>\nqualified students to attend PLMW. These scholarships should cover<br>\nreasonable expenses (airfare, hotel, and registration fees) for<br>\nattendance at both the workshop and the POPL conference.</p>\n<p>Students attending this year will get one year free student membership<br>\nof SIGPLAN, unless they prefer to opt out during their application.</p>\n<p>The workshop registration is open to all. Students with alternative<br>\nsources of funding are welcome.</p>\n<p>APPLICATION for PLMW scholarship:</p>\n<p>The scholarship application can be accessed from the workshop web site<br>\n(<a href=\"http://plmw2014.inria.fr/\">http://plmw2014.inria.fr/</a>). The deadline for full consideration of<br>\nfunding is 10th December, 2013. Selected participants will be notified<br>\nfrom Friday 14th December, and will need to register for the workshop by<br>\nDecember 24th.</p>\n<p>SPONSORS:</p>\n<p>Facebook<br>\nGoogle<br>\nJane Street<br>\nMicrosoft Research<br>\nNSF<br>\nSIGPLAN</p>",
        "id": 294256011,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660912618
    }
]