[
    {
        "content": "<p>From: Andrei Popescu &lt;<a href=\"mailto:A.Popescu@mdx.ac.uk\">A.Popescu@mdx.ac.uk</a>&gt;<br>\nThe 2019 editions of FroCoS (the 12th International Symposium on Frontiers of Combining Systems) and TABLEAUX (the 28th International Conference on Automated Reasoning with Analytic Tableaux and Related Methods), as well as their affiliated workshops and tutorials</p>\n<p>will take place in London, at Middlesex University, on the week of September 2-6.</p>\n<p>This year we have an exciting program of contributed and invited talks, and affiliated events. Please see</p>\n<p><a href=\"https://tableaux2019.org/Program_FroCoS_TABLEAUX_2019.pdf\">https://tableaux2019.org/Program_FroCoS_TABLEAUX_2019.pdf</a></p>\n<p>for detailed program information. Moreover, information on traveling and accommodation (including affordable accommodation for budget-constrained participants), and on the sites and activities that can be enjoyed in the Middlesex University's beautiful campus, is available from the conferences' websites:</p>\n<p><a href=\"https://frocos2019.org\">https://frocos2019.org</a>  and  <a href=\"https://tableaux2019.org\">https://tableaux2019.org</a></p>\n<p>Information on registration and fees is also available from these websites. The deadline for early registration is August 21st, 2019.</p>\n<p>INVITED TALKS</p>\n<ul>\n<li>\n<p>Jeremy Avigad. Automated Reasoning for the Working Mathematician</p>\n</li>\n<li>\n<p>Maria Paola Bonacina. Conflict-Driven Reasoning in Unions of Theories</p>\n</li>\n<li>\n<p>Stephane Graham-Lengrand. Recent and Ongoing Developments of Model-Constructing Satisfiability</p>\n</li>\n<li>\n<p>Stephane Graham-Lengrand and Sara Negri. Remembering Roy Dyckhoff</p>\n</li>\n<li>\n<p>Uli Sattler. Modularity and Automated Reasoning in Description Logics</p>\n</li>\n</ul>\n<p>AFFILIATED WORKSHPS</p>\n<ul>\n<li>\n<p>The 25th Workshop on Automated Reasoning (ARW 2019), organized by Alexander Bolotov and Florian Kammueller</p>\n</li>\n<li>\n<p>Journeys in Computational Logic: Tributes to Roy Dyckhoff, organized by Stephane Graham-Lengrand, Ekaterina Komendantskaya and Mehrnoosh Sadrzadeh</p>\n</li>\n</ul>\n<p>AFFILIATED TUTORIALS</p>\n<ul>\n<li>\n<p>Formalising Concurrent Computation: CLF, Celf, and Applications by Sonia Marin, Giselle Reis and Iliano Cervesato</p>\n</li>\n<li>\n<p>How to Build an Automated Theorem Prover---An Introductory Tutorial (invited TABLEAUX tutorial) by Jens Otten.</p>\n</li>\n</ul>\n<p>For any questions, please contact the organizers at <a href=\"mailto:chair@tableaux2019.org\">chair@tableaux2019.org</a> or <a href=\"mailto:chair@frocos2019.org\">chair@frocos2019.org</a>. We hope to see many of you this September in London.</p>\n<p>Best wishes,</p>\n<p>Serenella Cerrito, Andreas Herzig, Andrei Popescu and Franco Raimondi</p>\n<p>(program chairs and local organizers)</p>",
        "id": 294761033,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661199576
    }
]