[
    {
        "content": "<p>From: Joao Marcos &lt;<a href=\"mailto:jmarcos@dimap.ufrn.br\">jmarcos@dimap.ufrn.br</a>&gt;<br>\nDear All:</p>\n<p>I have always been using Isabelle 2004, and wrote all my theories<br>\n(basically, a collection of non-classical logics, in various formats)<br>\nfor it.  Recently, though, I have installed the new distribution,<br>\nIsabelle 2005, for the first time.  The message I consistently receive<br>\nwhen trying to use my old theories, say, my theory \"PROPOSICIONAL\",<br>\nis:</p>\n<p>Loading theory \"PROPOSICIONAL\"<br>\n  ### Non-Isar file format for theory \"PROPOSICIONAL\" -- deprecated<br>\n  *** Undeclared class: \"logic\"<br>\n  *** in arity for type \"o\"<br>\n  Exception- ERROR raised<br>\n  Exception- ERROR raised</p>\n<p>Is there a set of simple rules for translating old theories to the<br>\nIsar file format?  I have seen a few comments about the new headers at<br>\nthe Isabelle web-site and comments about the \"rules\" section<br>\ntransforming into \"axioms\".  Is that all?  Can anyone give me hints to<br>\nease the conversion?</p>\n<p>Thanx in advance!  Best,<br>\nJoao Marcos</p>",
        "id": 294040870,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660815219
    },
    {
        "content": "<p>From: Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt;<br>\nOn Mon, 21 Aug 2006, Joao Marcos wrote:</p>\n<blockquote>\n<p>*** Undeclared class: \"logic\"<br>\n *** in arity for type \"o\"<br>\n Exception- ERROR raised</p>\n</blockquote>\n<p>This has nothing to do with Isar vs. non-Isar theories -- the actual <br>\ncontent is the same for both formats.</p>\n<p>The above error indicates that class \"logic\" no longer exists.  Just <br>\ndelete the corresponding 'arities' declaration.</p>\n<blockquote>\n<p>Is there a set of simple rules for translating old theories to the Isar <br>\nfile format?</p>\n</blockquote>\n<p>Whenever Isabelle reports a problem with (outer) syntax, check the <br>\ndiagrams given in the Isar reference manual.  After some practice you <br>\nshould be able to see the few patterns of changes required for your <br>\nparticular theories.  The appendix of the manual also gives some hints on <br>\nconverting proof scripts -- use this together with ``isatool convert''.</p>\n<p>Makarius</p>",
        "id": 294040878,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660815221
    }
]