[
    {
        "content": "<p>From: Gerwin Klein &lt;<a href=\"mailto:gerwin.klein@nicta.com.au\">gerwin.klein@nicta.com.au</a>&gt;<br>\nHi Palle,</p>\n<p>in our experience, it is better to go for more powerful processors instead of more cores. Also go for lots of memory (24G rather than 16G, 32 if you can get it cheap). </p>\n<p>A fast disk for image writing and reading (additional SSD maybe, if that is an option) can make a few minutes difference for large sessions, depending on how much use of images you make.</p>\n<p>It depends on the Isabelle version, but 3-4 concurrent threads seems to be the optimum point at the moment. </p>\n<p>Hyperthreading as such is not a problem, you can easily tell Isabelle the maximum number of threads it should use and we haven't seen any significant overhead associated with that. Also, I vaguely recall that hyperthreading seems to have similar performance to separate cores, but I could be wrong there.</p>\n<p>Cheers,<br>\nGerwin</p>",
        "id": 294139192,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660845259
    },
    {
        "content": "<p>From: Palle Raabjerg &lt;<a href=\"mailto:palle.raabjerg@it.uu.se\">palle.raabjerg@it.uu.se</a>&gt;<br>\nI have considered this. And thank you for me reminding me. I need to <br>\nlook up how to do it.<br>\nUnfortunately, we do frequently change stuff in the core theories, so I <br>\nam not sure how well this would work out.</p>\n<ul>\n<li>Palle</li>\n</ul>",
        "id": 294139382,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660845326
    },
    {
        "content": "<p>From: Palle Raabjerg &lt;<a href=\"mailto:palle.raabjerg@it.uu.se\">palle.raabjerg@it.uu.se</a>&gt;<br>\nThank you. I will take this into consideration.<br>\nIt does indeed sound like a smaller number of powerful Xeon cores is the <br>\nbest solution.</p>\n<ul>\n<li>Palle</li>\n</ul>",
        "id": 294140000,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660845525
    },
    {
        "content": "<p>From: Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt;<br>\nI have worked both with AMD Opteron and Intel Xeon -- the papers alternate <br>\nin that respect without making it very explicit.  See also the more recent <br>\n<a href=\"http://www4.in.tum.de/~wenzelm/papers/itp-smp.pdf\">http://www4.in.tum.de/~wenzelm/papers/itp-smp.pdf</a> which is for Xeon again.</p>\n<p>I find it much easier to get actual performance out of Xeon our setting, <br>\nthan with Opteron with nominally more cores. In practice that can mean a <br>\nwell-equippped Mac Pro, but you can also get cheaper Linux boxes with <br>\nthese CPUs, if you spend some time investigating the market.</p>\n<p>It seems that the latest Intel Westmere is already replacing the <br>\nestablished Nehalem line -- which was very good in the past 2 years.</p>\n<p>Hyperthreading is not getting in the way.  Isabelle provides the soft <br>\nMultithreading.max_threads option, instead of relying on raw number of <br>\nCPUs reported by the operating system.  Mac OS X, and presumably Linux, <br>\nare smart enough to map running threads on real cores, before using <br>\nhyperthreading.  (Apple's Snow Leopard update on Leopard was a big <br>\nperformance improvement in this respect.)</p>\n<p>After Isabelle2011 it is easier to saturate 8 cores, and memory <br>\nrequirements are descreasing a bit. So a midrange system with 2 sockets of <br>\n6 core Xeon, and maybe 32 GB memory, should make a very good workstation <br>\nfor the next few years.</p>\n<p>Makarius</p>",
        "id": 294140207,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660845592
    },
    {
        "content": "<p>From: Palle Raabjerg &lt;<a href=\"mailto:palle.raabjerg@it.uu.se\">palle.raabjerg@it.uu.se</a>&gt;<br>\nThank you. This has also been duly noted.<br>\nIf we can afford it, we might actually go for the two 6-cores then. I <br>\nhave been looking at such boxes, and the prices don't seem to be too steep.<br>\nAnd yes, the efficiency of a single core is unlikely to improve <br>\ndrastically, as the focus today is on creating chips with more cores. So <br>\nthis setup should stay useful for quite a while.</p>\n<ul>\n<li>Palle</li>\n</ul>",
        "id": 294140325,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660845611
    },
    {
        "content": "<p>From: Palle Raabjerg &lt;<a href=\"mailto:palle.raabjerg@it.uu.se\">palle.raabjerg@it.uu.se</a>&gt;<br>\nHi all,</p>\n<p>In our research group, we are currently considering getting a dedicated <br>\nmachine for working on proofs. Our Psi-calculus theories are large <br>\nenough to incur significant waiting times whenever we have to restart <br>\nthe proof process. And there is more than one of us now, so simply <br>\ngetting powerful laptops is looking like the more expensive option.</p>\n<p>So I am trying to find out what kind of setup is most effective for <br>\ncutting proof times, since a dedicated box gives us a few interesting <br>\noptions for costumisation.<br>\nThis paper presents some graphs that show performance benefits declining <br>\nsomewhat after the 4th core (as is also the case with many other <br>\nparallel applications): <br>\n<a href=\"http://www4.in.tum.de/~wenzelm/papers/parallel-isabelle.pdf\">http://www4.in.tum.de/~wenzelm/papers/parallel-isabelle.pdf</a><br>\nSince we are two Isabelle-guys now, and will probably be one or two more <br>\nin the future, I am considering going for a box with 6-8 cores in total. <br>\nAnd since I read from a previous post on this list that there is an <br>\nadditional memory-overhead for each core, that would likely put us at 16 <br>\nor 24GB memory for those cores.<br>\nWe could also go for a single 8-12 core Opteron, but since it seems that <br>\nXeon cores are fewer in number, though more powerful, the better idea <br>\nmay be to go for two 4-core or one 6-core Xeon.</p>\n<p>But one thing that worries me a bit in that case is Intel's <br>\nhyperthreading. So even if we get a 4-core Xeon, it would likely happily <br>\nrun 8 threads at once, thus potentially doubling the memory requirement <br>\nand at the same time flattening the multicore-benefit curve quicker.<br>\nAnd in that case, maybe we should consider just having more real cores <br>\nin a single Opteron?</p>\n<p>Any thoughts on this would be appreciated. Particularly if someone has <br>\npractical experience with running Isabelle on these architectures.</p>\n<p>Best regards,<br>\nPalle Raabjerg</p>",
        "id": 294141484,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660845966
    },
    {
        "content": "<p>From: Simon Winwood &lt;<a href=\"mailto:sjw@cse.unsw.edu.au\">sjw@cse.unsw.edu.au</a>&gt;<br>\nAs a side note, we get around this problem (somewhat, although it<br>\nis still annoying) by building images for the theories that don't change much --- <br>\nif you aren't changing your core definitions and proofs, this can save time.</p>\n<p>Of course, if you are changing stuff all over your theories, this won't help.</p>\n<p>Simon</p>",
        "id": 294141844,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660846103
    }
]