[
    {
        "content": "<p>From: Mandy Martin &lt;<a href=\"mailto:tesleft@hotmail.com\">tesleft@hotmail.com</a>&gt;<br>\nHi  ,<br>\nhow to classify logic rules that belong to an axiom system?<br>\nhow to know  that  which rules  together form a axiom  system?<br>\nRegards,<br>\nMartin Lee</p>",
        "id": 294642646,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661162764
    },
    {
        "content": "<p>From: Buday Gergely &lt;<a href=\"mailto:gbuday@karolyrobert.hu\">gbuday@karolyrobert.hu</a>&gt;<br>\nHi Martin,</p>\n<p>what do you mean by the classification of logic rules? The best would be to cite some paper or book you got this idea from.</p>\n<p>To your second question: you can define any axiom system you want but what property do you want to achieve? Being free of contradictions? Please detail this.</p>\n<ul>\n<li>Gergely</li>\n</ul>",
        "id": 294642658,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661162775
    },
    {
        "content": "<p>From: Buday Gergely &lt;<a href=\"mailto:gbuday@karolyrobert.hu\">gbuday@karolyrobert.hu</a>&gt;<br>\nHi Martin,</p>\n<p>what do you want to model by your axiom system? Do you want to create a logical framework for general mathematics or some concrete axiom system for geometry or number theory?</p>\n<p>And, what does this have to do with the Isabelle theorem prover? If you are at the theoretical beginning of your research you might better ask on</p>\n<p><a href=\"http://math.stackexchange.com/questions/tagged/logic\">http://math.stackexchange.com/questions/tagged/logic</a></p>\n<p>Cheers</p>\n<ul>\n<li>Gergely</li>\n</ul>",
        "id": 294642905,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661162875
    },
    {
        "content": "<p>From: Buday Gergely &lt;<a href=\"mailto:gbuday@karolyrobert.hu\">gbuday@karolyrobert.hu</a>&gt;<br>\nHi Martin,</p>\n<p>what do you mean by \"script\"? An Isabelle script? If you want to pose beginner questions about writing Isabelle scripts the place is</p>\n<p><a href=\"http://stackoverflow.com/questions/tagged/isabelle\">http://stackoverflow.com/questions/tagged/isabelle</a></p>\n<p>But even there you cannot expect that others will write full proof scripts for your problems.</p>\n<p>Could you tell us how did you arrive to Isabelle? Do you attend a course on verification somewhere or is it purely a personal interest?</p>\n<ul>\n<li>Gergely</li>\n</ul>",
        "id": 294642968,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661162887
    },
    {
        "content": "<p>From: Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt;<br>\nBTW, the terminology of \"proof scripts\" was abandoned for Isabelle/Isar in <br>\n1998 or so, and replaced by \"proof texts\" or \"proof documents\".</p>\n<p>Since Proof General with its \"scripting\" mode was still used until last <br>\nyear, there was a remaining confusion about that.  In Isabelle2015, <br>\nsupport for Proof General and the TTY command-line no longer exists, and <br>\nit is all about interactive proof document editing in PIDE.</p>\n<p>Makarius</p>",
        "id": 294642988,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661162899
    },
    {
        "content": "<p>From: Mandy Martin &lt;<a href=\"mailto:tesleft@hotmail.com\">tesleft@hotmail.com</a>&gt;<br>\nHi Buday,<br>\ni  can  validate  whether it  is  a  correct  rule by more one in output cover  less one in two input and  filter  all  possible  rules  from all combination of  equations but i do not know  the  steps  about  how to form an  axiom  system. for example, how to choose which rules, which  book  teaching  this and any  web  resources  teaching  this?any  properties list  show  all existing  properties?actually  i  do not  know  which  property  it  output.  i  just  want to  filter and  form  all  axioms  system  including  unknown  axioms  system  and  research  the  usage of  them.<br>\ni am not  sure  whether  a, b  -&gt; c  # two  logic  input  and  1 logic  output  is called  3 termed  syllogism. if so,  i am using this  kind  of  rules.<br>\nRegards,<br>\nMartin Lee</p>",
        "id": 294643206,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661162991
    }
]