[
    {
        "content": "<p>From: Christoph LANGE &lt;<a href=\"mailto:math.semantic.web@gmail.com\">math.semantic.web@gmail.com</a>&gt;<br>\nCALL FOR PARTICIPATION</p>\n<p>Applying Mechanised Reasoning in Economics – Making Reasoners Applicable<br>\nfor Domain Experts<br>\n<a href=\"http://www.cs.bham.ac.uk/research/projects/formare/events/informatik2013/\">http://www.cs.bham.ac.uk/research/projects/formare/events/informatik2013/</a></p>\n<p>Tutorial at Informatik 2013 – Computer science adapted to humans,<br>\norganization and the environment, 43rd annual meeting of the German<br>\nInformatics Society (Gesellschaft für Informatik e.V. (GI)<br>\n<a href=\"http://informatik2013.de/\">http://informatik2013.de/</a></p>\n<p>17 September 2013, 14:00-17:30<br>\nKoblenz, Germany</p>\n<p>AUDIENCE</p>\n<p>Our audience comprises computer scientists developing or using<br>\nmechanised reasoning systems, or interested in learning how to use them.<br>\nThe message of this tutorial is:</p>\n<ol>\n<li>\n<p>There are interesting nails (problems) out there in economics,<br>\nwaiting for hammers (tools) from computer science to be applied to them.</p>\n</li>\n<li>\n<p>Those domain experts who have the interesting problems do not speak<br>\nthe same language as computer scientists do.</p>\n</li>\n<li>\n<p>Therefore, it takes some effort to make computer science tools<br>\napplicable in such domains:</p>\n<ul>\n<li>giving meaningful feedback on errors,</li>\n<li>writing application-oriented documentation,</li>\n<li>trying hard to support users who understand textbook mathematics<br>\nbut not proof calculi, etc.</li>\n</ul>\n</li>\n</ol>\n<p>MOTIVATION (ECONOMIST'S PERSPECTIVE)</p>\n<p>We have a vision of increasing confidence in economics' models and<br>\nmechanisms. Auction designs are under constant evolution as they seek to<br>\nincorporate lessons learned and to recognise specific features of the<br>\nmarkets in which they are run. Similarly, current models for financial<br>\nrisk measurement are too large and change too quickly to be checked by<br>\nhand. These challenges affect not only the economics sector itself, but<br>\nalso the government as it regulates the economy, and thus the general<br>\npublic. Since the software used is mission critical it should be<br>\nverified to a high level of reliability.</p>\n<p>We believe that such problems can be addressed by representing the<br>\nunderlying knowledge in a formal, explicit way that is accessible to<br>\nmechanised reasoning tools. These have already been applied to<br>\neconomics, albeit by computer scientists rather than the economists<br>\nthemselves.</p>\n<p>Many economists have postgraduate training in mathematics; historically,<br>\nit has been less common for them to have training in computer science.<br>\nTherefore, despite a growing interface (consider, e.g., the ACM<br>\nTransactions on Economics and Computation), they lack awareness of the<br>\nexistence of reasoning tools and their appropriateness for tasks in<br>\neconomics. Moreover such tools are still challenging to use. The<br>\nobjective of our ForMaRE project (formal mathematical reasoning in<br>\neconomics) is to raise awareness and to enable economists to work with<br>\nthe languages and tools of their choice.</p>\n<p>RESEARCH CONTEXT (Computer Science Perspective)</p>\n<p>How can we make formal methods familiar to economists? Concretely, we<br>\nare developing a basic Auction Theory Toolbox of formalisations, on top<br>\nof which auction designers can formalise and verify their own auction<br>\ndesigns, and we are getting started with applying similar techniques to<br>\nmatching markets and financial risk management. This tutorial reports on<br>\nour experience and insights from carrying out this research.</p>\n<blockquote>\n<p>From a computer science perspective, our “toolbox building” approach<br>\nrequires</p>\n</blockquote>\n<ol>\n<li>\n<p>identifying the right language to formalise the theory (i.e. being<br>\nsufficiently expressive while still supporting efficient proofs), and</p>\n</li>\n<li>\n<p>identifying a a mechanised reasoning system whose input and output<br>\nare comprehensible to economists, who usually do pen-and-paper proofs<br>\nand are familiar with mathematical textbook notation.</p>\n</li>\n</ol>\n<p>We have so far gained experience with the languages/systems Isabelle/HOL<br>\nand its jEdit IDE, Theorema, CASL and its Hets IDE and the System on<br>\nTPTP web service, Mizar, as well as Prover9 and Mace4.</p>\n<ul>\n<li>\n<p>Economists may find it appealing that the structure of an Isabelle or<br>\nMizar proof resembles the structure of a paper proof, that Theorema is<br>\nan add-on to the familiar Mathematica CAS with its textbook-like<br>\nnotebook interface, or that Hets allows for uniformly feeding one<br>\nformalisation into a wide range of highly efficient automated theorem<br>\nprovers.</p>\n</li>\n<li>\n<p>It may deter them that little documentation for these tools is<br>\navailable, or that it requires strong background knowledge, and that the<br>\ninvestigation of unsuccessful automated proof attempts requires a good<br>\nunderstanding of the underlying calculus.</p>\n</li>\n</ul>\n<p>INTERACTIVE MATCHMAKING</p>\n<p>The last part of the tutorial involves an interactive matchmaking<br>\nsession. We will try to match tutorial participants who are developers<br>\nor experienced users of tools (if you are, please contact us in<br>\nadvance!) and economics problems to which consider these tools may be<br>\napplicable. We will briefly present the respective problem and ask the<br>\nrespective participant for a brief voluntary presentation of his or her<br>\ntool. From our connections in the economics community (cf. our research<br>\ncollaborators and our organisation of the AISB 2013 symposium on<br>\nEnabling Domain Experts to use Formalised Reasoning) we have a portfolio<br>\nof around a dozen potentially matching problems.</p>\n<p>ORGANISERS</p>\n<ul>\n<li>Christoph Lange, Computer Science, University of Birmingham, UK</li>\n<li>Manfred Kerber, Computer Science, University of Birmingham, UK</li>\n<li>Colin Rowat, Economics, University of Birmingham, UK</li>\n</ul>\n<p>Please contact us at <a href=\"mailto:formare-management@cs.bham.ac.uk\">formare-management@cs.bham.ac.uk</a>.</p>",
        "id": 294244593,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660908398
    }
]