[
    {
        "content": "<p>From: \"Marcello M. Bonsangue\" &lt;<a href=\"mailto:marcello@liacs.nl\">marcello@liacs.nl</a>&gt;<br>\nVacancies for PhD positions in theoretical computer science<br>\n===========================================================</p>\n<p>Leiden Institute of Advanced Computer Science (LIACS) of Leiden<br>\nUniversity and Centrum Wiskunde &amp; Informatica (CWI) in Amsterdam are<br>\nlooking for two PhD students for working in the NWO funded research<br>\nproject</p>\n<p>CoRE: Coinductive Calculi of Regular Expressions</p>\n<p>The purpose of the project is to use the theory of coalgebras and<br>\nKleene algebras for automatic reasoning and verification of<br>\nquantitative and probabilistic systems, interactive systems and<br>\nadvanced functional programs.</p>\n<p>We are looking for excellent candidates with a background (Master<br>\ndegree) in mathematics, computer science or a related degree and who have<br>\nstrong interest in the mathematical foundations of computer<br>\nscience.</p>\n<p>Conditions of employment</p>\n<hr>\n<p>There are two PhD positions available.  One candidate will be employed at<br>\nLIACS in the Foundations of Software Technology (FAST) group.  The other<br>\nwill be employed at CWI in the Coordination Languages group<br>\n(SEN3) in the sub-group `Coalgebraic Models of Computation' led by Prof.<br>\nJan Rutten. Both groups provide a dynamic and productive work environment,<br>\nare in close collaboration with each other and are<br>\ninvolved in several national and international research projects.<br>\nBoth PhD candidates will be appointed for a period of four years and will<br>\nreceive salary based on a full-time employment.  The salary and labour<br>\nagreements are in accordance with the CAO for Dutch<br>\nuniversities and research institutes.</p>\n<p>How to Apply?</p>\n<hr>\n<p>You are invited to send your application letter together with a<br>\ncurriculum vitae (including a list of master courses), an abstract of your<br>\nmaster thesis or a list of publications, and the names and contact<br>\naddresses of two potential referees.  Please send your application before<br>\n1 March 2010 to:</p>\n<p>Marcello Bonsangue &lt;<a href=\"mailto:marcello@liacs.nl\">marcello@liacs.nl</a>&gt; and<br>\n Milad Niqui &lt;<a href=\"mailto:M.Niqui@cwi.nl\">M.Niqui@cwi.nl</a>&gt;</p>",
        "id": 294098188,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660832954
    }
]