[
    {
        "content": "<p>From: Tobias Nipkow &lt;<a href=\"mailto:nipkow@in.tum.de\">nipkow@in.tum.de</a>&gt;<br>\nACL2 2018<br>\n         15th International Workshop on the ACL2 Theorem Prover<br>\n                          and Its Applications</p>\n<p>November 5-6, 2018, Austin, Texas, USA</p>\n<p><a href=\"http://www.cs.utexas.edu/users/moore/acl2/workshop-2018/index.html\">http://www.cs.utexas.edu/users/moore/acl2/workshop-2018/index.html</a></p>\n<p>The 2018 ACL2 Workshop will be held in Austin, Texas, USA, and it is<br>\n  co-located with FMCAD (<a href=\"http://www.fmcad.org/FMCAD18\">http://www.fmcad.org/FMCAD18</a>).  We invite<br>\n  users of ACL2, users of other theorem provers, and persons interested<br>\n  in the applications of theorem proving technology to attend.</p>\n<p>IMPORTANT DATES:</p>\n<p>Abstract submission:   June 30, 2018<br>\n  Paper submission:      July 7, 2018<br>\n  Author notification:   August 25, 2018<br>\n  Camera ready:          September 25, 2018<br>\n  Workshop:              November 5-6, 2018</p>\n<p>AIMS AND SCOPE:</p>\n<p>The ACL2 Workshop series is the major technical forum for users of<br>\n  the ACL2 theorem proving system to present research related to the<br>\n  ACL2 theorem prover and its applications.  ACL2 is an<br>\n  industrial-strength automated reasoning system, the latest in the<br>\n  Boyer-Moore family of theorem provers.  The 2005 ACM Software System<br>\n  Award was awarded to Boyer, Kaufmann, and Moore for their work in<br>\n  ACL2 and the other theorem provers in the Boyer-Moore family.</p>\n<p>ACL2-2018 is a two-day workshop to be held in Austin, Texas, USA, on<br>\n  November 5-6, 2018, immediately after FMCAD<br>\n  (<a href=\"http://www.fmcad.org/FMCAD18\">http://www.fmcad.org/FMCAD18</a>), on the University of Texas campus.<br>\n  It is the 15th in the series of ACL2 workshops, which occur<br>\n  approximately every 18 months.  The workshop will feature technical<br>\n  papers as well as rump sessions that discuss ongoing research.</p>\n<p>There will be two invited keynote talks, given by:</p>\n<p>Sandip Ray, University of Florida at Gainesville<br>\n  Alastair Reid, ARM</p>\n<p>We invite submissions of papers on any topic related to ACL2 and its<br>\n  applications, and we strongly encourage submissions related to other<br>\n  theorem provers or formal methods that are of interest to the ACL2<br>\n  community.  Suggested topics include but are not limited to new<br>\n  results in the following areas.</p>\n<p>* Software or hardware verification with ACL2<br>\n      * Formalizations of mathematics in ACL2<br>\n      * Libraries and tools for ACL2<br>\n      * User interfaces for ACL2<br>\n      * Novel uses of ACL2<br>\n      * Experiences with ACL2 in the classroom<br>\n      * Reports of and proposals for improvements of ACL2<br>\n      * Comparisons with other theorem provers<br>\n      * Comparisons with other programming or specification languages<br>\n      * Challenge problems and their solutions<br>\n      * Foundational issues related to ACL2<br>\n      * Implementations connecting ACL2 with other systems</p>\n<p>PAPER SUBMISSIONS:</p>\n<p>Submissions must be made electronically in PDF format.  Submissions<br>\n  should be prepared in the EPTCS templates, available from<br>\n<a href=\"http://style.eptcs.org\">http://style.eptcs.org</a> &lt;<a href=\"http://style.eptcs.org/\">http://style.eptcs.org/</a>&gt;, and submitted via<br>\n  EasyChair.  See the ACL2 2018 website for details.</p>\n<p>The ACL2 Workshop accepts both long papers (up to sixteen pages) and<br>\n  extended abstracts (up to two pages).  Both categories of papers will<br>\n  require short abstracts to be submitted by the \"Abstract submission\"<br>\n  deadline and will be refereed by at least two members of the program<br>\n  committee.  Accepted submissions in both categories will be included<br>\n  in the final workshop proceedings, although speaking slots will be<br>\n  shorter for extended abstracts.  At least one author of each accepted<br>\n  submission must register for the workshop and give a presentation<br>\n  summarizing the paper's results.</p>\n<p>Extended abstracts should contain at least one or two references so<br>\n  someone can pursue the abstract topic.  Like long papers, extended<br>\n  abstracts must describe work that has already been done -- it is not<br>\n  for ideas for future work.  To discuss future work, we will have a<br>\n  rump session, and we will later appeal for those topics.</p>\n<p>One of the main advantages of the ACL2 Workshop is that attendees are<br>\n  already knowledgeable about ACL2, its syntax, its basic commands, and<br>\n  the art of writing models in it.  So authors may assume that readers<br>\n  have this familiarity.  The workshop proceedings will be published as<br>\n  a volume of Electronic Proceedings in Theoretical Computer Science<br>\n  (EPTCS).  Long papers will be published as PDFs, and extended<br>\n  abstracts will be published as HTML snippets.  Please see the EPTCS<br>\n  copyright page (<a href=\"http://copyright.eptcs.org/\">http://copyright.eptcs.org/</a>) for a discussion of<br>\n  licensing.  Please also see the EPTCS LaTeX style file and formatting<br>\n  instructions (<a href=\"http://style.eptcs.org\">http://style.eptcs.org</a>).</p>\n<p>Many papers presented at the workshop will describe interactions with<br>\n  the theorem prover.  Authors of such papers are required to provide<br>\n  ACL2 script files (typically, ACL2 books) along with instructions for<br>\n  their use with ACL2, unless they provide a small text file explaining<br>\n  why supporting materials are not appropriate (e.g., for a theory<br>\n  paper).  Such supporting materials should have proper licenses and<br>\n  copyrights (feel free to email the workshop chairs if you have<br>\n  questions about that).  The books should be certifiable either with<br>\n  custom instructions that are clearly provided, or by running the<br>\n  following shell command in the directory of your contributed books,<br>\n  where ACL2_DIR denotes your ACL2 sources directory and ACL2 denotes a<br>\n  recent ACL2 executable.</p>\n<p>ACL2_DIR/books/build/cert.pl --acl2 ACL2 *.lisp</p>\n<p>Send the supporting materials to Matt Kaufmann,<br>\n<a href=\"mailto:kaufmann@cs.utexas.edu\">kaufmann@cs.utexas.edu</a>.</p>\n<p>For accepted papers, we will require authors to make these books<br>\n  available by adding them to the ACL2 Community Books.  (The chairs<br>\n  may assist in that process, if asked.)  The authors can expect the<br>\n  reviewers to take the supporting materials into account during the<br>\n  refereeing process.</p>\n<p>The workshop will also feature ``rump sessions'', in which<br>\n  participants can describe ongoing research related to ACL2.<br>\n  Proposals for rump session presentations, including a title and short<br>\n  abstract, may be accepted until the workshop, but preference will<br>\n  be given to early submissions and subject to available time.</p>\n<p>ORGANIZATION:</p>\n<p>Chairs</p>\n<p>Shilpi Goel (Centaur Technology, Inc.)<br>\n      Matt Kaufmann (University of Texas)</p>\n<p>Program Committee</p>\n<p>Harsh Chamarthi (General Electric)<br>\n      Alessandro Coglio (Kestrel Institute)<br>\n      Jared Davis (Apple)<br>\n      Ruben Gamboa (University of Wyoming)<br>\n      Shilpi Goel (Centaur Technology, Inc.)<br>\n      Dave Greve (Rockwell-Collins, Inc.)<br>\n      Warren Hunt (University of Texas at Austin)<br>\n      Sebastiaan Joosten (University of Twente)<br>\n      Matt Kaufmann (University of Texas)<br>\n      John O'Leary (Intel)<br>\n      Grant Passmore (Aesthetic Integration)<br>\n      David Rager (Oracle, Inc.)<br>\n      Sandip Ray (University of Florida)<br>\n      David Russinoff (ARM, Ltd.)<br>\n      Julien Schmaltz (Eindhoven University of Technology)<br>\n      Anna Slobodova (Centaur Technology, Inc.)<br>\n      Eric Smith (Kestrel Institute)<br>\n      Sol Swords (Centaur Technology, Inc.)</p>\n<p>The chairs thank Mertcan Temel for his assistance with local arrangements.</p>\n<p>NOTE:</p>\n<p>Please see the website</p>\n<p><a href=\"http://www.cs.utexas.edu/users/moore/acl2/workshop-2018/index.html\">http://www.cs.utexas.edu/users/moore/acl2/workshop-2018/index.html</a></p>\n<p>for further information including paper submission, organization,<br>\n  venue, lodging, and eventually, registration and program information.</p>\n<p>Note that no block of rooms is being reserved for the workshop.<br>\n  Please see the following link<br>\n<a href=\"http://www.cs.utexas.edu/users/moore/acl2/workshop-2018/index.html#lodging\">http://www.cs.utexas.edu/users/moore/acl2/workshop-2018/index.html#lodging</a><br>\n  for information about lodging options near the workshop venue.</p>\n<p>HISTORICAL INFORMATION:</p>\n<p>The ACL2 Workshop series has previously published with EPTCS in 2011,<br>\n  2013, 2014, 2015, and 2017.  In other past years: the proceedings<br>\n  were published with Springer LNCS 6172 in 2010, and ACM digital<br>\n  library in 2006 and 2009.  The first ACL2 workshop in 1999 resulted<br>\n  in two books:</p>\n<p>- Computer-Aided Reasoning: An Approach, Kaufmann, Manolios, Moore,<br>\n    Kluwer, (May, 2000)</p>\n<p>- Computer-Aided Reasoning: ACL2 Case Studies, Kaufmann, Manolios,<br>\n    Moore (eds), Kluwer, (May, 2000)</p>\n<p>ACL2 workshops have been co-located with major conferences in formal<br>\n  methods in the past: European Joint Conferences on Theory and<br>\n  Practice of Software (ETAPS) in 2002, Computer-Aided Verification<br>\n  (CAV) in 2003, Federated Logic Conference (FLoC) in 2006, 2010, and<br>\n  2014, and Formal Methods in Computer-Aided Design (FMCAD) in 2004,<br>\n  2007, 2011, 2015, and 2018.<br>\n<a href=\"/user_uploads/14278/RWGuj2y-7B5KpKxr0OWOSeHa/smime.p7s\">smime.p7s</a></p>",
        "id": 294730838,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661187966
    }
]