[
    {
        "content": "<p>From: Lawrence Paulson &lt;<a href=\"mailto:lp15@cam.ac.uk\">lp15@cam.ac.uk</a>&gt;<br>\nWe now have a small but elegant entry from Lukas Bulwahn:</p>\n<blockquote>\n<p>This entry provides a geometric proof of the intersecting chords theorem. The theorem states that when two chords intersect each other inside a circle, the products of their segments are equal. After a short review of existing proofs in the literature, I decided to use a proof approach that employs reasoning about lengths of line segments, the orthogonality of two lines and the Pythagoras Law. Hence, one can understand the formalized proof easily with the knowledge of a few general geometric facts that are commonly taught in high-school. This theorem is the 55th theorem of the Top 100 Theorems list.</p>\n</blockquote>\n<p><a href=\"https://www.isa-afp.org/entries/Chord_Segments.shtml\">https://www.isa-afp.org/entries/Chord_Segments.shtml</a></p>\n<p>Many thanks, and keep them coming! Incidentally, we are also getting entries to the Development branch of the AFP. These can take advantage of the latest development version of Isabelle but unfortunately will not become visible on the AFP website until after the next release. That is expected by the end of 2016.</p>\n<p>Larry Paulson</p>",
        "id": 294685050,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661177683
    },
    {
        "content": "<p>From: Johannes Waldmann &lt;<a href=\"mailto:johannes.waldmann@htwk-leipzig.de\">johannes.waldmann@htwk-leipzig.de</a>&gt;</p>\n<blockquote>\n<p>... the intersecting chords theorem.</p>\n</blockquote>\n<p>Yes, geometry is nice.</p>\n<blockquote>\n<p>This theorem is the 55th theorem of the Top 100 Theorems list.</p>\n</blockquote>\n<p>So - what Isabelle formulations are missing - and why?</p>\n<p>Ok, I can compute the diff of  <a href=\"http://www.cs.ru.nl/~freek/100/\">http://www.cs.ru.nl/~freek/100/</a><br>\nand <a href=\"http://www.cse.unsw.edu.au/~kleing/top100/\">http://www.cse.unsw.edu.au/~kleing/top100/</a><br>\nbut I'd be interested to know about the \"why\".<br>\nIs it mostly \"too easy\" or \"too tedious\" -<br>\nor is there something else, like \"fundamentally hard\"?</p>\n<p>The lowest-numbered items where Isabelle is missing,<br>\nbut other systems have a formalisation, are</p>\n<p>13 : Polyhedron Formula<br>\n28 : Pascal's Hexagon Theorem<br>\n29 : Feuerbach's Theorem</p>\n<p>I'm pretty sure 28 and 29 (and 61 - Ceva, 84 - Morley, 87 - Desargues)<br>\ncan be proved automatically using computer algebra (with Gröbner bases)<br>\n(cf. <a href=\"http://dx.doi.org/10.1016/S0747-7171(86)80006-2\">http://dx.doi.org/10.1016/S0747-7171(86)80006-2</a> )<br>\nOf course, Isabelle is not a computer algebra system.<br>\nBut you have <a href=\"https://www.isa-afp.org/entries/Groebner_Bases.shtml\">https://www.isa-afp.org/entries/Groebner_Bases.shtml</a><br>\nso something could be done here. Well, I guess it's \"why bother\".</p>\n<ul>\n<li>J.</li>\n</ul>",
        "id": 294685240,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661177746
    },
    {
        "content": "<p>From: Manuel Eberl &lt;<a href=\"mailto:eberlm@in.tum.de\">eberlm@in.tum.de</a>&gt;<br>\nAs someone who has done quite a few of the Top 100 theorems in Isabelle,<br>\nI would say that the remaining ones fall mostly into three categories:</p>\n<ol>\n<li>far too difficult to be done ‘just for fun’</li>\n<li>too far removed from what most Isabelle users are familiar with</li>\n<li>too much underlying theory missing</li>\n</ol>\n<p>or some linear combination thereof. I for one know very little about all<br>\nthese geometric problems and have never really felt the appeal of<br>\nformalising them in Isabelle.</p>\n<p>Still, there has been a pretty continuous trickle of problems of this<br>\nlist being done in Isabelle in the past few years, and I am fairly<br>\nconfident that this will continue.</p>\n<p>Cheers,</p>\n<p>Manuel</p>",
        "id": 294690899,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661177751
    },
    {
        "content": "<p>From: Manuel Eberl &lt;<a href=\"mailto:eberlm@in.tum.de\">eberlm@in.tum.de</a>&gt;<br>\nI should probably add: there are also some problems (like \"e is<br>\ntranscendental\", \"π is transcendental\") that are perfectly within reach<br>\nfor a small side project for someone. The main reason why I haven't<br>\nattacked them yet is that the proofs for those are a bit ‘ad-hoc’. There<br>\nare much stronger results like the very nice Lindemann–Weierstraß<br>\ntheorem, which I'd very much like to see in Isabelle, but that is a bit<br>\nmore tricky to prove and I haven't found a nicely written-up version of<br>\nit so far.</p>\n<p>As for the Gröbner bases, I know very little about these things. We have<br>\nsome ML code doing something with Gröbner basis, and we have the<br>\ntheoretical formalisation of them by Alexander Maletzky in the AFP. I<br>\ndon't know what would be required to use either of these to prove<br>\ntheorems like the ones you mentioned – that certainly sounds like an<br>\ninteresting idea though. Maybe one of our Gröbner basis experts could<br>\ncomment on this?</p>\n<p>Cheers,</p>\n<p>Manuel</p>",
        "id": 294690917,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661177757
    },
    {
        "content": "<p>From: Lukas Bulwahn &lt;<a href=\"mailto:lukas.bulwahn@gmail.com\">lukas.bulwahn@gmail.com</a>&gt;<br>\nDear Johannes,</p>\n<p>to large parts I agree with Manuel's opinion, but nevertheless here<br>\nare some thoughts from my side:</p>\n<p>as author of the AFP entry \"Intersecting Chords Theorem\" and some<br>\nother entries on the Top 100, I can give a little personal insight<br>\nabout the reasons that some theorems are formalized and some are not.<br>\nPlease remember that this is really a very subjective personal<br>\nopinion.</p>\n<p>First of all, already Freek Wiedijk, who maintains the recordings of<br>\nthe formalized Top 100 Theorems list, noted that the list is actually<br>\nquite arbitrary and does not really provide a proper measure of the<br>\nstate of formalizations in the different theorem provers. So, this<br>\nlist is actually really more <code>for the fun of it</code> than a proper<br>\nmeasurement of contributions.</p>\n<p>This brings me directly to the reason for my contributions. I enjoy<br>\nusing Isabelle to challenge my brain with logical puzzles and there<br>\nare still some theorems in the Top 100 theorems list that are just in<br>\nreach with a few free-time sessions. Although  the list is largely<br>\narbitrary as proper measure, the theorems actually point to historical<br>\ninteresting and sometimes surprising discoveries, and while<br>\nresearching and formalizing those you often also learn a bit on the<br>\nhistory of mathematics.</p>\n<p>Another reason that some theorems on the list have lately been<br>\nformalized is that some of them are just challenging enough to give as<br>\nfinal challenge to students after an introductory course on Isabelle.<br>\nBut also, many proved theorems on the list are more or less basics<br>\nthat are today available in all larger formalized mathematical<br>\ncollections of theorem provers.</p>\n<p>To your remark that some of the open proofs could be proved<br>\nautomatically with the right automation points actually in an<br>\ninteresting direction that Amine Chaieb suggested a few years ago:<br>\nWhereas it is more or less obvious that these historic proofs can be<br>\nformalized by humans later on with some effort, the real challenge<br>\n(and measure of research progress) is to provide automation on whole<br>\ntheories that make it possible that these facts can today be proved by<br>\nautomatic methods without any further human interaction. So, we should<br>\nnot measure which have been formalized, but instead which can be<br>\nproved automatic from some base theory and powerful automation. But<br>\nimproving on this measure takes wise guidance and some work from PhD<br>\nstudents to be completed.</p>\n<p>Now, here are the reasons why some theorems are not formalized:</p>\n<p>Most of the theorems have an historic importance, but no one would<br>\ntoday expect these historic proofs to be possibly flawed or consider<br>\nsome specific proof step difficult to argue. Some past research<br>\nprojects on formalizing mathematics, such as the formalization of the<br>\nfour-color-theorem and the proof of Kepler's conjecture, focussed on<br>\nincreasing the confidence of proofs that could be possibly flawed. For<br>\nexample, the two mentioned proofs had specific proof steps that were<br>\nimpossible to validate or verify by sheer human reasoning capacity.<br>\nOther research activities focus on formalizing mathematics, so that<br>\ncertain classes of computer programs or systems can be verified. So<br>\nthese formalizations are driven by mathematic fields which are applied<br>\nin systems that must be dependable (i.e., safe, secure, reliable,<br>\navailable...). However, these substantial research contributions do<br>\nnot necessarily come across the very specific theorems on the Top 100<br>\nlist.</p>\n<p>Lukas</p>",
        "id": 294690995,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661177773
    },
    {
        "content": "<p>From: Tobias Nipkow &lt;<a href=\"mailto:nipkow@in.tum.de\">nipkow@in.tum.de</a>&gt;<br>\nAll of the ones that Johannes says can be proved by Gröbner bases have been <br>\nproved in HOL Light, which has well-developed Gröbner basis algorithms. It would <br>\nbe interesting to see if the proofs make use of them.</p>\n<p>Tobias<br>\n<a href=\"/user_uploads/14278/1ewx2d2mvS7VpdIuLWxff8cY/smime.p7s\">smime.p7s</a></p>",
        "id": 294691044,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661177785
    },
    {
        "content": "<p>From: Lawrence Paulson &lt;<a href=\"mailto:lp15@cam.ac.uk\">lp15@cam.ac.uk</a>&gt;<br>\nI haven’t come across any. The most distinctive feature of HOL Light is its suite of “without loss of generality” tactics, which however seldom seem to lead to shorter or more readable proofs.</p>\n<p>Larry</p>",
        "id": 294691051,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661177787
    }
]