[
    {
        "content": "<p>From: \"Nagashima, Yutaka\" &lt;<a href=\"mailto:Yutaka.Nagashima@uibk.ac.at\">Yutaka.Nagashima@uibk.ac.at</a>&gt;<br>\nDear Isabelle users and developers,</p>\n<p>I developed LiFtEr, a domain-specific language in Isabelle/ML, designed to encode induction heuristics in Isabelle.<br>\nLiFtEr is a domain-specific language in the sense that I developed it to encode induction heuristics,<br>\nbut heuristics written in LiFtEr should not be specific to any problem domains.</p>\n<p>I wrote a 19 page paper to explain this language, and the paper is available at GitHub [1].</p>\n<p>For now, the intended workflow of LiFtEr is as following:</p>\n<ol>\n<li>Experienced users encode their induction heuristics as assertions in LiFtEr based on their experience in a certain problem, e.g. proving the equivalence of two reverse functions for list.</li>\n<li>New Isabelle users check if their invocations of the induct(ion) method are appropriate for their proof obligation (e.g. proving properties about stack machines) using the assertions developed by the experienced users in the previous step.</li>\n</ol>\n<p>Eventually, I plan to </p>\n<ol>\n<li>encode many induction heuristics as assertions in LiFtEr,</li>\n<li>apply those assertions as a feature extractor to the Archive of Formal Proofs and build a database, which distills the essence of promising applications of the induct(ion) method,</li>\n<li>apply a machine learning algorithm to the database,</li>\n<li>build a tool that recommends how to apply the induct(ion) method to a given problem without completing a proof search.</li>\n</ol>\n<p>My three page abstract at arXiv illustrates this supervised learning approach for automatic induction [2].</p>\n<p>I developed LiFtEr based on my research hypothesis that many useful induction heuristics are programmable in a domain-independent way.<br>\nBut I could not find preceding work in the same direction.<br>\nSo, I will appreciate your constructive feedback about the direction of research, related work, Isabelle terminology, writing, etc.</p>\n<p>[1] <a href=\"https://github.com/data61/PSL/blob/master/LiFtEr/LiFtEr.pdf\">https://github.com/data61/PSL/blob/master/LiFtEr/LiFtEr.pdf</a><br>\n[2] <a href=\"https://arxiv.org/abs/1812.04088v2\">https://arxiv.org/abs/1812.04088v2</a></p>\n<p>Best,<br>\nYutaka</p>",
        "id": 294757992,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661198345
    }
]