[
    {
        "content": "<p>From: John Matthews &lt;<a href=\"mailto:john_matthews@apple.com\">john_matthews@apple.com</a>&gt;<br>\nWe've noticed some unintuitive Isar behavior when we have an identity proof step within a chain of “also have” calculations.</p>\n<p>For example, the proof below succeeds that has the identity proof step commented out:</p>\n<p>lemma \"(1::nat)+2+3 = 6\"<br>\nproof -<br>\n  have \"(1::nat)+2+3 = 3+3\" by arith<br>\n  (<strong>* also have \"... = 3+3\" .. -- \"identity proof step\" </strong>*)<br>\n  also have \"... = 6\" by arith<br>\n  finally show \"(1::nat)+2+3 = 6\" .<br>\nqed</p>\n<p>However with that line enabled then the \"finally show” proof step fails two lines later. We were expecting either for the \"finally show\" proof step to succeed or else for Isar to report an error at the identity proof step itself. Note that identity proof steps may not be obvious to the user in the presence of complex term abbreviations.</p>\n<p>Thanks,<br>\nJohn</p>",
        "id": 294738862,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661190781
    },
    {
        "content": "<p>From: \"Eugene W. Stark\" &lt;<a href=\"mailto:isabelle-users@starkeffect.com\">isabelle-users@starkeffect.com</a>&gt;<br>\nAlso mysterious to the uninitiated are situations in which the chain of terms<br>\ncontains a nontrivial loop; i.e. the repeated term occurs not in the immediate<br>\nnext step, but in a later one.  In that case, an \"also\" in the proof can loop<br>\n(visually, turns purple and stays that way).  I don't know if this always happens;<br>\nit seems that sometimes there is no visual indication of the problem.  With a<br>\nvisual indication, it is usually more clear that something is wrong, but when<br>\nI first encountered this behavior I had no idea what was happening.  An explicit<br>\ncheck for loops in the calculation, with an error report to the user, would be<br>\nvery helpful.</p>",
        "id": 294738882,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661190789
    },
    {
        "content": "<p>From: Dominique Unruh &lt;<a href=\"mailto:unruh@ut.ee\">unruh@ut.ee</a>&gt;<br>\nDear John,</p>\n<p>the also-finally mechanism works as follows (in the example including the<br>\nidentity proof step):</p>\n<p>- There is a variable \"calculation\" that contains the intermediate<br>\n   conclusion of the chain of the equations. Initially, this variable is empty.</p>\n<p>- The first \"also\" sets calculation := \"1+2+3=3+3\", because it was empty<br>\n   before, and the last proven fact was \"1+2+3=3+3\"</p>\n<p>- The second \"also\" takes the current content of calculation (1+2+3=3+3)<br>\n   and the last proven fact (3+3=3+3) and tries to apply some transitivity<br>\n   rule to it.<br>\n   The obvious choice would, of course, be the rule \"a=b ==&gt; b=c ==&gt; a=c\",<br>\n   and that would give us calculation := 1+2+3=3+3.</p>\n<p>- However, in this special case, there are other transitivity rules that<br>\n   also match (you get the full list with print_trans_rules):<br>\n   For example, there is the rule \"a = b ⟹ P b ⟹ P a\". This rule matches<br>\n   the current situation, instantiated with a:=1+2+3, b:=3+3, and P:=\"λx. x=x\".<br>\n   The conclusion of the rule is then 1+2+3=1+2+3. This is then stored in<br>\n   calculation (you can check this in jEdit by clicking on the work also and<br>\n   looking at the output panel). (So here is where things went wrong.)</p>\n<p>- The finally command applies the same mechanism as also (except that it<br>\n   does not store the result in calculation but makes it available to the show<br>\n   command as a fact).<br>\n   But in the present case, we have \"1+2+3=1+2+3\" and \"3+3=6\", there is no<br>\n   rule that can combine those. Thus \"finally\" fails (not show!).</p>\n<p>I don't know if there is a way to solve this. (The only way I see would be<br>\nto have priorities on trans-rules, so that the \"a=b ==&gt; b=c ==&gt; a=c\" rule<br>\nis always tried first but that sounds like a bigger chance in the<br>\nmechanism.)</p>\n<p>Best wishes,<br>\nDominique.</p>",
        "id": 294739001,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661190826
    }
]