[
    {
        "content": "<p>From: Osman Hasan &lt;<a href=\"mailto:o_hasan@ece.concordia.ca\">o_hasan@ece.concordia.ca</a>&gt;<br>\nWe apologize if you receive multiple copies of this email.</p>\n<p>======================================================================</p>\n<p>Half Day Tutorial on</p>\n<p>\"Performance Analysis of Systems and Software using a Theorem Prover\"</p>\n<p>2008 IEEE International Symposium on Performance Analysis of Systems and<br>\nSoftware<br>\n(ISPASS` 2008)</p>\n<p>April 20, 2008<br>\nAustin, Texas</p>\n<p>CALL FOR PARTICIPATION</p>\n<p>======================================================================</p>\n<hr>\n<p>Abstract</p>\n<hr>\n<p>Nowadays, computer simulation is one of the most widely used performance<br>\nanalysis technique. However, simulation based analysis usually provides<br>\napproximate results due to its inherent nature and it cannot handle<br>\nlarge-scale problems due to its enormous CPU time requirements. The<br>\nunreliability of the results poses a serious problem in safety critical<br>\napplications, such as those in space travel, military, and medicine, where<br>\na mismatch between the predicted and the actual system performance may<br>\nresult in either inefficient usage of the available resources or by<br>\nunnecessarily paying higher costs to meet some performance or reliability<br>\ncriteria. A possible solution for overcoming these limitations is to<br>\nconduct performance analysis within the environment of a<br>\nhigher-order-logic theorem prover. Higher-order logic is a system of<br>\ndeduction with a precise semantics and can be used for the development of<br>\nalmost all classical mathematical theories. Whereas, interactive theorem<br>\nproving is the field of computer science and mathematical logic concerned<br>\nwith computer based formal proof tools that require some sort of human<br>\nassistance. Due to the high expressiveness of the higher-order logic and<br>\nthe inherent soundness of interactive theorem proving, this approach can<br>\nbe used to conduct error free performance analysis at the cost of<br>\nsignificant user interaction.</p>\n<p>There has been some fruitful developments in this emerging area and a<br>\npreliminary infrastructure has been proposed that allows the formalization<br>\nof random variables in higherorder-logic and the formal verification their<br>\nuseful probabilistic and statistical properties within the theorem prover.<br>\nThe main focus of the tutorial is to introduce this new area of research<br>\nand present its practical effectiveness for conducting precise performance<br>\nanalysis of real world system and software examples.</p>\n<p>The tutorial begins by presenting a comprehensive introduction to formal<br>\nmethods and their usefulness in the system design process. It is followed<br>\nby an overview of the HOL theorem prover, which is the higher-order-logic<br>\ntheorem prover that we have used in this project. Next, we present the<br>\nprocess of formalizing (or modeling) random variables and verifying their<br>\ncorrectness by proving the corresponding probabilistic and statistical<br>\nproperties, such as mean and variance, in HOL. These formalized random<br>\nvariables can be used to model the uncertainties and random elements found<br>\nin a system and thus allow us to reason about its performance issues in<br>\nHOL. For illustration purposes, we present the performance analysis of two<br>\nexamples. Firstly, we verify the average number of trials required for the<br>\nCoupon Collectors problem, which is a well known commercially used<br>\nalgorithm. Next, we verify the average message delay relation for the<br>\nStop-and-Wait protocol, which is a commonly used Automated Repeat Request<br>\n(ARQ) protocol.</p>\n<hr>\n<p>Organizers</p>\n<hr>\n<p>Osman Hasan and Sofiene Tahar,<br>\n{o_hasan,tahar@ece.concordia.ca}<br>\nConcordia University,<br>\nMontreal, Canada</p>\n<hr>\n<p>Important Dates</p>\n<hr>\n<p>Early Registeration until: April 4th, 2008<br>\nTutorial Date: April 20th, 2008</p>\n<hr>\n<p>More Information</p>\n<hr>\n<p>For registeration and more details<br>\n<a href=\"http://ispass.org/ispass2008/\">http://ispass.org/ispass2008/</a></p>",
        "id": 294058802,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660822698
    }
]