[
    {
        "content": "<p>From: Gottfried Barrow &lt;<a href=\"mailto:igbi@gmx.com\">igbi@gmx.com</a>&gt;<br>\nGreetings,</p>\n<p>The previously stated suboptimal, non-response-non-feedback formality <br>\napplies; a very scary formality under unknown circumstances, before the <br>\nknowns become known; a formality not to be fully formally stated more <br>\nthan once every 6 months, or at least not twice within a week, even at <br>\nthe expense of being ambiguous.</p>\n<p>If I'm covering info already covered, I apologize more than those who <br>\napologize for the possibility of sending out duplicate notices for calls <br>\nfor submissions.</p>\n<p>This is just a report that I get an error for a session run that I don't <br>\nget in the PIDE.</p>\n<p>The following outer syntax command causes an error in the session run, <br>\nbut not in the PIDE:</p>\n<p>FOOBAR\\&lt;open&gt;test\\&lt;close&gt;\\&lt;open&gt;test\\&lt;close&gt;</p>\n<p>If a space is put between the two commands '\\&lt;close&gt;\\&lt;open&gt;', then there <br>\nis no error, or if quotes are used instead of cartouche delimiters.</p>\n<p>I include the example theory and outer syntax command below. A small <br>\nimage is attached showing the failure in the session run.</p>\n<p>Thanks,<br>\nGB</p>\n<p>(<strong>*</strong><strong> THEORY </strong><strong>*</strong>**)</p>\n<p>theory i151113a<br>\nimports Complex_Main (<em>\"$GEZ/m/IsE\"</em>)<br>\nkeywords \"FOOBAR\" :: diag<br>\nbegin<br>\nML<br>\n\\&lt;open&gt;Outer_Syntax.command @{command_keyword \"FOOBAR\"}<br>\n   \"(IsE) IMM general text/text tag\"<br>\n   (Parse.text -- Parse.text &gt;&gt; (fn _ =&gt; Toplevel.keep (fn _ =&gt; <br>\n())))\\&lt;close&gt;</p>\n<p>FOOBAR\\&lt;open&gt;test\\&lt;close&gt;\\&lt;open&gt;test\\&lt;close&gt;<br>\n(*<br>\nI.prog \\&lt;open&gt;w,p\\&lt;close&gt; \\&lt;open&gt;\\&lt;open&gt;f\\&lt;bar&gt;ROOT\\&lt;close&gt;\\&lt;close&gt; \\&lt;open&gt;<br>\nsession \"i151113a\" (i151113a) = \"HOL\" +<br>\n   options [quick_and_dirty = true]<br>\n   theories<br>\n     \"i151113a\"<br>\n\\&lt;close&gt;</p>\n<p>~I.prog \\&lt;open&gt;bash.bash\\&lt;bar&gt;w,ss,con0\\&lt;close&gt; <br>\n\\&lt;open&gt;\\&lt;open&gt;f\\&lt;bar&gt;root_run.bash\\&lt;close&gt;\\&lt;close&gt; \\&lt;open&gt;<br>\nroot_run=\"isabelle build -v -d . -g i151113a\"<br>\nprintf \"%s\\n\" \"$ ${root_run}\"<br>\n${root_run}<br>\n\\&lt;close&gt;<br>\n*)<br>\nend<br>\n<a href=\"/user_uploads/14278/xx8S-p9JEAO1v96YyfYbZn4R/151113a_session_error_2_cartouche.png\">151113a_session_error_2_cartouche.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/14278/xx8S-p9JEAO1v96YyfYbZn4R/151113a_session_error_2_cartouche.png\" title=\"151113a_session_error_2_cartouche.png\"><img src=\"/user_uploads/14278/xx8S-p9JEAO1v96YyfYbZn4R/151113a_session_error_2_cartouche.png\"></a></div>",
        "id": 294658950,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661169199
    },
    {
        "content": "<p>From: Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt;<br>\nOn Fri, 13 Nov 2015, Gottfried Barrow wrote:</p>\n<blockquote>\n<p>The previously stated suboptimal, non-response-non-feedback formality <br>\napplies; a very scary formality under unknown circumstances, before the <br>\nknowns become known; a formality not to be fully formally stated more <br>\nthan once every 6 months, or at least not twice within a week, even at <br>\nthe expense of being ambiguous.</p>\n</blockquote>\n<p>Can you say this again in plain words?</p>\n<blockquote>\n<p>This is just a report that I get an error for a session run that I don't <br>\nget in the PIDE.</p>\n<p>The following outer syntax command causes an error in the session run, but <br>\nnot in the PIDE:</p>\n<p>FOOBAR\\&lt;open&gt;test\\&lt;close&gt;\\&lt;open&gt;test\\&lt;close&gt;</p>\n<p>If a space is put between the two commands '\\&lt;close&gt;\\&lt;open&gt;', then there <br>\nis no error, or if quotes are used instead of cartouche delimiters.</p>\n</blockquote>\n<p>Isabelle outer syntax is normally written with a bit more space, e.g. like <br>\nthis:</p>\n<p>FOOBAR \\&lt;open&gt;test\\&lt;close&gt; \\&lt;open&gt;test\\&lt;close&gt;</p>\n<p>You are nonetheless right, that there is a mistake in the scanner for <br>\ncartouches in Isabelle/ML, and it disagrees with the Isabelle/Scala <br>\nversion.  I have changed that 3 weeks ago here: <br>\n<a href=\"http://isabelle.in.tum.de/repos/isabelle/rev/760e21900b01\">http://isabelle.in.tum.de/repos/isabelle/rev/760e21900b01</a></p>\n<p>Thus the coming winter release should work better in this respect.  When <br>\nthe first release candiates are announced, you should definitely try them. <br>\nThere is a good chance that other improvements are in conflict with your <br>\nway of writing Isabelle documents.  See also <br>\n<a href=\"http://isabelle.in.tum.de/repos/isabelle/file/f1b257607981/NEWS#l85\">http://isabelle.in.tum.de/repos/isabelle/file/f1b257607981/NEWS#l85</a></p>\n<p>Makarius</p>",
        "id": 294658961,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661169204
    },
    {
        "content": "<p>From: Gottfried Barrow &lt;<a href=\"mailto:igbi@gmx.com\">igbi@gmx.com</a>&gt;<br>\nOn 11/14/2015 9:42 AM, Makarius wrote:</p>\n<blockquote>\n<p>Can you say this again in plain words?</p>\n</blockquote>\n<p>Makarius,</p>\n<p>Part of its meaning was to say that I won't respond back to anyone who <br>\nresponds back to me. But to show respect, among other reasons, such a <br>\nrule should be applied with discretion.</p>\n<p>There are jokes to be made, but all this is no joking matter. It is also <br>\nan example of a problem where there is no good solution. The purpose of <br>\na \"bug tracking\" system would be narrowly defined, but this is a forum, <br>\nand a forum is about engaging with people as humans. (Note: As to \"bug <br>\ntracking\" systems, though I don't agree with how you dealt with a <br>\nparticular event, your philosophy sounds reasonable to me. In the end, <br>\nthough, apart from this, I consider \"things\" like that to be \"Isabelle <br>\ninternal politics\", and not for me to be concerned with.)</p>\n<p>First, I just state another rule of mine about how I operate on the web, <br>\nwhere I consider this as part of the web. My rule is not to engage with <br>\npeople privately who aren't personal friends. If something starts in <br>\npublic, I make a point of keeping it in public.</p>\n<p>There's this problem that I want to protect my technical interests, by <br>\nreporting problems, but the traffic is light here, and so I can end up <br>\ncreating a big footprint here. I do want a footprint on the web, but I <br>\ndon't want one here. I do searches on the isabelle-user's page, and <br>\nthere I am, showing up way too much.</p>\n<p>Stating a formality was maybe the third iteration of trying to solve <br>\nthis problem.</p>\n<blockquote>\n<p>Isabelle outer syntax is normally written with a bit more space, e.g. <br>\nlike this:</p>\n<p>FOOBAR \\&lt;open&gt;test\\&lt;close&gt; \\&lt;open&gt;test\\&lt;close&gt;</p>\n</blockquote>\n<p>Let us consider that your time is more valuable than mine.</p>\n<p>You tell me how to do things, but then I don't do it your way. At this <br>\npoint, it has already been a waste of your time to read this, and the <br>\nlast two sentences.</p>\n<p>When you can see my ideas as a whole, then it won't be a waste of your <br>\ntime to tell me how I should do things. In a just a few minutes, you'll <br>\nyou be able to say, \"Yea, there's a few good ideas here, I see why <br>\nyou're having to do things different\", or, \"This is worthless, there's <br>\nno good reason for you to be doing things different.\".</p>\n<p>The use of no space would be specific to using \"FOOBAR\" as a <br>\ntext-text-argument markup tag, in a way that's meant to take up as <br>\nlittle space as possible. As to two-arg outer syntax tags, there is also <br>\ntext-term and term-text. Below, I say that new additions to releases <br>\neliminate any special needs.</p>\n<blockquote>\n<p>You are nonetheless right, that there is a mistake in the scanner for <br>\ncartouches in Isabelle/ML, and it disagrees with the Isabelle/Scala <br>\nversion.  I have changed that 3 weeks ago here: <br>\n<a href=\"http://isabelle.in.tum.de/repos/isabelle/rev/760e21900b01\">http://isabelle.in.tum.de/repos/isabelle/rev/760e21900b01</a></p>\n</blockquote>\n<p>And this would be in line with how I think I should operate sometimes, <br>\nthat problems like these have been taken care of, or will eventually get <br>\ntaken care of, so there's no need for me to get involved. But then the <br>\nflip-side-analogy is 10 people getting served, who came in after me; I <br>\nassume I'll get served, but I don't, because they lost my order.</p>\n<blockquote>\n<p>Thus the coming winter release should work better in this respect.  <br>\nWhen the first release candiates are announced, you should definitely <br>\ntry them. There is a good chance that other improvements are in <br>\nconflict with your way of writing Isabelle documents.  See also <br>\n<a href=\"http://isabelle.in.tum.de/repos/isabelle/file/f1b257607981/NEWS#l85\">http://isabelle.in.tum.de/repos/isabelle/file/f1b257607981/NEWS#l85</a></p>\n</blockquote>\n<p>I continue to welcome new additions, and I see the addition of  <br>\n\\&lt;^verbatim&gt; and \\&lt;^emph&gt;.</p>\n<p>I try to build on what others have done, so to the extent that the new <br>\nfeatures line up with what I think I need, or to the extent that they <br>\nonly can be used in one way, I use them the normal way. To your chagrin, <br>\nI may use them differently.</p>\n<p>What I do shouldn't undermine anything. For me, it's the real deal. For <br>\nothers, I hope to make it a demo of what could be done, most likely in a <br>\nmore sophisticated way.</p>\n<p>I end this mentioning three \"features\", some outer syntax commands that <br>\nget interpreted as LaTeX newtheorem environments, where the source that <br>\nfollows is put in a fancyverb environment with line numbers, directly <br>\nunderneath the newtheorem title. The 3rd feature would be \"subtle\" <br>\nsyntax that gets interpreted as a very specific LaTeX equation environment.</p>\n<p>I ask, \"Do these features exist?\", and, \"If they don't, should you make <br>\nimplementing them a priority just for me?\"</p>\n<p>The answers are no and no. What I want is more textbook style. What you <br>\nguys needs is more journal style.</p>\n<p>I could explain what my ideas are for the two-text argument of FOOBAR <br>\nabove, as a tag, but it would be a waste of your time. If I ever produce <br>\nsomething, it'll already have been superseded by a new feature, or <br>\nyou'll very quickly be able to look see at what might interest you.</p>\n<p>New features sometimes eliminate a need for what I've done, but <br>\nsometimes they don't. Given enough time, anything I've done, you'll have <br>\ndone better, but I have to commit now.</p>\n<p>With all due respect, I don't respond to those who respond back to me.</p>\n<p>Regards,<br>\nGB</p>",
        "id": 294658976,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661169210
    },
    {
        "content": "<p>From: Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt;<br>\nThere is already a \"tag\" feature that allows to wrap Isabelle document <br>\ncommands (like 'text') or other formal command (e.g. proof commands) in a <br>\nLaTeX environment.</p>\n<p>An example can be seen here:<br>\n<a href=\"http://isabelle.in.tum.de/repos/isabelle/file/Isabelle2015/src/Doc/Implementation/ML.thy#l563\">http://isabelle.in.tum.de/repos/isabelle/file/Isabelle2015/src/Doc/Implementation/ML.thy#l563</a><br>\n<a href=\"http://isabelle.in.tum.de/repos/isabelle/file/Isabelle2015/src/Doc/Implementation/document/style.sty#l39\">http://isabelle.in.tum.de/repos/isabelle/file/Isabelle2015/src/Doc/Implementation/document/style.sty#l39</a></p>\n<p>Maybe that is already sufficient to implement all 3 points above.</p>\n<p>Makarius</p>",
        "id": 294658991,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661169217
    },
    {
        "content": "<p>From: Gottfried Barrow &lt;<a href=\"mailto:igbi@gmx.com\">igbi@gmx.com</a>&gt;<br>\nMarkarius,</p>\n<p>I suppose I should finish what I started, which requires that I attempt <br>\nto explain some of my ideas.</p>\n<p>I attach two images which show what I did the first year in 2012, when I <br>\nimplemented about 9 ZFC axioms based on Obua's THY. The particular image <br>\nshows work on permutative rewrite rules. T.Nipkow tipped me off about <br>\nthose. As to the words in the image, don't pay too much attention to <br>\nthat. I say more about the images below.</p>\n<p>Thanks for the links. I opened the document. I'll use some of it to <br>\nargue that we're not in sync as to our current vision of what the <br>\ninternals of a THY should look like.</p>\n<p>(NOTE: At line 564 all I see special is '%mlex'. You might mean that <br>\ncommands are available to tie into the low-level machinery. If that's <br>\nwhat you mean, I don't know how much that helps me. Using machinery can <br>\nrequire getting educated about the machinery. It's much easier to get <br>\neducated about things like parsing with PEG.js and Node.js, than it is <br>\nto get educated about Isabelle machinery. What I say below may reflect <br>\nthat I didn't get your drift, but I think we're still at odds.)</p>\n<p>First, by all appearances, you prioritize according to what want. With <br>\nsyntax, what's not there must reflect your own personal preferences.</p>\n<p>Now, I state two opinions:</p>\n<p>1) A TeX file, full of LaTeX commands, isn't readable.</p>\n<p>2) When a THY is marked up heavily in LaTeX, the THY isn't readable.</p>\n<p>3) Should I go further? Isar commands, such as 'subsubsection', which <br>\nare fashioned after the corresponding LaTeX commands, contribute nothing <br>\nto readability, and in fact, hinder readability, just like LaTeX.</p>\n<p>This is not criticism on my part. It's a reflection of what has been <br>\nimportant to you, given that you prioritize according to what you want.</p>\n<p>My goal? Eliminate all use of LaTeX from THY documents (other than a few <br>\ninfrequently used commands), and moreover, eliminate \"verbose\" Isar <br>\ncommands that distract from readability.</p>\n<p>Here's a LaTeX command from ML.thy: \\begin{verbatim}</p>\n<p>A LaTeX verbatim command like that will never be in my THY. In my THY, <br>\nverbatim environment markup never has to be used, except for the few <br>\nplaces outside of a newtheorem environment, and there the syntax is <br>\nreasonably subtle.</p>\n<p>You say, \"Maybe that is already sufficient to implement all 3 points <br>\nabove. \" No. (SEE NOTE ABOVE)</p>\n<p>My markup \"tags\" are outer syntax definitions. They wrap what they're <br>\nsupposed to mark up, and nothing wraps the markup tags, because wrapping <br>\nrequires additional characters and symbols. What I have as outer syntax <br>\nmay also sometimes be used in textual exposition, where, of course, it's <br>\ntext, though still markup, but that's not wrapping, that's using tags in <br>\ntext. (SEE NOTE ABOVE)</p>\n<p><em>EXPLAINING THE FOOBAR COMMAND</em></p>\n<p>Defining too many outer syntax commands is no good, so my FOOBAR was a <br>\ngeneral purpose text-text command, one use being a LaTeX equation <br>\nenvironment. Everything is subject to further change, but I show its <br>\nuse, where the period represents \\&lt;cdot&gt;, and \"&lt;\" and \"&gt;\" represent <br>\ncartouche delimiters.</p>\n<p>.&lt;x + y = z + w<br>\n           = m + y<br>\n           = q + r&gt;&lt;eq.jkl1608&gt;</p>\n<p>The alignment of the '=' symbols may get lost.</p>\n<p>I will parse that equation into a LaTeX environment, inserting <br>\nend-of-lines, and whatever else is necessary. The '\\&lt;open&gt;eq\\&lt;cdot&gt;' is <br>\nthe part of the tag that tells me it's an equation environment. It's <br>\npossible, given the numerous types of LaTeX equation environments, I <br>\nmight want 'e1', 'e2', etc. to represent other kinds of environments.</p>\n<p>I could change 'eq' to 'q', but the '\\label', 'jkl1608',is most of the <br>\nclutter, so there's no reason to save one letter.</p>\n<p>If all my syntax is defined, I can also have a term-text command, so <br>\nthat my formula is an active term, rather than just text.</p>\n<p><em>IMAGES, MORE IMAGES</em></p>\n<p>In 2012 and 2013 I developed my funky markup language, with just a <br>\nlittle knowledge of regular expressions. Since then, the words \"parsing\" <br>\nand \"grammars\" sunk in to my conscientious. It's the result of being <br>\nexposed to the talk of computer scientists, who deal in languages.</p>\n<p>I'm trying to get back to where I was, but with much cleaner syntax. <br>\nIt'll take me six months to a year to get there, because I'm also trying <br>\nto work on getting some number systems, vectors, and boolean logic done.</p>\n<p>The first image is my funky markup, in the THY, which is fairly <br>\nreadable. The second image shows my PDF. These things involve personal <br>\npreference, but I like how my PDF looks.</p>\n<p>I've moved on, on some things, but it formed the basis of some things. I <br>\ncan't converge back, from the divergence. I'm too deep in. What's most <br>\nimportant is that I actually finish something.</p>\n<p>Regards,<br>\nGB<br>\n<a href=\"/user_uploads/14278/Yky17B81Yu6LkVT0yGnIQgDv/151114a_Z_thy.png\">151114a_Z_thy.png</a><br>\n<a href=\"/user_uploads/14278/MYvpbVmH0eYYVHnPMbsK1FeK/151114b_Z_pdf.png\">151114b_Z_pdf.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/14278/Yky17B81Yu6LkVT0yGnIQgDv/151114a_Z_thy.png\" title=\"151114a_Z_thy.png\"><img src=\"/user_uploads/14278/Yky17B81Yu6LkVT0yGnIQgDv/151114a_Z_thy.png\"></a></div><div class=\"message_inline_image\"><a href=\"/user_uploads/14278/MYvpbVmH0eYYVHnPMbsK1FeK/151114b_Z_pdf.png\" title=\"151114b_Z_pdf.png\"><img src=\"/user_uploads/14278/MYvpbVmH0eYYVHnPMbsK1FeK/151114b_Z_pdf.png\"></a></div>",
        "id": 294659018,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661169225
    },
    {
        "content": "<p>From: Gottfried Barrow &lt;<a href=\"mailto:igbi@gmx.com\">igbi@gmx.com</a>&gt;<br>\nMakarius,</p>\n<p>This email is to finish things up before I send in another email, about <br>\nthe big problems with RC1.</p>\n<p>My game has changed, so I installed. I don't do proof with Isabelle <br>\nanymore, so my need for help will be near zero.</p>\n<p>I only do programming with Isabelle. The right foundation has to be <br>\nlaid, and programming is part of the foundation; there's not enough time <br>\nto do both.</p>\n<p>The first part is to you. The rest is just me talking.</p>\n<p>I jumped to conclusions about <code>\\&lt;^emph&gt;</code>, but the associated symbol for <br>\nthe command is good. Not having true italics is no big loss, but not <br>\nhaving a true bold font would be a really big loss.</p>\n<p>The extra bullet symbols are good.</p>\n<p>I got everything converted that's important.</p>\n<p>You switched the way Windows paths work, but I found those problems when <br>\nyou put out a test release last year. Here's how I now have to set <br>\nUSER_HOME to be able to change my home folder:</p>\n<p>set USER_HOME=/cygdrive/e/D_1/w rk/g_d/gezz</p>\n<p>I had some ML in between {<em>...</em>}, which allowed me to not having <br>\nmatching cartouches. Using 'isabelle build' wouldn't allow that. Now I <br>\nhave a dummy right cartouche like this:</p>\n<p>val split1 = IsE.split_symS_delim_to_snd \"\\&lt;open&gt;\" setup1; val _ = <br>\n\"\\&lt;close&gt;\"</p>\n<p>I tell you that to let you know that all the programming commands I've <br>\nimplemented are all dependent on the cartouche delimiters.</p>\n<p><em>BAD PROBLEMS</em></p>\n<p>I'll send in a different email about the bad problems. There's been some <br>\nbad process runaway, a blue screen of death, and bad hanging for the <br>\n64-bit Windows version.</p>\n<p><em>FRONT END MATH</em></p>\n<p>I've been driven by a simple number theory problem, where the proof was <br>\nbased on manipulating base ten digits.</p>\n<p>The long story is too long, but here's a good book:</p>\n<p>Computer Arithmetic and Verilog HDL, by Cavanagh</p>\n<p><a href=\"https://www.crcpress.com/Computer-Arithmetic-and-Verilog-HDL-Fundamentals/Cavanagh/9781439811245\">https://www.crcpress.com/Computer-Arithmetic-and-Verilog-HDL-Fundamentals/Cavanagh/9781439811245</a></p>\n<p>That was supposed to give me the model for computer arithmetic in <br>\nIsabelle/HOL, for number systems.</p>\n<p>In my mind, I just break up a decimal number as a sum of digits, <br>\nmultiplied by the appropriate power. In Isabelle/HOL, it's not simple at <br>\nall, because all the basic groundwork isn't there. It seems true types <br>\nfor at least bases 3, 5, 7, and 10 should be there.</p>\n<p>Now, take a standard function, \"f:A --&gt; B\", where A and B are elements <br>\nof the power set of the natural numbers. How do you easily state A and B <br>\nas your domain and codomain in HOL?</p>\n<p>You don't, not easily. It could be reasonably easy, but right now it's <br>\nnot. Part of the problem is just a \"syntax feature problem\". It's not a <br>\nlogic problem.</p>\n<p>Nothing in all this is a problem with the software. The software is <br>\npowerful enough, if people are flexible and will fill in all the gaps.</p>\n<p>Regards,<br>\nGB</p>",
        "id": 294664184,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661171085
    },
    {
        "content": "<p>From: Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt;<br>\nHave you tried Isabelle2016-RC0 already?</p>\n<p>It provides many new things concerning document markup and markdown. Very <br>\nfew LaTeX macros are remaining. Since you are using creative add-ons to <br>\nIsabelle document preparation, there is also a chance that something stops <br>\nworking.</p>\n<p>Now is still a chance to work it out.  Later in the release process, <br>\nfurther changes will be less likely.</p>\n<p>Makarius</p>",
        "id": 294664791,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661171328
    }
]