[
    {
        "content": "<p>From: <a href=\"mailto:Gerwin.Klein@data61.csiro.au\">Gerwin.Klein@data61.csiro.au</a><br>\nData61 Seeking Proof Engineers<br>\n==============================</p>\n<p>We are are hiring again!</p>\n<p>If only there were a place where I could prove theorems for money,<br>\nchange the world, and have fun while doing it...</p>\n<p>Sounds too good to exist?</p>\n<p>In the Trustworthy Systems team at Data61 that's what we do for a<br>\nliving. We are the creators of seL4, the world's first fully formally<br>\nverified operating system kernel with extreme performance and strong<br>\nsecurity &amp; correctness proofs. Our highly international team is located<br>\non the UNSW campus, close to the beautiful beaches of sunny Sydney,<br>\nAustralia, one of the world's most liveable cities.</p>\n<p>We are looking for multiple motivated proof engineers who want to join<br>\nour team in Sydney, move things forward, and have global impact. You<br>\nwould</p>\n<p>- work on industrial-scale formal proofs in Isabelle/HOL<br>\n  - develop formally verified infrastructure for building secure systems<br>\n    on top of seL4</p>\n<p>- contribute to improved proof automation and reasoning techniques<br>\n  - apply formal proof to real-world systems and tools</p>\n<p>To apply for this position, you should possess a significant subset of<br>\nthe following skills.</p>\n<p>- functional programming in a language like Haskell, ML, or OCaml<br>\n  - first-order or higher-order formal logic<br>\n  - basic experience in C<br>\n  - ability and desire to quickly learn new techniques<br>\n  - undergraduate degree in Computer Science, Mathematics, or similar<br>\n  - ability and desire to work in a larger team</p>\n<p>We are hiring at two levels, so if you are more qualified or<br>\nexperienced than the above would suggest, you can come in as a senior<br>\nproof engineer.</p>\n<p>If you additionally have experience</p>\n<p>- in software verification with an interactive theorem prover such as<br>\n    Isabelle/HOL, HOL4, or Coq, and/or</p>\n<p>- with operating systems and microkernels</p>\n<p>you should definitely apply!</p>\n<p>If you have the right skills and background, we can provide training on<br>\nthe job. Continual learning is a central component of everything we do.<br>\nYou will work with a unique world-leading combination of OS and formal<br>\nmethods experts, students at undergraduate and PhD level, engineers,<br>\nand researchers from 5 continents, speaking over 15 languages.<br>\nTrustworthy Systems is a fun, creative, and welcoming workplace with<br>\nflexible hours &amp; work arrangements.</p>\n<p>We value diversity in all forms and welcome applications from people of<br>\nall ages, including people with disabilities, and those who identify as<br>\nLGBTIQ. See <a href=\"https://ts.data61.csiro.au/diversity/\">https://ts.data61.csiro.au/diversity/</a> for more information.</p>\n<p>Salary ranges, in AUD (plus superannuation):</p>\n<ul>\n<li>Junior Proof Engineer: 73k-93k</li>\n<li>Senior Proof Engineer: 97k-105k<br>\ndepending on experience and qualifications.</li>\n</ul>\n<p>Apply online at the following link for the Proof Engineer positions:</p>\n<ul>\n<li><a href=\"https://jobs.csiro.au/job/Sydney%2C-NSW-Proof-Engineer/518443000/\">https://jobs.csiro.au/job/Sydney%2C-NSW-Proof-Engineer/518443000/</a></li>\n<li><a href=\"https://jobs.csiro.au/job/Sydney%2C-NSW-DATA-61/518441000/\">https://jobs.csiro.au/job/Sydney%2C-NSW-DATA-61/518441000/</a></li>\n</ul>\n<p>Your application should include a cover letter, CV, undergraduate<br>\ntranscript (if applicable), and contact information for two references.</p>\n<p>This round of applications closes on 17 December 2018.</p>\n<p>For any questions on these positions, please contact<br>\n<a href=\"mailto:Rafal.Kolanski@data61.csiro.au\">Rafal.Kolanski@data61.csiro.au</a></p>\n<p>The seL4 code and proof are open source. Check them out at <a href=\"https://seL4.systems\">https://seL4.systems</a></p>\n<p>More information about Data61's Trustworthy Systems team at<br>\n<a href=\"https://ts.data61.csiro.au\">https://ts.data61.csiro.au</a></p>\n<p>There are additional proof engineering positions available on the<br>\nCogent project. Cogent is a language we designed to ease the<br>\nverification of systems components around seL4. For expressions of<br>\ninterest, see contact details on<br>\n<a href=\"https://ts.data61.csiro.au/projects/TS/cogent.pml\">https://ts.data61.csiro.au/projects/TS/cogent.pml</a></p>\n<p>Looking to do a PhD?<br>\nData61 and UNSW (<a href=\"https://www.unsw.edu.au/\">https://www.unsw.edu.au/</a>) offer scholarships!<br>\nSee <a href=\"https://ts.data61.csiro.au/students/research.pml\">https://ts.data61.csiro.au/students/research.pml</a> for details.</p>",
        "id": 294746949,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661193878
    }
]