[
    {
        "content": "<p>From: Jasmin Blanchette &lt;<a href=\"mailto:jasmin.blanchette@inria.fr\">jasmin.blanchette@inria.fr</a>&gt;<br>\nITP 2016: CALL FOR WORKSHOPS AND TUTORIALS</p>\n<p>The Seventh International Conference on Interactive Theorem Proving<br>\n22 to 26 August 2016, Nancy, France<br>\n<a href=\"http://itp2016.inria.fr/\">http://itp2016.inria.fr/</a></p>\n<p>The ITP conference series is concerned with all topics related to interactive<br>\ntheorem proving, ranging from theoretical foundations to implementation<br>\naspects and applications in program verification, security, and formalization<br>\nof mathematics. The seventh ITP conference, ITP 2016, will be held at Inria<br>\nNancy - Grand-Est and LORIA between 22 and 26 August 2016.</p>\n<p>Researchers and practitioners are invited to submit proposals for co-located<br>\nworkshops on topics relating to interactive theorem proving. Workshops can<br>\ntarget the ITP community in general, focus on a particular ITP system, or<br>\nhighlight more specific issues or recent developments. Proposals for in-depth<br>\ntutorials or tool introductions are also welcome.</p>\n<p>Co-located events will take place on 26 (and possibly 27) August and will be<br>\nheld on the same premises as the main conference. Conference facilities are<br>\noffered free of charge to the organizers. Workshop-only attendees will enjoy a<br>\nsignificantly reduced registration fee.</p>\n<p>Detailed organizational matters such as paper submission and review process,<br>\nor publication of proceedings, are up to the organizers of individual<br>\nworkshops. All accepted workshops will be expected to have their program ready<br>\nby 10 July 2016.</p>\n<p>Proposals for workshops should contain at least the following pieces of<br>\ninformation:</p>\n<p>+ name and contact details of the main organizer(s)<br>\n  + (if applicable:) names of additional organizers<br>\n  + title and organizational style of workshop (tutorial, public workshop,<br>\n    project workshop, etc.)</p>\n<p>+ preferred length of workshop (between half day and two days)<br>\n  + estimated number of attendees<br>\n  + short (up to one page) description of topic<br>\n  + (if applicable:) pointers to previous editions of the workshop, or to<br>\n    similar events</p>\n<p>Proposals are invited to be submitted by email to <a href=\"mailto:itp2016nancy@easychair.org\">itp2016nancy@easychair.org</a>,<br>\nno later than 12 December 2015. Selected workshops will be notified by 23<br>\nDecember 2015. The workshop selection committee consists of the ITP program<br>\nchairs and organizers:</p>\n<p>Jasmin Christian Blanchette  (Inria Nancy &amp; LORIA, MPII Saarbrücken)<br>\n    Stephan Merz  (Inria Nancy &amp; LORIA)</p>",
        "id": 294657326,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661168591
    }
]