[
    {
        "content": "<p>From: Pascal Fontaine &lt;<a href=\"mailto:Pascal.Fontaine@inria.fr\">Pascal.Fontaine@inria.fr</a>&gt;<br>\nThe 27th International Conference on Automated Deduction (CADE-27)</p>\n<p>Natal, Brazil</p>\n<p>25-30 August 2019</p>\n<p><a href=\"http://www.cade-27.info\">http://www.cade-27.info</a></p>\n<p>CALL FOR PAPERS</p>\n<p>CADE is the major international forum for presenting research on all <br>\naspects of automated deduction. High-quality submissions on the general <br>\ntopic of automated deduction, including foundations, applications, <br>\nimplementations, theoretical results, practical experiences and user <br>\nstudies are solicited.</p>\n<p>Key dates:<br>\n   Abstract deadline:        15 February 2019<br>\n   Submission deadline:      22 February 2019</p>\n<ul>\n<li>\n<p>Logics of interest include propositional, first-order, equational, <br>\nhigher-order, classical, description, modal, temporal, many-valued, <br>\nconstructive, other non-classical, meta-logics, logical frameworks, type <br>\ntheory, set theory, as well as any combination thereof.</p>\n</li>\n<li>\n<p>Paradigms of interest include theorem proving, model building, <br>\nconstraint solving, computer algebra, model checking, proof checking, <br>\nand their integration.</p>\n</li>\n<li>\n<p>Methods of interest include resolution, superposition, completion, <br>\nsaturation, term rewriting, decision procedures, model elimination, <br>\nconnection methods, tableaux, sequent calculi, natural deduction, as <br>\nwell as their supporting algorithms and data structures, including <br>\nmatching, unification, orderings, induction, indexing techniques, proof <br>\npresentation and explanation, proof planning.</p>\n</li>\n<li>\n<p>Applications of interest include program analysis, verification and <br>\nsynthesis of software and hardware, formal methods, computational logic, <br>\ncomputer mathematics, natural language processing, computational <br>\nlinguistics, knowledge representation, ontology reasoning, deductive <br>\ndatabases, declarative programming, robotics, planning, and other areas <br>\nof artificial intelligence.</p>\n</li>\n</ul>\n<p>Submissions can be made in two categories: regular papers and system <br>\ndescriptions. The page limit in Springer LNCS style is 15 pages <br>\nexcluding references for regular papers and 10 pages excluding <br>\nreferences for system descriptions. Submissions must be unpublished and <br>\nnot submitted for publication elsewhere. They will be judged on <br>\nrelevance, originality, significance, correctness, and readability. <br>\nSystem descriptions must contain a link to a working system and will <br>\nalso be judged on usefulness and design. Proofs of theoretical results <br>\nthat do not fit in the page limit, executables of systems, and input <br>\ndata of experiments should be made available, via a reference to a <br>\nwebsite or in an appendix of the paper. For papers containing <br>\nexperimental evaluations, all data needed to rerun the experiments must <br>\nbe available. Reviewers will be encouraged to consider this additional <br>\nmaterial, but submissions must be self-contained within the respective <br>\npage limit; considering the additional material should not be necessary <br>\nto assess the merits of a submission. The review process will include a <br>\nfeedback/rebuttal period where authors will have the option to respond <br>\nto reviewer comments. The PC chair may solicit further reviews after the <br>\nrebuttal period.</p>\n<p>The proceedings of the conference will be published in the Springer <br>\nLNCS/LNAI series. Formatting instructions and the LNCS style files can <br>\nbe obtained at</p>\n<p><a href=\"http://www.springer.de/comp/lncs/authors.html\">http://www.springer.de/comp/lncs/authors.html</a></p>\n<p>At every CADE conference the Program Committee selects one of the <br>\naccepted papers to receive the CADE Best Paper Award. The award <br>\nrecognizes a paper that the Program Committee collegially evaluates as <br>\nthe best in terms of originality and significance, having substantial <br>\nconfidence in its correctness. Overall technical quality, completeness, <br>\nscholarly accuracy, and readability are also considered. Characteristics <br>\nassociated with a best paper include, for instance, introduction of a <br>\nstrong new technique or approach, solution of a long-standing open <br>\nproblem, introduction and solution of an interesting and important new <br>\nproblem, highly innovative application of known ideas or existing <br>\ntechniques, and presentation of a new system of outstanding power. Under <br>\nexceptional circumstances, the Program Committee may give two awards (ex <br>\naequo) or give no award.</p>\n<p>IMPORTANT DATES<br>\n   Abstract deadline:        15 February 2019<br>\n   Submission deadline:      22 February 2019<br>\n   Rebuttal phase:           2  April    2019<br>\n   Notification:             15 April    2019<br>\n   Final version:            27 May      2019</p>\n<p>SUBMISSION INSTRUCTIONS</p>\n<p>Papers should be submitted via</p>\n<p><a href=\"https://easychair.org/conferences/?conf=cade27\">https://easychair.org/conferences/?conf=cade27</a></p>\n<p>CADE-27 ORGANIZERS</p>\n<p>Conference Chair:<br>\n   Elaine Pimentel        Federal University of Rio Grande do Norte, Brazil</p>\n<p>Organizers:<br>\n   Carlos Olarte          Federal University of Rio Grande do Norte, Brazil<br>\n   Joao Marcos            Federal University of Rio Grande do Norte, Brazil<br>\n   Claudia Nalon          University of Brasilia, Brazil<br>\n   Giselle Reis           CMU, Qatar</p>\n<p>Program Committee Chair:<br>\n   Pascal Fontaine        Universite de Lorraine, CNRS, Inria, LORIA, France</p>\n<p>Workshop, Tutorial, and Competition Chair:<br>\n   Giles Reger            University of Manchester, UK</p>\n<p>Publicity Chair:<br>\n   Geoff Sutcliffe        University of Miami, USA</p>\n<p>Program Committee:<br>\n   Carlos Areces, FaMAF - Universidad Nacional de Cordoba, Argentina<br>\n   Franz Baader, TU Dresden, Germany<br>\n   Clark Barrett, Stanford University, USA<br>\n   Jasmin Christian Blanchette, Vrije Universiteit Amsterdam, The <br>\nNetherlands<br>\n   Maria Paola Bonacina, Universita degli Studi di Verona, Italy<br>\n   Leonardo Mendonca de Moura, Microsoft Research, USA<br>\n   Hans de Nivelle, Nazarbayev University, Astana, Kazakhstan<br>\n   Clare Dixon, University of Liverpool, UK<br>\n   Mnacho Echenim, Universite de Grenoble, France<br>\n   Marcelo Finger, University of Sao Paulo, Brazil<br>\n   Pascal Fontaine, Universite de Lorraine, CNRS, Inria, LORIA, France<br>\n   Silvio Ghilardi, Universita degli Studi di Milano, Italy<br>\n   Juergen Giesl, RWTH Aachen University, Germany<br>\n   Rajeev Gore, The Australian National University, Australia<br>\n   Stefan Hetzl, Technische Universitaet Wien, Austria<br>\n   Marijn J. H. Heule, The University of Texas at Austin, USA<br>\n   Nao Hirokawa, JAIST, Japan<br>\n   Moa Johansson, Chalmers University of Technology, Sweden<br>\n   Cezary Kaliszyk, University of Innsbruck, Austria<br>\n   Deepak Kapur, University of New Mexico, USA<br>\n   Benjamin Kiesl, Technische Universitaet Wien, Austria<br>\n   Konstantin Korovin, The University of Manchester, UK<br>\n   Laura Kovacs, Technische Universitaet Wien, Austria<br>\n   Ramana Kumar, DeepMind, UK<br>\n   Claudia Nalon, University of Brasilia, Brazil<br>\n   Vivek Nigam, Federal University of Paraiba &amp; Fortiss, Brazil &amp; Germany<br>\n   Carlos Olarte, Federal University of Rio Grande do Norte, Brazil<br>\n   Jens Otten, University of Oslo, Norway<br>\n   Andre Platzer, Carnegie Mellon University, USA<br>\n   Andrew Reynolds, The University of Iowa, USA<br>\n   Philipp Ruemmer, Uppsala University, Sweden<br>\n   Renate A. Schmidt, The University of Manchester, UK<br>\n   Stephan Schulz, DHBW Stuttgart, Germany<br>\n   Roberto Sebastiani, University of Trento, Italy<br>\n   Natarajan Shankar, SRI International, USA<br>\n   Viorica Sofronie-Stokkermans, Universitaet Koblenz-Landau, Germany<br>\n   Martin Suda, Czech Technical University, Czech Republic<br>\n   Geoff Sutcliffe, University of Miami, USA<br>\n   Rene Thiemann, University of Innsbruck, Austria<br>\n   Uwe Waldmann, Max Planck Institute for Informatics, Germany<br>\n   Christoph Weidenbach, Max Planck Institute for Informatics, Germany<br>\n   Sarah Winkler, University of Innsbruck, Austria</p>\n<p>CALL FOR WORKSHOPS, TUTORIALS, SYSTEM COMPETITIONS</p>\n<p>The 27th International Conference on Automated Deduction (CADE-27)<br>\nNatal, Brazil</p>\n<p>25-30 August 2019</p>\n<p><a href=\"http://www.cade-27.info\">http://www.cade-27.info</a></p>\n<p>CALL FOR WORKSHOPS</p>\n<p>Workshop proposals for CADE-27 are solicited. The workshops will take <br>\nplace on August 25-26 2019, before the main conference. Both <br>\nwell-established workshops and newer ones are encouraged. Similarly, <br>\nproposals for workshops with a tight focus on a core automated reasoning <br>\nspecialization, as well as those with a broader, more applied focus, are <br>\nvery welcome.</p>\n<p>Please provide the following information in your application document:</p>\n<ul>\n<li>Workshop title.</li>\n<li>Names and affiliations of organizers.</li>\n<li>\n<p>Proposed workshop duration (from half a day to two days) and preferred <br>\nday(s).</p>\n</li>\n<li>\n<p>Brief description of the goals and the scope of the workshop. Why is <br>\nthe workshop relevant for CADE?</p>\n</li>\n<li>\n<p>Is the workshop new or has it met previously? In the latter case <br>\ninformation on previous meetings should be given (e.g., links to the <br>\nprogram, number of submissions, number of participants).</p>\n</li>\n<li>\n<p>What are the plans for publication?</p>\n</li>\n</ul>\n<p>CALL FOR TUTORIALS</p>\n<p>Tutorial proposals for CADE-27 are solicited. Tutorials are expected to <br>\nbe either half-day or full-day events, with a theoretical or applied <br>\nfocus, on a topic of interest for CADE-27. Proposals should provide the <br>\nfollowing information:</p>\n<ul>\n<li>Tutorial title.</li>\n<li>Names and affiliations of organizers.</li>\n<li>\n<p>Proposed tutorial duration (from half a day to one days) and the <br>\npreferred day.</p>\n</li>\n<li>\n<p>Brief description of the tutorial's goals and topics to be covered.</p>\n</li>\n<li>Whether or not a version of the tutorial has been given previously.</li>\n</ul>\n<p>CADE will take care of printing and distributing notes for tutorials <br>\nthat would like this service.</p>\n<p>CALL FOR SYSTEM COMPETITIONS</p>\n<p>The CADE ATP System Competition (CASC), which evaluates automated <br>\ntheorem proving systems for classical logics, has become an integral <br>\npart of the CADE conferences.</p>\n<p>Further system competition proposals are solicited. The goal is to <br>\nfoster the development of automated reasoning systems in all areas <br>\nrelevant for automated deduction in a broader sense. Proposals should <br>\ninclude the following information:</p>\n<ul>\n<li>Competition title.</li>\n<li>Names and affiliations of organizers.</li>\n<li>Duration and schedule of the competition.</li>\n<li>Room/space requirements.</li>\n<li>Description of the competition task and the evaluation procedure.</li>\n<li>Is the competition new or has it been organized before?  In the latter <br>\ncase information on previous competition<br>\n[message truncated]</li>\n</ul>",
        "id": 294746100,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661193504
    }
]