[
    {
        "content": "<p>From: David Pichardie &lt;<a href=\"mailto:David.Pichardie@irisa.fr\">David.Pichardie@irisa.fr</a>&gt;<br>\nITP 2013: 4th International Conference on Interactive Theorem Proving</p>\n<p>23-26 July 2013, Rennes, France<br>\n<a href=\"http://itp2013.inria.fr\">http://itp2013.inria.fr</a></p>\n<p>ITP is the premier international conference for researchers from all<br>\nareas of interactive theorem proving and its applications. The<br>\ninaugural meeting of ITP was held in July 2010 in Edinburgh, Scotland,<br>\nas part of the Federated Logic Conference (FLoC), the second<br>\nmeeting took place in Nijmegen, The Netherlands, in August 2011 and<br>\nthe third meeting was held in Princeton, New Jersey, in  August 2012. <br>\nITP 2013 will take place in Rennes, France on 23-26 July<br>\n2013 with workshops preceding the main conference.  ITP is the<br>\nevolution of the TPHOLs conference series to the broad field of<br>\ninteractive theorem proving. TPHOLs meetings took place every year<br>\nfrom 1988 until 2009.</p>\n<p>The program committee welcomes submissions on all aspects of<br>\ninteractive theorem proving and its applications.  Examples of typical<br>\ntopics include formal aspects of hardware or software (specification,<br>\nverification, semantics, synthesis, refinement, compilation, etc.);<br>\nformalization of significant bodies of mathematics; advances in<br>\ntheorem prover technology (automation, decision procedures, induction,<br>\ncombinations of systems and tools, etc.); other topics including those<br>\nrelating to user interfaces, education, comparisons of systems, and<br>\nmechanizable logics; and concise and elegant worked examples (\"Proof<br>\nPearls\").</p>\n<p>Submission details:</p>\n<p>All papers must be submitted electronically, via EasyChair:<br>\n<a href=\"https://www.easychair.org/conferences/?conf=itp2013\">https://www.easychair.org/conferences/?conf=itp2013</a></p>\n<p>Papers may be no longer than 16 pages and are to be submitted in PDF<br>\nusing the Springer \"llncs\" format.  Instructions may be found at<br>\nftp://ftp.springer.de/pub/tex/latex/llncs/latex2e/instruct/authors/typeinst.pdf<br>\nwith Latex source file typeinst.tex in the same directory.<br>\nSubmissions must describe original unpublished work not submitted for<br>\npublication elsewhere, presented in a way that users of other systems<br>\ncan understand.  The proceedings will be published as a volume in the<br>\nSpringer Lecture Notes in Computer Science series and will be<br>\navailable to participants at the conference.</p>\n<p>In addition to regular submissions, described above, there will be a<br>\n\"rough diamonds\" section.  Rough diamond submissions are limited to<br>\nsix pages and may consist of an extended abstract.  They will be<br>\nrefereed: they will be expected to present innovative and promising<br>\nideas, possibly in an early form and without supporting evidence.<br>\nAccepted diamonds will be published in the main proceedings, and will<br>\nbe presented as short talks.</p>\n<p>Both regular and rough diamond submissions require an abstract of 70<br>\nto 150 words to be submitted electronically at the above address one<br>\nweek before the full submission.  All submissions must be written in<br>\nEnglish. Submissions are expected to be accompanied by verifiable<br>\nevidence of a suitable implementation, such as the source files of a<br>\nformalization for the proof assistant used. This material can be <br>\nuploaded via easychair or made available online if a suitable URL <br>\nis provided in the submitted paper. This material will not be <br>\naccessed until February 11th (10 days after the paper submission <br>\ndeadline). Authors who have strong reasons (e.g. of commercial/legal <br>\nnature) for violating this policy should contact the PC chairs in <br>\nadvance. At the time of abstract submission, proof assistants and <br>\nother tools necessary for evaluating the submission should be <br>\nindicated using the Keywords section of the web interface.</p>\n<p>Authors of accepted papers are expected to present their papers at the<br>\nconference, and will be required to sign copyright release forms. <br>\nAll submissions must be written in English.</p>\n<p>Important dates:</p>\n<p>Abstract submission deadline:           28 January 2013<br>\nPaper submission deadline:              1st February 2013<br>\nNotification of paper decisions:        28 March 2013<br>\nFinal versions due from authors:        22 April 2013<br>\nConference dates:                       23-26 July 2013</p>\n<p>Web page: <a href=\"http://itp2013.inria.fr\">http://itp2013.inria.fr</a></p>\n<p>Program Committee:<br>\nWolfgang Ahrendt, Chalmers University, Sweden<br>\nJeremy Avigad, Carnegie Mellon University, USA<br>\nNick Benton, Microsoft Research, UK<br>\nLennart Beringer, Princeton University, USA<br>\nSandrine Blazy, University of Rennes, France (co-chair)<br>\nAdam Chlipala, MIT, USA<br>\nThierry Coquand, Chalmers University, Sweden<br>\nAmy Felty, University of Ottawa, Canada<br>\nRuben Gamboa, University of Wyoming, USA<br>\nHerman Geuvers, Radboud University Nijmegen, The Netherlands<br>\nElsa Gunter, University of Illinois at Urbana-Champaign, USA<br>\nDavid Hardin, Rockwell Collins, Inc., USA<br>\nJohn Harrison, Intel Corporation, USA<br>\nGerwin Klein, NICTA and UNSW, Australia<br>\nAssia Mahboubi, INRIA - École polytechnique, France<br>\nPanagiotis Manolios, Northeastern University, USA<br>\nConor Mcbride, University of Strathclyde, UK<br>\nCésar Muñoz, NASA, USA<br>\nMagnus O. Myreen, University of Cambridge, UK<br>\nTobias Nipkow, TU München, Germany<br>\nMichael Norrish, NICTA and ANU, Australia<br>\nSam Owre, SRI International, USA<br>\nChristine Paulin-Mohring, Université Paris-Sud 11, France (co-chair)<br>\nLawrence Paulson, University of Cambridge, UK<br>\nDavid Pichardie, Inria Rennes/Harvard University, France (co-chair)<br>\nBrigitte Pientka, McGill University, Canada<br>\nLaurence Pierre, TIMA, France<br>\nLee Pike, Galois, Inc., USA<br>\nClaudio Sacerdoti Coen, University of Bologna, Italy<br>\nJulien Schmaltz, Open University of the Netherlands, The Netherlands<br>\nMakoto Takeyama, AIST/COVS, Japan<br>\nLaurent Théry, Inria Sophia-Antipolis, France<br>\nRené Thiemann, University of Innsbruck, Austria<br>\nMakarius Wenzel, Université Paris-Sud 11, France</p>",
        "id": 294230817,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660902391
    }
]