[
    {
        "content": "<p>From: Cas Cremers &lt;<a href=\"mailto:cas.cremers@gmail.com\">cas.cremers@gmail.com</a>&gt;<br>\nPhD position in Information Security at ETH Zurich<br>\n==================================================</p>\n<p>The research group headed by Prof. David Basin at ETH Zurich has an open<br>\nposition for a PhD student.  The PhD project will be on formal methods<br>\nfor cryptographic protocols, in particular on security strengthening<br>\ntransformations.</p>\n<p>The project aims to develop security-strengthening transformations for<br>\ncryptographic protocols and provide both formal analysis methods as well<br>\nas cryptographic (indistinguishability-based) proof methods for<br>\nestablishing the correctness of the transformations.  The research of<br>\nthe PhD student will focus on the formal modeling and analysis of the<br>\ntransformations.</p>\n<p>For this project, we are looking for an enthusiastic young researcher<br>\nwith a background in formal methods. Knowledge of security protocols and<br>\ntheir analysis would be an asset.</p>\n<p>PhD students are paid employees of the university and salary and<br>\nemployment conditions are attractive. The PhD student employed will be<br>\ngiven the opportunity to carry out a PhD in Computer Science at ETH<br>\nZurich on a topic related to the project. ETH Zurich regulations require<br>\ndoctoral students to hold a Master's or equivalent degree (e.g. Diplom).</p>\n<p>Zurich is a diverse and multicultural Swiss city which is consistently<br>\nrated among the best cities in the world in which to live. We favor the<br>\nsame sort of diversity that defines Zurich's cultural makeup and<br>\nencourage anyone to apply with interest in formal methods and security,<br>\nregardless of where you are from.</p>\n<p>For further information please contact Cas Cremers at:<br>\n<a href=\"mailto:cas.cremers@inf.ethz.ch\">cas.cremers@inf.ethz.ch</a><br>\nApplications should also be sent to Cas Cremers at the email address<br>\nabove.</p>\n<p>Applications should include a curriculum vitae, a brief description of<br>\nresearch interests, and, if possible, letters of recommendation from<br>\nteachers or employers.</p>",
        "id": 294111403,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660836957
    }
]