[
    {
        "content": "<p>From: Alexander Steen &lt;<a href=\"mailto:a.steen@fu-berlin.de\">a.steen@fu-berlin.de</a>&gt;<br>\n====================================================<br>\n25th International Conference on Automated Deduction (CADE) -- Call for <br>\nVolunteers<br>\n====================================================</p>\n<p>CADE is the major forum for the presentation of research in all aspects <br>\nof automated deduction. The conference programme includes invited talks, <br>\npaper presentations, workshops, tutorials, and system competitions. <br>\nFurthermore, the Herbrand Award for Distinguished Contributions to <br>\nAutomated Deduction and the new Skolem award(s) for influential <br>\nhistorical CADE papers are presented at the conference. Moreover, to <br>\ncelebrate its 25th edition, CADE-25 includes a Jubilee Session on the <br>\nPast, Present and Future of Automated Deduction. Renowned scientists <br>\nfrom leading universities have agreed to give invited lectures at <br>\nCADE-25. For further information, visit <a href=\"http://cade-25.info\">http://cade-25.info</a>.</p>\n<p>The CADE-25 conference will be held from the 1st to 7th of August, 2015 <br>\nat the Freie Universität Berlin in Berlin-Dahlem.</p>\n<blockquote>\n<blockquote>\n<p>Volunteering at CADE-25.<br>\nIn order to support the organisation of CADE-25, we are seeking <br>\nvolunteers to help between August 1st and 7th. The duties of the <br>\nvolunteers are to assist the CADE-25 organisation team, for example, at <br>\nthe registration desk, as technical support staff during the workshop <br>\nand tutorial days, as a group guide during the excursion, etc. Each <br>\nvolunteer is supervised by one of the senior organizers who will also be <br>\nthe primary contact person for that volunteer during the conference.</p>\n</blockquote>\n</blockquote>\n<blockquote>\n<blockquote>\n<p>Perks of a volunteer.<br>\nIn return, the volunteers will receive free registration and access to <br>\nall scientific events of CADE-25, including tutorials, workshops and the <br>\nmain conference itself. Each volunteer is guaranteed to have at least <br>\n50% free time to attend lectures at will. The remaining time is devided <br>\ninto a share of 2-3 days of fixed duties and a small part of \"stand-by\" <br>\nduties, which are likely to be free time.</p>\n</blockquote>\n</blockquote>\n<p>Moreover, upon request, we might be able to provide free (shared) <br>\naccommodation in a student hostel. Please tell us upon application <br>\nwhether this applies to you.</p>\n<blockquote>\n<blockquote>\n<p>Becoming a volunteer.<br>\nIf you are interested in becoming a volunteer at CADE-25, please visit <br>\n<a href=\"http://cade-25.info/cfv\">http://cade-25.info/cfv</a> for further information.<br>\nThe deadline for applications is 01.05.2015. Applicants that have been <br>\nchosen as volunteers will be contacted before 15.05.2015.<br>\n<a href=\"/user_uploads/14278/ckTUfMtf8ZutVKCPpzXCWLH6/smime.p7s\">smime.p7s</a></p>\n</blockquote>\n</blockquote>",
        "id": 294329091,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660929619
    }
]