[
    {
        "content": "<p>From: Roy Dyckhoff &lt;<a href=\"mailto:rd@cs.st-andrews.ac.uk\">rd@cs.st-andrews.ac.uk</a>&gt;<br>\nPRNCL 2009 - Workshop on Proofs and Refutations in Non-Classical Logics<br>\n(affiliated with Tableaux 2009)<br>\nCall for Papers<br>\nJuly 6, 2009, Oslo, Norway<br>\n<a href=\"http://www.loria.fr/~galmiche/PRNCL09.html\">http://www.loria.fr/~galmiche/PRNCL09.html</a></p>\n<ul>\n<li>There are various ways to design a refutation-based deduction <br>\nsystem. Deduction systems where refutations completely replace proofs <br>\nas first-class citizens, with a set of rules inductively defining <br>\nrefutation trees; systems combining proof-rules and refutation <br>\nmechanisms (or criteria) which can occur at various levels of the <br>\nproof-search process; systems where provability and refutability play <br>\ndual roles, i.e., proofs and refutations are both first-class <br>\ncitizens; systems where refutations are understood as mechanisms that <br>\nbuild counter-models:  for example, semantic information is collected <br>\nand may converge to a counter-model as the search process evolves.</li>\n</ul>\n<p>Such approaches are applicable to a wide range of logics like <br>\nsub-structural logics, intermediate logics and their extensions, <br>\nmodal or temporal logics, even to type theory. The deduction systems <br>\ncan be based on various structures/methods: sequents, tableaux, <br>\nnatural deduction, connections, proof-nets, games, etc.</p>\n<p>The aim of the workshop is to provide a forum of discussion between <br>\nresearchers interested in non-classical logics in the perspective of <br>\nproof and refutation systems.</p>\n<ul>\n<li>\n<p>Detailed information about topics and submission can be found on <br>\nthe web page.</p>\n</li>\n<li>\n<p>Program Committee : R. Dyckhoff (Univ. St Andrews, Scotland);<br>\nC. Fermueller (T.U. Wien, Austria); D. Galmiche (LORIA - UHP, France);<br>\nD. Larchey-Wendling (LORIA - CNRS, France); F. Pfenning (CMU<br>\nPittsburgh, USA); A. Waaler (Univ. Oslo, Norway)</p>\n</li>\n<li>\n<p>Important dates: extended abstract submission: May 15, 2009; <br>\nNotification: June 2, 2009.</p>\n</li>\n</ul>",
        "id": 294075867,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660828854
    }
]