[
    {
        "content": "<p>From: Walther Neuper &lt;<a href=\"mailto:wneuper@ist.tugraz.at\">wneuper@ist.tugraz.at</a>&gt;<br>\ndeadline 6.May</p>\n<hr>\n<p>Last Call for Extended Abstracts</p>\n<hr>\n<p>THedu'13<br>\n                     TP components for educational software<br>\n                     ======================================<br>\n                     (<a href=\"http://www.uc.pt/en/congressos/thedu\">http://www.uc.pt/en/congressos/thedu</a>)<br>\n                                 Wednesday, 10.July</p>\n<p>Co-located with CICM 2013<br>\n                   Conferences on Intelligent Computer Mathematics<br>\n                                     Bath, UK<br>\n<a href=\"http://www.cicm-conference.org/2013/cicm.php\">http://www.cicm-conference.org/2013/cicm.php</a></p>\n<hr>\n<p>THedu'13 Scope</p>\n<hr>\n<p>THedu is a forum to gather the research communities for computer<br>\nTheorem Proving (TP), Automated Theorem Proving (ATP), Interactive<br>\nTheorem Proving (ITP) as well as for Computer Algebra Systems (CAS)<br>\nand Dynamic Geometry Systems (DGS).<br>\nThe goal of this union is to combine and focus systems of these areas<br>\nand to enhance existing educational software as well as studying the<br>\ndesign of the next generation of mechanised mathematics assistants.</p>\n<p>Important Dates:</p>\n<hr>\n<p>* Extended Abstracts:     06 May 2013<br>\n      * Author Notification:    03 Jun 2013<br>\n      * Final Version:          15 Jun 2013<br>\n      * Workshop Day:           (still to be defined, 8-12 July)<br>\n      * Postproceedings(EPTCS): 15 October 2013</p>\n<p>(<a href=\"https://www.easychair.org/conferences/?conf=thedu13\">https://www.easychair.org/conferences/?conf=thedu13</a>)</p>\n<p>Elements for next-generation assistants include:</p>\n<p>* Declarative Languages for Problem Solution: education in applied<br>\n   sciences and in engineering is mainly concerned with problems, which<br>\n   are understood as operations on elementary objects to be transformed<br>\n   to an object representing a problem solution. Preconditions and<br>\n   postconditions of these operations can be used to describe the<br>\n   possible steps in the problem space; thus, ATP-systems can be used<br>\n   to check if an operation sequence given by the user does actually<br>\n   present a problem solution. Such \"Problem Solution Languages\"<br>\n   encompass declarative proof languages like Isabelle/Isar or Coq's<br>\n   Mathematical Proof Language, but also more specialized forms such<br>\n   as, for example, geometric problem solution languages that express a<br>\n   proof argument in Euclidean Geometry or languages for graph theory.</p>\n<p>* Consistent Mathematical Content Representation: libraries of<br>\n   existing ITP-Systems, in particular those following the LCF-prover<br>\n   paradigm, usually provide logically coherent and human readable<br>\n   knowledge. In the leading provers, mathematical knowledge is covered<br>\n   to an extent beyond most courses in applied sciences. However, the<br>\n   potential of this mechanised knowledge for education is clearly not<br>\n   yet recognised adequately: renewed pedagogy calls for enquiry-based<br>\n   learning from concrete to abstract --- and the knowledge's logical<br>\n   coherence supports such learning: for instance, the formula 2.Pi<br>\n   depends on the definition of reals and of multiplication; close to<br>\n   these definitions are the laws like commutativity etc. Clearly, the<br>\n   complexity of the knowledge's traceable interrelations poses a<br>\n   challenge to usability design.</p>\n<p>* User-Guidance in Stepwise Problem Solving: Such guidance is<br>\n   indispensable for independent learning, but costly to implement so<br>\n   far, because so many special cases need to be coded by<br>\n   hand. However, CTP technology makes automated generation of<br>\n   user-guidance reachable: declarative languages as mentioned above,<br>\n   novel programming languages combining computation and deduction,<br>\n   methods for automated construction with ruler and compass from<br>\n   specifications, etc --- all these methods 'know how to solve a<br>\n   problem'; so, using the methods' knowledge to generate user-guidance<br>\n   mechanically is an appealing challenge for ATP and ITP, and probably<br>\n   for compiler construction!</p>\n<p>In principle, mathematical software can be conceived as models of<br>\nmathematics: The challenge addressed by this workshop is to provide<br>\nappealing models for mathematics assistants which are interactive and<br>\nwhich explain themselves such that interested students can<br>\nindependently learn by inquiry and experimentation.</p>\n<p>Submission</p>\n<hr>\n<p>We welcome submission of extended abstracts (4 pages max) presenting<br>\noriginal unpublished work which is not been submitted for publication<br>\nelsewhere.</p>\n<p>All accepted extended abstracts will be presented at the workshop, and<br>\nthe extended abstracts will be made available online. A publication<br>\npost-proceedings (papers, 16 pages max) under EPTCS is under<br>\nconsideration.</p>\n<p>Extended abstracts and demo proposals should be submitted via THedu'13<br>\neasychair (<a href=\"https://www.easychair.org/conferences/?conf=thedu13\">https://www.easychair.org/conferences/?conf=thedu13</a>).</p>\n<p>Extended abstracts should be no more than 4 pages in length and are to<br>\nbe submitted in PDF format. They must conform to the EPTCS style<br>\nguidelines (<a href=\"http://http://style.eptcs.org/\">http://http://style.eptcs.org/</a>).</p>\n<p>At least one author of each accepted extended abstract/demo is<br>\nexpected to attend THedu'13 and presents her or his extended<br>\nabstract/demo.</p>\n<p>Program Committee</p>\n<hr>\n<p>Ralph-Johan Back, Abo Akademy University, Finland<br>\n      Francisco Botana, University of Vigo at Pontevedra, Spain<br>\n      Roman Hašek, University of South Bohemia<br>\n      Predrag Janicic, University of Belgrade, Serbia<br>\n      Julien Narboux, University of Strasbourg, France<br>\n      Filip Maric, University of Belgrade, Serbia<br>\n      Walther Neuper, Graz University of Technology, Austria<br>\n      Pavel Pech, University of South Bohemia<br>\n      Vanda Santos, CISUC, Portugal<br>\n      Wolfgang Schreiner, University of Linz, Austria<br>\n      Dusan Vallo, University of Nitra, Slovakia<br>\n      Makarius Wenzel, University Paris-Sud, France<br>\n      Burkhart Wolff, University Paris-Sud, France</p>",
        "id": 294241526,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660907185
    }
]