[
    {
        "content": "<p>From: Lars Hupel &lt;<a href=\"mailto:hupel@in.tum.de\">hupel@in.tum.de</a>&gt;<br>\nDear list,</p>\n<p>on Sunday, I released a new version of libisabelle. Since the initial<br>\nannouncement in February, a lot of things happened, mainly driven by my<br>\nstay at EPFL over summer. In fact, the Isabelle/Leon integration is<br>\npowered by libisabelle.</p>\n<p>Major features are:</p>\n<ul>\n<li>\n<p>bootstrapping: downloading and setting up a working Isabelle<br>\ninstallation on all three supported platforms, given an existing JVM</p>\n</li>\n<li>\n<p>multi-tenancy: managing different Isabelle instances on the same JVM<br>\nprocess</p>\n</li>\n<li>\n<p>multi-version: support for Isabelle2014 and 2015; JDK ≥ 7; Scala<br>\n2.10.x and 2.11.x</p>\n</li>\n</ul>\n<p>All of this is regularly and automatically tested on Windows, OS X and<br>\nLinux.</p>\n<p>Plans for the near future, in decreasing order of importance (and<br>\ncoincidentally, also in decreasing order of immediate utility to regular<br>\nIsabelle users):</p>\n<ul>\n<li>\n<p>Component management for Isabelle to be able to fetch non-AFP<br>\ndevelopments easily (for example: IsarMathLib, IsaFoR, Autocorres),<br>\nincluding a command-line interface and hooking into the regular Isabelle<br>\ncomponent mechanism.</p>\n</li>\n<li>\n<p>Offering parts of Isabelle/Pure and Isabelle/HOL as Scala API,<br>\nincluding term manipulation, definitional packages and tactics.</p>\n</li>\n<li>\n<p>Seamless remoting for libisabelle applications (e.g. Leon).*</p>\n</li>\n</ul>\n<p>I'm also soliciting feedback with this mail. If there's anything you'd<br>\nlike to see implemented or if you have any use cases, please do tell!</p>\n<p>Cheers<br>\nLars</p>\n<ul>\n<li>Note that Isabelle/jEdit isn't and presently can't be a libisabelle<br>\napplication. Hence, a PIDE display protocol as postulated by Makarius<br>\n&lt;<a href=\"http://sketis.net/2015/proposal-remote-prover-connectivity-for-isabellepide-2\">http://sketis.net/2015/proposal-remote-prover-connectivity-for-isabellepide-2</a>&gt;<br>\nis not within the scope of this project (unless someone not-me volunteers).</li>\n</ul>",
        "id": 294660537,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661169745
    }
]