[
    {
        "content": "<p>From: \"Yannick Duchêne (Hibou57 )\" &lt;<a href=\"mailto:yannick_duchene@yahoo.fr\">yannick_duchene@yahoo.fr</a>&gt;<br>\nHi guys'n gals,</p>\n<p>I feel ashamed now, while I feel it's so funny as much as useful enough to  <br>\nbe narrated, I'm telling the story here.</p>\n<p>Say I had a local with “assumes A and B”. The most important stuff was in  <br>\nA, so I was mainly busy proving theorems derived from A. One of those was  <br>\nhard to me (I'm not a guru, and I'm as slow as a snail), and I multiple  <br>\ntimes requested the help of Try/Sledgehammer and others. I was never happy  <br>\nwith the produced Isar proof, and to make it more clear, I wanted to  <br>\nunderstand one I picked, expecting to make it more readable.</p>\n<p>I was astonished to noticed one of the intermediate goal generated by  <br>\nSledgehammer, should have been impossible to prove according to my intents  <br>\nand interpretations of A and B. I forked my investigations toward this new  <br>\ncase, and discovered I could both prove this goal and disprove it. Yes, I  <br>\ncould prove P and ¬ P! You guess I was rather frightened, while not  <br>\nwilling to believe in an Isabelle bug.</p>\n<p>I finally understood: you could only prove ¬ P if you used A and B from  <br>\nthe locale's premisses and you could only prove P if you used only A and  <br>\ndon't bother about B; and as you could either bother or not about B, you  <br>\ncould prove both P and ¬ P one next to the other. So I changed the  <br>\nlocale's premisses into “assumes B and B ⟹ A” instead of “assumes A and  <br>\nB”. I also have to add “using B” in most proofs about A targeting that  <br>\nlocale.</p>\n<p>I was doing as if B was implicitly there everywhere; but it's not.</p>\n<p>Moral of the story: don't forget the premisses, it's not enough to have it  <br>\nin the locale's “assumes”, it probably also have to be there at the left  <br>\nof an ⟹, in some propositions of the “assumes” section.</p>\n<p>By the way, a question aside: is there a way to refer to a proposition  <br>\n from another proposition? I mean so that I would not have to copy/paste  <br>\nthe premiss of “(text of B) ⟹ (text of A)” and just refer to B, as “B ⟹  <br>\n(text of A)” instead of the latter.</p>",
        "id": 294260846,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660914323
    },
    {
        "content": "<p>From: Peter Lammich &lt;<a href=\"mailto:lammich@in.tum.de\">lammich@in.tum.de</a>&gt;<br>\nHi.</p>\n<p>Already years ago, I got used to always provide some model for any<br>\nlocale that contains \"final results\" of my formalization, just to make<br>\nsure that I have not introduced inconsistent assumptions by mistake. And<br>\nthis is, unfortunately, easier than one may think. E.g., a simple typo<br>\nis already enough:</p>\n<p>definition P :: \"nat =&gt; bool\" [...]</p>\n<p>locale foo = assumes A: \"j&gt;0 ==&gt; p j\" (* &lt;-- note the lower-case typo<br>\nhere, p is actually a free variable! *)</p>\n<p>inside the locale, you can prove everything you expect with A (and much<br>\nmore ;) ). Only when interpreting the locale you will realize the<br>\nmistake. </p>\n<p>Best,<br>\n  Peter</p>",
        "id": 294260909,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660914351
    },
    {
        "content": "<p>From: \"Yannick Duchêne (Hibou57 )\" &lt;<a href=\"mailto:yannick_duchene@yahoo.fr\">yannick_duchene@yahoo.fr</a>&gt;<br>\nHello Johannes,</p>\n<p>I already tried this one. It seems to be allowed by Isar‑Ref, but Isabelle  <br>\nreject it with this message: “Illegal term bindings in context element”.</p>",
        "id": 294260920,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660914354
    },
    {
        "content": "<p>From: \"Yannick Duchêne (Hibou57 )\" &lt;<a href=\"mailto:yannick_duchene@yahoo.fr\">yannick_duchene@yahoo.fr</a>&gt;<br>\nThat's what I would like to avoid, as I would like to be able to predict  <br>\nsuch issues. I'm still investigating the case, as the problem finally  <br>\nremains unsolved: adding the premiss directly in the proposition did not  <br>\nsolve everything.</p>\n<p>Some sanity theorems may help (successful in one case at least), but I  <br>\ndon't know any kind of general theorem which could assert there is no  <br>\npossible contradictions. I guess this is feasible, as that must be  <br>\nsomething close people do when they check a logic is sound and claim they  <br>\nproved it.</p>",
        "id": 294260940,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660914360
    },
    {
        "content": "<p>From: \"Yannick Duchêne (Hibou57 )\" &lt;<a href=\"mailto:yannick_duchene@yahoo.fr\">yannick_duchene@yahoo.fr</a>&gt;<br>\nI was wrong, Isar‑Ref disallows it. Printed page 89 it says:</p>\n<p>“Note that \"(is p 1 . . . p n )\" patterns given in the syntax of<br>\n      assumes and defines above are illegal in locale definitions.”</p>",
        "id": 294260995,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660914366
    }
]