[
    {
        "content": "<p>From: José Manuel Rodriguez Caballero &lt;<a href=\"mailto:josephcmac@gmail.com\">josephcmac@gmail.com</a>&gt;<br>\nNice project. My idea of an International Olympiad in Isabelle are a little<br>\nbit different. Indeed, I can summarize my vision as follows:</p>\n<p>1) There will be some publicity about the International Olympiad some<br>\nmonths before its date. The publicity should be mainly addressed to<br>\nundergraduate and high school students. People interested in the Olympiad<br>\nshould summit their email addresses in a website. People working with<br>\nIsabelle in an official research project, e.g., a Master, a PhD, a<br>\nprofessor or a professional programmer, are not allowed to apply in order<br>\nto guarantee more space for beginners.</p>\n<p>2) The day of the Olympiad, a thy-file with a theorem followed by sorry<br>\nwill be sent to each one of the email addresses.</p>\n<p>3) People can submit their solutions until 6 hours after their received the<br>\nemail  with the problem (5 hours to solve the problem and 1 hour to make a<br>\nbreak, I guess). Solutions sent after the deadline will be automatically<br>\nignored.</p>\n<p>4) An automatic system (software) will discriminate the invalid solutions,<br>\ne.g., using sorry somewhere, from the valid solutions. After that, it will<br>\nmake an ordering according to the running time of each valid solution.</p>\n<p>5) Finally, an email with the ranking of his/her solution will be<br>\nautomatically sent to each participant. The participants having ranking 1,<br>\n2, 3 will receive a prize.</p>\n<p>When I think about such an international project, I am mainly concerned<br>\nwith people living in economically less developed countries. The idea is<br>\nthat a person from such countries, having the dream of winning an<br>\nInternational Olympiad in Isabelle will have a motivation to improve<br>\nhimself/herself in this field. Of course, classification by countries<br>\nshould be avoided and people from highly developed countries should be<br>\nallowed to participate as well.</p>\n<p>This is just a dream, I have not enough free time to do something about it.<br>\nMy inspiration are the IOI: <a href=\"https://ioinformatics.org/\">https://ioinformatics.org/</a></p>\n<p>Kind Regards,<br>\nJosé M.</p>",
        "id": 294747452,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661194090
    }
]