[
    {
        "content": "<p>From: Jens Doll &lt;<a href=\"mailto:jd@cococo.de\">jd@cococo.de</a>&gt;<br>\nHello all.  </p>\n<p>let me again ask a question about Isabelle proofs in common. Being a formal<br>\nlanguage professional I wonder why these artefacts in your proof libraries<br>\nneed the abstract language level at all. In my opinion most of the proofs<br>\ncould be <strong>specified in context free syntax</strong> with the semantics attached to<br>\nit or having semantics in mind or specified elsewhere. If we had the proofs in<br>\na CH(2) pattern we could build transformers to transfer them to and from other<br>\nformalisms, which in turn would foster exchange with other groups building<br>\nproof libraries worldwide. Am I wrong or is there a reason for maintaining<br>\nsuch a hurdle?  </p>\n<p>Happy reasoning,  <br>\nJens  <br>\n&lt;<a href=\"http://cococo.de\">http://cococo.de</a>&gt;</p>",
        "id": 294226525,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660900254
    },
    {
        "content": "<p>From: Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt;<br>\nAncient LCF tradition already started this \"syntax-less\" attitude: it is <br>\nall just \"semantics\" (in ML) with some notation to produce it, and it is <br>\nextensible in all directions.</p>\n<p>The Isar framework emphasizes this further, allowing the user (or rather <br>\ntool implementor) to invent new languages and embed them into the system. <br>\nEven the core proof language does not have fixed syntax, although there is <br>\na reconstruction of some of it in appendix A of the isar-ref manual. This <br>\nintegration of many languages is actually more close to common practice in <br>\nthe world out there: consider \"HTML5\" and its many sub-languages that are <br>\nnot HTML at all.</p>\n<p>Makarius</p>",
        "id": 294226723,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660900345
    },
    {
        "content": "<p>From: Jens Doll &lt;<a href=\"mailto:jd@cococo.de\">jd@cococo.de</a>&gt;<br>\nDo you have statistical data about language usage in the Isabelle <br>\nlibraries known? A common ground exists at least on the Ch(3) level. My <br>\npersonal experience also tells me that there is a Ch(2) basic language. <br>\nThe idea of flexibility is understandable, but is similar to domain <br>\nspecific languages, which might/should  (deliberately) lead to Babylon <br>\nin commercial application development.<br>\nJens</p>",
        "id": 294226817,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660900387
    }
]