[
    {
        "content": "<p>From: Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt;<br>\nI think this is just a consequence of the normal operation of creating <br>\nPIDE document nodes from buffers, non-buffers, not-yet-buffers, <br>\nno-longer-buffers.  The Isabelle/jEdit manual has this slightly cryptic <br>\nentry in the last chapter, which is related, but does not tell the whole <br>\nstory:</p>\n<p>\\item \\textbf{Problem:} No way to delete document nodes from the overall<br>\n   collection of theories.</p>\n<p>\\textbf{Workaround:} Ignore unused files.  Restart whole<br>\n   Isabelle/jEdit session in worst-case situation.</p>\n<p>These mechanisms date back several years, and I did not have time yet to <br>\nbrush them up.  Anything that touches theory import management usually <br>\ncauses entanglement in the \"4 modes of Isabelle\", as explained earlier on <br>\nthis thread.</p>\n<p>Makarius</p>",
        "id": 294281879,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660920624
    },
    {
        "content": "<p>From: Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt;<br>\nIt is awkward indeed, and these things are a recurrent topic over many <br>\nyears.</p>\n<p>The thread about \"Name clashes in theory names\" from Feb-2014 is related <br>\nto the whole complex.  Shortly afterwards I made again some investigations <br>\nhow this could be sorted out, but got entangled in old things.</p>\n<p>So once again, nothing yet for the coming release.</p>\n<p>Makarius</p>",
        "id": 294281896,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660920630
    },
    {
        "content": "<p>From: Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt;<br>\nThese problems with the flat theory name space and odd rules to locate <br>\ntheory sources files are very old and well-known, but quite annoying <br>\nnonetheless, especially since many other aspects of the system have <br>\nimproved.</p>\n<p>Substantial reforms and simplications (removal of adhoc features) are in <br>\nthe pipeline for many years.  This spring I have revisited that once <br>\nagain, but did not finish for the release -- due to the Isar TTY loop and <br>\nProof General standing in the way.</p>\n<p>It is something to be sorted out eventually, together with the canonical <br>\nquestion about \"remaining uses of Proof General\".</p>\n<p>At VSL/Coq-6 there was an interesting talk about \"Coqoon: towards a modern <br>\nIDE for Coq\" <br>\n<a href=\"http://www.easychair.org/smart-program/VSL2014/Coq-program.html\">http://www.easychair.org/smart-program/VSL2014/Coq-program.html</a> -- he <br>\nreplaced the old-fashioned make-based coqc build process by a canonical <br>\nsolution within Eclipse, and encountered similar problems with multiple <br>\nways to locate files within implicit load paths, asking for just one <br>\nunique way to address theories within \"packages\".</p>\n<p>The quirks and workarounds sounded very familiar to me.</p>\n<p>Makarius</p>",
        "id": 294284704,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660921459
    },
    {
        "content": "<p>From: Christian Sternagel &lt;<a href=\"mailto:c.sternagel@gmail.com\">c.sternagel@gmail.com</a>&gt;<br>\nDear Makarius,</p>\n<p>I sometimes notice that the theory panel on Isabelle/jEdit lists <br>\ntheory-nodes that do not exist (and never did). Finally, I was able to <br>\nconstruct a minimal example (but it often happened to me when editing <br>\nthe headers of real theory files). On my machine (x86_64-linux; Fedora <br>\n20) I can somewhat reliably reconstruct the issue as follows:</p>\n<p>1) From the command line start Isabelle/jEdit with new file, e.g.,</p>\n<p>isabelle jedit Test.thy</p>\n<p>2) In the first line, enter a symbol that will cause an error, e.g., \"+\".</p>\n<p>3) Now after the plus-sign enter the usual</p>\n<p>theory Test<br>\n   imports M<br>\n   begin<br>\n   end</p>\n<p>where the imports consist of the non-existent theory M.</p>\n<p>4) Go to the first line and delete it.</p>\n<p>5) Open the theory panel, which no contains entries for \"Test\" and \"M\". <br>\nNote that I'm unable to reproduce the above, when the theory panel is <br>\nalready open on startup of Isabelle/jEdit.</p>\n<p>While I'm at it, another thing (but I guess this is well-known): In <br>\nIsaFoR we have a session HOL-AFP which builds a heap-image containing <br>\nall AFP entries we rely on. After building this image it is possible to <br>\nopen (with Isabelle/jEdit) a file as follows</p>\n<p>isabelle jedit -d . -l HOL-AFP Some_File.thy</p>\n<p>that contains an import like</p>\n<p>\"$AFP/some_path_that_no_longer_exists/Misc\"</p>\n<p>and there is no error-message (note that theory Misc exists, but at a <br>\ndifferent location). When I try</p>\n<p>isabelle jedit -d . Some_File.thy</p>\n<p>instead and let Isabelle/jEdit figure out the dependencies itself <br>\nwithout any intermediate heap-images, then I obtain the error that the <br>\nabove file does not exist. This asymmetry between using and not using a <br>\nheamp-image seems a bit awkward (although it is not clear to me whether <br>\nit can be avoided in general).</p>\n<p>cheers</p>\n<p>chris</p>",
        "id": 294286566,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660922063
    },
    {
        "content": "<p>From: René Neumann &lt;<a href=\"mailto:rene.neumann@in.tum.de\">rene.neumann@in.tum.de</a>&gt;<br>\nThis also happens quite a lot for our CAVA project and is not related to<br>\njEdit, but (as an educated guess) due to the flat namespace of theories:<br>\nIsabelle first checks whether a theory with the name (NB: not path!) to<br>\nbe imported already exists in the current image, and, if so, omits<br>\nlooking at it.</p>\n<p>I'd be in favor of changing this behavior to at least also check for the<br>\nexistance of the path. Because it happens (for us at least) quite often,<br>\nthat a theory is always loaded with a specific image and therefore an<br>\nerroneous import never gets detected.</p>\n<p>(FWIW: This also produces funny results, if you happen to have a theory<br>\n\"A\" in the image, and try to load another, though different, theory also<br>\nnamed \"A\". It then again omits loading it instead of saying something<br>\nabout a clash of theory names, producing funny results later on when you<br>\nare trying to find out why certain facts seem to be not available...)</p>\n<ul>\n<li>René<br>\n<a href=\"/user_uploads/14278/h3YiwbSflkYJqk__G_0XGES0/smime.p7s\">smime.p7s</a></li>\n</ul>",
        "id": 294286571,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660922066
    }
]