[
    {
        "content": "<p>From: Ekaterina Komendantskaya &lt;<a href=\"mailto:komendantskaya@gmail.com\">komendantskaya@gmail.com</a>&gt;<br>\nWe invite participants to the on-line workshop on</p>\n<ul>\n<li>Trends, Extensions, Applications and Semantics of Logic Programming*</li>\n</ul>\n<p>Logic programming is a framework for expressing programs, propositions and<br>\nrelations as Horn clause theories, and for automatic inference in these<br>\ntheories. Horn clause theories are famous for their well-understood<br>\ndeclarative semantics, in which models of logic programs are given<br>\ninductively or coinductively. At the same time, Horn clauses give rise to<br>\nefficient inference procedures, usually involving resolution. Logic<br>\nprogramming found applications in type inference, verification, and AI.<br>\nWhile logic programming was originally conceived for describing simple<br>\npropositional facts, it was extended to account for much more complex<br>\ntheories. This includes first-order theories, higher-order theories,<br>\ninductive and coinductive data, and stochastic/probabilistic theories.</p>\n<p>The aim of this workshop is to bring together researchers that work on<br>\nextensions of logic programming and inference methods, and to foster an<br>\nexchange of methods and applications that have emerged in different<br>\ncommunities.</p>\n<p>Keynote talk: <em>Dale Miller</em>. Structural Proof-Theory and Logic Programming<br>\n&lt;<a href=\"https://www.coalg.org/tease-lp/2020/dale-miller-structural-proof-theory-and-logic-programming/\">https://www.coalg.org/tease-lp/2020/dale-miller-structural-proof-theory-and-logic-programming/</a>&gt;<br>\nInvited tutorial: <em>Uli Sattler</em>.* Description Logics and Ontology Languages</p>\n<ul>\n<li>an introduction and overview*</li>\n</ul>\n<p>In light of COVID-19, we organise TEASE-LP as a virtual workshop and<br>\nonline-only event. To achieve broad participation, we use three different<br>\nmediums:<br>\nDiscussion Forum, Pre-recorded lightning talks, Live sessions with invited<br>\nand contributed live talks. Further details can be found here:<br>\n<a href=\"https://www.coalg.org/tease-lp/workshop-schedule/\">https://www.coalg.org/tease-lp/workshop-schedule/</a>.</p>\n<p>Registration is free, but we require all participants to register at<br>\n<a href=\"https://teaselp.flarum.cloud/\">https://teaselp.flarum.cloud/</a><br>\nFor any further queries, please contact the organisers:</p>\n<p>Henning Basold &lt;<a href=\"mailto:henning@basold.eu\">henning@basold.eu</a>&gt;<br>\nKatya Komendantskaya &lt;<a href=\"mailto:ek19@hw.ac.uk\">ek19@hw.ac.uk</a>&gt;</p>",
        "id": 294829397,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661245911
    }
]