[
    {
        "content": "<p>From: Holger Gast &lt;<a href=\"mailto:gast@informatik.uni-tuebingen.de\">gast@informatik.uni-tuebingen.de</a>&gt;<br>\nDear Joachim,</p>\n<p>The issue arises from I3P trying to have the messages of previous<br>\ncommands available for the user for inspection. For this to work,<br>\nIsabelle has to print the goal state, which may take some time<br>\n(sometimes &gt; 100ms, or even more for really large goal states).<br>\nI had already noticed this, but it was never severe enough to prompt action.<br>\nSince we agreed that the availability of previous messages is desirable,<br>\nsimply turning off the output is no solution.</p>\n<p>I have therefore added to the I3P framework the notion of<br>\n\"lazy messages\", of which Isabelle only sends a \"proxy\" with an identifier,<br>\nand internally keeps the information for generating the message<br>\non request. (Due to the structure-sharing, purely functional<br>\nrepresentation employed throughout Isabelle, this is not a<br>\nmajor overhead.) When the user points the UI to a lazy message,<br>\nit is requested from Isabelle on the fly.</p>\n<p>With this setup, the perceived processing speed in<br>\nrelease 1.0.8 has increased very much.</p>\n<p>Lazy messages, as implemented, also cover more general scenarios<br>\nthan just the goal output. For instance, I have had good results<br>\nfor bulk trace messages where the proxy contained enough information<br>\nto let the user decided whether the message is relevant at all.<br>\nIf this is interesting to other people, I can provide more details.<br>\nAlso, the LazyMessageHandler in the Isabelle2009Driver<br>\n(in the 1.0.8 source code) explains the essential idea of how to<br>\ngarbage-collect message references across the process boundary<br>\nusing Java's WeakReference/ReferenceQueue mechanisms.</p>\n<p>Thank you very much for pointing this out, and also for the offline<br>\ndiscussion and for testing the changes beforehand. It certainly<br>\nraised very interesting design &amp; programming challenges :)</p>\n<p>Holger</p>",
        "id": 294118870,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660839153
    }
]