[
    {
        "content": "<p>From: Zhong Shao &lt;<a href=\"mailto:shao@cs.yale.edu\">shao@cs.yale.edu</a>&gt;<br>\n[Apology for possible cross-postings!]</p>\n<p>The Department of Computer Science at Yale University is seeking<br>\napplicants for PostDoc and PhD positions in the broad area of<br>\ncertified software. The successful applicants will be expected to<br>\nparticipate in a rigorous research program on topics such as<br>\nprogramming languages, formal semantics, certified operating systems,<br>\nprogram verification, proof assistants and automation, concurrency and<br>\ncoordination, language-based security, and certifying compilers.</p>\n<p>The programming languages and operating systems group, led jointly by<br>\nProfessors Zhong Shao and Bryan Ford at Yale, is embarking on a<br>\nmulti-year effort to develop a new certified OS kernel that<br>\ngeneralizes and unifies traditional OS abstractions in microkernels<br>\nand hypervisors. The new effort advocates a modular certification<br>\nframework for OS kernel components, which mirrors and enhances the<br>\nmodularity of the kernel itself.  Using this framework, it aims to<br>\ncreate not just a \"one-off\" lump of verified kernel code, but a<br>\nstatically and dynamically extensible kernel that can be incrementally<br>\nbuilt and extended with individual certified modules, each of which<br>\nwill provably preserve the kernel's overall safety and security<br>\nproperties.</p>\n<p>Important research questions include but are not limited to: what OS<br>\nkernel structures can offer the best support for extensibility,<br>\nsecurity, and resilience? what program logics and semantic models can<br>\nbest capture these abstractions? what are the right programming<br>\nlanguages and environments for developing such certified kernel?  and<br>\nhow to build new automation facilities to make certified software<br>\nreally scale?</p>\n<p>Successful applicants should have a combination of creativity,<br>\nself-motivation, and strong interests on applying programming language<br>\ntheory or formal methods to solve practical problems. </p>\n<p>Applicants for PostDoc positions must have a Ph.D. in Computer Science<br>\nor a closely related field. The term of a PostDoc position is one year<br>\nwith an option to renew for up to four years. Starting date is<br>\nnegotiable (a preference will be given to those who can start by<br>\nSpring 2011).</p>\n<p>Interested applicants for PostDoc positions should email a CV, research <br>\nstatement, and the names of three references with their email addresses <br>\nand phone numbers to Zhong Shao (Email: zhong.shao at <a href=\"http://yale.edu\">yale.edu</a>).</p>\n<p>PhD positions (with full guaranteed financial support) are also<br>\navailable. Applicants interested in pursuing PhD studies can email<br>\neither PI but should still submit their applications directly to the<br>\nYale Graduate School of Arts and Sciences (the deadline for Fall 2011<br>\nadmission is January 2nd, 2011).</p>\n<p>More information regarding this research effort can be found in a<br>\nwhite paper available at &lt;<a href=\"http://flint.cs.yale.edu/ctos\">http://flint.cs.yale.edu/ctos</a>&gt; or at the two<br>\nPIs' research web sites &lt;<a href=\"http://flint.cs.yale.edu\">http://flint.cs.yale.edu</a>&gt; and<br>\n&lt;<a href=\"http://dedis.cs.yale.edu\">http://dedis.cs.yale.edu</a>&gt;. Inquiries can be directed to any PI.</p>\n<p>Professors Zhong Shao and Bryan Ford<br>\nDepartment of Computer Science<br>\nYale University<br>\nP.O. Box 208285<br>\nNew Haven, CT 06520-8285, USA<br>\nPhone: +1 (203) 432 6828 and +1 (203) 432 1055<br>\nEmail: zhong.shao at <a href=\"http://yale.edu\">yale.edu</a> and <a href=\"http://bryan.ford\">bryan.ford</a> at <a href=\"http://yale.edu\">yale.edu</a></p>",
        "id": 294119397,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660839328
    }
]