[
    {
        "content": "<p>From: Christoph LANGE &lt;<a href=\"mailto:math.semantic.web@gmail.com\">math.semantic.web@gmail.com</a>&gt;<br>\nDear Isabelle community,</p>\n<p>I frequently need to include Isabelle source code listings in my LaTeX<br>\ndocuments.  However I have not yet figured out how to make Isabelle's<br>\ndocument preparation machinery export LaTeX snippets.  I know it's<br>\npossible, but I haven't had the time.  Moreover I often need to deviate<br>\nfrom my verbatim formalisation for didactic purposes.</p>\n<p>I'm sure this has been done before, and I'm sure one could realise a<br>\nmore advanced solution by reusing parts of the *.sty files that come<br>\nwith Isabelle, but anyway I quickly hacked this LaTeX package together<br>\nfrom scratch, which does part of the job:</p>\n<p><a href=\"https://github.com/clange/latex/blob/master/pmisabelle.sty\">https://github.com/clange/latex/blob/master/pmisabelle.sty</a></p>\n<p>If you check out <a href=\"https://github.com/clange/latex\">https://github.com/clange/latex</a> you may find a few more<br>\nuseful LaTeX packages.  In<br>\n<a href=\"https://github.com/clange/latex/blob/master/lstsemantic.sty#L20\">https://github.com/clange/latex/blob/master/lstsemantic.sty#L20</a> you will<br>\nsee that I have also tried this with the \"listings\" package, but gave up<br>\nquite soon, because the result didn't look nice.</p>\n<p>Cheers,</p>\n<p>Christoph</p>",
        "id": 294250853,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660910667
    },
    {
        "content": "<p>From: Lawrence Paulson &lt;<a href=\"mailto:lp15@cam.ac.uk\">lp15@cam.ac.uk</a>&gt;<br>\nI continue to struggle with this machinery myself.</p>\n<p>Some people use this system to write entire papers based upon their theory development. But this isn't very practical if your development takes 40 minutes to run, as in a recent one I completed. Instead I use the document preparation system to convert the theory files into .tex files, which I then insert into my document within the brackets \\begin{isabelle} … \\end{isabelle} or simply \\isa{…}.</p>\n<p>I pre-process these files using a shell script (attached) in order to replace some of the numerous macros by the character equivalents, in order to make them more compact unreadable.</p>\n<p>Larry Paulson<br>\n<a href=\"/user_uploads/14278/gowq8AhXUileuy_fcTC5A7ZH/cleanTeX.pl\">cleanTeX.pl</a></p>",
        "id": 294253104,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660911543
    },
    {
        "content": "<p>From: Tobias Nipkow &lt;<a href=\"mailto:nipkow@in.tum.de\">nipkow@in.tum.de</a>&gt;<br>\nAre saying you need to run the whole development every time you latex your<br>\npaper? This is only the case if you want to include literally (some of) the text<br>\nof your theories. Which doesn't work very well anyway because you have to stick<br>\nto the order in which the material is presented in the theories.</p>\n<p>The normal way to write a paper with Isabelle is to build on an image that<br>\ncontains all the theories, start from that image and use antiquotation to<br>\ndisplay material.</p>\n<p>If for formatting reasons you absolutely need some fragment of the source text,<br>\nthe LaTeX sugar document contains a section Theory Snippets describing how to do<br>\nthat in a selective manner.</p>\n<p>Tobias</p>",
        "id": 294253186,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660911575
    },
    {
        "content": "<p>From: Christoph LANGE &lt;<a href=\"mailto:math.semantic.web@gmail.com\">math.semantic.web@gmail.com</a>&gt;<br>\nThanks, Larry and Tobias, for sharing your experience on including<br>\nIsabelle sources in LaTeX.  I see that one has more flexibility in using<br>\nthe document preparation system than I had thought.</p>\n<p>Nevertheless I wonder whether is also offers an easy solution for the<br>\nproblem that I tried to solve with my pmisabelle.sty, i.e. a solution<br>\nthat addresses the following requirements:</p>\n<p>My papers consist of a lot of LaTeX and a few short Isabelle listings;<br>\ntherefore:</p>\n<ol>\n<li>I'd like to write them in my favourite LaTeX editor.</li>\n<li>\n<p>They sometimes deviate from my actual formalisation for readability<br>\nor didactic purposes.</p>\n</li>\n<li>\n<p>It is not absolutely essential that these listings are syntactically<br>\nand semantically correct.  \"Correct to the eye of a proof-reader\" is<br>\ngood enough; \"correct to Isabelle's verification engine\" is nice to have<br>\nbut not essential.</p>\n</li>\n<li>\n<p>Exporting LaTeX snippets from my actual Isabelle sources is merely<br>\nnice to have.  I wouldn't mind copy/pasting snippets from my *.thy files<br>\ninto the LaTeX editor and applying minor adaptations manually or via a<br>\nscript to make them render as nice LaTeX.</p>\n</li>\n<li>\n<p>I don't want to invest a lot into the formalisation (such as<br>\ninserting special markup) to make it \"exportable\".</p>\n</li>\n</ol>\n<p>pmisabelle.sty satisfies these requirements, except that the adaptations<br>\nrequired in step (4) are a bit more than minor, which is mainly because<br>\nI am not experienced with modifying the behaviour of the LaTeX parser<br>\n(catcodes etc.).  My approach to use a math align environment requires<br>\nme, e.g., to manually escape underscores in identifiers and to make sure<br>\nI insert the right amount of &amp; and \\\\.  The alternative approach to use<br>\nlistings.sty would require me to explicitly wrap terms into $…$, to<br>\nmanually pretty-print \"…\" into ``…'', plus possibly some more work to<br>\nget the spacing as right as you could do it in math mode, and it would<br>\nnot accept Unicode input, which LaTeX allows<br>\n(<a href=\"http://tex.stackexchange.com/questions/110042/entering-unicode-math-symbols-into-latex-direct-from-keyboard-on-a-mac\">http://tex.stackexchange.com/questions/110042/entering-unicode-math-symbols-into-latex-direct-from-keyboard-on-a-mac</a><br>\n– actually written by Isabelle user John Wickerson :-))</p>\n<p>What would you suggest?</p>\n<p>Christoph</p>",
        "id": 294253236,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660911600
    },
    {
        "content": "<p>From: Lawrence Paulson &lt;<a href=\"mailto:lp15@cam.ac.uk\">lp15@cam.ac.uk</a>&gt;<br>\nThe way I do markup is undoubtedly viewed by some as an abuse of the document preparation system, but I have exactly the same goals as you list below. An example of a paper written in that style can be found here, starting on page 5:</p>\n<p><a href=\"http://www.cl.cam.ac.uk/~lp15/Pages/Gödel-ar.pdf\">http://www.cl.cam.ac.uk/~lp15/Pages/Gödel-ar.pdf</a></p>\n<p>I didn't understandThe following paragraph, were you wrote about modifying the behaviour of the LaTeX parser. I never do that. Equally there's no need to manually escape anything. The main trick is to let the document preparation system translate your theory files into LaTeX. This is not something you are supposed to do, so the way of doing it seems to change every year or two.</p>\n<p>Larry Paulson</p>",
        "id": 294253393,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660911649
    }
]