[
    {
        "content": "<p>From: Josef Urban &lt;<a href=\"mailto:josef.urban@gmail.com\">josef.urban@gmail.com</a>&gt;<br>\nCall for Papers, PxTP 2013</p>\n<p>The Third International Workshop on<br>\n            Proof Exchange for Theorem Proving (PxTP)<br>\n            (and Cooperation between Theorem Provers)<br>\n<a href=\"http://www.cs.ru.nl/pxtp13/\">http://www.cs.ru.nl/pxtp13/</a></p>\n<p>June 10, 2013, Lake Placid, USA</p>\n<p>associated with</p>\n<p>The Conference on Automated Deduction (CADE), 2013.</p>\n<hr>\n<p>Invited Speaker</p>\n<p>Thomas C. Hales, University of Pittsburgh</p>\n<hr>\n<p>Scope</p>\n<p>The PxTP workshop welcomes contributions on various aspects of<br>\ncommunication, integration, and cooperation between reasoning systems<br>\nand formalisms.</p>\n<p>The past decades have seen impressive advances in computer-aided<br>\nreasoning, both in automated and interactive theorem proving. As shown<br>\nby various system competitions, such as CASC, SMT-COMP, and the SAT<br>\ncompetition, deduction tools are able to tackle larger problems<br>\nprogressively faster and are increasingly more applicable to a wider<br>\nrange of problems. In recent years, integration of such automated<br>\ntools in larger verification environments has demonstrated the<br>\npotential to reduce the amount of manual verification work.</p>\n<p>It is becoming clear that the success of deduction tools will not only<br>\ndepend on their power to solve large and difficult problems in an<br>\nisolated manner, but it will also rely on their ability to cooperate,<br>\nby exchanging problems, proofs, and models. The PxTP workshop aims at<br>\nencouraging such cooperation by inviting contributions on various<br>\naspects of communication, integration, and cooperation between systems<br>\nand formalisms. The workshop's mission is to facilitate building of<br>\ncomplex reasoning applications and reuse of reasoning tools by<br>\ndeveloping and discussing suitable integration, translation and<br>\ncommunication methods, standards, protocols, and application<br>\nprogramming interfaces (APIs).  We are interested both in success<br>\nstories and in descriptions of the current bottlenecks and proposals<br>\nfor improvement.</p>\n<hr>\n<p>Topics of interest for this workshop include all aspects of<br>\ncooperation between reasoning tools, whether automatic or interactive.<br>\nMore specifically, some suggested topics are</p>\n<p>-- applications that integrate reasoning tools<br>\n   (ideally with certification of the result);</p>\n<p>-- translations between logics, proof systems, models;</p>\n<p>-- distribution of proof obligations among heterogeneous reasoning<br>\n   tools;</p>\n<p>-- algorithms and tools for checking and importing (replaying,<br>\n   reconstructing) proofs;</p>\n<p>-- proposed formats for expressing problems and solutions for<br>\n   different classes of logic solvers (SAT, SMT, QBF, first-order<br>\n   logic, higher-order logic, typed logic, rewriting, etc.);</p>\n<p>-- meta-languages, logical frameworks, communication methods,<br>\n   standards, protocols, and APIs connected to problems, proofs, and<br>\n   models;</p>\n<p>-- comparison, refactoring, and optimization of proofs;</p>\n<p>-- practical experiences, case studies, feasibility studies;</p>\n<p>-- applications relying on importing proofs from automatic theorem<br>\n   provers, such as certified static analysis, proof-carrying code, or<br>\n   certified compilation;</p>\n<p>-- data structures and algorithms for improved proof production in<br>\n   solvers (e.g., efficient proof representations).</p>\n<hr>\n<p>Submissions</p>\n<p>Researchers interested in participating are invited to submit either<br>\nan extended abstract (up to 8 pages) or a regular paper (up to 15<br>\npages) via EasyChair.</p>\n<p>Submissions will be refereed by the program committee, which will<br>\nselect a balanced program of high-quality contributions.  Short<br>\nsubmissions that could stimulate fruitful discussion at the workshop<br>\nare particularly welcome.</p>\n<p>Submissions should be in PDF. Final versions should be prepared in<br>\nLaTeX using the \"easychair.cls\" class file, available at<br>\n<a href=\"http://www.easychair.org/publications/\">http://www.easychair.org/publications/</a>.</p>\n<p>To submit a paper, go to the EasyChair PxTP page<br>\n<a href=\"http://www.easychair.org/conferences/?conf=pxtp2013\">http://www.easychair.org/conferences/?conf=pxtp2013</a><br>\nand follow the instructions there.</p>\n<p>PxTP proceedings will be published electronically in the EasyChair<br>\nProceedings in Computing (EPiC) series or in the CEUR workshop<br>\nproceedings.</p>\n<hr>\n<p>Important dates</p>\n<p>Submission of papers: 11 April 2013<br>\nNotification: 2 May 2013<br>\nCamera-ready versions due: 9 May 2013<br>\nWorkshop: 10 June 2013</p>\n<hr>\n<p>Program Committee</p>\n<p>Jasmin Christian Blanchette (co-chair), TU Muenchen, Germany<br>\nChad Brown, Saarland University, Germany<br>\nDavid Delahaye, CEDRIC/CNAM, Paris, France<br>\nEwen Denney, SGT/NASA Ames, USA<br>\nPeter Dybjer, Chalmers University, Sweden<br>\nPascal Fontaine, Loria, INRIA, University of Nancy, France<br>\nWarren Hunt, University of Texas, USA<br>\nChantal Keller, Laboratoire d'Informatique de Polytechnique, France<br>\nKonstantin Korovin, Manchester University, UK<br>\nMagnus O. Myreen, University of Cambridge, UK<br>\nJens Otten, University of Potsdam, Germany<br>\nAndrei Paskevich, Universite Paris-Sud 11, IUT d'Orsay, France<br>\nLawrence C. Paulson, University of Cambridge, UK<br>\nDavid Pichardie, INRIA Rennes - Bretagne Atlantique, France<br>\nFlorian Rabe, Jacobs University Bremen, Germany<br>\nStephan Schulz, TU Muenchen, Germany<br>\nAaron Stump, CS Department, The University of Iowa, USA<br>\nGeoff Sutcliffe, University of Miami, USA<br>\nLaurent Thery, INRIA, France<br>\nJosef Urban (co-chair), Radboud Universiteit Nijmegen, Netherlands<br>\nTjark Weber, Uppsala University, Sweden</p>\n<hr>",
        "id": 294230146,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660902057
    }
]