[
    {
        "content": "<p>From: Panagiotis Manolios &lt;<a href=\"mailto:manolios@cc.gatech.edu\">manolios@cc.gatech.edu</a>&gt;<br>\nACL2 2006<br>\nInternational Workshop on the ACL2 Theorem Prover and its Applications<br>\n<a href=\"http://www.cc.gatech.edu/~manolios/acl206\">http://www.cc.gatech.edu/~manolios/acl206</a></p>\n<p>FINAL CALL FOR PAPERS</p>\n<p>August 15-16, 2006 in Seattle, Washington<br>\n       Part of FLoC 2006 (<a href=\"http://research.microsoft.com/floc06/\">http://research.microsoft.com/floc06/</a>)<br>\n           Hosted by CAV 2006 and IJCAR 2006</p>\n<p>IMPORTANT DATES<br>\n========================================================================<br>\nAbstract Submission Deadline    April 14, 2006, 11:59 PM NY time<br>\nPaper Submission Deadline   April 19, 2006, 11:59 PM NY time<br>\nAcceptance notification:        June 9, 2006<br>\nFinal version due:      July 24, 2006</p>\n<p>SCOPE OF CONFERENCE<br>\n========================================================================<br>\nACL2 2006 is the major technical forum for users of the ACL2 theorem<br>\nproving system and is the sixth in a series of workshops that occur<br>\nevery 18 months. ACL2 is an industrial-strength automated reasoning<br>\nsystem that is part of the Boyer-Moore family of theorem provers, winner<br>\nof the 2005 ACM Software System Award.  ACL2 2006 is hosted by the CAV<br>\nand IJCAR conferences, which are part of FLoC 2006, the Federated Logic<br>\nConference.  In addition, and as reflected by our program committee, we<br>\nencourage participation from users of other theorem provers and persons<br>\ninterested in the application of theorem proving technology.  We invite<br>\npapers on any ACL2-related topic, including but not limited to:</p>\n<ul>\n<li>\n<p>applications of the theorem prover,</p>\n</li>\n<li>\n<p>proposals for ACL2 theorem prover improvements, especially as<br>\n  illustrated in experimental extensions or other systems,</p>\n</li>\n<li>\n<p>comparisons with other theorem provers, programming languages, or<br>\n  specification languages,</p>\n</li>\n<li>\n<p>solved (and unsolved!) challenge problems, and</p>\n</li>\n<li>\n<p>implementations connecting ACL2 with other systems.</p>\n</li>\n</ul>\n<p>PAPER SUBMISSIONS<br>\n========================================================================<br>\nSubmissions must be made electronically in PDF format, following the<br>\ninstructions on the ACL2 2006 Web site.  Submissions must use the ACM<br>\nSIG Proceedings format with letter-size paper (see<br>\n<a href=\"http://www.acm.org/sigs/pubs/proceed/template.html\">http://www.acm.org/sigs/pubs/proceed/template.html</a>).</p>\n<p>Two categories of papers will be accepted: long (at most 10 pages) and<br>\nshort (at most 4 pages). Note that the current paper format is much more<br>\ncompact than the LNCS format we used in the past! Authors can assume<br>\nthat the workshop audience has a working knowledge of ACL2's syntax,<br>\nbasic commands, and modeling techniques.  Papers should contain a short<br>\nabstract of approximately 150 words clearly stating the contribution of<br>\nthe submission.  Authors of accepted papers are required to give a<br>\npresentation at the workshop.  Papers should be self-contained, but, as<br>\nhas been the case traditionally (and where applicable), we strongly<br>\nencourage authors to provide ACL2 \"books\" or script files that provide<br>\nfull details, along with instructions for how to process these books<br>\nwith ACL2.  The submission guidelines for supporting materials, which we<br>\nstrongly recommend you adhere to can be found at <br>\n<a href=\"http://www.cs.utexas.edu/users/moore/acl2/v2-9/new/books/\">http://www.cs.utexas.edu/users/moore/acl2/v2-9/new/books/</a>.  For<br>\naccepted papers, these books will be mirrored on the ACL2 home page and<br>\nincluded in future ACL2 distributions. We expect to provide workshop<br>\nproceedings and to include these proceedings in the ACM digital library.</p>\n<p>ORGANIZATION<br>\n========================================================================<br>\nChairsChairs:   Panagiotis Manolios, Georgia Institute of Technology<br>\n                Matthew Wilding, Rockwell Collins Inc.<br>\nPublications:   Ruben Gamboa, University of Wyoming<br>\nWebmasters:     Sudarshan Srinivasan, Georgia Tech<br>\n                Daron Vroon, Georgia Tech</p>\n<p>PROGRAM COMMITTEE<br>\n========================================================================<br>\nRuben Gamboa, University of Wyoming, USA<br>\nDavid Greve, Rockwell Collins Inc., USA<br>\nWarren Hunt, University of Texas at Austin, USA <br>\nDeepak Kapur, University of New Mexico, USA <br>\nMatt Kaufmann, University of Texas at Austin, USA <br>\nBill Legato, NSA, USA<br>\nPanagiotis Manolios, Georgia Institute of Technology, USA      <br>\nJose Meseguer, University of Illinois at Urbana-Champaign, USA <br>\nPaul Miner, NASA Langley Research Center, USA<br>\nJ Strother Moore, University of Texas at Austin, USA <br>\nLawrence C. Paulson, University of Cambridge, UK<br>\nJose Luis Ruiz-Reina, University of Seville, Spain<br>\nDavid M. Russinoff, Advanced Micro Devices, Inc., USA<br>\nJun Sawada, IBM Austin Research Laboratory, USA<br>\nMary Sheeran,  Chalmers University of Technology, Sweden <br>\nKonrad Slind,  University of Utah, USA<br>\nMatthew Wilding, Rockwell Collins Inc., USA<br>\n<a href=\"/user_uploads/14278/8R9M9pZHs2DdXNy73YckubJj/ACL2-2006-Final-Call-For-Papers.pdf\">ACL2-2006-Final-Call-For-Papers.pdf</a></p>",
        "id": 293905234,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660745758
    }
]