[
    {
        "content": "<p>From: David Cock &lt;<a href=\"mailto:davec@cse.unsw.edu.au\">davec@cse.unsw.edu.au</a>&gt;<br>\nAfter a recent gnome upgrade, jedit suddenly stopped working for me: all<br>\nmouse clicks seemed to be offset by some amount, making menus unusable.<br>\n  A little googling established that this is a bug in the JVM, which<br>\napparently contains a hardcoded list of window managers that don't add<br>\nwindow decorations, so that the swing/AWT can <code>work around' them (I've\ngot no idea why it feels it needs to, but it does).  The trigger (for\nme) was that the name of the gnome window manager changed (from Mutter\nto Gnome Shell), and thus no longer triggered the hack.  The solution\nwas to install the </code>wmname' utility, which lets you change the name that<br>\nthe WM reports to clients - I set it back to Mutter, and everything<br>\nworked again.</p>\n<p>I'm sending this around, as I'm guessing that others will probably run<br>\nacross this behaviour at some point, and the solution might also make<br>\njedit usable on other tiling WMs (xmonad, ratpoison, etc.).  The<br>\nlong-term solution, of course, is a non-hacky JVM, but I'm not holding<br>\nmy breath.</p>\n<p>Dave</p>\n<hr>\n<p>The information in this e-mail may be confidential and subject to legal <br>\nprofessional privilege and/or copyright. National ICT Australia Limited <br>\naccepts no liability for any damage caused by this email or its attachments.</p>",
        "id": 294260717,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660914275
    },
    {
        "content": "<p>From: Christian Sternagel &lt;<a href=\"mailto:c.sternagel@gmail.com\">c.sternagel@gmail.com</a>&gt;<br>\nDear Dave,</p>\n<p>thanks for pointing to \"wmname\". I was just about to bring up this <br>\nissue, again, on the users lists, since it (i.e., pointer offset) <br>\nhappens to me on Fedora 20 whenever I use Isabelle/jEdit in \"full-screen <br>\nmode\". (Here I do not only mean full-screen as with F11, but also the <br>\nvariant that is triggered, in Gnome, by double clicking the title-bar of <br>\na window.)</p>\n<p>Now I used</p>\n<p>$ wname Mutter</p>\n<p>and there is no more offset. Thanks!</p>\n<p>cheers</p>\n<p>chris</p>",
        "id": 294260763,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660914290
    }
]