[
    {
        "content": "<p>From: Andrei Borac &lt;<a href=\"mailto:zerosum42@gmail.com\">zerosum42@gmail.com</a>&gt;<br>\nFirst off, sorry for not posting the actual real problem at hand, but<br>\nthere quite a number of definitions that would have to be brought in.</p>\n<p>I have a subgoal that can be solved by \"force\" if I first specify a<br>\nuniversal instantiation (UI) of an expression with three variables:</p>\n<p>apply(erule_tac x=\"...\" in meta_allE)<br>\napply(erule_tac x=\"...\" in meta_allE)<br>\napply(erule_tac x=\"...\" in meta_allE)<br>\napply(force)</p>\n<p>\"force\" has been able to do universal instantiation in the past ...<br>\nhowever, this time:<br>\n(1) there is a lot of stuff in the assumptions block<br>\n(2) some amount of simplification is required after UI including<br>\nfollowing the appropriate branch of nested case expressions</p>\n<p>Is there a way to get force to try harder, or use some other kind of<br>\nautomated method? Note that I have tried ATPs but it seems as they<br>\nhave difficulty doing the simplifications required after UI (just a<br>\nguess, I don't actually know how these tools work). To split the<br>\ncase/options before instantiation cannot be done by simp split and<br>\nwould have to be done semi-manually (to split into multiple<br>\nuniversally quantified expressions) which I might try but looks<br>\ntedious at best and might not even help.</p>\n<p>Any ideas?<br>\n-Andrei</p>",
        "id": 294107137,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660835588
    },
    {
        "content": "<p>From: Lawrence Paulson &lt;<a href=\"mailto:lp15@cam.ac.uk\">lp15@cam.ac.uk</a>&gt;<br>\nLooking at the code, I see that force has no search depth, but performs a best-first search. You haven't stated whether it gives up or runs forever, but I would expect the latter. If you can make it work by instantiating a couple of quantifiers, that's probably the simplest thing to do. Tuning a reasoning tactic to your specific requirements would probably take quite a long time.</p>\n<p>Larry Paulson</p>",
        "id": 294107200,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660835613
    },
    {
        "content": "<p>From: Andrei Borac &lt;<a href=\"mailto:zerosum42@gmail.com\">zerosum42@gmail.com</a>&gt;<br>\nWell, if it is doing a best-first search, which I take to be<br>\nexhaustive, it does not seem as if the search is over all possible<br>\nUIs. Applying force to the unrefined subgoal gives up (rather quickly)<br>\n... manually instantiating the quantifiers is not really an option, as<br>\nthere are 269 subgoals ... I got here because I assumed that force can<br>\nfind the instantiation that works (and it has been able to do similar<br>\nproofs, this one just has slightly more complex stuff under the<br>\nquantifier).</p>\n<p>Additionally, I found that simp is sufficient to solve the subgoal<br>\nafter manual instantiation:</p>\n<p>apply(erule_tac x=\"...\" in meta_allE)<br>\napply(erule_tac x=\"...\" in meta_allE)<br>\napply(erule_tac x=\"...\" in meta_allE)<br>\napply(simp)</p>\n<p>So, my speculation at this point is that force does not blindly try<br>\nUIs, but looks for some correlation between the stuff in the UI and<br>\nthe other facts in the assumption block. What I am thinking is the<br>\nbest option at this point is to write some kind of control program<br>\nthat will interact with Isabelle, first inserting the thy file up the<br>\ncurrent point and then try all possible (type-sane) instantiations<br>\nfollowed by force until one succeeds ... after a long time, I will<br>\nhave a long script that can be cut &amp; paste into the thy file ...<br>\nperhaps it would even be possible to run regular expressions on the<br>\nassumption facts to make good guesses at the required UI.</p>\n<p>At this point, it would sorta help me out if I knew the incantation to<br>\nturn on \"quick and dirty mode\" in the Isabelle shell.</p>\n<p>Or perhaps someone can give me few pointers to places in Isabelle's<br>\nsource or code samples that are relevant to writing such a trial and<br>\nerror tactic in ML?</p>\n<p>-Andrei</p>",
        "id": 294109145,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660836214
    },
    {
        "content": "<p>From: Jeremy Dawson &lt;<a href=\"mailto:jeremy@rsise.anu.edu.au\">jeremy@rsise.anu.edu.au</a>&gt;<br>\nAndrei Borac wrote:<br>\nIt all rather depends on the nature of your problem, but I find that you <br>\ncan often pick out the easy subgoals in a way which will give you the <br>\nright instantiations.</p>\n<p>Things like this</p>\n<p>(TRYALL (ares_tac [refl])), (TRYALL (eresolve_tac wf_cc_Ds)),</p>\n<p>tend to be sprinkled throughout my proofs, and I don't have to do much <br>\ninstantiating by \"hand\", or, for that matter, waiting for Force_tac to <br>\nfinish.</p>\n<p>So far as I know these tactics have no equivalent in Isar.  Opinions <br>\nseem to vary as to whether that is a reason for not using them</p>\n<p>Regards</p>\n<p>Jeremy</p>",
        "id": 294109734,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660836398
    },
    {
        "content": "<p>From: Lawrence Paulson &lt;<a href=\"mailto:lp15@cam.ac.uk\">lp15@cam.ac.uk</a>&gt;<br>\nI assume that by UI you mean universal instantiation. Isabelle instantiates quantifiers solely by unification. It could be interesting to investigate whether some proofs would benefit from automated explicit substitution of candidate terms.</p>\n<p>As Jeremy mentioned, at the ML level Isabelle provides a flexible tactic language in which you can express various search strategies that may be able to automate your proofs, and there are ways of inserting ML tactics into Isar proofs or encapsulating them as Isar methods.</p>\n<p>Larry Paulson</p>",
        "id": 294109894,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660836466
    }
]