[
    {
        "content": "<p>From: Gerwin Klein &lt;<a href=\"mailto:Gerwin.Klein@nicta.com.au\">Gerwin.Klein@nicta.com.au</a>&gt;<br>\nCall for Papers</p>\n<p>ITP 2014<br>\n      5th International Conference on Interactive Theorem Proving<br>\n                 14th-17th July 2014 in Vienna, Austria<br>\n<a href=\"http://www.cs.uwyo.edu/~ruben/itp-2014\">http://www.cs.uwyo.edu/~ruben/itp-2014</a></p>\n<p>IMPORTANT DATES</p>\n<p>Abstract submission:   24th January 2014<br>\nPaper submission:      31st January 2014<br>\nAuthor notification:   21st March 2014<br>\nCamera-ready:          18th April 2014<br>\nConference:            14th-17th July 2014</p>\n<p>CONFERENCE BACKGROUND</p>\n<p>ITP is the premier international conference for researchers from all areas of<br>\ninteractive theorem proving and its applications. It represents the natural<br>\nevolution of the TPHOLs conference series to include research related to all<br>\nother interactive theorem provers. TPHOLs meetings took place every year from<br>\n1988 until 2009. In 2010, the first ITP conference was held in Edinburgh,<br>\nScotland, as part of the Federated Logic Conference (FLoC). Subsequent ITP<br>\nconferences were held in Nijmegen, The Netherlands, in 2011, Princeton, New<br>\nJersey, USA, in 2012, and Rennes, France in 2013. ITP 2014 will again be a<br>\npart of FLoC, in Vienna, Austria.</p>\n<p>PAPER SUBMISSIONS</p>\n<p>ITP welcomes submissions describing original research on all aspects of<br>\ninteractive theorem proving and its applications. In particular, the ITP<br>\ncommunity is open to users of all interactive theorem provers. Suggested<br>\ntopics include but are not limited to the following:</p>\n<p>-&gt; formal aspects of hardware and software,<br>\n -&gt; formalizations of mathematics,<br>\n -&gt; improvements in theorem prover technology,<br>\n -&gt; user interfaces for interactive theorem provers,<br>\n -&gt; formalizations of computational models,<br>\n -&gt; use of theorem provers in education,<br>\n -&gt; industrial applications of interactive theorem provers, and<br>\n -&gt; concise and elegant worked examples of formalizations (\"Proof Pearls\").</p>\n<p>Submissions must be made electronically in PDF format. Submissions should be<br>\nprepared using the Springer LNCS format, available from<br>\n<a href=\"http://www.springer.com/computer/lncs/lncs+authors\">http://www.springer.com/computer/lncs/lncs+authors</a>, and submitted via<br>\nEasyChair. Submissions must describe original unpublished work not submitted<br>\nfor publication elsewhere, presented in a way that is accessible to users of<br>\nother systems. The proceedings will be published as a volume in the Springer<br>\nLecture Notes in Computer Science series and will be available to participants<br>\nat the conference.</p>\n<p>ITP accepts both long papers (up to 16 pages) and \"rough diamonds\" (up to six<br>\npages, possibly in the form of an extended abstract). Both categories of<br>\npapers will be fully refereed and included in the published proceedings.<br>\nPapers in the \"rough diamonds\" category are expected to present innovative and<br>\npromising ideas that have not yet had the time to mature. Regular papers are<br>\nexpected to present mature research projects with appropriate supporting<br>\nevidence.</p>\n<p>All papers should have an abstract of approximately 100 words. Note that<br>\nabstracts must be submitted a week prior to the paper submission deadline.<br>\nPapers should also include a list of relevant keywords, which must include the<br>\nname of the theorem prover featured in the paper. We strongly encourage<br>\nsubmissions that describe interactions with or improvements of a theorem<br>\nprover. Authors of such papers should provide verifiable evidence of an<br>\nimplementation, such as appropriate source files. This material may be<br>\nuploaded via EasyChair or may be placed online, as long as a URL is included<br>\nwith the submission.</p>\n<p>Authors of accepted papers are expected to present their papers at the<br>\nconference, and will be required to sign copyright release forms. All<br>\nsubmissions must be written in English.</p>\n<p>ORGANIZATION</p>\n<p>Program Chairs<br>\nGerwin Klein, NICTA and The University of New South Wales, Australia<br>\nRuben Gamboa, University of Wyoming, USA</p>\n<p>Workshop Chair<br>\nDavid Pichardie, INRIA, France</p>\n<p>Program Committee<br>\nJeremy Avigad, Carnegie Mellon University<br>\nLennart Beringer, Princeton University<br>\nYves Bertot, INRIA<br>\nThierry Coquand, Chalmers University<br>\nAmy Felty, University of Ottawa<br>\nRuben Gamboa, University of Wyoming<br>\nGeorges Gonthier, Microsoft Research<br>\nElsa Gunter, University of Illinois at Urbana-Champaign<br>\nJohn Harrison, Intel Corporation<br>\nMatt Kaufmann, University of Texas at Austin<br>\nGerwin Klein, NICTA and UNSW<br>\nAlexander Krauss, Technische Universität München<br>\nRamana Kumar, University of Cambridge<br>\nJoe Leslie-Hurd, Intel Corporation<br>\nAssia Mahboubi, INRIA - École polytechnique<br>\nPanagiotis Manolios, Northeastern University<br>\nMagnus O. Myreen, University of Cambridge<br>\nTobias Nipkow, TU München<br>\nMichael Norrish, NICTA<br>\nSam Owre, SRI International<br>\nChristine Paulin-Mohring, Université Paris-Sud<br>\nLawrence Paulson, University of Cambridge<br>\nDavid Pichardie, INRIA Rennes - Bretagne Atlantique<br>\nLee Pike, Galois, Inc.<br>\nJose-Luis Ruiz-Reina, University of Seville<br>\nJulien Schmaltz, Open University of the Netherlands<br>\nBas Spitters, Radboud University Nijmegen<br>\nSofiene Tahar, Concordia University<br>\nRené Thiemann, University of Innsbruck<br>\nLaurent Théry, INRIA<br>\nChristian Urban, King's College London<br>\nTjark Weber, Uppsala University<br>\nMakarius Wenzel, Université Paris-Sud 11</p>\n<hr>\n<p>The information in this e-mail may be confidential and subject to legal professional privilege and/or copyright. National ICT Australia Limited accepts no liability for any damage caused by this email or its attachments.</p>",
        "id": 294260767,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660914293
    }
]