[
    {
        "content": "<p>From: José Manuel Rodriguez Caballero &lt;<a href=\"mailto:josephcmac@gmail.com\">josephcmac@gmail.com</a>&gt;<br>\nIf I am wrong in the following lines, please feel free to correct me, I am<br>\nfar from being an expert in proof assistants (such a correction may help<br>\nother beginners having the same wrong ideas). My two arguments for the<br>\n\"sorry\" approach in actual research in mathematics are the following, which<br>\nseem to apply to both the human brains and the computers:</p>\n<p>Argument 1 (The Tower of Babel): A library in which the types corresponding<br>\nto the statements of the theorems and their corollaries are assumed to be<br>\ninhabited rather than to be proved to be inhabited is more efficient from a<br>\ncomputational point of view, e.g., sledgehammer should work faster than in<br>\nthe traditional approach because the search space is smaller. So, even if<br>\nwe know the proof of a theorem, we may omit such a proof in order to<br>\nimprove the computational efficiency of the proof assistant by eliminating<br>\nunnecessary lemmas.</p>\n<p>Argument 2 (The Tortoise and the Hare): Informal mathematics develops<br>\nfaster than formal mathematics for the same obvious reasons that it falls<br>\napart easier. So, to do research in contemporary mathematics,<br>\nnon-controversial theorems should be assumed to be true in a proof<br>\nassistant, as most mathematicians do in their brain. Few creative<br>\ncontemporary mathematicians really know all the proofs of the theorems that<br>\nthey used in their research, because mathematics developed in an<br>\nexponential way.</p>\n<p>Angeliki's above-mentioned observation applies to Argument 2. Nevertheless,<br>\nusing the \"sorry\" approach, the discussion will be no longer about validity<br>\nof logical reasoning, but about the translations from ZFC to simple type<br>\ntheory. This last subject does not belong to the foundations of the<br>\nparticular branch of mathematics where we are proving the theorem, e.g.,<br>\nmodular forms, but to type theory and formal logic. Furthermore, it is<br>\neasier to do experiments changing the statements in Isabelle than in a<br>\npaper, because the paper does not change color after a mistake is found.</p>\n<p>A proof assistant, with a library of types corresponding to contemporary<br>\ntheorems written in Isabelle assumed to be inhabited by \"sorrry\" will be a<br>\nuseful tool to do informal mathematics and such a practical solution should<br>\nnot be confused with the systematic project of formally verifying all<br>\nmathematics. I do not say that to implement such a library of statements<br>\nwithout proofs is easy, but it is the only way to reach the hare.</p>\n<p>Kind Regards,<br>\nJose M.</p>",
        "id": 294743757,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661192599
    },
    {
        "content": "<p>From: Freek Wiedijk &lt;<a href=\"mailto:freek@cs.ru.nl\">freek@cs.ru.nl</a>&gt;<br>\nDear José,</p>\n<p>Isn't the \"formal math through sorry\" thing you're<br>\nproposing very close to what will be given by Tom Hales'<br>\nformal abstracts project?  So isn't this happening already<br>\nin some small way?</p>\n<p>Freek</p>",
        "id": 294743801,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661192617
    }
]