[
    {
        "content": "<p>From: José Manuel Rodriguez Caballero &lt;<a href=\"mailto:josephcmac@gmail.com\">josephcmac@gmail.com</a>&gt;<br>\nDear Freek, as I already pointed out, I am just a beginner in the world of<br>\nproof assistants. So, I cannot give official references to the state of art<br>\nof the ideas in this field, just because of lack of knowledge (maybe in the<br>\nfuture that will be possible). I did not study Tom Hales' work, although I<br>\nknow that he contributed to the proof of Kepler's conjecture. When I<br>\npropose some idea to other peoples, it is because I hope that other people,<br>\nwith more experience than myself, will develop it: it is like to deliver a<br>\nbaby to an orphanage. If Tom Hales' had the idea first, good for him,<br>\nless responsability for myself.</p>\n<p>In my own mathematical research I do not use the \"sorry\" approach, because<br>\neverything that I need was already implemented in Isabelle/HOL. Indeed, in<br>\nmy last publication in Journal of Number Theory (Elsevier)</p>\n<p><a href=\"https://authors.elsevier.com/a/1XqPC,WUAvIul\">https://authors.elsevier.com/a/1XqPC,WUAvIul</a></p>\n<p>I just used elementary mathematics and even a good high school student can<br>\nunderstand my result and its proof (maybe someday this theorem will be<br>\nproposed as an exercise for an Olympiad of Mathematics at high school<br>\nlevel). In my paper, there are some theorems which are assumed to be true<br>\nwithout providing the details (it is the informal equivalent of \"sorry\"),<br>\ne.g., in Corollary 7 I wrote \"it follows in a straight-forward way that\".<br>\nAfter the publication of the paper, I filled the gap in Corollary 7 using<br>\nIsabelle without \"sorry\":<br>\n<a href=\"https://github.com/josephcmac/Folklore-and-miscellaneous-results-in-number-theory/blob/master/PeriPythTriang.thy\">https://github.com/josephcmac/Folklore-and-miscellaneous-results-in-number-theory/blob/master/PeriPythTriang.thy</a></p>\n<p>Nevertheless, other mathematicians, working in new branches of mathematics,<br>\nmay lack libraries.</p>\n<p>Kind Regards,<br>\nJosé M.</p>",
        "id": 294746160,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661193531
    }
]