[
    {
        "content": "<p>From: Jasmin Blanchette &lt;<a href=\"mailto:jasmin.blanchette@inria.fr\">jasmin.blanchette@inria.fr</a>&gt;<br>\nThe Automation of Logic group, led by Dr. Christoph Weidenbach, is looking for a PhD student to work on the formalization, in the Isabelle proof assistant, of the metatheory of automated reasoning.</p>\n<p>Researchers in automated reasoning spend a substantial portion of their work time developing logical calculi (e.g., DPLL, resolution, and superposition) and proving metatheorems about them. These proofs are typically carried out with pen and paper, which is error-prone and can be tedious. As part of the IsaFoL (Isabelle Formalization of Logic) project [1], we are interested in formalizing results concerning existing logical calculi. The motivation is manifold:</p>\n<ol>\n<li>\n<p>Formalization can offer a convenient means to study extensions, generalizations, or variations of existing calculi.</p>\n</li>\n<li>\n<p>Once we have developed suitable libraries and a methodology, formalization becomes not only a way to gain more trustworthiness about the results, it also is more convenient than pen and paper (or LaTeX).</p>\n</li>\n<li>\n<p>Isabelle includes automatic theorem provers as proving backends. There is an undeniable thrill in applying our own tools and find ways to improve them further, based on practical experience with them.</p>\n</li>\n</ol>\n<p>The PhD project is about verifying a functional implementation of a superposition prover: a minimalistic version of E, SPASS, or Vampire, based on the superposition calculus, a saturation loop, simplification, subsumption, and splitting. The project would be executed in close collaboration with Jasmin Blanchette at Vrije Universiteit Amsterdam and members of the Automation of Logic group [2] in Saarbrücken, including Mathias Fleury, Sophie Tourret, and Uwe Waldmann.</p>\n<p>The candidate should ideally have some experience with automated or interactive theorem proving, or with some closely related area of theoretical computer science (e.g., term rewriting). To apply, please send your personal record (including CV, grade transcripts, and contact information for two references) by email to Jennifer Müller &lt;<a href=\"mailto:jmueller@mpi-inf.mpg.de\">jmueller@mpi-inf.mpg.de</a>&gt;.</p>\n<p>[1] <a href=\"https://bitbucket.org/isafol/isafol/wiki/Home\">https://bitbucket.org/isafol/isafol/wiki/Home</a><br>\n[2] <a href=\"https://www.mpi-inf.mpg.de/departments/automation-of-logic/\">https://www.mpi-inf.mpg.de/departments/automation-of-logic/</a></p>",
        "id": 294736775,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661190073
    }
]