[
    {
        "content": "<p>From: grechukbogdan &lt;<a href=\"mailto:grechukbogdan@yandex.ru\">grechukbogdan@yandex.ru</a>&gt;<br>\nDear Isabelle Users</p>\n<p>Thank you everyone who provided me with a feedback for this document.</p>\n<p>I took into account all the suggestions and corrections, and the new version of the document is attached.</p>\n<p>I plan to wait about two-three more weeks in case if someone would have more global suggestions, and then I plan to find someone to help me with polishing English.</p>\n<p>I really hope such a Primer will be helpfull for beginners.</p>\n<p>Sincerely,<br>\n  Bogdan<br>\n<a href=\"/user_uploads/14278/w-mAeqeXIqx7W5OZ1tCWZnGt/document.tex\">document.tex</a><br>\n<a href=\"/user_uploads/14278/rNyiOFStlcLCqz7idjaP5WH6/document.pdf\">document.pdf</a></p>",
        "id": 294111397,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660836954
    },
    {
        "content": "<p>From: grechukbogdan &lt;<a href=\"mailto:grechukbogdan@yandex.ru\">grechukbogdan@yandex.ru</a>&gt;<br>\nDear Isabelle Users</p>\n<p>I have tried to write a short Primer aimed for mathematicians who would like to use Isabelle first time for formalization of mathematical results, but do not want to read a 218-page tutorial before formalizing the first simple lemma.</p>\n<p>I have tried to concentrate on topics, which are especially useful for a beginner: main notations, search in Isabelle, sledgehammer, organization of blocks inside the proof, etc. More importantly, I have tried not just tell the reader ``how it works'', but tell how to learn Isabelle, looking at the existing theories. Also, instead of providing the reader with correct proofs immediately, I often start with intuitive, but incorrect versions, and describe how to correct the resulting errors.</p>\n<p>The current version of the Primer is attached.</p>\n<p>Any feedback would be appreciated.</p>\n<p>Sincerely,<br>\nBogdan.<br>\n<a href=\"/user_uploads/14278/kImLwFFoDa93y9VM-3ZTAAGm/document.tex\">document.tex</a></p>",
        "id": 294113106,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660837457
    }
]