[
    {
        "content": "<p>From: Paul Curzon &lt;<a href=\"mailto:pc@dcs.qmul.ac.uk\">pc@dcs.qmul.ac.uk</a>&gt;</p>\n<hr>\n<p>Final Call for Papers - Deadline Extended</p>\n<hr>\n<p>FMIS 2006</p>\n<p>1st International Workshop on FORMAL METHODS FOR INTERACTIVE SYSTEMS</p>\n<p>Macau SAR China, 31 October 2006</p>\n<p><a href=\"http://fmis.iist.unu.edu/\">http://fmis.iist.unu.edu/</a></p>\n<p>Satellite Event of ICFEM 2006</p>\n<hr>\n<p>IMPORTANT DATES</p>\n<p>Submission deadline: 6 August, 2006 (EXTENDED)</p>\n<p>Acceptance notification: 10 September, 2006</p>\n<p>Final version for the pre-proceedings due: 12 October, 2006</p>\n<p>Final version for the ENTCS proceedings due: 1 December, 2006</p>\n<hr>\n<p>BACKGROUND AND OBJECTIVES</p>\n<p>Reducing the likelihood of human error in the use of interactive<br>\n   systems is increasingly important: the use of such systems is<br>\n   becoming widespread in applications that demand high reliability<br>\n   due to safety, security, financial or similar considerations.<br>\n   Consequently, the use of formal methods in verifying the<br>\n   correctness of interactive systems should also include analysis<br>\n   of human behaviour in interacting with the interface. </p>\n<p>The aim of this workshop is to bring together researchers in<br>\n   computer science and cognitive psychology, from both academia<br>\n   and industry, who are interested in developing formal and<br>\n   semi-formal methodologies and tools for the evaluation and<br>\n   verification of interactive systems. The outcome is to establish<br>\n   a worldwide network of researchers interested in applying formal<br>\n   methods to HCI. </p>\n<p>The workshop will focus on, though will not be restricted to,</p>\n<p>* general design and verification methodologies<br>\n       based on cognitive psychology</p>\n<p>as well as application areas such as</p>\n<p>* mobile devices;<br>\n     * embedded systems;<br>\n     * safety-critical systems;<br>\n     * high-reliability systems;<br>\n     * shared control systems;<br>\n     * digital libraries;<br>\n     * eGovernment;<br>\n     * pervasive systems;<br>\n     * augmented reality. </p>\n<p>The one-day workshop will feature a one hour presentation by a<br>\n   keynote speaker together with contributed papers that will<br>\n   undergo a peer-review process. Contributed papers may be<br>\n   accepted either for full presentation or short presentation.</p>\n<p>PUBLICATION</p>\n<p>Papers accepted as full paper presentations will be published by<br>\n   Elsevier in the series Electronic Notes in Theoretical Computer<br>\n   Science (ENTCS). Papers accepted as short paper presentations<br>\n   will be published in the participants` proceedings at the<br>\n   workshop only. Detailed information on the submission procedure<br>\n   is available below. </p>\n<p>Publication of a selection of the papers in a journal special<br>\n   issue is also under consideration.</p>\n<p>INVITED SPEAKER</p>\n<p>* Harold Thimbleby, University of Wales Swansea, UK</p>\n<p>SPONSORS AND ORGANISATION</p>\n<p>IFMIS 2006 will be organised jointly between the International<br>\n   Institute for Software Technology of the United Nations<br>\n   University (UNU-IIST) and the EPSRC Human Error Modelling (HUM)<br>\n   Project of the University of London (QMUL and UCL).<br>\n   UNU-IIST and EPSRC-HUM are also sponsors of ICTAC 2006.</p>\n<p>SUBMISSION AND PUBLICATION</p>\n<p>Submissions to the workshop must not have been published or be<br>\n   concurrently considered for publication elsewhere.<br>\n   All submissions will be peer-reviewed and judged on the basis<br>\n   of originality, contribution to the field, technical and<br>\n   presentation quality, and relevance to the workshop.<br>\n   Papers should be written in English and not exceed 16 pages<br>\n   in ENTCS format. </p>\n<p>Authors should utilize the ENTCS macro files that have been<br>\n   specially prepared for use with ENTCS. The generic ENTCS package,<br>\n   which contains files common for all volumes in ENTCS and<br>\n   includes several examples, as well as instructions, can be<br>\n   downloaded from <br>\n<a href=\"http://www.entcs.org/generic.tar.gz\">http://www.entcs.org/generic.tar.gz</a>.<br>\n   The entcsmacro.sty file in the ENTCS package should be be<br>\n   replaced by the prentcsmacro.sty file, which is specific to<br>\n   FMIS 2006 and can be downloaded from<br>\n<a href=\"http://www.entcs.org/files/fmis/prentcsmacro.sty\">http://www.entcs.org/files/fmis/prentcsmacro.sty</a>.<br>\n   File prentcsmacro.sty has to be renamed entcsmacro.sty.<br>\n   File example.tex has to be used as a template for the paper,<br>\n   making sure that key words are included in the frontmatter<br>\n   section where indicated. </p>\n<p>Authors also should not use any formatting commands that alter<br>\n   the ENTCS style definitions. This includes the format of<br>\n   Definitions, Lemmas, Theorems, etc., as well as the spacing<br>\n   that is defined by the ENTCS Macros. </p>\n<p>Authors must submit their papers in pdf format to the website<br>\n<a href=\"http://confman.iist.unu.edu/FMIS2006/REG-paper/\">http://confman.iist.unu.edu/FMIS2006/REG-paper/</a><br>\n   no later than Sunday 23 July 2006. </p>\n<p>All queries should be sent to: fmis2006 AT <a href=\"http://iist.unu.edu\">iist.unu.edu</a>.</p>\n<p>ORGANISERS</p>\n<p>* Antonio Cerone, UNI-IIST, Macau SAR China<br>\n     * Paul Curzon, Queen Mary, University of London, UK</p>\n<p>PROGRAM COMMITTEE</p>\n<p>* Ann Blandford, UCL Interaction Center, UK<br>\n     * Ralph Back, Åbo Akademi, Finland<br>\n     * Howard Bowman, University of Kent, UK<br>\n     * George Buchanan, University of Wales Swansea, UK<br>\n     * Antonio Cerone, UNI-IIST, Macau SAR China (Co-chair)<br>\n     * Paul Cairns, UCL Interaction Center, UK<br>\n     * Josè Creissac Campos, University of Minho, Portugal<br>\n     * Paul Curzon, Queen Mary, University of London, UK (Co-chair)<br>\n     * Gavin Doherty, Trinity College, University of Dublin, Ireland<br>\n     * Michael Harrison, University of Newcastle upon Tyne, UK<br>\n     * C. Michael Holloway, NASA Langley Research Center, USA<br>\n     * Chris Johnson, University of Glasgow, UK<br>\n     * Alan Dix, Lancaster University, UK<br>\n     * Li Siu Pan, Macao Polytechnic Institute, Macau SAR China<br>\n     * Peter Lindsay, The University of Queensland, Australia<br>\n     * Adegboyega Ojo, UNI-IIST, Macau SAR China<br>\n     * Philippe Palanque, University of Toulouse III, France<br>\n     * Fabio Paternò, CNR-ISTI, Italy<br>\n     * Rimvydas Ruksenas, Queen Mary, University of London, UK</p>",
        "id": 294040544,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660815070
    }
]