[
    {
        "content": "<p>From: Nils Jähnig &lt;<a href=\"mailto:jaehnig@mi.fu-berlin.de\">jaehnig@mi.fu-berlin.de</a>&gt;<br>\nHello,</p>\n<p>i hope this is also the right list for jedit stuff.</p>\n<p>I disabled the Auto-parsing in Isabelle. as it was the only way, to<br>\ndisable the Isabelle-parsing. just to read some files.<br>\nNow i wanted to reactivate the parsing, so i ticked the option,<br>\nrestartet jedit and got the following error:</p>\n<p>the following plug-in could not be loaded:<br>\n/home/nils/Isabelle2011/contrib/jedit-4.3.2_Isabelle-6d736d983d5c/jars/Isabelle-jEdit.jar:<br>\nCannot start: java.lang.reflect.InvocationTargetException<br>\nTry updating to a newer version of the plug-in.</p>\n<p>Workaround: delete the properties file in<br>\n.isabelle/Isabelle2011/jedit. jedit will create a new working one.<br>\nif you are lucky, you can also copy one of the properties files from<br>\nthe backup directory in the same location and rename it.</p>\n<p>the pre-2011 version of jedit ran much butter on my machine. the new<br>\none has problems clearing the ram, when i load and afterwards close<br>\nmultiple theory files in a row. for me the auto-trace is not really<br>\nuseful, as I usually have one or two theories to work on, and some<br>\nmore, wherein i just want to lookup things. So like it was before, to<br>\nenable parsing for every buffer on it's own was better for me.</p>\n<p>to mention something positive: i really like the sidekick showing some<br>\nsort of outline of the theory.</p>\n<p>best regards<br>\nNils</p>",
        "id": 294135922,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660844322
    },
    {
        "content": "<p>From: Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt;<br>\nIn the old Proof General model, the user \"schedules\" everything by hand -- <br>\nindividual commands and theory buffers.  This is convenient for experts <br>\nwho want to control every aspect of the system themselves, but it is also <br>\na bit inefficient.  A modern operating system also does the scheduling for <br>\nthe user, not the user for the operating system.</p>\n<p>Session management above means dependency management and scheduling of <br>\nchecking.  For Isabelle/Scala/jEdit in Isabelle2011 I've successfully <br>\nremoved the old stuff (which was also a lot of work), but managed to <br>\nimplement only little of the new world order when the release deadline was <br>\napproaching. This is why it is still a bit awkward to work with files in <br>\nIsabelle/jEdit right now, but you can expect it to get better again next <br>\ntime.</p>\n<p>Makarius</p>",
        "id": 294136018,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660844353
    },
    {
        "content": "<p>From: Nils Jähnig &lt;<a href=\"mailto:jaehnig@mi.fu-berlin.de\">jaehnig@mi.fu-berlin.de</a>&gt;<br>\nso i'm looking forward to the next version, and in the meantime try to<br>\nget some RAM.<br>\nthanks for your decision-explanation<br>\nNils</p>",
        "id": 294136047,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660844365
    },
    {
        "content": "<p>From: Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt;<br>\nOn Fri, 29 Apr 2011, Nils Jähnig wrote:</p>\n<blockquote>\n<p>i hope this is also the right list for jedit stuff.</p>\n</blockquote>\n<p>Yes, isabelle-users is for everything that is part of official Isabelle <br>\nrelease.  In contrast, when you start compiling things on your own from <br>\nsome repository version you should discuss things on the isabelle-dev <br>\nmailing list (and reveal your version via \"isabelle version -i\").</p>\n<blockquote>\n<p>I disabled the Auto-parsing in Isabelle. as it was the only way, to <br>\ndisable the Isabelle-parsing. just to read some files. Now i wanted to <br>\nreactivate the parsing, so i ticked the option, restartet jedit and got <br>\nthe following error:</p>\n<p>the following plug-in could not be loaded: <br>\n/home/nils/Isabelle2011/contrib/jedit-4.3.2_Isabelle-6d736d983d5c/jars/Isabelle-jEdit.jar: <br>\nCannot start: java.lang.reflect.InvocationTargetException Try updating <br>\nto a newer version of the plug-in.</p>\n</blockquote>\n<p>Proper session management is still largely missing, so disabling and <br>\nre-enabling these global options is not really supported at the moment.</p>\n<blockquote>\n<p>the pre-2011 version of jedit ran much butter on my machine. the new one <br>\nhas problems clearing the ram, when i load and afterwards close multiple <br>\ntheory files in a row.</p>\n</blockquote>\n<p>Resource management is as absent in the 2011 version as in the ones <br>\nbefore, but their might be more content produced.  How much RAM do you <br>\nhave anyway.  I think you can work several hours on 2 GB.</p>\n<blockquote>\n<p>for me the auto-trace is not really useful, as I usually have one or two <br>\ntheories to work on, and some more, wherein i just want to lookup <br>\nthings. So like it was before, to enable parsing for every buffer on <br>\nit's own was better for me.</p>\n</blockquote>\n<p>What is auto-trace?</p>\n<p>The continous checking that is always enabled is a corollary of the <br>\nabsence of session manament.  I hope to have that in better shape for the <br>\nnext Isabelle release -- it also affects the way traditional <br>\nbatch-processing works, so it all takes a bit longer than anticipated.</p>\n<p>Makarius</p>",
        "id": 294136249,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660844414
    },
    {
        "content": "<p>From: Nils Jähnig &lt;<a href=\"mailto:jaehnig@mi.fu-berlin.de\">jaehnig@mi.fu-berlin.de</a>&gt;</p>\n<blockquote>\n<blockquote>\n<p>the pre-2011 version of jedit ran much butter on my machine. the new one<br>\nhas problems clearing the ram, when i load and afterwards close multiple<br>\ntheory files in a row.</p>\n</blockquote>\n<p>Resource management is as absent in the 2011 version as in the ones before,<br>\nbut their might be more content produced.  How much RAM do you have anyway.<br>\n I think you can work several hours on 2 GB.</p>\n</blockquote>\n<p>I have 2 GB of RAM at work. but usually some other programs running<br>\n(even without other programs running it freezes sometimes).<br>\nIt is when I'm looking through other theory-files (which get parsed),<br>\nwhen the RAM gets full.<br>\nAt home, where I use jedit via Cygwin on Windows, I have 4 GB of RAM,<br>\nwhere it's running smoother. But it actually uses more than 2GB of RAM<br>\n(together with Winows).</p>\n<blockquote>\n<blockquote>\n<p>for me the auto-trace is not really useful, as I usually have one or two<br>\ntheories to work on, and some more, wherein i just want to lookup things. So<br>\nlike it was before, to enable parsing for every buffer on it's own was<br>\nbetter for me.</p>\n</blockquote>\n<p>What is auto-trace?</p>\n</blockquote>\n<p>I'm sorry, i meant auto-parsing.</p>\n<blockquote>\n<p>The continous checking that is always enabled is a corollary of the absence<br>\nof session manament.  I hope to have that in better shape for the next<br>\nIsabelle release -- it also affects the way traditional batch-processing<br>\nworks, so it all takes a bit longer than anticipated.</p>\n</blockquote>\n<p>I'm not sure, if I got you right (maybe due to me writing<br>\n\"auto-trace\"). my idea was to get back to the not-enabled checking,<br>\nwithout any options. pressing three keys to activate the parsing is no<br>\nbig deal. on the other hand I don't see a big advantage in having all<br>\ntheories parsed without pressing a button (please correct me, if I'm<br>\nwrong). how does the absence of session management intefere here?</p>\n<p>Nils</p>",
        "id": 294137444,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660844807
    }
]