[
    {
        "content": "<p>From: Brian Huffman &lt;<a href=\"mailto:brianh@cs.pdx.edu\">brianh@cs.pdx.edu</a>&gt;<br>\nI agree that the old Integral should be kept somewhere, like in HOL/ex.</p>\n<p>Johannes and Robert: I thought your plan was just to remove it from<br>\nthe Isabelle/HOL image (which I fully approve of), but now it is<br>\ncompletely gone!</p>\n<p>It is probably best to handle little-used libraries in a more<br>\nconservative way, like first moving them to a different directory,<br>\nrather than just deleting them completely. Libraries may have value<br>\neven if nobody imports them: I think Integral.thy is a fairly readable<br>\nexposition of gauge integrals (especially when compared to<br>\nMultivariate_Analysis!), and would be a useful object of study for<br>\nsomeone trying to learn the subject. I'll take responsibility for<br>\nmaintaining the theory, if maintenance is a concern.</p>\n<ul>\n<li>Brian</li>\n</ul>",
        "id": 294099864,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660833436
    },
    {
        "content": "<p>From: Tobias Nipkow &lt;<a href=\"mailto:nipkow@in.tum.de\">nipkow@in.tum.de</a>&gt;<br>\nI sympathize with Brian's sentiments. But when you put the theory into<br>\nHOL/ex</p>\n<ol>\n<li>\n<p>include a comment that states clearly that this is of<br>\nhistorical/expository interest only and that HOL's proper integration<br>\ntheory is found elsewhere.</p>\n</li>\n<li>\n<p>Remove extraneous stuff, in this case the lemmas beyond FCT1.</p>\n</li>\n</ol>\n<p>Tobias</p>\n<p>Brian Huffman schrieb:</p>",
        "id": 294099878,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660833442
    },
    {
        "content": "<p>From: Johannes Hölzl &lt;<a href=\"mailto:hoelzl@in.tum.de\">hoelzl@in.tum.de</a>&gt;<br>\nReadded the old Integration theory to HOL examples. </p>\n<p>It would be of course nice if someone could cleanup the proofs in this<br>\ntheory and rewrite them in nice Isar-style.</p>\n<ul>\n<li>Johannes</li>\n</ul>",
        "id": 294099915,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660833454
    },
    {
        "content": "<p>From: Johannes Hölzl &lt;<a href=\"mailto:hoelzl@in.tum.de\">hoelzl@in.tum.de</a>&gt;<br>\nHi Isabelle Users,</p>\n<p>Robert Himmelmann is currently porting the Multivariate Analysis from<br>\nHOL-light to Isabelle/HOL. This contains a definition of the Gauge<br>\nIntegral. However a one-dimensional version of this is already in<br>\nsrc/HOL/Integration.</p>\n<p>To avoid a duplication of maintenance we plan to remove the current<br>\none-dimensional Integral definition and replace it by a definition based<br>\non Multivariate Analysis. Therefore users of the old Integral need to<br>\nadjust their proofs and import the HOL-Multivariate_Analysis image in<br>\nthe future.</p>\n<p>Is there anyone using the old Integral? There is no usage in Isabelle or<br>\nthe AFP. Are there any objections or comments?</p>\n<p>Best Regards,</p>\n<ul>\n<li>Johannes</li>\n</ul>\n<p>PS: Also Armin Heller and I currently port the Probability theory from<br>\nHOL4, which contains the Lebegues integration (based again on<br>\nafp/thy/Integration). Hence in the future will be at least two integrals<br>\nin Isabelle/HOL anyway. Hopefully we can show the equivalence of both<br>\nintegrals when the function if Gauge and Lebegues integrable.</p>",
        "id": 294101324,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660833871
    },
    {
        "content": "<p>From: Florian Haftmann &lt;<a href=\"mailto:florian.haftmann@informatik.tu-muenchen.de\">florian.haftmann@informatik.tu-muenchen.de</a>&gt;<br>\nSounds reasonable to me.  Perhaps the old Integral could go to a theory<br>\nin ex/?</p>\n<p>Florian<br>\n<a href=\"/user_uploads/14278/5qjyJXnWaxDJbTidVE8NBhrZ/signature.asc\">signature.asc</a></p>",
        "id": 294101460,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660833909
    }
]