[
    {
        "content": "<p>From: Lawrence Paulson &lt;<a href=\"mailto:lp15@cam.ac.uk\">lp15@cam.ac.uk</a>&gt;<br>\nAn unusual entry by Lukas Bulwahn: three different proofs inspired by a Mathematics Stack Exchange page. Many thanks, Lukas!</p>\n<p>Larry Paulson</p>\n<p><a href=\"https://www.isa-afp.org/entries/Falling_Factorial_Sum.html\">https://www.isa-afp.org/entries/Falling_Factorial_Sum.html</a></p>\n<blockquote>\n<p>This entry shows that the falling factorial of a sum can be computed with an expression using binomial coefficients and the falling factorial of its summands. The entry provides three different proofs: a combinatorial proof, an induction proof and an algebraic proof using the Vandermonde identity. The three formalizations try to follow their informal presentations from a Mathematics Stack Exchange page as close as possible. The induction and algebraic formalization end up to be very close to their informal presentation, whereas the combinatorial proof first requires the introduction of list interleavings, and significant more detail than its informal presentation.</p>\n</blockquote>",
        "id": 294724448,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661185971
    },
    {
        "content": "<p>From: j4n bur53 &lt;<a href=\"mailto:janburse@fastmail.fm\">janburse@fastmail.fm</a>&gt;<br>\nSignificant more detail, but also less readability. The<br>\narchive entry is quite repellent. There is no 2-diemensional<br>\nrendering of formulas, as compared to MSE. The most text<br>\noccupies the copyright notice at the end.</p>\n<p>Something has to change!</p>\n<p>Lawrence Paulson schrieb:</p>",
        "id": 294724461,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661185978
    },
    {
        "content": "<p>From: Lukas Bulwahn &lt;<a href=\"mailto:lukas.bulwahn@gmail.com\">lukas.bulwahn@gmail.com</a>&gt;<br>\nHi,</p>\n<p>Concerning the combinatorial proof, this entry simply shows that this<br>\nproof from elementary combinatorics is clearly more explicit than its<br>\ntextbook proofs. If you also compare the formalisations of other<br>\nelementary combinatorics with their textbook proofs, you will find<br>\nthat they are similarly explicit. Hence, I have the conjecture that<br>\ntextbook proofs from elementary combinatorics can be much more<br>\nimplicit for human readers; theorem provers need much more guidance<br>\ndespite all the automation and reasoning power we have gained and<br>\nachieved over the last few decades.</p>\n<p>Concerning the induction and algebraic proof, readability in the pdf<br>\nmight currently be an open issue, but I believe this can be addressed<br>\nwith latex output notation. So far, we have not formalized much<br>\ncombinatorics and nobody provides a dedicated notation for typical<br>\nfunctions in combinatorics, such as binomial, factorial, rising<br>\nfactorial/pochhammer, falling factorial or Stirling numbers.</p>\n<p>You are free to contribute a theory that provides proper setup for the<br>\nused notation, or extend and modify the provided theories in the entry<br>\nto improve its presentation.</p>\n<p>Best regards,</p>\n<p>Lukas</p>",
        "id": 294724477,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661185983
    },
    {
        "content": "<p>From: j4n bur53 &lt;<a href=\"mailto:janburse@fastmail.fm\">janburse@fastmail.fm</a>&gt;<br>\nWasn't a critique ad Hominem, only somehow it<br>\nconfuses me increasingly that there is a discrepancy<br>\nbetween modern math notation, in current practice,</p>\n<p>and what you generate in the archive. The archive is<br>\nkind of a hybrid between a PDF article and what you<br>\nenter in jEdit when creating Isabelle/HOL theorems.</p>\n<p>But I am not sure whether it gets best of both worlds<br>\nor only a weak common denominator. jEdit looks more<br>\nlike programming code with its coloring.</p>\n<p>But what are the unique selling propositions of<br>\nthe PDF articles? I don't know the actual status quo,<br>\nis it at all possible to generate 2-dimensional</p>\n<p>output? Like the output a CAS would easily generate<br>\nfor mathematical formulas such as sums, integrals, etc..<br>\nwith all the subscript, superscript, etc...</p>\n<p>Lukas Bulwahn schrieb:</p>",
        "id": 294724497,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661185989
    },
    {
        "content": "<p>From: j4n bur53 &lt;<a href=\"mailto:janburse@fastmail.fm\">janburse@fastmail.fm</a>&gt;<br>\nA starting point could be this example here (Page 20):</p>\n<p><a href=\"http://sketis.net/wp-content/uploads/2016/03/Curry-Club_Mar-2016.pdf\">http://sketis.net/wp-content/uploads/2016/03/Curry-Club_Mar-2016.pdf</a></p>\n<p>Its nice to see that there is a \"also have : : :\" construct<br>\nin Isar, many proofs on MSE essential use such a reasoning<br>\nsequence.</p>\n<p>But nevertheless the stuff looks much better on MSE. Its<br>\nnot only the 2-dimensional rendering, but also the use<br>\nof whitespace.</p>\n<p>Here only a \"Pedro\" used induction:</p>\n<p><a href=\"https://math.stackexchange.com/a/34437/4414\">https://math.stackexchange.com/a/34437/4414</a></p>\n<p>But he didn't use the Sum sign, instead less symbolic notation,<br>\nwith ellipses. For more advanced users you see Sum sign<br>\nusage although.</p>\n<p>But then \"Carlo\"'s solution jump skips induction, and<br>\nthe Sum sign and appeals goemetrically:</p>\n<p><a href=\"https://math.stackexchange.com/a/2263/4414\">https://math.stackexchange.com/a/2263/4414</a></p>\n<p>Quite fascinating. Should a PDF output drop some of<br>\nthe Isar statements in favor of whitespace and 2-dimensional<br>\nrendering. How could this be done?</p>\n<p>j4n bur53 schrieb:</p>",
        "id": 294724521,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661185996
    }
]