[
    {
        "content": "<p>From: Gerwin Klein &lt;<a href=\"mailto:gerwin.klein@nicta.com.au\">gerwin.klein@nicta.com.au</a>&gt;<br>\nWe're pleased to announce the release of the C-to-Isabelle/Simpl parser by Michael Norrish that was used in the L4.verified project.</p>\n<p>It is available for download under BSD license from:<br>\n<a href=\"http://www.ertos.nicta.com.au/software/c-parser/\">http://www.ertos.nicta.com.au/software/c-parser/</a></p>\n<p>The parser reads .c files after preprocessing and translates them into the language Simpl by Norbert Schirmer embedded in Isabelle/HOL [http://afp.sf.net/entries/Simpl.shtml]. Programs in Simpl can then be verified using the VCG and other mechanisms of that package.</p>\n<p>This release is still very much a research tool for experts and is based on Isabelle2009-1. We are aiming at porting the parser to the current Isabelle version in the future.</p>\n<p>Cheers,<br>\nGerwin</p>",
        "id": 294148775,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660848520
    },
    {
        "content": "<p>From: Gerwin Klein &lt;<a href=\"mailto:gerwin.klein@nicta.com.au\">gerwin.klein@nicta.com.au</a>&gt;<br>\nWe're looking at updating all our proofs in the next 2 months or so (optimistically). That includes the parser.</p>\n<p>Effort: the C parser is usually one of the more painful parts, because it uses ML-level Isabelle APIs which tend to change a lot more than the user level. We might be pestering people with questions in a few weeks on new ways of doing things.</p>\n<p>Cheers,<br>\nGerwin</p>",
        "id": 294149741,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660848850
    },
    {
        "content": "<p>From: Lars Noschinski &lt;<a href=\"mailto:noschinl@in.tum.de\">noschinl@in.tum.de</a>&gt;<br>\nDo you have any estimate when this is going to happen or how much of an <br>\neffort it will be to port this to a current Isabelle version?</p>\n<p>-- Lars</p>",
        "id": 294150394,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660849095
    }
]