[
    {
        "content": "<p>From: Gerwin Klein &lt;<a href=\"mailto:Gerwin.Klein@nicta.com.au\">Gerwin.Klein@nicta.com.au</a>&gt;<br>\nWe have 4 new AFP entries online at [http://afp.sfp.net], all by Manuel Eberl:</p>\n<ol>\n<li>The Divergence of the Prime Harmonic Series</li>\n</ol>\n<p>Abstract:<br>\nIn this work, we prove the lower bound ln (H_n) - ln(5/3) for the partial sum of the Prime Harmonic series and, based on this, the divergence of the Prime Harmonic Series ∑ [p prime] · 1/p.</p>\n<p>The proof relies on the unique squarefree decomposition of natural numbers. This is similar to Euler's original proof (which was highly informal and morally questionable). Its advantage over proofs by contradiction, like the famous one by Paul Erdős, is that it provides a relatively good lower bound for the partial sums.</p>\n<ol start=\"2\">\n<li>Descartes' Rule of Signs</li>\n</ol>\n<p>Abstract:<br>\nDescartes' Rule of Signs relates the number of positive real roots of a polynomial with the number of sign changes in its coefficient sequence.</p>\n<p>Our proof follows the simple inductive proof given by Rob Arthan, which was also used by John Harrison in his HOL Light formalisation. We proved most of the lemmas for arbitrary linearly-ordered integrity domains (e.g. integers, rationals, reals); the main result, however, requires the intermediate value theorem and was therefore only proven for real polynomials.</p>\n<ol start=\"3\">\n<li>Basic Geometric Properties of Triangles</li>\n</ol>\n<p>Abstract:<br>\nThis entry contains a definition of angles between vectors and between three points. Building on this, we prove basic geometric properties of triangles, such as the Isosceles Triangle Theorem, the Law of Sines and the Law of Cosines, that the sum of the angles of a triangle is π, and the congruence theorems for triangles.</p>\n<p>The definitions and proofs were developed following those by John Harrison in HOL Light. However, due to Isabelle's type class system, all definitions and theorems in the Isabelle formalisation hold for all real inner product spaces.</p>\n<ol start=\"4\">\n<li>Liouville numbers</li>\n</ol>\n<p>Abstract:<br>\nLiouville numbers are a class of transcendental numbers that can be approximated particularly well with rational numbers. Historically, they were the first numbers whose transcendence was proven.</p>\n<p>In this entry, we define the concept of Liouville numbers as well as the standard construction to obtain Liouville numbers (including Liouville's constant) and we prove their most important properties: irrationality and transcendence.</p>\n<p>The proof is very elementary and requires only standard arithmetic, the Mean Value Theorem for polynomials, and the boundedness of polynomials on compact intervals.</p>\n<p>Enjoy!<br>\nGerwin</p>\n<hr>\n<p>The information in this e-mail may be confidential and subject to legal professional privilege and/or copyright. National ICT Australia Limited accepts no liability for any damage caused by this email or its attachments.</p>",
        "id": 294664384,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661171169
    }
]