[
    {
        "content": "<p>From: Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt;<br>\nOn Thu, 16 Apr 2015, Lars Noschinski wrote:</p>\n<blockquote>\n<p>I have occasionally problems with hovering, in the sense that popups do<br>\nnot appear (at least not in a reasonable amount of time). I have not<br>\nbeen able to discern a pattern, so here are some observations:</p>\n<ul>\n<li>Most of the time, everything works fine.</li>\n<li>Sometimes, I do not get popups at all (but clicking still works).</li>\n<li>Sometimes, I get popups at some places, but not in other places<br>\n   (even in the same file on the same screen).</li>\n<li>Forcing Isabelle to reprocess by changing some part above (or<br>\n   cutting and pasting the relevant part) does not seem to help.</li>\n<li>Once, popups didn't work for some part at the top of the screen.<br>\n   Scrolling up helped. When I scrolled down again, I couldn't get the<br>\n   popup anymore. This was repeatable.</li>\n<li>Usually, it vanishes after a restart, but some files seem to trigger<br>\n   this behaviour more easily (or there are some external conditions<br>\n   which cause this?). While writing this mail, I had to restart jEdit<br>\n   a few times, till I got working popups in a certain file.<br>\n   Afterwards, I worked reliably; even after more restarts.</li>\n</ul>\n</blockquote>\n<p>Did you see these problems again?</p>\n<blockquote>\n<p>From a distance it looks to me like an allergic reaction of the window <br>\nmanager versus Java/AWT/Swing.  What exactly is your desktop environment?</p>\n</blockquote>\n<p>Makarius</p>",
        "id": 294642595,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661162758
    },
    {
        "content": "<p>From: Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt;<br>\nSo the next attempt is to try OpenJDK from that system.  In principle, it <br>\nshould be possible to bypass the Isabelle JDK component, by having local <br>\nsettings with ISABELLE_JDK_HOME pointing to a proper place.  This assumes <br>\na canonical directory structure, but Linux packagers often destroy that.</p>\n<p>OpenJDK variants claim to work better on the \"native\" Linux system they <br>\nare made for.  I've occasionally checked that, with relatively little <br>\nsuccess.</p>\n<p>Makarius</p>",
        "id": 294642785,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661162826
    }
]