[
    {
        "content": "<p>From: <a href=\"mailto:Michael.Norrish@data61.csiro.au\">Michael.Norrish@data61.csiro.au</a><br>\n++++++++++++++++++++++++++++++</p>\n<p>The Programming Language Systems Group in the Research School of Computer Science, The Australian National University has several PhD scholarships and post-doctoral fellowship opportunities available for bright, enthusiastic researchers in the following fields:</p>\n<ul>\n<li>Memory Management (Steve Blackburn, Tony Hosking, Michael Norrish)</li>\n<li>Language Runtime Systems (Steve Blackburn, Tony Hosking, Michael Norrish)</li>\n<li>Programming Language Semantics (Michael Norrish)</li>\n<li>Language Implementation Verification (Michael Norrish, Tony Hosking)</li>\n<li>Hardware Support for Programming Languages (Steve Blackburn, Tony Hosking)</li>\n<li>Transactional Memory (Steve Blackburn, Tony Hosking)</li>\n<li>Software Security (Steve Blackburn, Tony Hosking, Michael Norrish)</li>\n<li>Vulnerability Detection and Mitigation (Tony Hosking, Michael Norrish)</li>\n<li>System Evaluation Methodology (Steve Blackburn, Tony Hosking)</li>\n<li>Concurrency and Parallelism in Languages and Runtimes (Steve Blackburn, Tony Hosking)</li>\n</ul>\n<p>Potential applicants are encouraged to consult the group’s web pages at <a href=\"https://cecs.anu.edu.au/research/systems/programming-language-systems\">https://cecs.anu.edu.au/research/systems/programming-language-systems</a> and make direct contact with potential supervisors.</p>\n<p>Students and research fellows will be based at the Research School of Computer Science         within the Australian National University. Studentships are a tax-free allowance of A$27,082 (2018 rate) per year, tenable for a maximum of 3.5 years.</p>\n<p>PhD applications are to be submitted electronically at <a href=\"http://applyonline.anu.edu.au/\">http://applyonline.anu.edu.au/</a> before the closing date, April 16, 2019. For further information about graduate research within Computer Science at ANU, please see <a href=\"https://cs.anu.edu.au/study/graduate-research\">https://cs.anu.edu.au/study/graduate-research</a>. </p>\n<p>The scholarships are open to individuals of any nationality. We are based in Canberra, Australia, the top-ranking region of the 2014 OECD quality of life survey (<a href=\"https://www.canberratimes.com.au/national/act/canberra-named-the-best-place-in-the-world-again-20141007-10r5sp.html\">https://www.canberratimes.com.au/national/act/canberra-named-the-best-place-in-the-world-again-20141007-10r5sp.html</a>).</p>\n<p>Expressions of interest regarding post-doctoral research fellowships should be made via e-mail to Steve Blackburn &lt;<a href=\"mailto:steve.blackburn@anu.edu.au\">steve.blackburn@anu.edu.au</a>&gt; or Tony Hosking &lt;<a href=\"mailto:antony.hosking@anu.edu.au\">antony.hosking@anu.edu.au</a>&gt;.</p>\n<p>The ANU actively seeks to promote diversity in the workplace.</p>\n<p>++++++++++++++++++++++++++++++++++++++++++++++++++++++﻿</p>",
        "id": 294752187,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661195890
    }
]