[
    {
        "content": "<p>From: Maria Spichkova &lt;<a href=\"mailto:maria.spichkova@rmit.edu.au\">maria.spichkova@rmit.edu.au</a>&gt;<br>\nRMIT Classification: Trusted</p>\n<p>Dear Colleagues,</p>\n<p>The submission deadline for the Special Session<br>\nIS08: Collaboration in Software and System Engineering (CSSE),</p>\n<p>is extended till 10 June.</p>\n<p>24rd International Conference on Knowledge-Based and Intelligent Information &amp; Engineering Systems (KES).</p>\n<p>Because of the COVID-19 pandemic, KES 2020 will be a virtual event, held on 16-18 September.</p>\n<p>All submitted papers will be reviewed by the Program Committee, and if accepted and presented, they will be published in Elsevier's Procedia Computer Science, which is an open access journal. The papers will be then available in ScienceDirect and submitted to be indexed in Google Scholar, Scopus, CPCI (ISI conferences and part of Web of Science), and Engineering Index.</p>\n<p><a href=\"http://kes2020.kesinternational.org/cms/userfiles/is08.pdf&lt;https://aus01.safelinks.protection.outlook.com/?url=http%3A%2F%2Fkes2020.kesinternational.org%2Fcms%2Fuserfiles%2Fis08.pdf&amp;data=02%7C01%7Cmaria.spichkova%40rmit.edu.au%7C961831d5bdb94f79f49d08d805e2b410%7Cd1323671cdbe4417b4d4bdb24b51316b%7C0%7C0%7C637265818563366971&amp;sdata=cCI3xIdkSLBnU1lRAKZ%2BtWeoxcDfL8S6TzdVbfreB7c%3D&amp;reserved=0\">http://kes2020.kesinternational.org/cms/userfiles/is08.pdf&lt;https://aus01.safelinks.protection.outlook.com/?url=http%3A%2F%2Fkes2020.kesinternational.org%2Fcms%2Fuserfiles%2Fis08.pdf&amp;data=02%7C01%7Cmaria.spichkova%40rmit.edu.au%7C961831d5bdb94f79f49d08d805e2b410%7Cd1323671cdbe4417b4d4bdb24b51316b%7C0%7C0%7C637265818563366971&amp;sdata=cCI3xIdkSLBnU1lRAKZ%2BtWeoxcDfL8S6TzdVbfreB7c%3D&amp;reserved=0</a>&gt;</p>\n<p>Software &amp; systems development projects are generally collaborative and cooperative. A large system development can hardly be developed by a single person. Thus, this is a task for a team (or even a number of teams working together), where collaboration could play a crucial role. This task becomes even more challenging in the case of safety-critical systems, such as vehicles and aircrafts, where formal verification can be a part of development process.</p>\n<p>The goal of this session is to develop a future vision and roadmap of collaboration in software and systems engineering, focusing especially on requirements engineering and methodological analysis, as well as on diversity and intercultural aspects. The session aims to bring together researchers, engineers and practitioners from academia and industry to baseline the state of the art in this increasingly important domain.</p>\n<p>Areas of interest include but are not limited to:</p>\n<p>*   Collaborative modelling and analysis of sustainable software<br>\n  *   Collaborative aspects of global requirements engineering<br>\n  *   Collaborative aspects of formal methods in conceptual modelling, specification, and design<br>\n  *   Collaborative aspects of testing, verification and validation of systems<br>\n  *   New best practices for software and system engineering education to support team-based learning<br>\n  *   Innovative curriculum, assessment or course formats to support team-based learning of software and system engineering<br>\n  *   Diversity in software and systems engineering teams<br>\n  *   Intercultural aspects in software and systems engineering<br>\n  *   Usability aspects in software and systems engineering (including formal methods)<br>\n  *   Successful case studies on application of formal methods in collaborative projects<br>\n  *   Comprehensibility and readability of formal methods in software engineering<br>\n  *   Teaching of formal methods and collaborative aspects thereof<br>\n  *   Cross-disciplinary software and systems engineering (including application of formal methods)<br>\n  *   Industrial challenges, experience reports and case studies</p>\n<p>Formatting and Submission Guidelines:</p>\n<p><a href=\"http://kes2020.kesinternational.org/submission.php&lt;https://aus01.safelinks.protection.outlook.com/?url=http%3A%2F%2Fkes2020.kesinternational.org%2Fsubmission.php&amp;data=02%7C01%7Cmaria.spichkova%40rmit.edu.au%7C961831d5bdb94f79f49d08d805e2b410%7Cd1323671cdbe4417b4d4bdb24b51316b%7C0%7C0%7C637265818563366971&amp;sdata=PQQcJAObF4khG%2FHooMSivDTtxjZoGOpYYpzCmrKvVVA%3D&amp;reserved=0\">http://kes2020.kesinternational.org/submission.php&lt;https://aus01.safelinks.protection.outlook.com/?url=http%3A%2F%2Fkes2020.kesinternational.org%2Fsubmission.php&amp;data=02%7C01%7Cmaria.spichkova%40rmit.edu.au%7C961831d5bdb94f79f49d08d805e2b410%7Cd1323671cdbe4417b4d4bdb24b51316b%7C0%7C0%7C637265818563366971&amp;sdata=PQQcJAObF4khG%2FHooMSivDTtxjZoGOpYYpzCmrKvVVA%3D&amp;reserved=0</a>&gt;</p>\n<p>When you submit papers, just make sure that you select<br>\nIS08: Collaboration in Software and System Engineering.</p>\n<p>Kind regards,</p>\n<p>Maria</p>\n<hr>\n<p>Dr Maria Spichkova</p>\n<p>Senior Lecturer, Software Engineering</p>\n<p>School of Science</p>\n<p>RMIT University</p>",
        "id": 294829584,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661245992
    }
]