[
    {
        "content": "<p>From: Walther Neuper &lt;<a href=\"mailto:wneuper@ist.tugraz.at\">wneuper@ist.tugraz.at</a>&gt;<br>\n[apologies for multiple copies]<br>\n[Note: Extended Deadline is 22 September 2012]</p>\n<p>Special Issue of<br>\n         The Electronic Journal of Mathematics &amp; Technology (eJMT)<br>\n<a href=\"https://php.radford.edu/~ejmt/\">https://php.radford.edu/~ejmt/</a><br>\n                                   on<br>\n                Theorem-Prover based Systems for Education</p>\n<p>===Scope</p>\n<p>CADGME, the Conference on Computer Algebra and Dynamic Geometry Sy-<br>\nstems in Mathematics Education, has a working group on Theorem-Prover<br>\n(TP) based Systems since 2009. This year's conference held in Novi Sad,<br>\nSerbia, leads to a special issue with this scope:</p>\n<p>Recently and largely unnoticed in public, applications in science and<br>\ntechnology drove the development of automated and interactive theorem<br>\nproving technologies, which have become of major importance for mathe-<br>\nmatics and computer science in academia and in industry. However,<br>\ntheir potential for a wide-spread education technology is unexplored,<br>\nin spite of the fact, that TP exhibits features relevant for  educati-<br>\nonal systems:</p>\n<ul>\n<li>\n<p>TP supports automated checks of user-input: since input states a<br>\n   lemma to be proved within the logical context of a proof, a cal-<br>\n   culation or a geometric construction, TP checks user-input without<br>\n   specific code for large classes of input. Such automation brings<br>\n   systems for step-wise problem solving within reach.</p>\n</li>\n<li>\n<p>TP covers the whole problem solving process: since TP implements<br>\n   reasoning – the core of mathematical thinking, it supports all steps<br>\n   in problem solving (mathematising, comparing specifications, reason-<br>\n   ing and arguing, trying various strategies, until a solution can be<br>\n   verified).</p>\n</li>\n<li>\n<p>TP has underlying knowledge in a human readable format (following<br>\n   the LCF-paradigm): mathematics  knowledge is mechanized down to<br>\n   \"first principles\" beginning from basic axioms and definitions; so<br>\n   presenting explanations to learners is not an issue of implementa-<br>\n   tion but an issue of filtering off details.<br>\nThese features are distinguished from present educational mathematics<br>\nsoftware, from CAS, DGS, Spreadsheets etc. such that they promote a<br>\nnew generation of educational math assistants. Several prototypes are<br>\nunder construction in academic R&amp;D for geometry, algebra and appli-<br>\ncations in engineering disciplines. So it seems in time to publish<br>\nTP's potential and expected impact on educational practice in a<br>\nspecial issue.</p>\n</li>\n</ul>\n<p>===Important Dates</p>\n<p>Deadline:                 September 15, 2012<br>\nDeadline extended to:     September 22, 2012<br>\nSubmission:               16 pages pdf<br>\n<a href=\"https://www.easychair.org/conferences/?conf=cadgme12-edutps\">https://www.easychair.org/conferences/?conf=cadgme12-edutps</a><br>\nPreliminary notification: October 22, 2012<br>\nFinal notification        due to eJMT referees<br>\nExpected publication:     Spring 2013</p>\n<p>===Submission Details</p>\n<p>We expect original articles (typically 12-18 pages) that present high-<br>\nquality contributions that have not been previously published in an<br>\narchival venue and that must not be simultaneously submitted for<br>\npublication elsewhere.<br>\nGuidelines <a href=\"https://php.radford.edu/~ejmt/SubmissionGuidelines.php\">https://php.radford.edu/~ejmt/SubmissionGuidelines.php</a></p>\n<p>===Program Committee</p>\n<p>Christian Gütl, Graz University of Technology<br>\nRoman Hašek, University of South Bohemia<br>\nZlatan Magajna, University of Ljubljana<br>\nFilip Maric, University of Belgrade              (chair)<br>\nWalther Neuper, Graz University of Technology (co-chair)<br>\nPavel Pech, University of South Bohemia<br>\nRein Prank, University of Tartu<br>\nPedro Quaresma, University of Coimbra<br>\nJudit Robu, University of Xluj-Napoca<br>\nWolfgang Windsteiger, University of Linz</p>\n<p>===Topics of interest include, but are not limited to:</p>\n<ul>\n<li>\n<p>Features of TP which have specific potential for innovating educati-<br>\n   onal software</p>\n</li>\n<li>\n<p>Descriptions of systems which implement TP components, and expected<br>\n   impact on innovating education</p>\n</li>\n<li>\n<p>Reports from field-tests for TP-based systems</p>\n</li>\n<li>\n<p>What are novel promises of TP for open learning scenarios in class,<br>\n   independent learning at home, in renewed math and science education?</p>\n</li>\n<li>\n<p>How can TP provide additional challenges for gifted and interested<br>\n   students as well as extra tuition to catch up on, particularly for<br>\n   \"slow but rigorous thinkers\"?</p>\n</li>\n<li>\n<p>What is the gain for designing curricula, when respective math know-<br>\n   ledge can be mechanized and is available \"from first principles\"?</p>\n</li>\n<li>\n<p>What is the gain for evaluation and assessment, when the same soft-<br>\n   ware can be used for learning as well as for assessment (because for<br>\n   the latter only supportive functionality needs to be reduced)?</p>\n</li>\n<li>\n<p>How can TP-based systems support and enforce continuity between<br>\n   “intuitive” math at high-school and “formal” math at university?</p>\n</li>\n<li>\n<p>Are there ideas for open price competitions addressing the public in<br>\n   interactive mathematical challenges via “cloud computing”?</p>\n</li>\n</ul>",
        "id": 294222422,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660898192
    }
]