[
    {
        "content": "<p>From: Michael Norrish &lt;<a href=\"mailto:michael.norrish@nicta.com.au\">michael.norrish@nicta.com.au</a>&gt;<br>\nPRELIMINARY CALL FOR PAPERS<br>\n===========================</p>\n<p>Third International Conference on Certified Programs and Proofs (CPP 2013)</p>\n<hr>\n<p>December 2013, Australia (co-located with APLAS 2013)</p>\n<p>CPP is an international forum on theoretical and practical topics in all areas,<br>\nincluding computer science, mathematics, and education, that consider<br>\ncertification as an essential paradigm for their work. Certification here means<br>\nformal, mechanized verification of some sort, preferably with production of<br>\nindependently checkable certificates. We invite submissions on topics that fit<br>\nunder this rubric.</p>\n<p>The first two CPP conferences were held in Kenting, Taiwan, and Kyoto, Japan, in<br>\nDecember 2011 and 2012, respectively. As with the first meetings, the<br>\nproceedings will be published in Springer-Verlag’s Lecture Notes in Computer<br>\nScience series.</p>\n<p>Suggested, but not exclusive, specific topics of interest for submissions<br>\ninclude: certified or certifying programming, compilation, linking, OS kernels,<br>\nruntime systems, and security monitors; program logics, type systems, and<br>\nsemantics for certified code; certified decision procedures, mathematical<br>\nlibraries, and mathematical theorems; proof assistants and proof theory; new<br>\nlanguages and tools for certified programming; program analysis, program<br>\nverification, and proof-carrying code; certified secure protocols and<br>\ntransactions; certificates for decision procedures, including linear algebra,<br>\npolynomial systems, SAT, SMT, and unification in algebras of interest;<br>\ncertificates for semi-decision procedures, including equality, first-order<br>\nlogic, and higher-order unification; certificates for program termination;<br>\nlogics for certifying concurrent and distributed programs; higher-order logics,<br>\nlogical systems, separation logics, and logics for security; teaching<br>\nmathematics and computer science with proof assistants; and “Proof Pearls”<br>\n(elegant, concise, and instructive examples).</p>\n<p>Important Dates:<br>\n++++++++++++++++</p>\n<p>Authors are required to submit a paper title and a short abstract before<br>\nsubmitting the full paper. The submission should include when necessary a URL<br>\nwhere to find the formal development assessing the essential aspects of the<br>\nwork.  All submissions will be electronic. All deadlines are at midnight (GMT).</p>\n<p>============================    ==========================<br>\n<strong>Abstract Deadline:</strong>          Friday, May 30, 2013<br>\n<strong>Submission Deadline:</strong>        Friday, June 7, 2013<br>\n<strong>Author Notification:</strong>        Monday, August 19, 2013<br>\n<strong>Camera-ready Papers Due:</strong>    Monday, September 16, 2013<br>\n============================    ==========================</p>\n<p>Submission Instructions:<br>\n++++++++++++++++++++++++</p>\n<p>Papers should be submitted electronically online via the conference submission<br>\nweb page at URL:</p>\n<p><a href=\"http://www.easychair.org/conferences/?conf=cpp2013\">http://www.easychair.org/conferences/?conf=cpp2013</a></p>\n<p>Acceptable formats are PostScript or PDF, viewable by Ghostview or Acrobat<br>\nReader. Submissions should not exceed 16 pages in LNCS format, including<br>\nbibliography and figures.  Submitted papers will be judged on the basis of<br>\nsignificance, relevance, correctness, originality, and clarity. They should<br>\nclearly identify what has been accomplished and why it is significant. The<br>\nproceedings of the symposium will be published as a volume in Springer-Verlag’s<br>\nLecture Notes in Computer Science series. Submission instructions including<br>\nLaTeX style files are available from the CPP 2013 website.</p>\n<p>Each submission must be written in English and provide sufficient detail to<br>\nallow the program committee to assess the merits of the paper.  It should begin<br>\nwith a succinct statement of the issues, a summary of the main results, and a<br>\nbrief explanation of their significance and relevance to the conference, all<br>\nphrased for the non-specialist.  Technical and formal developments directed to<br>\nthe specialist should follow.  Whenever appropriate, the submission should come<br>\nalong with a formal development, using whatever prover, e.g., Agda, Coq, Elf,<br>\nHOL, HOL-Light, Isabelle, Matita, Mizar, NQTHM, PVS, Vampire, etc. References<br>\nand comparisons with related work should be included.  *Papers not conforming to<br>\nthe above requirements concerning format and length may be rejected without<br>\nfurther consideration.*</p>\n<p>The results must be unpublished and not submitted for publication elsewhere,<br>\nincluding the proceedings of other published conferences or workshops.  The PC<br>\nchairs should be informed of closely related work submitted to a conference or<br>\njournal in advance of submission. Original formal proofs of known results in<br>\nmathematics or computer science are among the targets.  One author of each<br>\naccepted paper is expected to present it at the conference.</p>\n<p>Organisation<br>\n++++++++++++</p>\n<p>:Program Co-Chairs:<br>\n  Georges Gonthier (Microsoft Research Cambridge) &amp;<br>\n  Michael Norrish (NICTA)</p>\n<p>:General Chair:<br>\n  Peter Schachte, <em>University of Melbourne</em></p>\n<p>Program Committee<br>\n^^^^^^^^^^^^^^^^^</p>\n<p>=========================   =======================================<br>\nDerek Dreyer                 Max Planck Institute<br>\nWilliam Farmer               McMaster University<br>\nJean-Christophe Filiâtre     INRIA<br>\nCédric Fournet               Microsoft Research Cambridge<br>\nBenjamin Grégoire            INRIA<br>\nReiner Hähnle                Technische Universität Darmstadt<br>\nAquinas Hobor                National University of Singapore<br>\nGyesik Lee                   Seoul University<br>\nCesar Muñoz                  NASA Langley<br>\nToby Murray                  NICTA<br>\nGopalan Nadathur             University of Minnesota<br>\nClaudio Sacerdoti            University of Bologna<br>\nPeter Sewell                 University of Cambridge<br>\nBas Spitters                 University of Nijmegen<br>\nGang Tan                     Lehigh University<br>\nAlwen Tiu                    Australian National University<br>\nYih-Kuen Tsay                Taiwan National Technical University<br>\nLihong Zhi                   Academica Sinica<br>\n=========================   =======================================<br>\n<a href=\"/user_uploads/14278/K_DCNbH-P1bzZln1LjSGsqBw/signature.asc\">signature.asc</a></p>",
        "id": 294237699,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660905496
    }
]