[
    {
        "content": "<p>From: Holden Lee &lt;<a href=\"mailto:hl422@cam.ac.uk\">hl422@cam.ac.uk</a>&gt;<br>\nA lot of proofs I have to do are methodical, but to my knowledge can't<br>\nbe done by auto, because auto doesn't have the right control structure.<br>\nHere are some tactics/controls which would be useful to me if they could<br>\nwork with auto - I'd be interested to know whether they exist, and if not,<br>\ncould someone point me to how I could code them in?</p>\n<p>- \"auto subst!: A\" where \"A is P x ==&gt; f(x)=g(x)\" Run auto, but every<br>\n   time you see f(x), replace it by g(x) and add the subgoal P x.</p>\n<p>- \"conditional substitution\" - Same as above but under conditions. Given<br>\n   a rule \"P x ==&gt; f(x)=g(x)\" and a congruence-type rule \"!! x. Q x --&gt;<br>\n   f(x)=g(x)  ==&gt; F(f(x),x)=F(g(x),x)\" (for example, \\sum_{x\\in A} f(x) =<br>\n   \\sum_{x\\in A} g(x) when for all x\\in A, f(x)=g(x)), then replace F(f(x),x)<br>\n   with F(g(x),x) and add the condition \"Q x ==&gt; P x\" as a goal to be proved.</p>\n<p>- \"auto intro a rule only if it succeeds directly (cf. Hint Immediate in<br>\n   Coq)\" Given a rule P x ==&gt; Q x ==&gt; R x, if R x is in the goal, see if P x<br>\n   and Q x are in the premises. If so, solve it. If not, do not introduce P x,<br>\n   Q x. (Use case: rules like A\\subseteq B ==&gt; B\\subseteq C ==&gt; A\\subseteq C:<br>\n   marking this as a intro rule would cause infinite regress.)</p>\n<p>- Don't go deeper than depth x - so prevent it from going down an<br>\n   infinite branch.</p>\n<p>Cheers,</p>\n<p>Holden</p>",
        "id": 294287935,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660922475
    },
    {
        "content": "<p>From: Lawrence Paulson &lt;<a href=\"mailto:lp15@cam.ac.uk\">lp15@cam.ac.uk</a>&gt;<br>\nDon’t overlook blast, which is a little more flexible in its use of inference rules and can even cope with reasonable amounts of transitivity. However, it doesn’t do simplification at all, so simplify in a previous step.</p>\n<p>Larry</p>",
        "id": 294287963,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660922484
    }
]