[
    {
        "content": "<p>From: Florian Lonsing &lt;<a href=\"mailto:florian.lonsing@tuwien.ac.at\">florian.lonsing@tuwien.ac.at</a>&gt;<br>\n[We apologize if you receive multiple copies of this call.]</p>\n<hr>\n<p>The Vienna Center for Logic and Algorithms announces the 2015 edition<br>\nof the VCLA International Student Awards and calls for the nomination<br>\nof authors of outstanding scientific works in the field of Logic and<br>\nComputer Science, in the following two categories:</p>\n<ul>\n<li>\n<p>Outstanding Master Thesis Award, to be given to the author of an<br>\noutstanding thesis for obtaining a Masters degree or equivalent (2nd<br>\ncycle Bologna process).</p>\n</li>\n<li>\n<p>Outstanding Undergraduate Research Award, to be given to the author<br>\nof an outstanding thesis or final project for obtaining a Bachelors<br>\ndegree or equivalent (1st cycle Bologna process).</p>\n</li>\n</ul>\n<p>In both categories, the work must make an original contribution to a<br>\nresearch field that can be classified as part of Logic in Computer<br>\nScience, understood broadly as the use of logic as a tool that enables<br>\ncomputer programs to reason about the world. The main areas of<br>\ninterest are:</p>\n<ul>\n<li>\n<p>Databases and Artificial Intelligence</p>\n</li>\n<li>\n<p>Verification</p>\n</li>\n<li>\n<p>Computational Logic</p>\n</li>\n</ul>\n<p>The committee will select a winner for each category. The winners will<br>\nbe invited to Vienna to present their project and participate in a<br>\nfestive award ceremony. Additionally, the Outstanding Master Thesis<br>\nAward category is accompanied by a prize of 1,200 EUR, and the<br>\nOutstanding Undergraduate Research Award by a prize of 800 EUR.</p>\n<p>Important Dates:</p>\n<p>Nomination deadline: November 15, 2015 (AoE)<br>\nNotification of the committee’s decision: early February 2016<br>\nAward ceremony: Spring 2016<br>\nFurther information: <a href=\"http://logic-cs.at/award/award-call-2015/\">http://logic-cs.at/award/award-call-2015/</a></p>\n<hr>",
        "id": 294657221,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661168528
    }
]