[
    {
        "content": "<p>From: Lucas Dixon &lt;<a href=\"mailto:ldixon@inf.ed.ac.uk\">ldixon@inf.ed.ac.uk</a>&gt;<br>\nHello,</p>\n<p>I'm wondering about the decision procedures present in Isabelle - which<br>\nones have been implemented.</p>\n<p>In particular, I am considering implementing some, probably based on<br>\nterm normalisation, and then trying to automatically find bijective<br>\nmappings between theories in progress and those to which known decision<br>\nprocedures apply. Any comments and suggestions on existing work in<br>\nIsabelle (or other systems) is most welcome.</p>\n<p>thanks,<br>\nlucas</p>",
        "id": 294078689,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660829921
    },
    {
        "content": "<p>From: Amine Chaieb &lt;<a href=\"mailto:ac638@cam.ac.uk\">ac638@cam.ac.uk</a>&gt;<br>\nDear Lucas,</p>\n<p>Here are the decision procedures I know of in Isabelle. There are surely<br>\nmore, which are not related to arithmetic.</p>\n<p>1) First-order formulas (semi-decision) --- This is early work by Larry<br>\nPaulson and \"recent\" work by Joe Hurd. Of course they are available in<br>\nall HOL families.</p>\n<p>2) Fourrier-Motzkin method for linear arithmetic. This is also available<br>\nin all HOL Families and as far as I heard also in Coq (maybe an other<br>\nalgorithm Omega by Pugh which works for integers). Typically it proves<br>\nuniversal theorems over linear real arithmetic, but it can be very<br>\neasily changed to prove theorems over the integers (and consequently<br>\nnatural numbers). This is also available in Isabelle and HOL Light (I<br>\nguess in HOL4 too).</p>\n<p>3) Quantifier elimination for linear integer arithmetic (Presburger<br>\nArithmetic). This is available in Isabelle/HOL, HOL Light and HOL 4</p>\n<p>4) Quantifier elimination for Tarski-algebra (Real numbers with plus and<br>\ntimes and ordering). This is available in HOL Light and in HOL (88?).<br>\nNot yet in Isabelle, but there is some work going on.</p>\n<p>5) Quantifier elimination for the complex numbers. This is available in<br>\nHOL Light and I have also ported it to Isabelle/HOL but never found its<br>\nway in to the distribution, because it was quite slow on interesting<br>\nexamples and there was no real applications.</p>\n<p>6) Quantifier elimination for Dense linear orders. This is available in<br>\nIsabelle/HOL (Maybe in other HOL families --- but is really too simple<br>\nto be worth mentioning).</p>\n<p>7) Quantifier elimination for linear real arithmetic. This is available<br>\nin Isabelle/HOL (the algorithm of Ferrante Rackoff and if you do some<br>\ntransformations you can apply a Variant of Loos Weispfenning formalized<br>\nby Tobias Nipkow).</p>\n<p>There is also a version where you are allowed to multiply quantifier<br>\nvariables with non-linear parameters.</p>\n<p>All theses apply to any ordered zero-totalized field (and hence for the<br>\nreal numbers are a subclass of Tarski-algebra).</p>\n<p>8) Universal inequalities over the real numbers --- Using sums of<br>\nsquares and semidefinite programming. This is available in HOL Light and<br>\nhas also been ported to Isabelle/HOL. Laurent Thery also ported two<br>\nyears (or so) ago to Coq.</p>\n<p>9) Universal equalities in Rings (using Groebner Bases). This is<br>\navailable in HOL Light and Isabelle. The extension to an interesting<br>\nforall-exists fragment for ring-equalities is also available in both<br>\nsystems. In Coq there is a very basic version of this which tells you OK<br>\nif two ring terms are equal (without using assumptions).</p>\n<p>10) Quantifier elimination for mixed linear-real arithmetic (using the<br>\nfloor-function). This is available in Isabelle/HOL. I am not aware of<br>\nany other theorem prover having this decision procedure.</p>\n<p>11) There is also a formalization of DPLL (T) and SAT by Filip Maric and<br>\nPredrag Janicic in Isabelle/HOL</p>\n<p>Hope it helps,<br>\nAmine.<br>\nYou might be interested in glancing at the following paper which<br>\naddresses the issue of writing proof-method which work under<br>\ninterpretation of locales --- i.e. apply to several structures at once:</p>\n<p>Amine Chaieb and Makarius Wenzel. Context aware Calculation and<br>\nDeduction - Ring Equalities via Gröbner Bases in Isabelle. In M. Kauers,<br>\nM. Kerber, R. Miner, and W. Windsteiger, editors, / CALCULEMUS 2007/,<br>\nvolume 4573 of /Lecture Notes in Computer Science/, pages 27-39.<br>\nSpringer, 2007. [ bib<br>\n&lt;<a href=\"http://www4.in.tum.de/%7Echaieb/pubs/pubs_bib.html#Chaieb-Wenzel:2007a\">http://www4.in.tum.de/%7Echaieb/pubs/pubs_bib.html#Chaieb-Wenzel:2007a</a>&gt; |<br>\n.pdf &lt;<a href=\"http://www4.in.tum.de/%7Echaieb/pubs/pdf/morphism.pdf\">http://www4.in.tum.de/%7Echaieb/pubs/pdf/morphism.pdf</a>&gt; ]</p>",
        "id": 294078801,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660829971
    },
    {
        "content": "<p>From: Michael Norrish &lt;<a href=\"mailto:Michael.Norrish@nicta.com.au\">Michael.Norrish@nicta.com.au</a>&gt;<br>\nAmine Chaieb wrote:</p>\n<p>I believe the \"Omega\" implemented in Coq is just F-M elimination (and<br>\nthus incomplete for the integers).  This was the case a few years ago.<br>\nThe full Omega is implemented in HOL4, and is a quantifier elimination<br>\nprocedure for Presburger arithmetic over the integers.  I recommend<br>\nits implementation if you're looking for something to do in Isabelle:<br>\nit performs better than Cooper's algorithm on many typical problems.<br>\n(There are also other problems where Cooper's is better.)</p>\n<p>Michael.</p>",
        "id": 294079040,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660830039
    }
]