[
    {
        "content": "<p>From: Dominique Mery &lt;<a href=\"mailto:mery@loria.fr\">mery@loria.fr</a>&gt;<br>\nCall for Application to a Three-Years PhD Grant<br>\nReliability and safety of medical device software systems<br>\nOctober 2008<br>\nLaboratory : The MOSEL research team at LORIA UMR 7503 Nancy, France.<br>\nSupervisor:: MERY Dominique <a href=\"mailto:mery@loria.fr\">mery@loria.fr</a><br>\nSummary of the topics<br>\nThe aim of this project is to investigate the modelling of medical <br>\ndevice software and systems using formal techniques and using proof <br>\nassistants. Classical methods like tests have reached their limits and <br>\nthe development of medical device software and systems is a crucial <br>\nissue, since the society should ensure safe advances in healthcare <br>\ndelivery. Any safety and regulatory requirements for medical devices <br>\nnecessarily call for rigorous software developments methods to ensure <br>\nreliability and to protect the public health. The Grand Challenge <br>\nmentions a very interesting case study, namely the model of a pacemaker, <br>\nand there are a lot of other systems which are now embedded in our body <br>\nand require investigations on modelling them using proof assistants and <br>\na step-by-step approach for constructing models, namely refinement. <br>\nResearch directions will focus on the use of proof-based modelling <br>\ntechniques like RAISE, DC, Event B, .... and intends to study the <br>\nquestions of validation, certification, maintenance, usability and <br>\nadaptability. The work will evaluate the impact of mathematical proofs <br>\nin the modelling technique and the general approach will be based on <br>\ndomain engineering and on model-based approach; we will found our work <br>\non the triptych Domain, System, Requirement. The research will involve <br>\ncollaboration with therapists and surgeons.</p>\n<p>General Informations<br>\nWe seek a PhD student with an interest in modelling, proving and <br>\ndeveloping. Modelling will be a very crucial part of the work and <br>\nstudents should have skills in using at least one formal method (RAISE, <br>\nZ, VDM, B, ...) or semi-formal method (UML,SYSML? ...). The PhD student <br>\nshould have an effective background in computer science. The language of <br>\nwork will be either french or english.<br>\nThe studentship covers living expense at £14988, and the student fee for <br>\nhome/EU students.<br>\nApplications are invited for a 3-year PhD studentship starting Autumn <br>\n2008 under the supervision of Pr Dominique Méry. This project is a <br>\ncollaboration between the MOSEL team and the University Hospital of <br>\nNancy. The student will register for a PhD in the Doctoral School IAEM <br>\n(Informatique,Automatique,Electronique,Mathématiques) of the University <br>\nHenri Poincaré Nancy 1 Department of Computer Science.<br>\nFunding Notes: Salary rate (French Ministry of Education): ca. 19200 <br>\neuros per year.<br>\nApplicants should hold at least a MSc (or equivalent) in computer <br>\nscience or in computing science . Informal inquiries can be made to <br>\nDominique Méry (<a href=\"mailto:mery@loria.fr\">mery@loria.fr</a>).<br>\nTo apply: send an application by email to Dominique Méry (<a href=\"mailto:mery@loria.fr\">mery@loria.fr</a>) <br>\nSubject: Application PhD withy the following items:<br>\n• a detailed cv<br>\n• records of results and marks in master and previous years<br>\n• name and email of two referees supporting the application<br>\n• a statement of the last degree<br>\n• any document for supporting the application</p>\n<p>Other informations:<br>\n• <a href=\"http://www.loria.fr/~mery/phd\">http://www.loria.fr/~mery/phd</a><br>\n• Ministère de l'Education Nationale et de la Recherche: <br>\n<a href=\"http://edges.sup.adc.education.fr/portailthese/resultat_these.php?region=41&amp;secteur=X&amp;theme=X&amp;valider=Ok+\">http://edges.sup.adc.education.fr/portailthese/resultat_these.php?region=41&amp;secteur=X&amp;theme=X&amp;valider=Ok+</a>&gt;</p>\n<p>The closing date is 7 June 2008</p>",
        "id": 294060997,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660823691
    }
]