[
    {
        "content": "<p>From: Ina Schaefer &lt;<a href=\"mailto:i.schaefer@tu-braunschweig.de\">i.schaefer@tu-braunschweig.de</a>&gt;<br>\nThe Carl-Friedrich-Gauß-Fakultät der Technischen Universität <br>\nBraunschweig invites applications for a</p>\n<p>University Professorship (Salary Scale W3 BBesO) in Theoretical Computer <br>\nScience</p>\n<p>starting 1 April 2016</p>\n<p>The successful candidate should be internationally well-known for <br>\nhis/her research in the area of Theoretical Computer Science. Preference <br>\nwill be given to individuals whose research interests are in one or more <br>\nof the following fields:<br>\n.    Logic and Verification (Formal Analysis, SAT-Solvers, Model <br>\nChecking, Deduction)<br>\n.    Automata, Formal Languages, Complexity, Decidability<br>\n.    Machine Learning, Knowledge Discovery, Statistical and Inductive <br>\nInference<br>\n.    Theoretical Foundations of Complex Distributed Systems</p>\n<p>Responsibilities of the future professor also include teaching <br>\nundergraduate and graduate students within the course of studies <br>\nComputer Science. The professor is expected to attract external funding <br>\nand collaborate with in the interdisciplinary environment of Technische <br>\nUniversität Braunschweig.</p>\n<p>Conditions of appointment are in accordance with § 25, Niedersachsen <br>\nHigher Education Act (NHG).</p>\n<p>Technische Universität Braunschweig is a member of Niedersachsen <br>\nInstitutes of Technology (NTH), to which the vacant professorship is <br>\nalso assigned. Candidates are therefore expected to participate in <br>\ncoordinated interdisciplinary programmes and to collaborate in research <br>\nand teaching with the universities in Niedersachsen, and especially <br>\nwithin the NTH. For more information on NTH please visit <br>\n<a href=\"http://en.nth-online.org\">http://en.nth-online.org</a>. Part time employment can be arranged on request.</p>\n<p>As an equal opportunities employer, Technische Universität Braunschweig <br>\nhas set itself the strategic aim of significantly increasing the <br>\nproportion of women. Female scientists are therefore particularly <br>\nencouraged to apply. Equally qualified candidates with disabilities will <br>\nbe given preference.</p>\n<p>The Technische Universität Braunschweig offers first-class <br>\ninfrastructure, regional, national and international cooperation in <br>\nresearch and teaching, an exciting work environment with flexible and <br>\ncompetitive personnel and budgetary management, and support in <br>\ntechnology transfer through the Innovationsgesellschaft TU Braunschweig mbH.<br>\nSuccessful candidates who have reached the age of fifty by the time of <br>\nappointment and who do not already have civil servant status will be <br>\ngiven an employment contract.</p>\n<p>Further information is available from the Head of the Search Committee <br>\nProf. Dr.-Ing. Ina Schaefer (<a href=\"mailto:i.schaefer@tu-bs.de\">i.schaefer@tu-bs.de</a>).</p>\n<p>Please submit your full application by 30. September 2014 to<br>\nTechnische Universität Braunschweig<br>\nDekan der Carl-Friedrich-Gauß-Fakultät<br>\nProf. Dr. Thomas Sonar<br>\nRebenring 58A<br>\n38106 Braunschweig, Germany<br>\n<a href=\"http://www.tu-braunschweig.de/fk1\">www.tu-braunschweig.de/fk1</a></p>",
        "id": 294288977,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660922804
    }
]