[
    {
        "content": "<p>From: Jacques Fleuriot &lt;<a href=\"mailto:jdf@inf.ed.ac.uk\">jdf@inf.ed.ac.uk</a>&gt;<br>\nResearch studentship in collaborative theorem proving</p>\n<p>A studentship is available in the School of Informatics at the University of Edinburgh. This is related to a new initiative aimed at creating a model for interactive, machine-based theorem proving that integrates collaboration as a core concept. Sites like Wikipedia, Stack Overflow and Math Overflow have proven that social web components such as i) commons-based peer production and crowd-sourcing, ii) reputation systems and iii) recommender systems can result in remarkable collaborative productivity. The focus of this studentship will be to work on these aspects in order to help harness this productivity and establish collaborative theorem proving as the 'social machine' of ITP, and thus tackle large-scale formal verification tasks.</p>\n<p>The PhD research will be supervised by Jacques Fleuriot and require the student to work in collaboration with researchers involved in the newly-funded ProofPeer project (<a href=\"http://www.proofpeer.net\">http://www.proofpeer.net</a>), which aims to explore collaborative theorem proving.</p>\n<p>Research Environment:</p>\n<p>The student will join a diverse, multi-institutional group of academic and research staff plus PhD students interested in the interaction of representation and reasoning, with a special focus on interactive theorem proving and social computing. The student will contribute to various research aspects of the ProofPeer project and its applications.</p>\n<p>Requirements:</p>\n<p>Applicants should have a strong background in logical and mathematical aspects of computer science, strong programming skills and an interest in machine learning. A relevant first degree, for example in Informatics, Computer Science, Software Engineering, Artificial Intelligence or Mathematics is also expected.</p>\n<p>Funding:</p>\n<p>Full funding of fees and maintenance is available for UK-fundable students, i.e., either UK nationals or EU nationals who have been resident in the UK for 3 years. </p>\n<p>Application deadline: 21st February 2014.<br>\nExpected start date: September 2014.</p>\n<p>Please send informal inquiries to Jacques Fleuriot (<a href=\"mailto:jdf@inf.ed.ac.uk\">jdf@inf.ed.ac.uk</a>). Formal applications must follow the School of Informatics PhD application process, which is detailed at <a href=\"http://www.ed.ac.uk/schools-departments/informatics/postgraduate/apply/overview\">http://www.ed.ac.uk/schools-departments/informatics/postgraduate/apply/overview</a>. Applicants should select the PhD programme Informatics: CISA: Centre for Intelligent Systems &amp; their Applications (CISA).</p>",
        "id": 294267257,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660915962
    }
]