[
    {
        "content": "<p>From: Lawrence Paulson &lt;<a href=\"mailto:lp15@cam.ac.uk\">lp15@cam.ac.uk</a>&gt;<br>\nI’m pleased to announce a new AFP entry, by Pasquale Noce, on the conservation of CSP noninterference security under sequential composition. Abstract and other details below. Thank you, Pasquale!</p>\n<p>And please note that the AFP has a new URL: <a href=\"http://www.isa-afp.org/\">http://www.isa-afp.org/</a></p>\n<p>The AFP has moved from SourceForge because of a lot of issues there.</p>\n<p>Larry Paulson</p>\n<p>Conservation of CSP Noninterference Security under Sequential Composition</p>\n<p>Pasquale Noce</p>\n<p>In his outstanding work on Communicating Sequential Processes, Hoare has defined two fundamental binary operations allowing to compose the input processes into another, typically more complex, process: sequential composition and concurrent composition. Particularly, the output of the former operation is a process that initially behaves like the first operand, and then like the second operand once the execution of the first one has terminated successfully, as long as it does. This paper formalizes Hoare's definition of sequential composition and proves, in the general case of a possibly intransitive policy, that CSP noninterference security is conserved under this operation, provided that successful termination cannot be affected by confidential events and cannot occur as an alternative to other events in the traces of the first operand. Both of these assumptions are shown, by means of counterexamples, to be necessary for the theorem to hold.</p>\n<p><a href=\"http://www.isa-afp.org/entries/Noninterference_Sequential_Composition.shtml\">http://www.isa-afp.org/entries/Noninterference_Sequential_Composition.shtml</a></p>",
        "id": 294672974,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661173966
    },
    {
        "content": "<p>From: Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt;<br>\nAt last!  With a delay of only 10 years after SourceForge issues started.</p>\n<p>Makarius</p>",
        "id": 294672989,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661173972
    },
    {
        "content": "<p>From: Gerwin Klein &lt;<a href=\"mailto:Gerwin.Klein@nicta.com.au\">Gerwin.Klein@nicta.com.au</a>&gt;<br>\nArchives shouldn’t move too often, so we’ve been very careful and conservative with this, but I’m happy that we have finally moved ahead.</p>\n<p>SF has had reliability issues for a long time, which Makarius is alluding to, and they’ve had malware issues more recently.</p>\n<p>The new domain <a href=\"http://isa-afp.org\">http://isa-afp.org</a> is controlled by us and should be stable for the future. Currently the site is hosted at TU Munich, but even if the physical server moves in the future, the URLs etc will remain stable.</p>\n<p>Existing links to SF in papers and other locations are redirected automatically to their counterparts on <a href=\"http://isa-afp.org\">http://isa-afp.org</a>, and we will keep maintaining a skeleton of the SF site to retain control and to make sure the redirects stay in place.</p>\n<p>Cheers,<br>\nGerwin</p>\n<hr>\n<p>The information in this e-mail may be confidential and subject to legal professional privilege and/or copyright. National ICT Australia Limited accepts no liability for any damage caused by this email or its attachments.</p>",
        "id": 294673007,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661173978
    }
]