[
    {
        "content": "<p>From: Sandrine Blazy &lt;<a href=\"mailto:Sandrine.Blazy@inria.fr\">Sandrine.Blazy@inria.fr</a>&gt;<br>\nThe Compcert project, funded by the French National Agency for<br>\nResearch in its program on the security of computer systems<br>\n(ANR-SSIA), is offering two post-doctoral positions for durations of<br>\nup to 18 months, starting in the first half of 2007.</p>\n<p>The Compcert project is concerned with the formal description of<br>\noptimizing compilers for high-level languages, including a significant<br>\nsubset of the C programming language, and computer-verified proofs of<br>\ncorrectness for these compilers.  Foundational aspects of this project<br>\ninclude the mechanization of programming language semantics and<br>\nmechanically verified proofs of correctness for functional and<br>\nimperative programs.  Most proofs and algorithms are verified using<br>\nthe Coq proof assistant.</p>\n<p>The project is looking for applicants having a solid background<br>\nin one or preferably two of the following domains:</p>\n<p>* programming language semantics,<br>\n  * compiler development,<br>\n  * computer-based proof assistants,</p>\n<p>and a real interest in the other aspects.</p>\n<p>The topics to be investigated during the post-docs range over the<br>\nscope of the project, from formal compiler verification to mechanized<br>\nsemantics to connections with other tools (program provers, static<br>\nanalyzers) used to develop high-assurance software.  For instance, we<br>\nenvision the following two topics:</p>\n<p>* A formalization of domain theory inside the type theory of the Coq<br>\n   proof assistant and a study of its applications in the development<br>\n   of correct functional programs, with a special focus on potentially<br>\n   non-terminating programs such as interpreters, debuggers, or<br>\n   semi-algorithms for optimisation problems.</p>\n<p>* A study of separation logic for the Compcert subset of the C<br>\n   programming language, including formal proofs of consistency<br>\n   between this axiomatic semantics and the operational semantics used<br>\n   in the compiler verification task.</p>\n<p>Proposals for other relevant topics are welcome and will be discussed<br>\nbetween applicants and the investigators of the Compcert project:<br>\n  Xavier Leroy (INRIA, main investigator), Yves Bertot (INRIA),<br>\n  Sandrine Blazy (ENSIIE), Pierre Courtieu (CNAM), Damien Doligez  <br>\n(INRIA),<br>\n   Pierre Letouzey (University of Paris 7), Laurence Rideau (INRIA).</p>\n<p>The positions are located either in Evry (Paris area, under the<br>\nsupervision of Sandrine Blazy) or Sophia Antipolis (Nice area, French<br>\nRiviera, under the supervision of Yves Bertot).</p>\n<p>The gross salary is around 2200 Euros per month (1800 Euros net salary<br>\nafter deduction of social benefits).</p>\n<p>To apply, please send a detailed vitae and a research statement<br>\n(indicating the topics on which you'd like to work) to the following<br>\naddress: <a href=\"mailto:compcert@yquem.inria.fr\">compcert@yquem.inria.fr</a>.  Other inquiries concerning these<br>\npositions can be sent to this address as well.</p>",
        "id": 294043002,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660816122
    }
]