[
    {
        "content": "<p>From: Sandra Alves &lt;<a href=\"mailto:sandra@dcc.fc.up.pt\">sandra@dcc.fc.up.pt</a>&gt;<br>\n(Apologies for multiple copies of this announcement. Please circulate.)</p>\n<hr>\n<p>FSCD 2019 Call for Workshop Proposals<br>\n(Formal Structures for Computation and Deduction, June 2019, Dortmund, Germany)<br>\n<a href=\"http://easyconferences.eu/fscd2019/\">http://easyconferences.eu/fscd2019/</a></p>\n<hr>\n<p>FSCD 2019 will be the fourth edition of the International Conference on Formal <br>\nStructures for Computation and Deduction. The FSCD conference was created <br>\nby the communities behind two major conferences, RTA (Rewriting Techniques <br>\nand Applications) and TLCA (Typed Lambda Calculi and Applications). The first<br>\nevent took place in Porto, Portugal in June 2016 and was extremely successful,<br>\nattracting 186 participants and 11 workshops.</p>\n<p>We invite proposals for workshops, tutorials or other satellite<br>\nevents, on any topic to related formal structures in computation and<br>\ndeduction, from theoretical foundations to tools and applications. A<br>\nfull list of suggested topics is given here:<br>\n<a href=\"http://fscdconference.org/editions/fscd-2019/cfpFSCD2019.pdf\">http://fscdconference.org/editions/fscd-2019/cfpFSCD2019.pdf</a></p>\n<p>Satellite events will take place on 24 June and 29-30 June, before and after <br>\nthe main conference on 25-28 June. It is expected that satellite events<br>\nwould run for 1 or 2 days, and be open to participants of parallel events.</p>\n<p>PROPOSALS</p>\n<p>Proposals should be submitted by email directly to the local workshop chair <br>\n<a href=\"mailto:boris.d@di.ku.dk\">boris.d@di.ku.dk</a>, with the following information:</p>\n<p>* title of the satellite event, description of the topic and its<br>\nrelevance to FSCD;</p>\n<p>* names and affiliations of the organizers;<br>\n  * pointers to information about past editions of the event, if applicable;<br>\n  * proposed event duration and format (for example, paper<br>\npresentations, tutorials, demo sessions, etc.);</p>\n<p>* plans for invited speakers or special sessions;<br>\n  * estimate of the number of participants;<br>\n  * procedures for selecting papers and participants and plans for the<br>\npublication of proceedings, if any;</p>\n<p>* tentative schedule for paper submission and notification of acceptance;<br>\n  * a brief description (up to 120 words) of the event for the website<br>\nand publicity material;</p>\n<p>* any other special requirements.</p>\n<p>The organizers of satellite events are expected to create and maintain<br>\na website for the event; handle paper selection, reviewing and<br>\nacceptance; draw up a programme of talks; advertise their event though<br>\nspecialist mailing lists; prepare the informal pre-proceedings (if<br>\napplicable) in a timely fashion; and arrange any post-proceedings.</p>\n<p>The FSCD 2019 organizing committee will handle promotion of the event<br>\non the main conference website; integration of the event's programme<br>\ninto the overall timetable; registration of participants; arrangement <br>\nof an appropriate meeting room; and provision of lunch and coffee <br>\nbreaks for participants. We will waive the registration fees for <br>\ninvited speakers to satellite events.</p>\n<p>IMPORTANT DATES</p>\n<p>Submission of workshop proposals: November 30, 2019<br>\nNotification of success of proposals: January 13, 2019<br>\nMain conference: June 25-28, 2019<br>\nWorkshop dates: June 24 and June 29-30, 2019</p>\n<p>Best wishes,<br>\nBoris Düdder<br>\n<a href=\"https://di.ku.dk/english/staff/?pure=en/persons/575423\">https://di.ku.dk/english/staff/?pure=en/persons/575423</a></p>",
        "id": 294746683,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661193753
    }
]