[
    {
        "content": "<p>From: Otmane Ait Mohamed &lt;<a href=\"mailto:ait@encs.concordia.ca\">ait@encs.concordia.ca</a>&gt;<br>\nFIRST CALL FOR PARTICIPATION</p>\n<p>21st International Conference on Theorem Proving in<br>\n              Higher Order Logics<br>\n                (TPHOLs 2008)</p>\n<p><a href=\"http://www.ece.concordia.ca/TPHOLs2008\">http://www.ece.concordia.ca/TPHOLs2008</a><br>\n<a href=\"mailto:tphols08@ece.concordia.ca\">tphols08@ece.concordia.ca</a></p>\n<p>August 18-21, 2008, Montreal, Quebec, Canada</p>\n<p>The 2008 International Conference on Theorem Proving in Higher Order<br>\nLogics will be the 21st in a series that dates back to 1988. The<br>\nconference will be held in Montreal, Quebec, Canada, on 18-21 August 2008.</p>\n<p>REGISTRATION</p>\n<p>Registration is now open.  Please visit the TPHOLs 2008 web site,<br>\n<a href=\"http://www.ece.concordia.ca/TPHOLs2008/\">http://www.ece.concordia.ca/TPHOLs2008/</a>, to register.</p>\n<p>INVITED SPEAKERS</p>\n<p>Mike Gordon, University of Cambridge, UK.</p>\n<p>Twenty Years of Theorem Proving for HOLs</p>\n<p>Steve Miller, Advanced Technology Center, Rockwell Collins, USA</p>\n<p>Will This Be Formal?</p>\n<p>INVITED TUTORIALS</p>\n<p>Konrad Slind. A Brief Overview of HOL4</p>\n<p>Sam Owre. A Brief Overview of PVS</p>\n<p>Makarius Wenzel. The Isabelle Framework</p>\n<p>Yves Bertot. A short presentation of Coq</p>\n<p>Matt Kaufmann. An ACL2 Tutorial</p>\n<p>ACCOMMODATION</p>\n<p>Information on accommodation is available on the TPHOLs 2008<br>\nweb site (click on the registration tab).</p>\n<p>RELATED EVENTS</p>\n<p>On Friday 22 August, the day after TPHOLs 2008 finishes, the UITP<br>\nWorkshop on User Interfaces for Theorem Proving will take place.<br>\nFurther information on the UITP workshop<br>\ncan be found at <a href=\"http://www.informatik.uni-bremen.de/~cxl/uitp/\">http://www.informatik.uni-bremen.de/~cxl/uitp/</a></p>\n<p>SPONSORS</p>\n<p>TPHOLs 2008 is sponsored by the following organizations:</p>\n<p>o ENCS<br>\n o NIA<br>\n o Intel<br>\n o RESMIQ<br>\n o Concordia University</p>\n<p>CONTACT</p>\n<p>Enquiries concerning the conference should be emailed to<br>\n<a href=\"mailto:tphols08@ece.concordia.ca\">tphols08@ece.concordia.ca</a></p>\n<p>OUTLINE PROGRAMME</p>\n<p>Monday 18th, Tuesday 19th: Technical sessions.</p>\n<p>Wednesday 20th: Technical sessions; excursion; conference dinner.</p>\n<p>Thursday 21st: Technical sessions.</p>\n<p>Friday 22nd : UITP workshop.</p>\n<p>The preliminary programme is available on the conference web site.</p>\n<p>VENUE</p>\n<p>TPHOLs'08 will be be held at the new 19-storey (two underground floors)<br>\nConcordia Engineering &amp; Computer Science building, home of the Engenering<br>\nand Computer Science faculty. The building is located in downtown<br>\nMontreal, an irresistible blend of European charm and<br>\nNorth American effervescence, Montreal's architecture enchants the visitor<br>\nwith its harmonious contrast of old and new. With some 3.7 million inhabitants<br>\nand 80 distinct ethnic cultures, Montal is a resolutely international city.<br>\nA world leader in a wide range of industries, including aeronautics,<br>\ninformation technology and biotechnologies, the city is also renowned for innovation<br>\nin medicine, multimedia and arts.  Getting around the city on a day-to-day basis is hassle-free.<br>\nIts streets, underground pedestrian network and subway system are safe and easy to navigate.<br>\nMontalers are naturally charming and quite often multilingual, always ready to strike up a<br>\nconversation and share a moment of friendship. This spontaneous hospitality has made Montal<br>\nthe site of many exciting international festivals, which - much like the city and its<br>\ninhabitants - are a manifestation of pure passion!<br>\n(<a href=\"http://www.concordia.ca/about/whereweare/montreal/\">http://www.concordia.ca/about/whereweare/montreal/</a>)</p>\n<p>ACCEPTED REGULAR PAPERS</p>\n<p>Klaus Aehlig, Florian Haftmann and Tobias Nipkow.<br>\n    A Compiled Implementation of Normalization by Evaluation</p>\n<p>Daniel Wasserrab and Andreas Lochbihler.<br>\n    Formalizing a Framework for Dynamic Slicing of Program Dependence Graphs in Isabelle/HOL</p>\n<p>Ana Bove and Venanzio Capretta.<br>\n    A Type of Partial Recursive Functions</p>\n<p>Sascha Bhme, Rustan Leino and Burkhart Wolff.<br>\n    HOL-Boogie --- An Interactive Prover for the Boogie Program-Verifier</p>\n<p>Lukas Bulwahn, Alexander Krauss, Florian Haftmann, Levent Erkok and John Matthews.<br>\n    Imperative Functional Programming with Isabelle/HOL</p>\n<p>David Cock, Gerwin Klein and Thomas Sewell.<br>\n    Secure Microkernels, State Monads and Scalable Refinement</p>\n<p>David Lester.<br>\n    Real Number Calculations and Theorem Proving: Validation and Use of an Exact Arithmetic</p>\n<p>Holger Gast.<br>\n    Lightweight Separation</p>\n<p>Hasan Amjad.<br>\n    LCF-style Propositional Simplification With BDDs and SAT Solvers</p>\n<p>Jens Brandt and Klaus Schneider.<br>\n    Formal Reasoning about Causality Analysis</p>\n<p>Pierre Courtieu, Julien Forest and Xavier Urbain.<br>\n    Certifying a Termination Criterion Based on Graphs, without Graphs</p>\n<p>Matthieu Sozeau and Nicolas Oury.<br>\n    First-Class Type Classes</p>\n<p>Yves Bertot, Georges Gonthier, Sidi Ould Biha and Ioana Pasca.<br>\n    Canonical Big Operators</p>\n<p>Stefan Berghofer and Christian Urban.<br>\n    Nominal Inversion Principles</p>\n<p>Polyvios Pratikakis, Jeff Foster, Michael Hicks and Iulian Neamtiu.<br>\n    Formalizing Soundness of Contextual Effects</p>\n<p>Laurent Thery.<br>\n    Proof Pearl: Revisiting the Mini-Rubik in Coq</p>\n<p>Russell O'Connor.<br>\n    Certified Exact Transcendental Real Number Computation in Coq</p>\n<p>Sayan Mitra and K. Mani Chandy.<br>\n    A Formalized Theory for Verifying Stability and Convergence of Automata in PVS</p>",
        "id": 294061522,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660823875
    }
]