[
    {
        "content": "<p>From: Bohua Zhan &lt;<a href=\"mailto:bzhan@mit.edu\">bzhan@mit.edu</a>&gt;<br>\nHi, everyone</p>\n<p>Recently I have been working on writing a new theorem prover based on<br>\nIsabelle. This is the first time I think it is in good enough shape to<br>\nbe made public. It is now available at</p>\n<p><a href=\"https://github.com/bzhan/auto2\">https://github.com/bzhan/auto2</a></p>\n<p>An informal documentation (doc.pdf) is also available.</p>\n<p>It is still more of a \"proof-of-concept\" than anything that can be<br>\nused in production. The focus has been on reproducing the proof of<br>\nselected theorems in HOL/Number_Theory/Primes.thy. A lot of work will<br>\nbe needed to extend it to be able to prove a wide range of theorems.</p>\n<p>I am posting it here to see if there are any suggestions, things that<br>\nare known that could help with this project, or (even better)<br>\ncontributions. I can also answer questions about the program here. In<br>\nparticular please point out anything that is confusing or need to be<br>\nelaborated on in the documentation.</p>\n<p>Thanks,<br>\nBohua</p>",
        "id": 294329580,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660929778
    },
    {
        "content": "<p>From: Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt;<br>\nOn Mon, 16 Mar 2015, Bohua Zhan wrote:</p>\n<blockquote>\n<p>Recently I have been working on writing a new theorem prover based on <br>\nIsabelle.</p>\n</blockquote>\n<p>I was first confused by this wording, but \"auto2\" seems to be a plain <br>\nproof tool inside Isabelle, i.e. just a normal application of the existing <br>\nframework.</p>\n<blockquote>\n<p><a href=\"https://github.com/bzhan/auto2\">https://github.com/bzhan/auto2</a></p>\n</blockquote>\n<p>I recommend to add a formal session ROOT to make clear what is the project <br>\nstructure.  See also \"isabelle mkroot\" in the \"system\" manual.</p>\n<p>BTW, using some unspecified \"development version of Isabelle\" means this <br>\nis mainly a private experiment of yours.  I you have good reasons for not <br>\nusing the latest Isabelle release (Which ones?) the minimum is to say <br>\nwhich changeset id of the Isabelle repository is required.  It is also <br>\npossible to make a formal Mercurial subrepository reference (in a <br>\nMercurial repository, probably not a git one).</p>\n<blockquote>\n<p>I am posting it here to see if there are any suggestions, things that<br>\nare known that could help with this project, or (even better)<br>\ncontributions.</p>\n</blockquote>\n<p>Just some notes from looking briefly:</p>\n<ul>\n<li>\n<p>Theory names are always capitalized in Isabelle.</p>\n</li>\n<li>\n<p>The @{term_pat} antiqutation is a bit strange.  If you really mean to<br>\n   refer to schematic terms, you should say so via<br>\n   Proof_Context.mode_schematic, and not Proof_Context.mode_pattern.</p>\n<p>Makarius</p>\n</li>\n</ul>",
        "id": 294329598,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660929783
    },
    {
        "content": "<p>From: Bohua Zhan &lt;<a href=\"mailto:bzhan@mit.edu\">bzhan@mit.edu</a>&gt;<br>\nHi, Makarius</p>\n<p>Thanks. Updated with capitalization of theory names, and moved to<br>\nsupport Isabelle2014.</p>\n<p>It seems when a schematic variable without specified type is read in<br>\nmode_schematic, the type is set to be a free variable rather than<br>\nschematic variable. I would actually prefer it to be schematic, since<br>\nthere is potential for type matchings.</p>\n<p>I will need more time to figure out mkroot. The general structure is:<br>\nAuto2 depends on Arith_Thms, Logic_Thms<br>\nAuto2_Test depends on Auto2 (unit testing)<br>\nPrimes_Ex depends on Auto2.</p>\n<p>Best,<br>\nBohua</p>",
        "id": 294329617,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660929789
    },
    {
        "content": "<p>From: Jasmin Blanchette &lt;<a href=\"mailto:jasmin.blanchette@inria.fr\">jasmin.blanchette@inria.fr</a>&gt;<br>\nDear Bohua,</p>\n<p>This looks interesting. What I would be curious to see is how “auto2” performs with respect to other Isabelle automation (“auto”, “blast”, etc., and “sledgehammer”). The paper “Sledgehammer: Judgement Day” by Böhme and Nipkow applied Sledgehammer to 1240 goals from Isabelle theories, using a tool called Mirabelle, included with Isabelle. It would be fairly straightforward to extend Mirabelle with “auto2” and perform some comparisons. Please let me know if this interests you and I can help you get started with Mirabelle.</p>\n<p>Cheers,</p>\n<p>Jasmin</p>",
        "id": 294647637,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661164739
    },
    {
        "content": "<p>From: Bohua Zhan &lt;<a href=\"mailto:bzhan@mit.edu\">bzhan@mit.edu</a>&gt;<br>\nHi, Jasmin</p>\n<p>The intention (not to say it is realized) is that auto2 should be<br>\nstronger than auto and blast, perhaps comparable to an SMT solver. The<br>\nway auto2 matches terms with patterns (up to rewriting the term using<br>\nknown equalities) is similar to what is done in SMT, although I would<br>\nthink the overall idea is different.</p>\n<p>One difficulty with directly comparing auto2 and sledgehammer tools is<br>\nthat auto2 needs each theorem it uses to be registered by hand,<br>\nspecifying which direction it is to be used and under what conditions<br>\n(this is done for some theorems in logic, arithmetic, and sets in<br>\ntheories Logic_Thms, Arith_Thms, and Set_Thms). Naively adding all<br>\ntheorems in all directions will make auto2 very inefficient. Also,<br>\nauto2 works directly with statements in HOL rather than in first-order<br>\nlogic (the point is to work as closely as possible to what a human<br>\nsees).</p>\n<p>On the other hand, I think it would be very interesting to try to use<br>\nauto2 to formalize different theories, such as the 7 examples in the<br>\nreference you gave. The goal is to use auto2 to prove all major<br>\ntheorems, with hints provided in the form of intermediate steps of the<br>\nproof. The hints should be no more detailed than what would appear in<br>\nan informal proof in a textbook. If this cannot be done, it may point<br>\ntoward some improvements in auto2 that can be made.</p>\n<p>Best,<br>\nBohua</p>",
        "id": 294648615,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661165168
    },
    {
        "content": "<p>From: Bohua Zhan &lt;<a href=\"mailto:bzhan@mit.edu\">bzhan@mit.edu</a>&gt;<br>\nHi, everyone</p>\n<p>I have uploaded the second version of auto2 at<br>\n<a href=\"https://github.com/bzhan/auto2\">https://github.com/bzhan/auto2</a></p>\n<p>It now supports Isabelle2015. The biggest internal addition is proof<br>\nscripts, which allows the user to specify intermediate steps of a<br>\nproof, similar to (but currently independent from) Isar. There is also<br>\nmuch better support for induction.</p>\n<p>There are now more examples from different areas:</p>\n<ul>\n<li>Number theory: infinitude of primes and unique factorization theorem.</li>\n<li>Lists, trees, and red-black trees.</li>\n<li>Hoare logic.</li>\n</ul>\n<p>Please see README and the updated documentation for details. Again I<br>\nwould welcome any comments and suggestions.</p>\n<p>Best,<br>\nBohua</p>",
        "id": 294649054,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661165347
    }
]