[
    {
        "content": "<p>From: Alwen Tiu &lt;<a href=\"mailto:alwen.tiu@gmail.com\">alwen.tiu@gmail.com</a>&gt;<br>\n[Apology for multiple postings]</p>\n<p>One postdoc position is available at the School of Computer Engineering,<br>\nNanyang Technological University (NTU)  Singapore, for a project on<br>\nhardware verification.</p>\n<p>Candidates must possess a PhD degree in Computer Science or related areas.<br>\nThe position is part of a larger project on formal verification of hardware<br>\nand software systems at NTU. For this particular position, the postdoc is<br>\nexpected to work on building formal models of hardware description<br>\nlanguages, and verifying the correctness of hardware designs. Candidates<br>\nfor the position must have experience in theorem proving tools. Candidates<br>\nwith knowledge of hardware design language are preferred. The salary range<br>\nis between SGD 4000 - 6000 per month.</p>\n<p>The position will be initially offered for one year, but can be extended up<br>\nto four years, subject to satisfactory performance and availability of<br>\nfunding.</p>\n<p>To apply for the position, please send a cover letter and your latest CV<br>\n(please indicate names of three referees in your CV) by email to Alwen Tiu (<br>\n<a href=\"mailto:atiu@ntu.edu.sg\">atiu@ntu.edu.sg</a>, <a href=\"mailto:alwen.tiu@gmail.com\">alwen.tiu@gmail.com</a>). Applications will be accepted until<br>\nthe position is filled, but to ensure the full consideration of your<br>\napplication, please send your application by 21 February 2016. Only<br>\nshortlisted candidates will be notified of the results of their<br>\napplications. The selected candidate is expected to commence in April 2016.</p>\n<p>If you have any further questions regarding the position and/or the<br>\nproject, please email <a href=\"mailto:atiu@ntu.edu.sg\">atiu@ntu.edu.sg</a>.</p>\n<p>Regards,<br>\nAlwen Tiu</p>",
        "id": 294662382,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661170407
    }
]