[
    {
        "content": "<p>From: ducis &lt;<a href=\"mailto:ducis_cn@126.com\">ducis_cn@126.com</a>&gt;<br>\nHello,<br>\n       I am trying to encapsulate matrices/vectors/arrays/lists as functions, similar to the matrices in<br>\nGauss-Jordan Elimination for Matrices Represented as Functions, but without passing the dimensions<br>\nexplicitly.<br>\nFor example,</p>\n<hr>\n<p>definition \"l2f (xs::'a list) = (λ (i::nat) . xs ! i)\"<br>\nvalue \"let a = l2f [10,11,12,13::real] in a 1\"</p>\n<hr>\n<p>Is it possible to define some<br>\n\"( nat =&gt; 'a ) =&gt; nat\" (the size of the original list)<br>\nor<br>\n\"( nat =&gt; 'a ) =&gt; (nat × nat) \" or \"( nat =&gt; 'a ) =&gt; nat set\" (the domain of the function) ?</p>\n<p>If it is impossible to define a computable one, is it possible to define an incomputable specifictaion?</p>\n<p>Du</p>",
        "id": 294721848,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661185086
    },
    {
        "content": "<p>From: David Cock &lt;<a href=\"mailto:david.cock@inf.ethz.ch\">david.cock@inf.ethz.ch</a>&gt;<br>\nDu,</p>\n<p>The \"function from indices to values\" form throws away information, <br>\nso you've got to supply it back when you try to invert.  There's no way <br>\nto extract the \"length\" of the original list from the function, as it's <br>\ngot to be well defined for every possible index (functions in HOL are <br>\ntotal, even if the result isn't visibly defined).  Your l2f function <br>\nreturns <em>some</em> value a for <em>any</em> index i that you pass it.</p>\n<p>One way of encoding the information you want might be a partial <br>\nfunction, that's only defined for those indices in the original list, <br>\nbut that's likely to be less convenient to work with.  Even then, you <br>\nneed to \"know\" that the function came from a list in order to find the <br>\nlength (to take, say, the largest index for which the output isn't None, <br>\nyou'll need to supply a proof that there <em>is</em> such a maximum).</p>\n<p>David</p>",
        "id": 294721851,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661185087
    }
]