[
    {
        "content": "<p>From: <a href=\"mailto:A.Beckmann@swansea.ac.uk\">A.Beckmann@swansea.ac.uk</a><br>\nFinal call for papers!</p>\n<hr>\n<p>COMPUTABILITY IN EUROPE 2010: Programs, Proofs, Processes<br>\n                   Ponta Delgada (Azores), Portugal<br>\n                       June 30 to July 4, 2010<br>\n<a href=\"http://www.cie2010.uac.pt/\">http://www.cie2010.uac.pt/</a></p>\n<p>Deadline for submissions: 20 JANUARY 2010</p>\n<hr>\n<p>Computability in Europe provides the largest international conference <br>\ndealing with the full spectrum of computability-related research.</p>\n<p>CiE 2010 in the Azores is the sixth conference of the Series, held in a <br>\ngeographically unique and dramatic location, Europe's most Westerly <br>\noutpost. The theme of CiE 2010 - \"Programs, Proofs, Processes\" - points to <br>\nthe usual CiE synergy of Computer Science, Mathematics and Logic, with <br>\nimportant computability-theoretic connections to science and the real <br>\nuniverse.</p>\n<p>TUTORIALS: Jeffrey Bub (Information, Computation and Physics),<br>\nBruno Codenotti (Computational Game Theory).</p>\n<p>INVITED SPEAKERS: Eric Allender, Jose L. Balcazar, Shafi Goldwasser, Denis <br>\nHirschfeldt, Seth Lloyd, Sara Negri, Toniann Pitassi, and Ronald de Wolf.</p>\n<p>SPECIAL SESSIONS on:</p>\n<p>Biological Computing, organizers: Paola Bonizzoni, Krishna Narayanan<br>\nInvited speakers: Giancarlo Mauri, Natasha Jonoska, Stephane Vialette, <br>\nYasubumi Sakakibara</p>\n<p>Computational Complexity, organizers: Luis Antunes, Alan Selman<br>\nInvited speakers: Eric Allender, Christian Glasser, John Hitchcock, Rahul <br>\nSanthanam</p>\n<p>Computability of the Physical, organizers: Barry Cooper, Cris Calude<br>\nInvited speakers: Giuseppe Longo, Yuri Manin, Cris Moore, David Wolpert</p>\n<p>Proof Theory and Computation, organizers: Martin Hyland, Fernando Ferreira<br>\nInvited speakers: Thorsten Altenkirch, Samuel Mimram, Paulo Oliva, Lutz <br>\nStrassburger</p>\n<p>Reasoning and Computation from Leibniz to Boole, organizers: Benedikt Loewe, <br>\nGuglielmo Tamburrini<br>\nConfirmed speakers: Volker Peckhaus, Olga Pombo, Sara Uckelman</p>\n<p>Web Algorithms and Computation, organizers: Martin Olsen, Thomas Erlebach<br>\nConfirmed speaker: Debora Donato</p>\n<p>SPECIAL TRIBUTE TO MARIAN POUR-EL: Ning Zhong.</p>\n<p>CiE serves as an interdisciplinary forum for research in all aspects of <br>\ncomputability and foundations of computer science, as well as the <br>\ninterplay of these theoretical areas with practical issues in computer <br>\nscience and with other disciplines such as biology, mathematics, <br>\nphilosophy, or physics.</p>\n<p>Formal systems, attendant proofs, and the possibility of their computer <br>\ngeneration and manipulation (for instance, into programs) have been <br>\nchanging a whole spectrum of disciplines. The conference will address not <br>\nonly the more established lines of research of Computational Complexity <br>\nand the interplay between Proofs and Computation, but also novel views <br>\nthat rely on physical and biological processes and models to find new ways <br>\nof tackling computations and improving their efficiency.</p>\n<p>We particularly invite papers that build bridges between different parts <br>\nof the research community. Since women are underrepresented in mathematics <br>\nand computer science, we emphatically encourage submissions by female <br>\nauthors. The Elsevier Foundation is supporting the CiE conference series <br>\nin the programme \"Increasing representation of female researchers in the <br>\ncomputability community\". This programme will allow us to fund child-care <br>\nsupport, a mentoring system for young female researchers, and also a small <br>\nnumber of grants for junior female researchers (see below).</p>\n<p>The dates around the submission process are as follows:</p>\n<p>Submission Deadline: 20 January 2010<br>\nNotification to Authors: 18 March 2010<br>\nDeadline for Final Version: 8 April 2010</p>\n<p>CiE 2010 conference topics include, but not exclusively:</p>\n<ul>\n<li>Admissible sets</li>\n<li>Analog computation</li>\n<li>Artificial intelligence</li>\n<li>Automata theory</li>\n<li>Classical computability and degree structures</li>\n<li>Computability theoretic aspects of programs</li>\n<li>Computable analysis and real computation</li>\n<li>Computable structures and models</li>\n<li>Computational and proof complexity</li>\n<li>Computational complexity</li>\n<li>Computational learning and complexity</li>\n<li>Concurrency and distributed computation</li>\n<li>Constructive mathematics</li>\n<li>Cryptographic complexity</li>\n<li>Decidability of theories</li>\n<li>Derandomization</li>\n<li>Domain theory and computability</li>\n<li>Dynamical systems and computational models</li>\n<li>Effective descriptive set theory</li>\n<li>Finite model theory</li>\n<li>Formal aspects of program analysis</li>\n<li>Formal methods</li>\n<li>Foundations of computer science</li>\n<li>Games</li>\n<li>Generalized recursion theory</li>\n<li>History of Computing</li>\n<li>Hybrid systems</li>\n<li>Higher type computability</li>\n<li>Hypercomputational models</li>\n<li>Infinite time Turing machines</li>\n<li>Kolmogorov complexity</li>\n<li>Lambda and combinatory calculi</li>\n<li>L-systems and membrane computation</li>\n<li>Mathematical models of emergence</li>\n<li>Molecular computation</li>\n<li>Natural computing</li>\n<li>Neural nets and connectionist models</li>\n<li>Philosophy of science and computation</li>\n<li>Physics and computability</li>\n<li>Probabilistic systems</li>\n<li>Process algebra</li>\n<li>Programming language semantics</li>\n<li>Proof mining</li>\n<li>Proof theory and computability</li>\n<li>Quantum computing and complexity</li>\n<li>Randomness</li>\n<li>Reducibilities and relative computation</li>\n<li>Relativistic computation</li>\n<li>Reverse mathematics</li>\n<li>Swarm intelligence</li>\n<li>Type systems and type theory</li>\n<li>Uncertain reasoning</li>\n<li>Weak arithmetics and applications</li>\n</ul>\n<p>Contributed papers will be selected from submissions received by the <br>\nPROGRAMME COMMITTEE consisting of:</p>\n<p>Klaus Ambos-Spies (Heidelberg), Luis Antunes (Porto), Arnold Beckmann <br>\n(Swansea), Paola Bonizzoni (Milano), Alessandra Carbone (Paris), Steve <br>\nCook (Toronto ON), Barry Cooper (Leeds), Erzsebet Csuhaj-Varju (Budapest), <br>\nFernando Ferreira (Lisbon, co-chair), Nicola Galesi (Rome), Luis Mendes <br>\nGomes (Ponta Delgada), Rosalie Iemhoff (Utrecht), Achim Jung (Birmingham), <br>\nMichael Kaminski (Haifa), Jarkko Kari (Turku), Viv Kendon (Leeds), James <br>\nLadyman (Bristol), Kamal Lodaya (Chennai), Giuseppe Longo (Paris), <br>\nBenedikt Loewe (Amsterdam), Elvira Mayordomo (Zaragoza, co-chair), <br>\nWolfgang Merkle (Heidelberg), Russell Miller (New York NY), Dag Normann <br>\n(Oslo), Isabel Oitavem (Lisbon), Joao Rasga (Lisbon), Nicole Schweikardt <br>\n(Frankfurt), Alan Selman (Buffalo NY), Peter van Emde Boas (Amsterdam), <br>\nAlbert Visser (Utrecht)</p>\n<p>The Programme Committee cordially invites all researchers in the area of <br>\nthe conference to submit their papers (in PDF-format, at most 10 pages) <br>\nfor presentation at CiE 2010.</p>\n<p>The best of the accepted papers will be published in the conference <br>\nproceedings within the Lecture Notes in Computer Science (LNCS) series of <br>\nSpringer, which will be available at the conference. Authors of accepted <br>\npapers are expected to present their work at the conference. Submitted <br>\npapers must describe work not previously published, and they must neither <br>\nbe accepted nor under review at a journal or at another conference with <br>\nrefereed proceedings.</p>\n<p>All papers need to be prepared in LNCS-style LaTeX. Papers must not exceed <br>\n10 pages. Full proofs may appear in a technical appendix which will be <br>\nread at the reviewers' discretion. Submissions authored or co-authored by <br>\nmembers of the Programme Committee are not allowed.</p>\n<p>Papers that have only student authors are eligible for the \"CiE 2010 Best <br>\nStudent Paper Award.\" If your submission satisfies the requirements, <br>\nplease submit your paper in the category \"Regular paper (eligible for Best <br>\nStudent Paper Award).\" The Programme Committee will select the best <br>\nsubmission among these after acceptance. The recipient of the Best Student <br>\nPaper Award will get a fee waiver of the registration fee, a certificate, <br>\nand a small symbolic cash prize.</p>\n<p>Funded by the Elsevier Foundation's programme 'Women in Computability' we <br>\nshall offer five travel grants (covering registration fee and up to 300 <br>\nEUR in reimbursement for travel and accomodation expenses) for junior <br>\nfemale researchers. More information will become available in March 2010.</p>\n<p>Funded by the Elsevier journal Annals of Pure and Applied Logic (APAL), <br>\nthe organizers are offering a number of travel grants (including fee <br>\nwaivers and a modest reimbursement of travel and accommodation expenses) <br>\nfor students to attend CiE 2010. Student authors of accepted papers will <br>\nhave priority for these grants.</p>\n<p>The Association for Symbolic Logic (ASL) sponsors modest student member <br>\ntravel grants. See <a href=\"http://www.aslonline.org/studenttravelawards.html\">http://www.aslonline.org/studenttravelawards.html</a></p>\n<p>New funding opportunities are expected to be offered. For more details <br>\nconcerning funding and up to date information, please consult regularly <br>\nthe web page of the conference <a href=\"http://www.cie2010.uac.pt/\">http://www.cie2010.uac.pt/</a></p>\n<hr>\n<p>ASSOCIATION COMPUTABILITY IN EUROPE      <a href=\"http://www.computability.org.uk\">http://www.computability.org.uk</a><br>\n  CiE Conference Series                         <a href=\"http://www.illc.uva.nl/CiE\">http://www.illc.uva.nl/CiE</a><br>\n  CiE 2010                                      <a href=\"http://www.cie2010.uac.pt/\">http://www.cie2010.uac.pt/</a><br>\n  CiE Membership Application Form            <a href=\"http://www.cs.swan.ac.uk/acie\">http://www.cs.swan.ac.uk/acie</a><br>\n  CiE on Twitter                         <a href=\"http://twitter.com/AssociationCiE\">http://twitter.com/AssociationCiE</a></p>\n<hr>",
        "id": 294098005,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660832903
    }
]