[
    {
        "content": "<p>From: Florian Lonsing &lt;<a href=\"mailto:florian.lonsing@tuwien.ac.at\">florian.lonsing@tuwien.ac.at</a>&gt;<br>\n[We apologize if you receive multiple copies of this call]</p>\n<hr>\n<p>CALL FOR PAPERS</p>\n<p>QUANTIFY 2015<br>\n                   --------<br>\n           International Workshop on<br>\n                QUANTIFICATION</p>\n<p>Berlin, Germany, August 1, 2015<br>\n<a href=\"http://fmv.jku.at/quantify15/\">http://fmv.jku.at/quantify15/</a></p>\n<p>Affiliated to and co-located with:<br>\n              CADE 2015 conference<br>\n        Berlin, Germany, August 1-7, 2015<br>\n<a href=\"http://conference.mi.fu-berlin.de/cade-25/home\">http://conference.mi.fu-berlin.de/cade-25/home</a></p>\n<hr>\n<p>Quantifiers play an important role in language extensions of many<br>\nlogics.  The use of quantifiers often allows for a more succinct<br>\nencoding as it would be possible without quantifiers. However, the<br>\nintroduction of quantifiers affects the complexity of the extended<br>\nformalism in general.  Consequently, theoretical results established<br>\nfor the quantifier-free formalism may not directly be transferred to<br>\nthe quantified case. Further, techniques successfully implemented in<br>\nreasoning tools for quantifier-free formulas cannot directly be lifted<br>\nto a quantified version.</p>\n<p>The goal of the 2nd International Workshop on Quantification (QUANTIFY<br>\n2015) is to bring together researchers who investigate the impact of<br>\nquantification from a theoretical as well as from a practical point of<br>\nview. Quantification is a topic in different research areas such as in<br>\nSAT in terms of QBF, in CSP in terms of QCSP, in SMT, etc. This<br>\nworkshop has the aim to provide an interdisciplinary forum where<br>\nresearchers of various fields may exchange their experiences.</p>\n<p>===============<br>\nINVITED SPEAKER<br>\n===============</p>\n<p>Olaf Beyersdorff, University of Leeds</p>\n<p>===============<br>\nIMPORTANT DATES<br>\n===============</p>\n<p>Please follow <a href=\"http://fmv.jku.at/quantify15/\">http://fmv.jku.at/quantify15/</a> for any updates.</p>\n<p>May    8 2015: paper submission<br>\nMay   29 2015: notification of acceptance<br>\nJune  23 2015: camera-ready version of papers<br>\nAugust 1 2015: workshop</p>\n<p>==================<br>\nTOPICS OF INTEREST<br>\n==================</p>\n<p>The workshop is concerned with all theoretical and practical aspects<br>\nof quantification in logics such as QBF, QCSP, SMT, and theorem<br>\nproving. The topics of interest include (but are not limited to):</p>\n<ul>\n<li>Complexity results</li>\n<li>Encodings with and without quantification and comparisons thereof</li>\n<li>Applications of quantification</li>\n<li>Implementations of reasoning tools</li>\n<li>Case studies and experimental results</li>\n<li>\n<p>Intersections between the different research communities working on<br>\n   quantification</p>\n</li>\n<li>\n<p>Surveys of state-of-the-art approaches to handling quantification</p>\n</li>\n</ul>\n<p>================================<br>\nSUBMISSION OF EXTENDED ABSTRACTS<br>\n================================</p>\n<p>Submissions of extended abstracts are solicited and will be managed<br>\nvia Easychair:</p>\n<p><a href=\"https://easychair.org/conferences/?conf=quantify15\">https://easychair.org/conferences/?conf=quantify15</a></p>\n<p>Submitted papers should be formatted in either LNCS format or a<br>\nstandard LaTeX article format (paper size A4, font size 11pt).</p>\n<p>We solicit two types of submissions:</p>\n<ol>\n<li>\n<p>Talk abstracts (maximum two pages, excluding references) describing<br>\nalready published results.</p>\n</li>\n<li>\n<p>Full papers (maximum 14 pages, excluding references) on novel,<br>\nunpublished work.</p>\n</li>\n</ol>\n<p>The talk abstracts of category 1 should include a relevant<br>\nbibliography of related work and an outline of the planned talk.  For<br>\nthis category, we explicitly advocate talks which survey results<br>\nalready published, maybe in multiple articles or presentations<br>\ncapturing the commonalities and differences of various quantification<br>\napproaches (perhaps even interdisciplinary).</p>\n<p>Each submission will be assessed by the program committee and the<br>\nworkshop organizers with respect to novelty, originality, and scope.</p>\n<p>Submissions related to completed work as well as work in progress are<br>\nwelcome. Authors are encouraged to provide additional material such as<br>\nsource code of tools, experimental data, benchmarks and related<br>\npublications in an appendix or a related webpage. The additional<br>\nmaterial will be considered at the discretion of the reviewers.</p>\n<p>Previously published work or extensions thereof may be submitted to<br>\nthe workshop but that case has to be explicitly stated in the<br>\nsubmitted paper. This regulation also applies to work which is<br>\ncurrently under review elsewhere.</p>\n<p>Since the workshop does not have official proceedings, work related to<br>\naccepted submissions can be resubmitted to other venues without<br>\nrestrictions.</p>\n<p>Authors of accepted abstracts and papers are expected to give a talk<br>\nat the workshop.</p>\n<p>===============<br>\nWORKSHOP REPORT<br>\n===============</p>\n<p>Accepted extended abstracts are collected in an informal report which<br>\nwill be publicly available at the workshop's website.</p>\n<p>==============<br>\nPROGRAM CHAIRS<br>\n==============</p>\n<p>Hubie Chen, Universidad del Pais Vasco and Ikerbasque<br>\nFlorian Lonsing, Vienna University of Technology, Austria<br>\nMartina Seidl, Johannes Kepler University Linz, Austria</p>\n<p>=================<br>\nPROGRAM COMMITTEE<br>\n=================</p>\n<p>Olaf Beyersdorff, University of Leeds<br>\nNikolaj Bjorner, Microsoft Research<br>\nJasmin Blanchette, TU Munich<br>\nMikolas Janota, INESC-ID Lisboa<br>\nLaura Kovacs, Chalmers University of Technology<br>\nFrancesco Scarcello, DIMES, University of Calabria<br>\nChristoph Wintersteiger, Microsoft Research</p>",
        "id": 294329076,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660929613
    }
]