[
    {
        "content": "<p>From: Dale Miller &lt;<a href=\"mailto:dale@lix.polytechnique.fr\">dale@lix.polytechnique.fr</a>&gt;<br>\nCall For Papers --- IJCAR 2012<br>\n        6th International Joint Conference on Automated Reasoning<br>\n                     Manchester, UK, June 26-July 1, 2012<br>\n<a href=\"http://ijcar.cs.manchester.ac.uk/\">http://ijcar.cs.manchester.ac.uk/</a></p>\n<p>Important Dates (all in 2012)<br>\n  Abstract submission  January 23    Final version due        April 16<br>\n  Paper submission     January 30    Conference dates       June 26-29<br>\n  Notification           March 26    Satellite events   June 30-July 1</p>\n<p>IJCAR is the premier international joint conference on all topics in<br>\nautomated<br>\nreasoning. IJCAR 2012, the 6th International Joint Conference on Automated<br>\nReasoning, is a merger of leading events in automated reasoning: CADE<br>\n(International Conference on Automated Deduction), FroCoS (International<br>\nSymposium on Frontiers of Combining Systems), FTP (International Workshop on<br>\nFirst-order Theorem Proving), and TABLEAUX (International Conference on<br>\nAutomated Reasoning with Analytic Tableaux and Related Methods). Previous<br>\neditions of IJCAR took place in Siena (2001), Cork (2004), Seattle (2006),<br>\nSydney (2008) and Edinburgh (2010), cf. http:/ /www.ijcar.org/.</p>\n<p>IJCAR 2012 is held as part of the Alan Turing Year 2012 just after The Alan<br>\nTuring Centenary Conference in Manchester.</p>\n<p>Scope: IJCAR 2012 invites submissions related to all aspects of automated<br>\nreasoning, including foundations, implementations, and applications.<br>\nOriginal<br>\nresearch papers and descriptions of working automated deduction systems are<br>\nsolicited.</p>\n<p>Logics of interest include: propositional, first-order, classical,<br>\nequational,<br>\nhigher-order, non-classical, constructive, modal, temporal, many-valued,<br>\nsubstructural, description, metalogics, type theory, and set theory.<br>\n Methods<br>\nof interest include: tableaux, sequent calculi, resolution, model-<br>\nelimination, connection method, inverse method, paramodulation, term<br>\nrewriting, induction, unification, constraint solving, decision procedures,<br>\nmodel generation, model checking, semantic guidance, interactive theorem<br>\nproving, logical frameworks, AI-related methods for deductive systems, proof<br>\npresentation, efficient datastructures and indexing, integration of computer<br>\nalgebra systems and automated theorem provers, and combination of logics or<br>\ndecision procedures.</p>\n<p>Applications of interest include: verification, formal methods, program<br>\nanalysis and synthesis, computer mathematics, declarative programming,<br>\ndeductive databases, knowledge representation, natural language processing,<br>\nlinguistics, robotics, and planning.</p>\n<p>Submission: Submission is electronic through<br>\n<a href=\"https://www.easychair.org/?conf=ijcar2012\">https://www.easychair.org/?conf=ijcar2012</a>.<br>\nAuthors are strongly encouraged to use LaTeX and the Springer llncs class<br>\nfile, which can be obtained from<br>\n<a href=\"http://www.springer.de/comp/lncs/authors.html\">http://www.springer.de/comp/lncs/authors.html</a>.  The page limit is 15 pages<br>\nfor<br>\nfull papers and 7 pages for system descriptions.  All papers will be<br>\nevaluated<br>\naccording to originality, significance, technical quality, and<br>\nreadability. Submitted papers must be original and not submitted for<br>\npublication elsewhere. For more details concerning submission see the<br>\nconference web site. The proceedings of IJCAR 2012 will be published by<br>\nSpringer-Verlag in the LNAI/LNCS series.</p>\n<p>Student Travel Awards: Travel awards will be available to enable selected<br>\nstudents to attend the conference. Details will be available in early 2012.</p>\n<p>Further Information: For further and up-to-date information about IJCAR 2012<br>\nvisit <a href=\"http://ijcar.cs.manchester.ac.uk/\">http://ijcar.cs.manchester.ac.uk/</a>.</p>\n<p>Program Chairs:<br>\n  Bernhard Gramlich (TU Wien)<br>\n  Dale Miller (INRIA Saclay -- Ile-de-France)<br>\n  Ulrike Sattler (Univ. of Manchester)</p>",
        "id": 294144906,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660847140
    }
]