[
    {
        "content": "<p>From: Muhammad Umair Siddique &lt;<a href=\"mailto:muh_sidd@encs.concordia.ca\">muh_sidd@encs.concordia.ca</a>&gt;<br>\nCALL FOR APPLICATIONS</p>\n<p>CICM 2015 Doctoral Programme<br>\n                             13-17 July 2015<br>\n                           Washington DC, USA</p>\n<p><a href=\"http://www.cicm-conference.org/2015/cicm.php\">http://www.cicm-conference.org/2015/cicm.php</a></p>\n<p>The  CICM conferences Calculemus, DML, and MKM  bring together<br>\nresearchers  from  the  areas  of  Artificial  Intelligence,  computer<br>\nalgebra,  automated  deduction, and  mathematical  publishing who  are<br>\ninterested  in  intelligent  mathematical  computation.   It  provides<br>\nstudents  an  excellent opportunity  to  get  an  overview of  ongoing<br>\nresearch, challenges and meet established researchers.</p>\n<p>The Doctoral Programme provides a  dedicated forum for PhD students to<br>\npresent  and discuss  their ideas,  ongoing or  planned  research, and<br>\nachieved  results   in  an  open  atmosphere.   It   will  consist  of<br>\npresentations  by  the  PhD  students to  get  constructive  feedback,<br>\nadvice, and suggestions from the research advisory board, researchers,<br>\nand  other PhD  students.  Each  PhD student  will be  assigned  to an<br>\nexperienced researcher  from the research advisory board  who will act<br>\nas a mentor and who will provide detailed feedback and advice on their<br>\nintended and ongoing research.</p>\n<p>APPLICATIONS</p>\n<p>Students at  any stage of  their PhD can  apply and should  submit the<br>\nfollowing documents:</p>\n<ul>\n<li>\n<p>A  two-page  abstract  of   your  thesis  describing  your  research<br>\n   questions,  research   plans,  completed  and   remaining  research,<br>\n   evaluation plans and publication plans;</p>\n</li>\n<li>\n<p>A   two-page  CV   that  includes   background   information  (name,<br>\n   university,  supervisor), education  (degree sought,  year/status of<br>\n   degree, previous degrees), employments, relevant research experience<br>\n   (publications,  presentations,  attended  conferences or  workshops,<br>\n   etc.)</p>\n</li>\n</ul>\n<p>Acceptance of applications will be  based on relevance with respect to<br>\nthe topics of the CICM conference.</p>\n<p>A limited  number of  student grants will  be available for  the<br>\nconference.  To  apply, please  indicate  this  when submitting  your<br>\nproposal  including a  short explanation  why  you need  a grant.  The<br>\ndecision for the grants will be based on necessity and merit.</p>\n<p>IMPORTANT DATES</p>\n<p>Submission of applications:        May 4, 2015<br>\nNotification of acceptance:        May 25, 2015</p>\n<p>For   any   further    questions   please   contact   Umair Siddique<br>\n(<a href=\"mailto:muh_sidd@ece.concordia.ca\">muh_sidd@ece.concordia.ca</a>)</p>",
        "id": 294327791,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660929158
    }
]