[
    {
        "content": "<p>From: Temur Kutsia &lt;<a href=\"mailto:kutsia@risc.jku.at\">kutsia@risc.jku.at</a>&gt;<br>\n[Please post - apologies for multiple copies.]</p>\n<p>Second Call for Papers</p>\n<hr>\n<p>Special issue of the</p>\n<p>JOURNAL OF SYMBOLIC COMPUTATION</p>\n<p>on</p>\n<p>SYMBOLIC COMPUTATION IN SOFTWARE SCIENCE</p>\n<hr>\n<p><a href=\"http://www.risc.jku.at/~tkutsia/organization/jsc-scss-2016.html\">http://www.risc.jku.at/~tkutsia/organization/jsc-scss-2016.html</a></p>\n<p>IMPORTANT DATES</p>\n<hr>\n<p>Abstract submission: June 27, 2016<br>\nPaper submission: July 11, 2016<br>\nNotification: October 17, 2016<br>\nPublication: 2017</p>\n<p>SCOPE</p>\n<hr>\n<p>Symbolic Computation is the science of computing with symbolic objects<br>\n(terms, formulae, programs, representations of algebraic objects etc.).<br>\nPowerful symbolic algorithms and methods have been developed during the<br>\npast decades like computer algebra, theorem proving, automated<br>\nreasoning, software verification, model checking, rewriting,<br>\nformalization of mathematics, Groebner bases, characteristic sets,<br>\ntelescoping for recurrence relations, cylindric algebraic decomposition<br>\nand other quantifier elimination techniques, etc.</p>\n<p>The purpose of this special issue is to promote research on theoretical<br>\nand practical aspects of symbolic computation in software science. The<br>\nspecial issue is related to the topics of the International Symposium on<br>\nSymbolic Computation in Software Science: SCSS 2014 and SCSS 2016. It<br>\nwill be published by Elsevier within the Journal of Symbolic Computation.</p>\n<p>Participants of the SCSS 2014 and SCSS 2016 symposia, as well as other<br>\nauthors are invited to submit contributions.</p>\n<p>EXAMPLES of TOPICS</p>\n<hr>\n<p>This special issue solicits papers on all aspects of symbolic<br>\ncomputation and their applications in software sciences. The topics<br>\ninclude, but are not limited to the following:</p>\n<ul>\n<li>automated reasoning</li>\n<li>algorithm (program) synthesis and/or verification</li>\n<li>formal methods for the analysis of network and system security</li>\n<li>termination analysis and complexity analysis of algorithms (programs)</li>\n<li>extraction of specifications from algorithms (programs)</li>\n<li>related theorem proving methods and techniques</li>\n<li>proof carrying code</li>\n<li>generation of inductive assertion for algorithm (programs)</li>\n<li>algorithm (program) transformations</li>\n<li>\n<p>formalization and computerization of knowledge (maths, medicine,<br>\neconomy, etc.)</p>\n</li>\n<li>\n<p>component-based programming</p>\n</li>\n<li>computational origami</li>\n<li>query languages (in particular for XML documents)</li>\n<li>semantic web and cloud computing</li>\n</ul>\n<p>SUBMISSION GUIDELINES</p>\n<hr>\n<p>This special issue welcomes original high-quality contributions that<br>\nhave been neither published in nor simultaneously submitted to any<br>\njournals or refereed conferences. Submissions will be peer-reviewed<br>\nusing the standard refereeing procedure of the Journal of Symbolic<br>\nComputation.</p>\n<p>Authors of papers presented at the SCSS 2014 and SCSS 2016 symposia are<br>\nwelcome and encouraged to submit extended and revised versions of their<br>\npapers. Furthermore, submissions of papers that are in the scope of<br>\nSCSS, but did not appear in SCSS 2014 and SCSS 2016 are welcome as well.</p>\n<p>Submitted papers must be in English and include a well written<br>\nintroduction explicitly addressing the following questions in succinct<br>\nand informal manner:</p>\n<ul>\n<li>What is the problem?</li>\n<li>Why is the problem important?</li>\n<li>What has been done so far on the problem?</li>\n<li>What is the main contribution of the paper on the problem?</li>\n<li>\n<p>Why is the contribution original? (Clarification: The results,<br>\nalready appeared in the conference paper, will be still counted as an<br>\noriginal result for JSC refereeing process.)</p>\n</li>\n<li>\n<p>Why is the contribution non-trivial?</p>\n</li>\n<li>How is the journal paper different from the conference paper? (For<br>\nsubmissions originated from the papers presented at the symposium.)</li>\n</ul>\n<p>The submissions should be complete (since there is no rigid page limit):</p>\n<ul>\n<li>\n<p>All the related works and issues must be completely and carefully<br>\ndiscussed.</p>\n</li>\n<li>\n<p>All the previous relevant JSC papers must be properly cited and<br>\ndiscussed.</p>\n</li>\n<li>\n<p>All the theorem must be rigorously proved (no sketch allowed).</p>\n</li>\n<li>All the important definitions/theorems/algorithms must be illustrated<br>\nby well chosen examples.</li>\n</ul>\n<p>Submissions originated from the papers presented at the symposium should<br>\naddress all the feedback from the symposium's referee process and Q/A.</p>\n<p>SUBMISSION</p>\n<hr>\n<p>Please prepare your submission in LaTeX using the JSC document format<br>\nfrom <a href=\"http://www4.ncsu.edu/~hong/jsc.htm\">http://www4.ncsu.edu/~hong/jsc.htm</a><br>\n(link to the submission template:<br>\n<a href=\"http://www4.ncsu.edu/~hong/jsc/JSC_LaTex_2007_Mar_12.zip\">http://www4.ncsu.edu/~hong/jsc/JSC_LaTex_2007_Mar_12.zip</a>.)</p>\n<p>Submission is via the EasyChair submission site at<br>\n<a href=\"https://easychair.org/conferences/?conf=jscscss2016\">https://easychair.org/conferences/?conf=jscscss2016</a>.</p>\n<p>GUEST EDITORS</p>\n<hr>\n<p>James H. Davenport (University of Bath, UK)<br>\nTemur Kutsia (RISC, Johannes Kepler University Linz, Austria)</p>",
        "id": 294677263,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661175377
    }
]