[
    {
        "content": "<p>From: Andreas Lochbihler &lt;<a href=\"mailto:andreas.lochbihler@inf.ethz.ch\">andreas.lochbihler@inf.ethz.ch</a>&gt;<br>\nHi Makarius,</p>\n<p>while playing with Isabelle2014-RC0, the following behaviour of Isabelle/jEdit regularly <br>\ndisrupted my work flow. Suppose that I use the incremental search bar to search for <br>\nsomething in the current buffer. For example, I'd like to jump to the first <br>\n\"lift_definition\" command in a theory. After typing lift_d, the view already shows what I <br>\nwas looking for. Having read the information I was interested in (without pressing any <br>\nfurther keys), I then press some other keys to navigate in the theory file (such as PgUp <br>\nand PgDn). This tricks me into thinking that the keyboard focus now is back in the main <br>\ntext area. However, as soon as I press Key-Up, I end up scrolling through the history of <br>\nincremental search, which causes the text area to jump around wildly. Can I somehow set <br>\nthat one I start scrolling with keys, the focus is transferred back to the main text area?</p>\n<p>Best,<br>\nAndreas</p>\n<p>PS: Thanks for all the effort to build PIDE. I haven't used ProofGeneral for a while now <br>\nand I don't miss it much.</p>",
        "id": 294286410,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660922017
    },
    {
        "content": "<p>From: Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt;<br>\njEdit has many tricks of keyboard focus change that I don't understand in <br>\nall details, but I have adapted to some of its aspects in Isabelle/jEdit <br>\nas of the Isabelle2014-RC0 snapshot.</p>\n<p>For example, the main text area cursor is now always visible, but changes <br>\ncolor depending on focus: without focus it is rendered via <br>\ncaret_invisible_color, which is a very pale and greyish version of the <br>\noriginal red.  So when the cursor becomes pale in that sense, it means <br>\nspecial tricks apply: only those key events are passed to the text area <br>\nthat are presently uninterpreted by the GUI component that does have the <br>\nfocus.  This can be the search bar, action bar, completion popup etc.</p>\n<p>I did not know the search bar incident yet, and put it on my list of <br>\nthings to keep in mind, whenever I revisit this very delicate topic of <br>\nfocus and event propagation again.</p>\n<p>Note that Isabelle2014-RC0 it is already a bit more smooth than in <br>\nIsabelle2013-2 concerning keyboard focus and event propagation.  This was <br>\nthe result of myself spending 3 days as actual user (for the AFP entry <br>\nRoy_Floyd_Warshall) and watching closely for snags, to iron them out <br>\nafterwards.</p>\n<p>The more such fine points become known, the better the chances that they <br>\ncan be sorted out eventually.</p>\n<p>Makarius</p>",
        "id": 294286954,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660922182
    }
]