[
    {
        "content": "<p>From: Cas Cremers &lt;<a href=\"mailto:ccremers@win.tue.nl\">ccremers@win.tue.nl</a>&gt;<br>\nOPEN POSITION AT ETH ZURICH<br>\n          Compositional Methods for the Design and Validation<br>\n                of Security Protocols and Architectures</p>\n<p>The research group headed by Prof. David Basin at the Swiss Federal<br>\nInstitute of Technology, Zurich (ETH Zurich) has an open position for<br>\na PhD student.</p>\n<p>Our project will focus on compositional methods for the verification<br>\nof security protocols.  Hence we are looking for an enthusiastic young<br>\nresearcher with a strong interest in formal methods and computer<br>\nsecurity (in particular protocols).  Additionally, experience in<br>\nhigher-order logic, theorem proving, or model checking would be an<br>\nasset.</p>\n<p>The researcher employed will be given the opportunity to carry out a<br>\nPhD in Computer Science at ETH Zurich, on a topic related to the<br>\nproject. ETH Zurich regulations require doctoral students to hold a<br>\nMaster's or equivalent degree (e.g. Diplom).  PhD students are paid<br>\nemployees of the university, and salary and employment conditions are<br>\nattractive.</p>\n<p>Zurich is a diverse and multicultural city which is consistently rated<br>\namong the best cities in the world in which to live.   We favor the<br>\nsame sort of diversity that defines Zurich's cultural makeup and<br>\nencourage anyone to apply with interest in formal methods and<br>\nsecurity, regardless of where you are from.</p>\n<p>For further information please contact Cas Cremers at<br>\n<a href=\"mailto:infsec.positions@lists.inf.ethz.ch\">infsec.positions@lists.inf.ethz.ch</a>. Applications should also be sent<br>\nto Cas Cremers at the same e-mail address and should include a<br>\ncurriculum vitae, a brief description of research interests, and, if<br>\npossible, letters of recommendation from teachers or employers.</p>",
        "id": 293911655,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660747583
    }
]