[
    {
        "content": "<p>From: Andreas Lochbihler &lt;<a href=\"mailto:andreas.lochbihler@inf.ethz.ch\">andreas.lochbihler@inf.ethz.ch</a>&gt;<br>\nThe Information Security group headed by Prof. David Basin at ETH<br>\nZurich has two open PhD positions in two projects:</p>\n<p>(1) Formalizing computational soundness for protocol implementations<br>\n(2) Testing access control systems</p>\n<p>We are looking for enthusiastic outstanding researchers with a strong<br>\nbackground and interest in one or more of the following areas:</p>\n<ul>\n<li>formal methods or mathematical logic,</li>\n<li>information security or cryptography,</li>\n<li>(project 1) interactive theorem proving<br>\n   (project 2) software testing.</li>\n</ul>\n<p>Candidates with a strong theoretical background in related areas are<br>\nalso encouraged to apply. ETH Zurich regulations require PhD<br>\ncandidates to hold a Masters or equivalent degree (e.g. Diplom). The<br>\npreferred starting date for both positions is as soon as possible, at<br>\nthe latest by the end of 2014.</p>\n<p>Description of the projects:</p>\n<p>(1) Formalizing computational soundness for protocol implementations,<br>\n     funded by the Swiss National Science Foundation</p>\n<p>The project aims at a better understanding of, and more confidence in,<br>\nthe security guarantees offered by symbolic analysis methods for<br>\nsecurity protocols, e.g. TLS and IPsec. To this end, symbolic and<br>\ncomputational models of security protocols and security properties<br>\nwill be formalized in the proof assistant Isabelle/HOL and linked with<br>\ncomputational soundness results. For more information see:</p>\n<p><a href=\"http://www.infsec.ethz.ch/research/projects/FCSPI\">http://www.infsec.ethz.ch/research/projects/FCSPI</a></p>\n<p>(2) Testing access control systems</p>\n<p>The project aims at developing algorithms and tools for generating<br>\nsecurity tests from formal access control policies, and assessing<br>\ntheir effectiveness. The position is within the Zurich Information<br>\nSecurity and Privacy Center (ZISC) and the successful candidate will<br>\nwork closely with our industrial partner.</p>\n<p>Applications should include a curriculum vitae, a brief description of<br>\nresearch interests, transcripts of grades, letters of recommendation<br>\nfrom teachers or employers, an indication of the preferred project,<br>\nand, if possible, the Master's or Bachelor's thesis and publications.<br>\nWe will consider applications until the position is filled. Please<br>\ncheck:</p>\n<p><a href=\"http://www.infsec.ethz.ch/news/positions\">http://www.infsec.ethz.ch/news/positions</a></p>\n<p>Applications and informal inquiries should be sent to Andreas<br>\nLochbihler and Mohammad Torabi Dashti at the following email address:</p>\n<p><a href=\"mailto:infsec.positions@inf.ethz.ch\">infsec.positions@inf.ethz.ch</a></p>\n<p>PhD students are paid employees of ETH. Salary and employment<br>\nconditions are attractive. Zurich is a diverse and multicultural city<br>\nthat is consistently rated among the best cities in the world in which<br>\nto live. Further information is available from the following links:</p>\n<p>Open Positions at Institute of Information Security:<br>\n<a href=\"http://www.infsec.ethz.ch/news/positions\">http://www.infsec.ethz.ch/news/positions</a></p>\n<p>Institute of Information Security:<br>\n<a href=\"http://www.infsec.ethz.ch/\">http://www.infsec.ethz.ch/</a></p>\n<p>ETH Zurich:<br>\n<a href=\"http://www.ethz.ch/\">http://www.ethz.ch/</a></p>\n<p>City of Zurich:<br>\n<a href=\"http://www.zuerich.ch\">http://www.zuerich.ch</a></p>",
        "id": 294275938,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660918766
    }
]