[
    {
        "content": "<p>From: Talia Ringer &lt;<a href=\"mailto:tringer@cs.washington.edu\">tringer@cs.washington.edu</a>&gt;<br>\nHi all,</p>\n<p>I'm curious if any of you have ever started to verify a system, but then<br>\nabandoned that system due to the difficulty of evolving and maintaining<br>\nyour proofs. If so, I would love for you to share those proof efforts with<br>\nme, especially if the code is public.</p>\n<p>Thanks!</p>\n<p>Talia</p>",
        "id": 294823551,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661243299
    },
    {
        "content": "<p>From: Talia Ringer &lt;<a href=\"mailto:tringer@cs.washington.edu\">tringer@cs.washington.edu</a>&gt;<br>\nTo clarify: any size project in any proof assistant is fine. I'd actually<br>\nreally love examples of projects of different sizes in different proof<br>\nassistants. The more examples, the better.</p>",
        "id": 294823553,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661243301
    },
    {
        "content": "<p>From: Jose Manuel Rodriguez Caballero &lt;<a href=\"mailto:jose.manuel.rodriguez.caballero@ut.ee\">jose.manuel.rodriguez.caballero@ut.ee</a>&gt;<br>\nTalia wrote:<br>\nI was developing a project of formal verification of my publications concerning a new approach to the number theory that I invented. In XIX century, number theory was approached from the analytic point of view (analytic number theory, e.g., Dirichlet, Riemann), the algebraic point of view (algebraic number theory, e.g., Dedekind, Kronecker), and the geometric point of view (geometry of numbers, Minkowski). My idea was to approach number theory from the point of view of computer science, more specifically, the theory of formal languages (language-theoretic number theory). There were some connections between number theory and formal language before, but it has nothing to do with my approach (this is the reason why I was able to publish my results in good journals, otherwise the editors will reject such a theory).</p>\n<p>I was developing a library in Isabelle/HOL and proving some of my theorems. The library is here:</p>\n<p><a href=\"https://github.com/josephcmac/Folklore-and-miscellaneous-results-in-number-theory/tree/Dyck-(old-version)\">https://github.com/josephcmac/Folklore-and-miscellaneous-results-in-number-theory/tree/Dyck-(old-version)</a></p>\n<p>Also, I proved a new result concerning the Erdos-Nicolas function:</p>\n<p><a href=\"https://github.com/josephcmac/Folklore-and-miscellaneous-results-in-number-theory/blob/master/ErdosNicolasOdd.thy\">https://github.com/josephcmac/Folklore-and-miscellaneous-results-in-number-theory/blob/master/ErdosNicolasOdd.thy</a></p>\n<p>Also, here is a theorem that I discovered using my approach:</p>\n<p><a href=\"https://github.com/josephcmac/Folklore-and-miscellaneous-results-in-number-theory/blob/master/TwoDenselyDivisible.thy\">https://github.com/josephcmac/Folklore-and-miscellaneous-results-in-number-theory/blob/master/TwoDenselyDivisible.thy</a></p>\n<p>I stopped this project because I learned from experts of TUM that my implementation in Isabelle/HOL was rather non-constructive, typical a mathematician by training, but it was better to develop a more constructive approach in order to make explicit computations and experiments in Isabelle/HOL. I tried to adapt my library to the approach suggested by the experts. But, because such a project was independent (zero funding),  I decided to spend my efforts on some projects with financial support and let the development of language-theoretic number theory for people with less financial need than myself and interested in the subject, if there are any in the future.</p>\n<p>Conclusion: the project was abandoned because my skills in Isabelle/HOL, which I learned by myself from the tutorial, were not developed enough at that time and I had no financial motivation in order to update this project when my skills were improved by practice. I think that young mathematicians can develop a creative mathematical research activity in Isabelle/HOL, with the condition of having financial support.</p>\n<p>--&gt; Here is the \"manifesto\" of language-theoretic number theory, which motivated the formal verification of this system:</p>\n<p>Caballero, José Manuel Rodrıguez. \"Symmetric Dyck Paths and Hooley’s∆-function.\" Combinatorics on Words. Springer International Publishing AG (2017).<br>\n<a href=\"https://www.springerprofessional.de/symmetric-dyck-paths-and-hooley-s-function/14229112\">https://www.springerprofessional.de/symmetric-dyck-paths-and-hooley-s-function/14229112</a></p>\n<p>--&gt; Here are some publications of new theorems that I obtained using this approach in the journal INTEGERS:</p>\n<p>\"Jordan's Expansion of the Reciprocal of Theta Functions and 2-densely Divisible Numbers\"<br>\n<a href=\"http://math.colgate.edu/~integers/u2/u2.pdf\">http://math.colgate.edu/~integers/u2/u2.pdf</a></p>\n<p>\"Integers Which Cannot Be Partitioned Into an Even Number of Consecutive Parts\"<br>\n<a href=\"http://math.colgate.edu/~integers/t20/t20.pdf\">http://math.colgate.edu/~integers/t20/t20.pdf</a></p>\n<p>--&gt; Here a publication in Journal of Number Theory (one of the main journals in this field):</p>\n<p>\"On a function introduced by Erdos and Nicolas\"<br>\n<a href=\"https://www.sciencedirect.com/science/article/pii/S0022314X18301999\">https://www.sciencedirect.com/science/article/pii/S0022314X18301999</a></p>\n<p>Kind regards,<br>\nJosé M.</p>",
        "id": 294823608,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661243336
    },
    {
        "content": "<p>From: Lawrence Paulson &lt;<a href=\"mailto:lp15@cam.ac.uk\">lp15@cam.ac.uk</a>&gt;<br>\nThis is unfortunate and rather untypical of attitudes to formalisation in Isabelle/HOL. There are some cases in which interesting executable code can be generated from proofs, but there’s no reason to pretend that Isabelle/HOL is constructive. It absolutely isn’t. Non-constructive proofs are everywhere in the libraries and absolutely welcome.</p>\n<p>Larry</p>",
        "id": 294823651,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661243362
    },
    {
        "content": "<p>From: Christoph Sprenger &lt;<a href=\"mailto:sprenger@inf.ethz.ch\">sprenger@inf.ethz.ch</a>&gt;<br>\nDear Talia,</p>\n<p>this is not my own proof effort, but I know Diego Ongaro formalized his Raft consensus protocol [1,3] in TLA and partially proved one of its properties in the TLA prover. He later abandoned the effort to prove further properties, since he “found it too tedious and time-consuming to use the TLA proof system at the scale of a complete proof” [2, Section 8.2], see also [1, Section 8.2].</p>\n<p>Cheers, <br>\nChristoph</p>\n<p>—</p>\n<p>[1] <a href=\"https://www.usenix.org/conference/atc14/technical-sessions/presentation/ongaro\">https://www.usenix.org/conference/atc14/technical-sessions/presentation/ongaro</a> &lt;<a href=\"https://www.usenix.org/conference/atc14/technical-sessions/presentation/ongaro\">https://www.usenix.org/conference/atc14/technical-sessions/presentation/ongaro</a>&gt;<br>\n[2] <a href=\"https://web.stanford.edu/~ouster/cgi-bin/papers/OngaroPhD.pdf\">https://web.stanford.edu/~ouster/cgi-bin/papers/OngaroPhD.pdf</a> &lt;<a href=\"https://web.stanford.edu/~ouster/cgi-bin/papers/OngaroPhD.pdf\">https://web.stanford.edu/~ouster/cgi-bin/papers/OngaroPhD.pdf</a>&gt;<br>\n[3] <a href=\"https://raft.github.io/\">https://raft.github.io/</a> &lt;<a href=\"https://raft.github.io/\">https://raft.github.io/</a>&gt;</p>",
        "id": 294823659,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661243369
    },
    {
        "content": "<p>From: Denis Nikiforov &lt;<a href=\"mailto:denis.nikif@gmail.com\">denis.nikif@gmail.com</a>&gt;<br>\nHi</p>\n<p>I formalized the semantics of the OCL language:<br>\n<a href=\"https://www.isa-afp.org/entries/Safe_OCL.html\">https://www.isa-afp.org/entries/Safe_OCL.html</a><br>\nHere is a significantly improved version of the theory:<br>\n<a href=\"https://github.com/AresEkb/Safe_OCL\">https://github.com/AresEkb/Safe_OCL</a><br>\nI added new data types, added a concrete syntax, refactored the type system<br>\nand changed semantics of some operations after discussion with a main OCL<br>\ncontributor.</p>\n<p>The project has two goals:<br>\n1) Provide a simple reference formalization of a real (non-toy) language<br>\nfor people far from mathematics (for engineers like me). There are a lot of<br>\nexamples of toy languages, but when you start to formalize a more<br>\ncomplicated language it's not an easy task. Formalizations of other<br>\nlanguages (Java, etc.) are too complicated for me.<br>\n2) Improve OCL language itself.</p>\n<p>However, I don't have time to finish it. I hope I'll do it in future.</p>\n<p>вс, 16 февр. 2020 г. в 06:28, Talia Ringer &lt;<a href=\"mailto:tringer@cs.washington.edu\">tringer@cs.washington.edu</a>&gt;:</p>",
        "id": 294823670,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661243376
    },
    {
        "content": "<p>From: Jose Manuel Rodriguez Caballero &lt;<a href=\"mailto:jose.manuel.rodriguez.caballero@ut.ee\">jose.manuel.rodriguez.caballero@ut.ee</a>&gt;<br>\nFor a mathematician who is working in a new subject, e.g., a new theorem in combinatorics, Isabelle/HOL can be used as a personal notebook, in order to keep track of the consistency and the progress in the proofs. Nevertheless, after obtaining his/her desired proof, the mathematician will write a paper about that subject and he/she will jump to the next subject. So, the notebook library may be abandoned, because the mathematician is measured in academia by his/her publications on journals about mathematics. The draft in Isabelle/HOL, as any draft, will not be optimal.</p>\n<p>A possible solution in order to make the notebook library a file good enough for publication in Archives of Formal Proofs is to develop a software in order to automatically improve the code written by the mathematician as a draft. This automatic improvement may even help the mathematician to write his/her paper for the journal of mathematics.</p>\n<p>Kind regards,<br>\nJosé M.</p>",
        "id": 294823691,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661243383
    },
    {
        "content": "<p>From: \"Fernandez, Matthew\" &lt;<a href=\"mailto:matthew.fernandez@intel.com\">matthew.fernandez@intel.com</a>&gt;<br>\nSome of the Elasticsearch algorithms have been verified using TLA+ [0]. In that repository is also a partial Isabelle formalization of the same. I had a conversation with David Turner about why they moved away from Isabelle to TLA+, but can't recall the exact details and motivation offhand. This might be an interesting case study for you though, Talia.</p>\n<p>[0]: <a href=\"https://github.com/elastic/elasticsearch-formal-models\">https://github.com/elastic/elasticsearch-formal-models</a></p>",
        "id": 294823697,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661243388
    },
    {
        "content": "<p>From: Stephan Merz &lt;<a href=\"mailto:stephan.merz@loria.fr\">stephan.merz@loria.fr</a>&gt;<br>\nA short look at the GitHub repository seems to indicate that they moved to model checking. Although an interactive proof system for TLA+ does exist, I couldn't see any proofs in their modules.</p>\n<p>Stephan</p>",
        "id": 294823702,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661243393
    },
    {
        "content": "<p>From: \"Fernandez, Matthew\" &lt;<a href=\"mailto:matthew.fernandez@intel.com\">matthew.fernandez@intel.com</a>&gt;<br>\nYes, I was not meaning to imply otherwise. Merely that I don't recall the reason why they moved away from ITP. You can see the Isabelle pieces under cluster/isabelle in the repository.</p>",
        "id": 294823708,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661243399
    }
]