[
    {
        "content": "<p>From: MOBIUS PhD Grants &lt;<a href=\"mailto:mobiusgrants@clip.dia.fi.upm.es\">mobiusgrants@clip.dia.fi.upm.es</a>&gt;</p>\n<hr>\n<p>Announcement of up to three PhD Scholarships</p>\n<p>to pursue PhD studies in the <br>\n              CLIP group (<a href=\"http://clip.dia.fi.upm.es\">http://clip.dia.fi.upm.es</a>),<br>\n              Technical University of Madrid (Spain)<br>\n              in the context of the MOBIUS EU project<br>\n                     (<a href=\"http://mobius.inria.fr\">http://mobius.inria.fr</a>)</p>\n<hr>\n<p>The CLIP  group at  the Technical University  of Madrid  (UPM) invites<br>\napplications for  up to three, fully funded,  4-year, PhD Scholarships<br>\nfor qualified graduate students.</p>\n<p>Candidates  should  have   graduated  in  Computer  Science,  Computer<br>\nEngineering, or  related fields prior to  the start of  their study at<br>\nUPM. The working language of  the group is English, and candidates can<br>\nbe of any nationality.</p>\n<p>The Ph.D. work will center around the research areas of the CLIP group<br>\nwithin the European research  project \"MOBIUS\", under the direction of<br>\nGerman Puebla and Manuel Hermenegildo.</p>\n<p>The general  aim of  \"MOBIUS: Mobility, Ubiquity  and Security\"  is to<br>\ndevelop  a  framework for  establishing  trust  and  security of  Java<br>\nprograms,  using the Proof  Carrying Code  paradigm. The  project will<br>\nstart September 1, 2005 and will run for four years.</p>\n<p>Within the MOBIUS  project, the research of the  CLIP group focuses on<br>\nAbstraction Carrying  Code, an Abstract  Interpretation based approach<br>\nto mobile code  safety. This involves the development  of new advanced<br>\nprogram analysis  techniques for security  and verification, including<br>\nresource consumption, both in terms of time and memory.</p>\n<p>The   offered  scholarships   provide   excellent  opportunities   for<br>\ninternational collaboration since MOBIUS is a European project with 16<br>\npartners  from  10 countries.  Also,  the  CLIP  group is  active  and<br>\ninternational,  with  around 15  full-time  members  from 6  different<br>\ncountries.</p>\n<p>The  grants  include  academic  fees,  medical  care, plus a  tax-free<br>\nmonthly  payment which  ranges from 1,100 to 1,600 euros, depending on<br>\nexperience.</p>\n<p>The  following  qualifications are  not  mandatory,  but increase  the<br>\nchances of success:</p>\n<p>* Experience with Java, Java bytecode, and JML<br>\n  * Knowledge of (Constraint) Logic Programming<br>\n  * Interest in software verification and security</p>\n<p>Applications and information:</p>\n<hr>\n<p>The  deadline for  applications is  September 26,  2005.  Applications<br>\nreceived  after this deadline  may be  considered if  the scholarships<br>\nhave  not been filled  at the  time.  Applications  should be  sent to<br>\n<a href=\"mailto:mobius-phd-grants@clip.dia.fi.upm.es\">mobius-phd-grants@clip.dia.fi.upm.es</a> and include a curriculum vitae, a<br>\nlisting  of  grades from  previous  studies,  a  brief description  of<br>\nresearch interests with regards to  the CLIP group and MOBIUS, and, if<br>\nat all  possible, letters of recommendation from  teachers or managers<br>\nthat  the student  has worked  with.   The latest  information on  the<br>\nscholarships   and   the  application   process   can   be  found   at<br>\n<a href=\"http://www.clip.dia.fi.upm.es/Job_Openings/mobius-phd-grants.html\">http://www.clip.dia.fi.upm.es/Job_Openings/mobius-phd-grants.html</a></p>\n<hr>",
        "id": 293896267,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660742793
    }
]