[
    {
        "content": "<p>From: Freek Verbeek &lt;<a href=\"mailto:freek@vt.edu\">freek@vt.edu</a>&gt;<br>\n=====================================================<br>\nPhD and postdoctoral positions in Formal Methods and Decompilation<br>\nOpen University of The Netherlands / VirginiaTech (USA)<br>\n=====================================================</p>\n<p>Multiple positions are available at the Open University of The Netherlands (<a href=\"https://ou.nl\">https://ou.nl</a> &lt;<a href=\"https://ou.nl/\">https://ou.nl/</a>&gt;) and the Systems Software Research Group at Virginia Tech (<a href=\"https://www.ssrg.ece.vt.edu/\">https://www.ssrg.ece.vt.edu/</a> &lt;<a href=\"https://www.ssrg.ece.vt.edu/\">https://www.ssrg.ece.vt.edu/</a>&gt;) on projects on formal methods and reverse engineering of binaries. We are interested in decompilation: retrieving source code from a binary while maintaining a formal correctness proof that everything is sound. This will make bottom-up formal verification possible: applying formal verification to binaries, instead of to source code. If you have an interest in one of the fields of formal methods, (de)compilation, low-level assembly code or reverse-engineering, then you must certainly apply. We can hire both ''promovendi'' (PhD students) and postdocs on this project. Unique about the project is:</p>\n<p>•   The project has close ties to interested parties with relevant case studies.<br>\n    •   It is a close collaboration between a Dutch and a US university and if requested there is the possibility of extended visits to the US.<br>\n    •   You can choose your own work location in The Netherlands (Amsterdam, Utrecht, Nijmegen, Eindhoven, ...)</p>\n<p>Applications can be done by sending your CV and a short application letter indicating your interest in the project via e-mail: fvb -- at -- <a href=\"http://ou.nl\">ou.nl</a> &lt;<a href=\"http://ou.nl/\">http://ou.nl/</a>&gt;. For more information, see <a href=\"http://www.cs.ru.nl/~freekver/positions/\">http://www.cs.ru.nl/~freekver/positions/</a> &lt;<a href=\"http://www.cs.ru.nl/~freekver/positions/\">http://www.cs.ru.nl/~freekver/positions/</a>&gt;</p>",
        "id": 294763855,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661200950
    }
]