[
    {
        "content": "<p>From: Lennart Beringer &lt;<a href=\"mailto:beringer@tcs.ifi.lmu.de\">beringer@tcs.ifi.lmu.de</a>&gt;<br>\nThe Institute for Computer Science at the University of Munich offers a </p>\n<p>Research assistant position</p>\n<p>for 2 years starting as soon as possible.  The position is available<br>\nin the EU-funded project ``MOBIUS - mobility, ubiquity, and<br>\nsecurity''.</p>\n<p>The aim of the project is to develop a proof-carrying code<br>\narchitecture, where programs are equipped with formal proofs of<br>\nsecurity- and resource-related properties. We offer the opportunity to<br>\nwork on theoretically challenging and practically relevant topics in<br>\nan international research environment. You are expected to have earned<br>\na good first degree in computer science or a closely related subject.<br>\nApplications with a strong background in some of the following</p>\n<ul>\n<li>\n<p>programming languages (type systems, program logics, compilers)</p>\n</li>\n<li>\n<p>verification techniques (static analysis, theorem proving)</p>\n</li>\n</ul>\n<p>are particularly welcome. Depending on interest and prior expertise<br>\nyou will work on type systems for resource usage or generation of<br>\ncertificates in formalised program logics.</p>\n<p>Apart from the scientific work to be reported in scientific papers and<br>\nprototype implementations you will also participate in the preparation<br>\nof activity reports and deliverables.</p>\n<p>Remuneration will be according to age and qualification, following the<br>\nGerman public service payment scheme (BAT IIA/TV\\\"OD 13).</p>\n<p>MOBIUS (<a href=\"http://mobius.inria.fr\">mobius.inria.fr</a>) is a large integrated project with 20<br>\nacademic and industrial partners. Annual and topical workshops will<br>\npresent you with an excellent opportunity to demonstrate your work,<br>\nlearn new things, and forge contacts.</p>\n<p>To apply please send as soon as possible a letter of application to<br>\nthe address given below, including a CV, degree certificates, and<br>\ncontact details of at least one referee. The University of Munich is<br>\nan equal opportunities employer and aims to increase the ratio of<br>\nwomen in academia. We therefore particularly encourage female<br>\ncandidates to apply. Applications of handicapped candidates are<br>\ntreated with priority.</p>\n<p>All applications received before 1st October 2007 will be<br>\nconsidered. Later applications are also welcome if the position is<br>\nstill open then.</p>\n<p>For further enquiries, please contact Lennart Beringer or<br>\nMartin Hofmann, Institut f\\\"ur Informatik,<br>\nLudwig-Maximilians-Universit\\\"at M\\\"unchen, Oettingenstrasse 67, 80538<br>\nM\\\"unchen, <a href=\"http://www.tcs.ifi.lmu.de/~beringer\">www.tcs.ifi.lmu.de/~beringer</a><br>\nand <a href=\"http://www.tcs.ifi.lmu.de/~mhofmann\">www.tcs.ifi.lmu.de/~mhofmann</a>.</p>",
        "id": 294051156,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660819532
    }
]