[
    {
        "content": "<p>From: John Matthews &lt;<a href=\"mailto:matthews@galois.com\">matthews@galois.com</a>&gt;<br>\nThanks, Makarius. Unfortunately, the code I wrote isn't being  <br>\nexecuted by Isar. I've attached two files that illustrate the  <br>\nproblem. The isar.thy file installs the new theorem attribute, and  <br>\nisar_test.thy tries to use it. I've instrumented the theorem  <br>\nattributes with \"print\" instructions, but none of them seem to fire.</p>\n<p>Also, what is the difference between \"local\" and \"global\" theorem  <br>\nattributes? That is, when should I use Classical.put_local_claset  <br>\nversus Classical.put_global_claset?</p>\n<p>Thanks in advance,<br>\n-john<br>\n<a href=\"/user_uploads/14278/YSFOHbYbEplZXnntHGQWQwF3/isar.thy\">isar.thy</a><br>\n<a href=\"/user_uploads/14278/yHzUFGFztQLpUa4sh4rfrLo7/isar_test.thy\">isar_test.thy</a></p>",
        "id": 293896632,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660742915
    },
    {
        "content": "<p>From: Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt;<br>\nOn Mon, 28 Nov 2005, John Matthews wrote:</p>\n<blockquote>\n<p>The isar.thy file installs the new theorem attribute, and isar_test.thy<br>\ntries to use it. I've instrumented the theorem attributes with \"print\"<br>\ninstructions, but none of them seem to fire.</p>\n</blockquote>\n<p>Oddly, there seems to be something wrong with print being used here --<br>\nmaybe the compiler removes this from encapsulated toplevel expressions.  <br>\nI do use PolyML.print regularly, but usually from actual ML files, rather<br>\nthan immediate ML code as encountered here. Using Isabelle's own functions<br>\ndoes work, e.g. warning or writeln.</p>\n<p>I also see your solver stemming from the D2 rule in the claset.</p>\n<p>Also note that attribute names quoted in a theory need to conform to the<br>\nidentifier syntax given in the isar-ref manual.  This is quite liberal,<br>\nbut does not include a bang as part of a word.  The attributes in<br>\nProvers/classical.ML do this by parsing there own arguments (cf.  <br>\noccurences of Args.bang, Args.bang_colon).</p>\n<blockquote>\n<p>Also, what is the difference between \"local\" and \"global\" theorem<br>\nattributes? That is, when should I use Classical.put_local_claset versus<br>\nClassical.put_global_claset?</p>\n</blockquote>\n<p>Attributes operate either in a theory (global) of proof context (local). A<br>\nglobal attribute should change the theory -- there is no proof context<br>\navailable anyway, a local attribute should change the proof context (in<br>\npurely functional manner).</p>\n<p>Makarius</p>",
        "id": 293896642,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660742918
    }
]