[
    {
        "content": "<p>From: Michael Norrish &lt;<a href=\"mailto:Michael.Norrish@nicta.com.au\">Michael.Norrish@nicta.com.au</a>&gt;<br>\nLots of questions.</p>\n<p>I want to set up a locale with an Element.Assumes element that gives<br>\nan assumption that I want marked with the \"simp\" attribute.</p>\n<p>In other words, I want to construct something like</p>\n<p>Element.Assumes<br>\n           [((&lt;name&gt;, [ ??? ]),<br>\n             [(&lt;a term of type bool, or should it be Prop?&gt;, [])])]</p>\n<p>where this will be passed to Locale.add_locale_i.</p>\n<p>Unfortunately, I can't see what I should put in the place of ???</p>\n<p>I hoped that Simplifier.simp_add might be usable (this is what I can<br>\nuse if I'm doing a PureThy.add_defs_i), but that has the wrong type.</p>\n<p>Instead, the ??? has to be a Args.src.  This type looks a bit<br>\nconfusing, but it seems like it encodes the raw syntax of attributes<br>\nat the Isar language level.  The functions Attrib.attribute{_i} then<br>\nlook like the \"parsers\" that turn src values into attributes.  If I<br>\ncould figure out how to create a Args.src value that corresponded to<br>\nthe string \"simp\", I could presumably use that, though that seems a<br>\npretty ugly route to have to take.</p>\n<p>Or should I just stop trying to use the attribute interface here, and<br>\nmanually call addsimps on the theory resulting from the call to<br>\nadd_locale?  And if so, what function do I use to do that?  The<br>\nfunction change_simpset_of function has this scary unit return type,<br>\nand I know from recent discussions that I should be wary of those.</p>\n<p>Moreover, once I'm at the level of calling addsimps, how do I get<br>\nsomething of type thm out of the context that I just created?   There<br>\nare a few functions in Thm that look plausible:</p>\n<p>val get_axiom_i: theory -&gt; string -&gt; thm<br>\n   val get_axiom: theory -&gt; xstring -&gt; thm<br>\n   val get_def: theory -&gt; xstring -&gt; thm<br>\n   val axioms_of: theory -&gt; (string * thm) list</p>\n<p>Does an Assumes element count as an axiom?  And what's the difference<br>\nbetween a string and an xstring here?</p>\n<p>Michael.</p>",
        "id": 294058956,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660822782
    }
]