[
    {
        "content": "<p>From: Randy Pollack &lt;<a href=\"mailto:rpollack@inf.ed.ac.uk\">rpollack@inf.ed.ac.uk</a>&gt;<br>\nCertified Complexity Preserving Compiler (CerCo):<br>\n      Programming and proving a compiler in Type Theory</p>\n<p>For details contact Randy Pollack &lt;<a href=\"mailto:rpollack@inf.ed.ac.uk\">rpollack@inf.ed.ac.uk</a>&gt;.</p>\n<p><strong> This is restricted to EU students. </strong></p>\n<p>A 3 year PhD studentship is available in a project titled A Certified<br>\nComplexity Preserving Compiler (CerCo), funded by the European<br>\nCommission under \"Future and Emerging Technologies\" (FET).</p>\n<p>The studentship will be held within the Laboratory for Foundations of<br>\nComputer Science, at the School of Informatics, University of<br>\nEdinburgh, to begin in 2010, start date flexible.</p>\n<p>The CerCo project aims at the construction of a formally verified<br>\ncomplexity preserving compiler from a large subset of the C<br>\nprogramming language to some typical micro-controller assembly<br>\nlanguage of the kind used in embedded systems. The work comprises the<br>\ndefinition of cost models for the input and target languages, coding<br>\nthe compiler in Type Theory and the machine-checked proof of<br>\npreservation of complexity (concrete, not asymptotic) along<br>\ncompilation, using the <em>Matita</em> proof tool. The compiler will return<br>\ncertified cost annotations for the source program, providing a<br>\nreliable infrastructure to draw temporal assertions on the executable<br>\ncode while reasoning on the source. The compiler will be open source,<br>\nand all proofs will be public domain.</p>\n<p>The permanent researchers involved in the CerCo project are Randy<br>\nPollack in Edinburgh, Andrea Asperti and Claudio Sacerdoti-Coen in<br>\nBologna and Roberto Amadio and Yann Regis-Gianas in Paris. The<br>\nEdinburgh site will focus on the compiler front end. We are interested<br>\nin use of dependent types in programming as well as in proof.</p>\n<p>Suitable candidates will have a strong first degree in Computer<br>\nScience and a strong interest in formal proof and type theory.</p>\n<p>Candidates are encouraged to contact Randy Pollack to informally<br>\ndiscuss the project further. Formal application will be through the<br>\nSchool's normal PhD application process:<br>\n&lt;<a href=\"http://www.inf.ed.ac.uk/postgraduate/phd.html\">http://www.inf.ed.ac.uk/postgraduate/phd.html</a>&gt;</p>\n<p>--<br>\nRandy Pollack<br>\nPhone: +44 131 650 5145  URL: <a href=\"http://homepages.inf.ed.ac.uk/rpollack\">http://homepages.inf.ed.ac.uk/rpollack</a><br>\nEdinburgh University, Informatics Forum, 10 Crichton Street, Edinburgh EH8 9AB</p>\n<p>-- <br>\nThe University of Edinburgh is a charitable body, registered in<br>\nScotland, with registration number SC005336.</p>",
        "id": 294106017,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660835227
    }
]