[
    {
        "content": "<p>From: Sascha Boehme &lt;<a href=\"mailto:boehmes@in.tum.de\">boehmes@in.tum.de</a>&gt;<br>\nBelow is a call for papers for a new workshop, associated with CADE.</p>\n<p>Regards,<br>\nSascha</p>\n<hr>\n<p>Boogie 2011: First International Workshop on Intermediate Verification Languages</p>\n<p>co-located with CADE-23, Wrocław, Poland, August 1st 2011</p>\n<p><a href=\"http://research.microsoft.com/~moskal/boogie2011/\">http://research.microsoft.com/~moskal/boogie2011/</a></p>\n<p>An intermediate verification language (IVL), like Boogie or Why, is used as a stepping stone between a source language and a reasoning engine. IVLs promote modularization and sharing of infrastructure. For example, the same IVL can have multiple source language front-ends and multiple reasoning engine back-ends, forming a verification tool bus. The goal of the Boogie Workshop is to advance theory and techniques supporting IVLs, to bring together researchers working with IVLs, and to promote sharing of infrastructure that they build.</p>\n<p>The workshop is intended for topics related to any intermediate verification language, not just Boogie.</p>\n<p>We welcome submissions up to 12 pages in LLNCS format. The accepted papers will be printed in informal proceedings distributed to the participants of the workshop. With the exception of survey and history papers, the papers should contain original work which has not been submitted or accepted for publication elsewhere.</p>\n<p>Make sure to visit workshop's webpage, which will describe the submission method in due time, and currently has a colorful flyer (looks excellent printed on A0 paper!).</p>\n<p>Topics</p>\n<ul>\n<li>\n<p>IVL tools</p>\n</li>\n<li>\n<p>language features of an IVL (e.g., angelic choice, tressa)</p>\n</li>\n<li>\n<p>type systems for an IVL</p>\n</li>\n<li>\n<p>translation from a source language to an IVL</p>\n</li>\n<li>\n<p>property inference at the level of an IVL (e.g., predicate abstraction, abstract interpretation, termination metric inference, Houdini-style inference)</p>\n</li>\n<li>\n<p>IVL to IVL translations (e.g., optimizations, slicing, translation between different IVLs)</p>\n</li>\n<li>\n<p>translation from an IVL to reasoning engine (SMT, ATP, HOL) input</p>\n</li>\n<li>\n<p>interaction with reasoning engines</p>\n</li>\n<li>\n<p>interpretation of reasoning engine output in terms of the source language via an IVL</p>\n</li>\n<li>\n<p>symbolic execution for an IVL</p>\n</li>\n<li>\n<p>axiomatizations of useful theories (like sets, sequences, heaps, ...)</p>\n</li>\n<li>\n<p>user experience improvements (e.g., caching of verification results)</p>\n</li>\n<li>\n<p>novel uses of IVLs (e.g., refinement or symbol diff)</p>\n</li>\n<li>\n<p>experimental evaluations (e.g., comparing different logical encoding or reasoning engines)</p>\n</li>\n</ul>\n<p>Dates</p>\n<p>submissions: May 1st, 2011</p>\n<p>notification: June 1st, 2011</p>\n<p>final versions: July 1st, 2011</p>\n<p>workshop: August 1st, 2011</p>\n<p>Program committee</p>\n<p>Tayfun Elmas, UC Berkeley</p>\n<p>K. Rustan M. Leino, Microsoft Research (co-chair)</p>\n<p>Claude Marché, INRIA</p>\n<p>Michał Moskal, Microsoft Research (co-chair)</p>\n<p>Shaz Qadeer, Microsoft Research</p>\n<p>Jan Smans, KU Leuven</p>\n<p>Alexander J. Summers, ETH Zürich</p>",
        "id": 294130319,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660842575
    }
]