[
    {
        "content": "<p>From: Gottfried Barrow &lt;<a href=\"mailto:gottfried.barrow@gmx.com\">gottfried.barrow@gmx.com</a>&gt;<br>\nNo one needs to respond to this, but I make this a global request, <br>\nrather than just mention it in another email I'm working on.</p>\n<p>I've been getting some mileage out of a short example using lifting that <br>\nBrian Huffman provided me on Stackoverflow, and just using what I see in <br>\nthe sources as templates, but I don't have any real understanding of <br>\nwhat's going on.</p>\n<p>I'm seeing quotient types and lifting show up in lots of places, but I <br>\nhaven't noticed anything in the way of tutorials, and even searches in <br>\nthe collection of most documents don't return much, if anything.</p>\n<p>In isar-ref.pdf, lifting is all through the document, which probably is <br>\na big part of why I've been thinking I see it mentioned a lot.</p>\n<p>It'd be nice to have something along the lines of the locales, classes, <br>\ncodegen, nitpick, sledgehammer, and functions documents.</p>\n<p>I assume no one has time. That's why I say there's no need to respond.</p>\n<p>Regards,<br>\nGB</p>",
        "id": 294241998,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660907365
    },
    {
        "content": "<p>From: Peter Vincent Homeier &lt;<a href=\"mailto:palantir@trustworthytools.com\">palantir@trustworthytools.com</a>&gt;<br>\nTo provide \"some real understanding of what's going on,\" you may wish to<br>\ncheck one of the original writings about quotient types and lifting,<br>\nwritten about the HOL4 implementation:</p>\n<p><a href=\"http://www.trustworthytools.com/quotients/quotient.pdf\">http://www.trustworthytools.com/quotients/quotient.pdf</a></p>\n<p>The actual internal computations involved in lifting a theorem is rather<br>\ncomplicated, and would take too long to describe even in a 50 page paper,<br>\nbut the source code of the package is rather well commented, if you can<br>\nread Standard ML. The source code can be read in the source of the HOL4<br>\nsystem, in the directory &lt;root&gt;/src/quotient/src/.</p>\n<p>Hope this helps.</p>\n<p>Peter</p>",
        "id": 294242241,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660907469
    },
    {
        "content": "<p>From: Gottfried Barrow &lt;<a href=\"mailto:gottfried.barrow@gmx.com\">gottfried.barrow@gmx.com</a>&gt;<br>\nOn 5/22/2013 9:15 AM, Peter Vincent Homeier wrote:</p>\n<blockquote>\n<p>To provide \"some real understanding of what's going on,\" you may wish <br>\nto check one of the original writings about quotient types and <br>\nlifting, written about the HOL4 implementation:</p>\n<p><a href=\"http://www.trustworthytools.com/quotients/quotient.pdf\">http://www.trustworthytools.com/quotients/quotient.pdf</a></p>\n</blockquote>\n<p>Peter,</p>\n<p>Thanks for the link.</p>\n<p>Mick Jagger comes to mind. You don't always get what you want, but if <br>\nyou try sometimes, you just might find, you get what you need, yea yea, <br>\nyou just might find, you get what you need, yea yea, and so forth.</p>\n<p>You chapter seven relating the choice operator with the definite choice <br>\noperator might speed up certain learning processes for me. I've been <br>\nthinking I'll have to eventually figure out the choice operator, where <br>\nas a running process, I've intentionally thought many times to not think <br>\nabout the THE operator in HOL.thy.</p>\n<blockquote>\n<p>The actual internal computations involved in lifting a theorem is <br>\nrather complicated, and would take too long to describe even in a 50 <br>\npage paper, but the source code of the package is rather well <br>\ncommented, if you can read Standard ML. The source code can be read in <br>\nthe source of the HOL4 system, in the directory &lt;root&gt;/src/quotient/src/.</p>\n</blockquote>\n<p>Yea, so maybe I'm talking more about a user's manual type of doc, rather <br>\nthan one on the theory. Partly it's just a need to document the <br>\nmechanics of using lifting and quotient types with lots of example and a <br>\nfew high level concepts on what the syntax means.</p>\n<p>Like, there's some kind of naming scheme where things are named by <br>\nadding suffixes and prefixes to other things, but I haven't found where <br>\nall that's documented and explained in detail to a user for the <br>\nIsabelle/HOL lifting and quotients packages.</p>\n<p>Thanks,<br>\nGB</p>\n<blockquote>\n<p>Hope this helps.</p>\n<p>Peter</p>\n<p>On Tue, May 21, 2013 at 9:24 PM, Gottfried Barrow <br>\n&lt;<a href=\"mailto:gottfried.barrow@gmx.com\">gottfried.barrow@gmx.com</a> &lt;mailto:<a href=\"mailto:gottfried.barrow@gmx.com\">gottfried.barrow@gmx.com</a>&gt;&gt; wrote:</p>\n<p>No one needs to respond to this, but I make this a global request,<br>\n    rather than just mention it in another email I'm working on.</p>\n<p>I've been getting some mileage out of a short example using<br>\n    lifting that Brian Huffman provided me on Stackoverflow, and just<br>\n    using what I see in the sources as templates, but I don't have any<br>\n    real understanding of what's going on.</p>\n<p>I'm seeing quotient types and lifting show up in lots of places,<br>\n    but I haven't noticed anything in the way of tutorials, and even<br>\n    searches in the collection of most documents don't return much, if<br>\n    anything.</p>\n<p>In isar-ref.pdf, lifting is all through the document, which<br>\n    probably is a big part of why I've been thinking I see it<br>\n    mentioned a lot.</p>\n<p>It'd be nice to have something along the lines of the locales,<br>\n    classes, codegen, nitpick, sledgehammer, and functions documents.</p>\n<p>I assume no one has time. That's why I say there's no need to respond.</p>\n<p>Regards,<br>\n    GB</p>\n<p>-- <br>\n\"In Your majesty ride prosperously<br>\nbecause of truth, humility, and righteousness;<br>\nand Your right hand shall teach You awesome things.\" (Psalm 45:4)</p>\n</blockquote>",
        "id": 294242270,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660907483
    }
]