[
    {
        "content": "<p>From: Burkhart Wolff &lt;<a href=\"mailto:Burkhart.Wolff@lri.fr\">Burkhart.Wolff@lri.fr</a>&gt;<br>\nApologies for multiple copies ...</p>\n<p>==================================================================================<br>\nICTSS 2011: The 23th IFIP International Conference on Testing Software and Systems<br>\nNovember 7-10, 2011<br>\nInstitut Henri Poincare, Paris, France<br>\n<a href=\"http://ictss2011.lri.fr\">http://ictss2011.lri.fr</a></p>\n<hr>\n<p><em>CALL FOR RESEARCH, INDUSTRY PAPERS</em><br>\nAbstract submission: May 8, 2011<br>\nPaper submission: May 15, 2011<br>\n==================================================================================</p>\n<hr>\n<p>Scope and Objectives</p>\n<hr>\n<p>Testing is one of the most important technique for the (partial) verification of communication and software systems as well as the validation of their models. Testing, if done right, is known to be a laborious and very cost-intensive task during the development of such systems; in extreme cases, more than 70% of the development cost in industrial development processes were spent for testing. ICTSS is a series of international conferences addressing the conceptual, theoretic, and practical problems of testing software systems, including communication protocols, services, distributed platforms, middleware, controllers and security infrastructures. The ICTSS is the successor of previous (joint) conferences TESTCOM and FATES and aims at being a forum for researchers, developers, testers, and users to review, discuss, and learn about new approaches, concepts, theories, methodologies, tools, and experiences in the field of testing of communicating systems and software. The conference web-site related to this call can be found at <a href=\"http://ictss2011.lri.fr\">http://ictss2011.lri.fr</a></p>\n<hr>\n<p>Topics of interest</p>\n<hr>\n<p>Topics of interest include but are not limited to, the following:</p>\n<ul>\n<li>aspects of testing: test derivation, test selection, test coverage, test implementation and execution, test result analysis, test oracles, test management, monitoring and runtime verification, test frameworks;</li>\n<li>model-based testing: formal models and modeling languages such as automata, state machines, process algebra, logics, SDL, UML, HOL, Markov-chains, test generation from models, model coverage;</li>\n<li>kind of testing: functional, interoperability, performance, conformance, security, reliability, robustness, etc.;</li>\n<li>application areas: communicating systems such as protocols, middleware, networks, Web services, wireless applications, control systems, business information systems, embedded and real-time software, etc.;</li>\n<li>combinations of different testing techniques, in particular techniques for the automated generation of test data;</li>\n<li>tools to support any of the testing activities;</li>\n<li>case studies and industrial applications involving qualified empirical evaluations.</li>\n</ul>\n<hr>\n<p>Types of Contributions</p>\n<hr>\n<p>Research papers (max. 16 pages) describing results of theoretical or experimental research, which must be original, significant and sound.<br>\nIndustrial papers (max. 16 pages) describing approaches and means to introduce new testing methodologies in industrial contexts or reporting on industrial best practices </p>\n<hr>\n<p>Submission and publication</p>\n<hr>\n<p>Original papers, not submitted for publication elsewhere, have to be submitted electronically in PDF format via easychair. All submissions have to follow the Springer LNCS paper format.<br>\nThe submission type according to the categories mentioned under Types of Contributions must be stated explicitly by the author(s) upon submission via the conference website. The submission type influences the review criteria.<br>\nAccepted contributions must be presented at the conference. Accepted papers are published by Springer in the LNCS series. Authors need to sign a copyright transfer form to transfer usage rights on theirs papers to Springer.</p>\n<hr>\n<p>Important Dates</p>\n<hr>\n<ul>\n<li>Abstracts submission: May 8, 2011</li>\n<li>Papers due: May 15, 2011 </li>\n<li>Notifications: July 13, 2011</li>\n<li>Camera ready: July 30, 2011</li>\n<li>ICTSS 2011 conference: November 7-10, 2011</li>\n</ul>\n<hr>\n<p>Organization</p>\n<hr>\n<p>Program Chairs:</p>\n<ul>\n<li>Burkhart Wolff, University Paris-Sud XI, France</li>\n<li>Fatiha Zaidi, University Paris-Sud XI, France</li>\n</ul>\n<p>ICTSS 2011 Program Committee :</p>\n<ul>\n<li>Paul Baker, Motorola, England  </li>\n<li>Achim Brucker, SAP Research, Germany</li>\n<li>Antonia Bertolino, ISTI-CNR, Italy</li>\n<li>Gregor V. Bochmann, University of Ottawa, Canada</li>\n<li>Ana R. Cavalli, Telecom SudParis, France</li>\n<li>Jim Davies, University of Oxford, UK</li>\n<li>John Derrick, University of Sheffield, UK</li>\n<li>Gordon Frazer, TU Graz, Austria</li>\n<li>Jens Grabowski, University of Gottingen, Germany</li>\n<li>Roland Groz, Grenoble INP, France</li>\n<li>Wolfgang Grieskamp, Microsoft Research, USA</li>\n<li>Toru Hasegawa, KDDI R&amp;D, Japan</li>\n<li>Rob Hierons, Brunel University, UK</li>\n<li>Teruo Higashino, Osaka University, Japan</li>\n<li>Dieter Hogrefe, University of Gottingen, Germany</li>\n<li>Antti Huima, M.Sc. Tech, Finland</li>\n<li>Thierry Jeron, IRISA Rennes, France</li>\n<li>Ferhat Khendek, Concordia University, Canada</li>\n<li>David Lee, Ohio State University, USA</li>\n<li>Bruno Legeard, Leirios, France</li>\n<li>Delphine Longuet, University of Paris-Sud XI, France</li>\n<li>Stephane Maag, Telecom SudParis, France</li>\n<li>Jose Carlos Maldonado, U of San Carlos; Brazil</li>\n<li>Mercedes G. Merayo, University of Complutense de Madrid, Spain</li>\n<li>Brian Nielsen, University of Aalborg, Danemark</li>\n<li>Manuel Nunez, University of Complutense de Madrid, Spain</li>\n<li>Doron Peled, University of Bar-Ilan, Israel</li>\n<li>Alexandre Petrenko, CRIM, Canada</li>\n<li>Antoine Rollet, University of Bordeaux 1, France</li>\n<li>Ina Schieferdecker, Fraunhofer FOKUS, Germany</li>\n<li>Adenilso da Silva Simao, University of San Carlos, Brazil</li>\n<li>Kenji Suzuki, University of Electro-Communications, Japan</li>\n<li>Nicolai Tillmann, Microsoft Research, USA</li>\n<li>Andreas Ulrich, Siemens AG, Germany</li>\n<li>Hasan Ural, University of Ottawa, Canada</li>\n<li>Umit Uyar, City University of New York, USA</li>\n<li>Margus Veanes, Microsoft Research, USA</li>\n<li>Cesar Viho, IRISA Rennes, France</li>\n<li>Carsten Weise, RWTH Aachen, Germany</li>\n<li>Burkhart Wolff, University of Paris-Sud XI, France</li>\n<li>Nina Yevtushenko, Tomsk State University, Russia</li>\n<li>Fatiha Zaidi, University of Paris-Sud XI, France</li>\n</ul>\n<hr>\n<p>Contact</p>\n<hr>\n<p>Conference Website: <a href=\"http://ictss2011.lri.fr\">http://ictss2011.lri.fr</a><br>\nFor any inquiries please contact the program chairs at: <a href=\"mailto:ictss11@easychair.org\">ictss11@easychair.org</a></p>",
        "id": 294132816,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660843423
    }
]