[
    {
        "content": "<p>From: \"Pasupuleti, Vijay\" &lt;<a href=\"mailto:V.S.Pasupuleti@warwick.ac.uk\">V.S.Pasupuleti@warwick.ac.uk</a>&gt;<br>\nHi,</p>\n<p>I am trying (but failing) to use Isabelle in conjunction with another tool, Symphony. My system runs Windows 7 OS. Let me just add that I could run Isabelle from the jEdit interface, on the ToyList example from the tutorial.<br>\nIn order to do the above, I need to have write permissions to my Isabelle heaps directory, which is a subdirectory of the following location.</p>\n<p>$USER_HOME/.isabelle</p>\n<p>The directory $USER_HOME is nothing but the home directory as per Cygwin installation (that is what I gather, I could be wrong).<br>\nBut this directory seems to be picked up from a network location, as the machine is part of a domain at the university.<br>\nI do not have write permissions to that directory, and would like to change it to a directory on my local drive.</p>\n<p>Does anybody know how to do this? Thanks in anticipation.</p>",
        "id": 294275958,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660918771
    },
    {
        "content": "<p>From: Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt;<br>\nOn Wed, 16 Apr 2014, Pasupuleti, Vijay wrote:</p>\n<blockquote>\n<p>I am trying (but failing) to use Isabelle in conjunction with another <br>\ntool, Symphony.</p>\n</blockquote>\n<p>Can you say what Symphony is, and how it needs to be connected to <br>\nIsabelle?  A quick web search gives the following <br>\n<a href=\"http://en.wikipedia.org/wiki/Symphony_%28software%29\">http://en.wikipedia.org/wiki/Symphony_%28software%29</a></p>\n<blockquote>\n<p>I need to have write permissions to my Isabelle heaps directory, which <br>\nis a subdirectory of the following location.</p>\n<p>$USER_HOME/.isabelle</p>\n<p>The directory $USER_HOME is nothing but the home directory as per Cygwin <br>\ninstallation (that is what I gather, I could be wrong).</p>\n</blockquote>\n<p>That is a bit odd.  The separate $USER_HOME (instead of better known <br>\n$HOME) was introduced specifically for the purpose of Windows and Cygwin, <br>\nto refer to the normal Windows user home directory, not the one within the <br>\nCygwin root.</p>\n<p>We need to figure out where that $USER_HOME comes from.  The default is <br>\ndetermined like this:</p>\n<p>if [ -z \"$USER_HOME\" ]; then<br>\n     USER_HOME=\"$(cygpath -u \"$HOMEDRIVE\\\\$HOMEPATH\")\"<br>\n   fi</p>\n<p>This assumes that there is no other source for a different $USER_HOME and <br>\nthat \"$HOMEDRIVE\\\\$HOMEPATH\" refer to the correct location.</p>\n<blockquote>\n<p>But this directory seems to be picked up from a network location, as the <br>\nmachine is part of a domain at the university. I do not have write <br>\npermissions to that directory, and would like to change it to a <br>\ndirectory on my local drive.</p>\n</blockquote>\n<p>Does that mean Isabelle is installed centrally on a network drive?  That <br>\nis basically OK -- it used to be done like that often in the past -- but <br>\nin recent years it came out of use since people usually have their private <br>\nmachines.</p>\n<p>Makarius</p>",
        "id": 294276001,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660918784
    }
]