[
    {
        "content": "<p>From: \"Munoz, Cesar Augusto (LARC-D320)\" &lt;<a href=\"mailto:cesar.a.munoz@nasa.gov\">cesar.a.munoz@nasa.gov</a>&gt;<br>\nCALL FOR PAPERS<br>\nInternational Workshop on Strategies in Rewriting, Proving, and Programming<br>\n                              IWS 2010<br>\n<a href=\"http://iws2010.inria.fr\">iws2010.inria.fr</a><br>\n                   (A satellite workshop of FLoC 2010)<br>\n                        July 9 2010, Edinburgh, UK</p>\n<p>Abstract submission: March 26, 2010<br>\nNotification date: April 11, 2010<br>\nAbstract final version: April 25, 2010<br>\nWorkshop: July 9, 2010<br>\nSubmission of full paper for the proceedings: September 5, 2010</p>\n<p>Strategies are ubiquitous in programming languages, automated<br>\ndeduction and reasoning systems, yet only since about ten years have<br>\nthey been studied in their own right. In the two communities of<br>\nRewriting and Programming on one side, and of Deduction and Proof<br>\nengines (Provers, Assistants, Solvers) on the other side, workshops<br>\nhave been launched to make progress towards a deeper understanding of<br>\nthe nature of strategies, their descriptions, their properties, and<br>\ntheir usage, in all kinds of computing and reasoning systems. Since<br>\nmore recently, strategies are also playing an important role in<br>\nrewrite-based programming languages, verification tools and techniques<br>\nlike SAT/SMT engines or termination provers. Moreover strategies have<br>\ncome to be viewed more generally as expressing complex designs for<br>\ncontrol in computing, modeling, proof search, program transformation,<br>\nand access control.</p>\n<p>Possible topics to address in this workshop include:</p>\n<ul>\n<li>\n<p>Foundations for the definition and semantic description of strategies:<br>\n  models of search spaces, logical or mathematical formalisms<br>\n  to define strategies and prove properties about them.</p>\n</li>\n<li>\n<p>Properties of strategies and corresponding computations:<br>\n  logical or mathematical formalisms to  prove properties about them.</p>\n</li>\n<li>\n<p>Analysis and optimization techniques for strategies:<br>\n  analysis of the search space, evaluation and comparison of strategies.</p>\n</li>\n<li>\n<p>Integration of strategic deductions and/or strategic computations:<br>\n  interrelations, combinations and applications of deduction and computation<br>\n  under different strategies, control issues and strategies in the<br>\nintegration<br>\n  of systems, strategies in decision procedures for SMT.</p>\n</li>\n<li>\n<p>Strategy languages: essential constructs, meta-level features. Definition,<br>\n  design, implementation and application. Comparison of  strategies in<br>\n  (existing) systems.</p>\n</li>\n<li>\n<p>Concrete types of (reduction/evaluation) strategies in rewriting<br>\n  and programming, lambda calculi, normalization, narrowing, constraint<br>\n  solving, as well as their properties and characteristics (complexity,<br>\n  decidability, ...).</p>\n</li>\n<li>\n<p>Applications and case studies in which strategies play a major role.</p>\n</li>\n</ul>\n<p>FLoC 2010 provides an excellent opportunity  to foster exchanges between<br>\nthe communities of Rewriting and Programming  on one side, and of Deduction<br>\nand Proof engines on the other side. This workshop is a joint follow-up of<br>\ntwo series of workshops, held since 1997: the Strategies workshops held by<br>\nthe CADE-IJCAR  community and the Workshops on Reduction Strategies (WRS)<br>\nheld by the RTA-RDP community.</p>\n<p>Submissions</p>\n<hr>\n<p>The submission process is in two stages.</p>\n<p>1) Before the workshop, authors are invited to submit an extended abstract<br>\n   (max. 5 pages) to be formatted in the EasyChair class style</p>\n<p><a href=\"http://www.easychair.org/easychair.zip\">http://www.easychair.org/easychair.zip</a></p>\n<p>through the EasyChair submission site:</p>\n<p><a href=\"http://www.easychair.org/conferences/?conf=iws2010\">http://www.easychair.org/conferences/?conf=iws2010</a></p>\n<p>Accepted abstracts will be presented at the workshop and included in<br>\n   the preliminary proceedings, available at the workshop.</p>\n<p>2) After the workshop, authors will be invited to submit a<br>\n   full paper of their presentation (typically a 15-pages paper), which<br>\n   will be refereed  and considered for publication in the electronic<br>\n   journal: Electronic Proceedings in Theoretical Computer Science<br>\n   (<a href=\"http://eptcs.org\">http://eptcs.org</a>).</p>\n<p>Beyond original ideas and recent results not published nor submitted<br>\nelsewhere, we also invite authors to submit a 5-pages abstract describing<br>\nrelevant work that has been or will be published elsewhere, or work in<br>\nprogress. These submissions will be only considered for presentation<br>\nat the workshop and inclusion in the preliminary proceedings but not<br>\nin the final proceedings.</p>\n<p>Organizers</p>\n<hr>\n<p>Helene Kirchner, INRIA Bordeaux - Sud-Ouest, France<br>\nCesar Munoz, NASA Langley Research Center, Hampton, USA</p>\n<p>Program Committee</p>\n<hr>\n<p>Maria Paola Bonacina, Univ. degli Studi di Verona, Italy<br>\nJean-Christophe Filliatre, CNRS, France<br>\nBernhard Gramlich, Technische Universitat Wien, Austria<br>\nSalvador Lucas, Universidad Politecnica de Valencia, Spain<br>\nPierre-Etienne Moreau, LORIA-INRIA Nancy, France<br>\nNatarajan Shankar, SRI International, Menlo Park, CA, USA<br>\nEelco Visser, Delft Univ. of Technology, The Netherlands<br>\nChristoph Weidenbach, MPI-INF, Saarbrucken, Germany</p>\n<p>Web:   <a href=\"http://iws2010.inria.fr\">iws2010.inria.fr</a><br>\nEmail: <a href=\"mailto:iws2010@inria.fr\">iws2010@inria.fr</a></p>",
        "id": 294093440,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660832598
    }
]