[
    {
        "content": "<p>From: <a href=\"mailto:Gerwin.Klein@data61.csiro.au\">Gerwin.Klein@data61.csiro.au</a><br>\nWe also have one open position for an early-career research scientist in formal verification.</p>\n<p>Cheers,<br>\nGerwin</p>\n<p>Data61 Seeking Research Scientist<br>\n=================================</p>\n<p>We are looking for a full-time research scientist in formal verification to<br>\njoin us, the Trustworthy Systems group, at Data61, CSIRO. Our highly<br>\ninternational team is located on the UNSW campus, close to the beautiful<br>\nbeaches of sunny Sydney, Australia, one of the world's most liveable cities.</p>\n<p>Our vision is a world in which computer users can choose all three: correct,<br>\nsecure, and fast. We believe that most current approaches to building systems<br>\nare fundamentally flawed. We aim to demonstrate a better way. Our approach is<br>\nrooted in foundational, formal verification using theorem provers (e.g.,<br>\nIsabelle, HOL4), and high-performance system design. If you find this vision<br>\nappealing, and have ideas about how to pursue it, we want to hear from you.</p>\n<p>Our team brings together a unique combination of expertise in systems,<br>\nsecurity, formal verification, and programming languages. We are the creators<br>\nof seL4, the world's first operating system microkernel with a<br>\nmachine-checked proof (in Isabelle/HOL). seL4 boasts both extreme performance<br>\nand foundational binary-level correctness and security proofs. We are also<br>\ninvolved in CakeML, the most realistic verified compiler for a functional<br>\nprogramming language, and a promising approach to scaling full verification<br>\nup to applications code.</p>\n<p>We are building on these successes in various directions, including<br>\nconcurrency (formal reasoning and implementation), timing (real-time<br>\nguarantees and timing channels), and whole-system verification using<br>\ncomponent systems (e.g., CAmKES) and code+proof co-generation.</p>\n<p>We publish in top conferences, and are involved in multiple international<br>\nresearch collaborations. You will have the opportunity to teach at UNSW<br>\nshould you wish to take it. We have a flexible, friendly, and intellectually<br>\nstimulating work environment.</p>\n<p>We value diversity in all forms and welcome applications from people of all<br>\nages, including people with disabilities, and those who identify as LGBTIQ.<br>\nSee <a href=\"https://ts.data61.csiro.au/diversity/\">https://ts.data61.csiro.au/diversity/</a> for more information.</p>\n<p>The salary range for this position is AUD 95-103K (plus superannuation),<br>\ndepending on experience and qualifications.</p>\n<p>Apply online here:<br>\n<a href=\"https://jobs.csiro.au/job/Sydney%2C-NSW-Research-Scientist-in-Formal-Verification/438798200/\">https://jobs.csiro.au/job/Sydney%2C-NSW-Research-Scientist-in-Formal-Verification/438798200/</a></p>\n<p>Your application should include a cover letter, CV, short research statement,<br>\nand contact information for two references.</p>\n<p>This round of applications closes 21 November 2017.</p>",
        "id": 294720629,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661184670
    }
]