[
    {
        "content": "<p>From: Ching-Tsun Chou &lt;<a href=\"mailto:chingtsun.chou@gmail.com\">chingtsun.chou@gmail.com</a>&gt;<br>\nI run:</p>\n<p>isabelle build -b HOL-Library</p>\n<p>and find that a heap image for HOL-Library is saved under my<br>\n$HOME/.isabelle.  But when I launch the Isabelle IDE, create a new theory<br>\nand import the theory HOL-Library.Library in the new theory, it looks like<br>\nIsabelle re-loads and re-checks all theories in HOL-Library, since those<br>\ntheories show up in the theory panel of the IDE and have colored progress<br>\nbars.</p>\n<p>However, after I change the default theory in the theory panel to<br>\nHOL-Library, quit the IDE and then re-launch it, a window pops up showing<br>\nthat Isabelle is re-building HOL-Library, whose heap image is saved under<br>\nthe Isabelle installation's directory.  (On my Mac, it is<br>\n/Applications/Isabelle2018.app.)  Furthermore, if I quit the IDE and then<br>\ncome back and open the theory which imports HOL-Library.Library, Isabelle<br>\ndoes not re-load and re-check HOL-Library.</p>\n<p>My questions are:</p>\n<ul>\n<li>\n<p>What caused the difference between the two scenarios, in particular<br>\nregarding whether the previously saved session is re-checked?</p>\n</li>\n<li>\n<p>My goal is to create the heap images of large sessions like<br>\nHOL-Analysis.  Is there a command-line method of doing this?</p>\n</li>\n</ul>\n<p>Thanks!</p>\n<ul>\n<li>Ching Tsun</li>\n</ul>",
        "id": 294744608,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661192918
    },
    {
        "content": "<p>From: Christian Sternagel &lt;<a href=\"mailto:c.sternagel@gmail.com\">c.sternagel@gmail.com</a>&gt;<br>\nDear Ching Tsun,</p>\n<p>the default session heap image (or \"default logic\") that is used when<br>\nstarting Isabelle/jEdit is \"HOL\". Which is why, even when you already<br>\nbuilt a heap image for HOL-Library, the corresponding theories are<br>\nloaded again.</p>\n<p>You can tell Isabelle/jEdit explicitly on the command line, which heap<br>\nimage to use (setting the default logic in the theory panel, should<br>\nbasically be equivalent, but you avoid a restart):</p>\n<p>isabelle jedit -l HOL-Library</p>\n<p>should build the heap image HOL-Library if necessary (and otherwise<br>\nreuse the existing heap image).</p>\n<p>Concerning the other part of your question, why HOL-Libary was rebuilt<br>\nby Isabelle/jEdit even though you already did</p>\n<p>isabelle build -b HOL-Library</p>\n<p>on the command line, I am not 100% sure, but I think this is due to the<br>\nfact that Isabelle has two different \"build modes\": system build mode,<br>\nand \"user\" build mode. See also the -s option for \"isabelle build\".</p>\n<p>With the former session heap images are located below the installation<br>\ndirectory of Isabelle ( $ISABELLE_HOME ) and with the latter below<br>\nthe user's home directory ( $ISABELLE_HOME_USER ).</p>\n<p>I think what happened is the following:</p>\n<ul>\n<li>\n<p>\"isabelle build -b HOL-Library\" produced a heap image below<br>\nISABELLE_HOME_USER</p>\n</li>\n<li>\n<p>but setting HOL-Library as default logic in Isabelle/jEdit looks for<br>\nthe heap image below ISABELLE_HOME (I am not sure about this point)</p>\n</li>\n<li>\n<p>thus after the first restart of Isabelle/jEdit the image was produced<br>\nbelow ISABELLE_HOME and the next time no rebuilt was necessary</p>\n</li>\n</ul>\n<p>cheers</p>\n<p>chris</p>",
        "id": 294744639,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661192930
    },
    {
        "content": "<p>From: Dominique Unruh &lt;<a href=\"mailto:unruh@ut.ee\">unruh@ut.ee</a>&gt;<br>\nTo add what Christian said:</p>\n<p>This is due to different defaults in the isabelle-command (command line),<br>\nand the <a href=\"http://Isabelle2018.app\">Isabelle2018.app</a> (under its different names on different OSs).</p>\n<p>Roughly speaking, <a href=\"http://Isabelle2018.app\">Isabelle2018.app</a> runs \"isabelle jedit -s\", hence the<br>\nimage will be in the Isabelle installation directory.<br>\nWhile \"isabelle jedit\" and \"isabelle build\" uses the user directory by<br>\ndefault.</p>\n<p>So there are three ways to avoid the duplication of heaps:</p>\n<p>- Always use the -s option when running the \"isabelle\" command (e.g., in<br>\n   \"isabelle build\").</p>\n<p>- Avoid using <a href=\"http://Isabelle2018.app\">Isabelle2018.app</a>, use \"isabelle jedit\" instead<br>\n   - Use symlinks to make the two heap directories point to the same place.</p>\n<p>Personally, I think it would be best if the Isabelle distro would switch to<br>\nusing the same default in both tools but I don't know if there are any<br>\nreasons against this that I am not aware of.</p>\n<p>Best wishes,<br>\nDominique.</p>",
        "id": 294744654,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661192937
    },
    {
        "content": "<p>From: Ching-Tsun Chou &lt;<a href=\"mailto:chingtsun.chou@gmail.com\">chingtsun.chou@gmail.com</a>&gt;<br>\nThanks a lot for all the explanations!</p>\n<ul>\n<li>Ching Tsun</li>\n</ul>",
        "id": 294744697,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661192959
    }
]