[
    {
        "content": "<p>From: Christian Urban &lt;<a href=\"mailto:urbanc@in.tum.de\">urbanc@in.tum.de</a>&gt;<br>\nHi Florian,</p>\n<p>Are you aware of all the recent developments in the nominal <br>\ndatatype package? </p>\n<p>We already provide a usable infrastructure to reason with <br>\nnamed alpha-equated lambda-terms - i.e. we can already reason <br>\nabout alpha-equivalence classes relatively easily without having <br>\nto represent them with de-Bruijn indices. The nominal package<br>\nis still a research project, as you write. However, we come already <br>\nquite close to the informality on paper. We have shown this in <br>\nformalisations for the CR-property in the lambda-calculus (following <br>\nthe proof Barendregt's book and I think this is the one you follow, just <br>\nwith de Bruijn indices), for SN in the simply-typed lambda-calculus <br>\n(following Girard's Proofs and Types Book), various proofs from <br>\nSOS and a complete formalisation of a chapter by Crary on logical <br>\nrelations. I do not foresee any problems to reuse the nominal package <br>\nfor your formalisation. What you gain is that your proofs look more <br>\nlike what one would write down on paper. If we can be of any assistance,<br>\nplease let us know.</p>\n<p>Best wishes,<br>\nChristian </p>\n<p>Florian Kammueller writes:</p>\n<blockquote>\n<p>Hello,</p>\n<p>I'd like to announce recent work with Ludovic Henrio on the <br>\nformalization of<br>\nAbadi's and Cardelli's Theory of Objects in Isabelle/HOL. We formalized <br>\nthe untyped<br>\nsigma calculus and proved confluence.</p>\n<p>A Technical report is available here <a href=\"https://hal.inria.fr/inria-00121816\">https://hal.inria.fr/inria-00121816</a> .<br>\nWe would appreciate comments and experience reports from people who have <br>\nperformed<br>\nsimilar experiments.</p>\n<p>Florian Kammueller<br>\n--<br>\nDr. Florian Kammüller, wissenschaftlicher Assistent<br>\nInstitut für Softwaretechnik und Theoretische Informatik<br>\nTU-Berlin, Franklinstr 28/29, 10587 Berlin<br>\nTel +49-30-314 24330</p>\n</blockquote>",
        "id": 294045582,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660817159
    }
]