[
    {
        "content": "<p>From: Lawrence Paulson &lt;<a href=\"mailto:lp15@cam.ac.uk\">lp15@cam.ac.uk</a>&gt;<br>\nWe have a new and ambitious entry concerning the development of cryptographic protocols by refinement. Details below. Have fun!</p>\n<p>Larry Paulson</p>\n<p>Refining Authenticated Key Agreement with Strong Adversaries</p>\n<p>We develop a family of key agreement protocols that are correct by construction. Our work substantially extends prior work on developing security protocols by refinement. First, we strengthen the adversary by allowing him to compromise different resources of protocol participants, such as their long-term keys or their session keys. This enables the systematic development of protocols that ensure strong properties such as perfect forward secrecy. Second, we broaden the class of protocols supported to include those with non-atomic keys and equationally defined cryptographic operators. We use these extensions to develop key agreement protocols including signed Diffie-Hellman and the core of IKEv1 and SKEME.</p>\n<p><a href=\"https://www.isa-afp.org/entries/Key_Agreement_Strong_Adversaries.shtml\">https://www.isa-afp.org/entries/Key_Agreement_Strong_Adversaries.shtml</a></p>",
        "id": 294705587,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661180523
    },
    {
        "content": "<p>From: Lars Hupel &lt;<a href=\"mailto:hupel@in.tum.de\">hupel@in.tum.de</a>&gt;<br>\nThis entry fails the \"afp_check_roots\" check:</p>\n<p>The following entries contain sessions without timeouts:<br>\n  Key_Agreement_Strong_Adversaries (Compromising_DH, Compromising_Infra,<br>\nCompromising_L1, Compromising_SKEME)<br>\nThe following sessions have wrong groups:<br>\n  Compromising_DH {}<br>\n  Compromising_Infra {}<br>\n  Compromising_L1 {}<br>\n  Compromising_SKEME {}<br>\nErrors found.</p>\n<p>I see that the ROOT file explicitly states:</p>\n<p>(* THE REMAINING SESSIONS WILL NOT BE TESTED BY THE AFP *)</p>\n<p>But running all of these sessions takes less than 5 minutes in total on<br>\nmy puny laptop, so I don't see any reason for excluding them. Thoughts?</p>\n<p>Cheers<br>\nLars</p>",
        "id": 294707074,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661180953
    }
]