[
    {
        "content": "<p>From: Sandip Ray &lt;<a href=\"mailto:sandip@cs.utexas.edu\">sandip@cs.utexas.edu</a>&gt;<br>\n[ Apologies if you get several copies of this call for papers.  Please<br>\n  share it with students and colleagues who may be interested in the<br>\n  workshop. ]</p>\n<p>===============================================================================<br>\n                         SECOND CALL FOR PAPERS<br>\n===============================================================================<br>\n                            ACL2 2009<br>\nInternational Workshop on the ACL2 Theorem Prover and Its Applications<br>\n                           May 11-12, 2009<br>\n                   Northeastern University, Boston, MA, USA<br>\n<a href=\"http://www.cs.utexas.edu/~sandip/acl2-09/\">http://www.cs.utexas.edu/~sandip/acl2-09/</a></p>\n<p>In cooperation with ACM SIGPLAN</p>\n<p>===============================================================================<br>\nIMPORTANT DATES</p>\n<p>Abstract Submission: January 12, 2009<br>\nPaper Submission: January 19, 2009<br>\nAcceptance Notification: February 23, 2009<br>\nFinal Version: March 23, 2009</p>\n<p>===============================================================================<br>\nSCOPE OF CONFERENCE</p>\n<p>ACL2 2009 is a major forum for the users of the ACL2 theorem proving<br>\nsystem to present research related to the ACL2 theorem prover and its<br>\napplications, and is the eighth in the series of workshops, occurring<br>\nat approximately 18-month intervals.  ACL2 is a state-of-the-art<br>\nautomated reasoning system, the latest in the Boyer-Moore family of<br>\ntheorem provers, for which its authors received the 2005 ACM Software<br>\nSystems Award. ACL2 2009 is planned as a two-day workshop to be held<br>\nin Boston, MA, USA, on May 11-12, 2009.  In addition to paper<br>\npresentations, ACL2 2009 is anticipated to include two keynote<br>\nlectures, a panel discussion, and several rump sessions discussing<br>\nongoing research.</p>\n<p>We invite submission of papers on any topic related to ACL2 and its<br>\napplications. We strongly encourage the participation of users of<br>\nother theorem provers and researchers and practitioners interested in<br>\ntheorem proving technology. Appropriate topics include, but are not<br>\nlimited to, the following:</p>\n<p>* Applications of ACL2 in hardware and software system verification<br>\n    * Formalization of mathematics in ACL2<br>\n    * Use of ACL2 in emerging and novel application areas<br>\n    * New libraries, tools, and interfaces for ACL2<br>\n    * Connection of ACL2 with other formal (and semi-formal) verification tools<br>\n    * Foundational issues related to ACL2<br>\n    * Comparison of ACL2 with other formal verification tools<br>\n    * Reports and proposals on improvement of ACL2<br>\n    * Challenge problems related to implementation and applications of ACL2<br>\n    * Classroom and pedagogical experiences in the use of ACL2</p>\n<p>===============================================================================<br>\nPAPER SUBMISSION</p>\n<p>Submissions must be made electronically in PDF format through the ACL2<br>\n2009 Web site.  Submissions must use ACM SIG Proceedings format with<br>\nletter-size paper (see URL<br>\n<a href=\"http://www.acm.org/sigs/pubs/proceed/template.html\">http://www.acm.org/sigs/pubs/proceed/template.html</a>).  ACL2 2009 is<br>\norganized in cooperation with ACM SIGPLAN and the proceedings are<br>\nexpected to be published in the ACM Digital Library.</p>\n<p>Two categories of papers will be accepted: long (at most 10 pages) and<br>\nshort (at most 4 pages).  Authors may assume that the audience has a<br>\nworking knowledge of ACL2's syntax, basic commands, and modeling<br>\ntechniques.  Papers should contain a short abstract of about 150<br>\nwords, clearly stating the contribution of the submission.  Papers<br>\nshould be self-contained, but we strongly encourage authors to follow<br>\nthe tradition (where applicable) of providing ACL2 \"books\", or script<br>\nfiles, with instructions for their execution.  For accepted papers,<br>\nthese books will be mirrored from the ACL2 Home Page and included in<br>\nthe future ACL2 distributions.  At least one author of each accepted<br>\npaper will be required to register for the workshop and present the<br>\npaper.</p>\n<p>==============================================================================<br>\nORGANIZATION</p>\n<p>Co-Chairmen:         Sandip Ray,  University of Texas at Austin, USA <br>\n                     David Russinoff,   Advanced Micro Devices, Inc., USA<br>\nLocal Arrangements:  Panagiotis Manolios, Northeastern University, USA<br>\nPublications:        Ruben Gamboa, University of Wyoming </p>\n<p>Steering Committee:  John Cowles, University of Wyoming, USA <br>\n             Ruben Gamboa, University of Wyoming, USA <br>\n             Matt Kaufmann, University of Texas at Austin, USA <br>\n             Panagiotis Manolios, Northeastern University, USA <br>\n             J Strother Moore, University of Texas at Austin, USA <br>\n             Jun Sawada, IBM Austin Research Laboratory, USA<br>\n             Matt Wilding, Rockwell Collins, Inc., USA</p>\n<p>==============================================================================<br>\nPROGRAM COMMITTEE</p>\n<p>* John Cowles, University of Wyoming, USA <br>\n  * Ruben Gamboa, University of Wyoming, USA <br>\n  * Mike Gordon, Cambridge University, UK <br>\n  * Matt Kaufmann, University of Texas at Austin, USA <br>\n  * Francisco Palomo Lozano, Universidad de Cadiz, Spain <br>\n  * Panagiotis Manolios, Northeastern University, USA <br>\n  * John Matthews, Galois, Inc., USA <br>\n  * J Strother Moore, University of Texas at Austin, USA <br>\n  * Rex Page, University of Oklahoma, USA<br>\n  * Jun Sawada, IBM Austin Research Laboratory, USA<br>\n  * Julien Schmaltz, Radboud University, Nijmegen, the Netherlands<br>\n  * Natarajan Shankar, SRI International, USA <br>\n  * Rob Sumners, Advanced Micro Devices, Inc., USA <br>\n  * Freek Wiedijk, Radboud University, Nijmegen, the Netherlands<br>\n  * Matt Wilding, Rockwell Collins, Inc., USA</p>",
        "id": 294069264,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660826610
    }
]