[
    {
        "content": "<p>From: Scott Owens &lt;<a href=\"mailto:S.A.Owens@kent.ac.uk\">S.A.Owens@kent.ac.uk</a>&gt;<br>\nI’m presently looking (with Simon Thompson) for two Post Docs to work on a CakeML related project. (Although the CakeML verified compiler is developed in HOL4, rather than Isabelle, it is the same kind of verification project that is very common in the Isabelle world too.) The posts last for 3.5 years and are at the University of Kent in Canterbury, England. Applications are due by <em>12 June, 2016</em>.</p>\n<p>Here is a brief description of the project:</p>\n<p>Trustworthy Refactoring project: Research Associate Positions in Refactoring Functional Programs and Formal Verification (for CakeML) </p>\n<p>The Trustworthy Refactoring project at the University of Kent is seeking to recruit postdoc research associates for two 3.5 year positions, to start in September this year.</p>\n<p>The overall goal of this project is to make a step change in the practice of refactoring by designing and constructing of trustworthy refactoring tools. By this we mean that when refactorings are performed, the tools will provide strong evidence that the refactoring has not changed the behaviour of the code, built on a solid theoretical understanding of the semantics of the language. Our approach will provide different levels of assurance from the (strongest) case of a fully formal proof that a refactoring can be trusted to work on all programs, given some pre-conditions, to other, more generally applicable guarantees, that a refactoring applied to a particular program does not change the behaviour of that program. </p>\n<p>The project will make both theoretical and practical advances. We will build a fully-verified refactoring tool for a relatively simple, but full featured programming language (CakeML <a href=\"https://cakeml.org\">https://cakeml.org</a>), and at the other we will build an industrial-strength refactoring tool for a related industrially-relevant language (OCaml). This OCaml tool will allow us to explore a range of verification techniques, both fully and partially automated, and will set a new benchmark for building refactoring tools for programming languages in general. </p>\n<p>The project, which is coordinated by Prof Simon Thompson and Dr Scott Owens, will support two research associates, and the four will work as a team. One post will focus on pushing the boundaries of trustworthy refactoring via mechanised proof for refactorings in CakeML, and the other post will concentrate on building an industrial strength refactoring tool for OCaml. The project has industrial support from Jane Street Capital, who will contribute not only ideas to the project but also host the second RA for a period working in their London office, understanding the OCaml infrastructure and their refactoring requirements.</p>\n<p>You are encouraged to contact either of the project investigators by email (<a href=\"mailto:s.a.owens@kent.ac.uk\">s.a.owens@kent.ac.uk</a>, <a href=\"mailto:s.j.thompson@kent.ac.uk\">s.j.thompson@kent.ac.uk</a>) if you have any further questions about the post, or if you would like a copy of the full research application for the project. We expect that applicants will have PhD degree in computer science (or a related discipline) or be close to completing one. For both posts we expect that applicants will have experience of writing functional programs, and for the verification post we also expect experience of developing (informal) proofs in a mathematical or programming context.</p>\n<p>To apply, please go to the following web pages:</p>\n<p>Research Associate in Formal Verification for CakeML (STM0682): </p>\n<p><a href=\"https://jobs.kent.ac.uk/fe/tpl_kent01.asp?s=4A515F4E5A565B1A&amp;jobid=40106,3472764668&amp;key=47167934&amp;c=549534472123&amp;pagestamp=sejmwzlocjpwfyyfak\">https://jobs.kent.ac.uk/fe/tpl_kent01.asp?s=4A515F4E5A565B1A&amp;jobid=40106,3472764668&amp;key=47167934&amp;c=549534472123&amp;pagestamp=sejmwzlocjpwfyyfak</a></p>\n<p>Research Associate in Refactoring Functional Programs (STM0683): </p>\n<p><a href=\"https://jobs.kent.ac.uk/fe/tpl_kent01.asp?s=4A515F4E5A565B1A&amp;jobid=40107,6987525698&amp;key=47167934&amp;c=549534472123&amp;pagestamp=sesioeandjktfucacs\">https://jobs.kent.ac.uk/fe/tpl_kent01.asp?s=4A515F4E5A565B1A&amp;jobid=40107,6987525698&amp;key=47167934&amp;c=549534472123&amp;pagestamp=sesioeandjktfucacs</a></p>\n<p>Simon and Scott</p>",
        "id": 294676661,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661175190
    }
]