[
    {
        "content": "<p>From: <a href=\"mailto:Ralf.Treinen@pps.jussieu.fr\">Ralf.Treinen@pps.jussieu.fr</a><br>\nFederated Conference on Rewriting, Deduction, and Programming<br>\n                                  RDP'09<br>\n                  28/6/2009 - 3/7/2009, Brasilia, Brazil<br>\n                      Call For Workshop Proposals        </p>\n<p>RDP'09 is a federated event comprising two major conferences: </p>\n<ul>\n<li>\n<p>The 20th International Conference on Rewriting Techniques and<br>\n   Applications (RTA'09) </p>\n</li>\n<li>\n<p>The 9th International Conference on Typed Lambda Calculi and<br>\n   Applications (TLCA'09) <br>\nIn addition, the School on Rewriting, Type Theory, and Applications<br>\nwill take place the week before RDP.</p>\n</li>\n</ul>\n<p>Previous RDPs were held in 2003 in Valencia (Spain), 2004 in Aachen<br>\n(Germany), 2005 in Nara (Japan), and 2007 in Paris (France). RDP has a<br>\ntradition of federating every two years RTA and TLCA, and of hosting<br>\nrelated workshops.</p>\n<p>We solicit proposals for satellite workshops of RDP'09 that are<br>\nrelated in topics to one or both of the RDP conferences. </p>\n<p>Workshops should have a length of 1 or 2 days (possibilities for<br>\nlonger workshops should be discussed with the organizers). It is<br>\ntradition at RDP that attendance to workshops is open to participants of<br>\nparallel events, similar to the way FLoC workshops are run. There will<br>\nbe one day (Sunday, June 28) reserved for workshops, however, it will<br>\nalso be possible to run workshops on the other days in parallel to one<br>\nof the main conferences.</p>\n<p>RDP will provide the possibility to print workshop proceedings,<br>\ndetails of the procedure will be posted later by the local organizing<br>\ncommittee. RDP will not be able to reimburse invited workshop speakers<br>\nfor travel or living expenses, though it may be possible to waive part<br>\nof the registration fees for invited speakers. The priority of RDP will<br>\nbe to keep registration fees for the conferences and workshops low.</p>\n<p>Please submit your workshop proposal by email to</p>\n<p><a href=\"mailto:rdp09workshop-proposal@sympa.pps.jussieu.fr\">rdp09workshop-proposal@sympa.pps.jussieu.fr</a></p>\n<p>Proposals should be written in plain text. The proposal should cover the<br>\nfollowing topics: </p>\n<ol>\n<li>Name of workshop </li>\n<li>A statement of the topics and goals of the workshop </li>\n<li>Names and addresses of the organizers </li>\n<li>Pointers to descriptions of previous editions of the workshop, if any </li>\n<li>A description of the submission selection process  </li>\n<li>\n<p>Plans for the publication of proceedings (informal proceedings<br>\n    distributed to participants, electronic journal,  proceedings with<br>\n    separate selection process, ...) </p>\n</li>\n<li>\n<p>Plans for invited speakers or special sessions (round-table<br>\n    discussion, tutorials, ...) </p>\n</li>\n<li>\n<p>Expected length of the workshop </p>\n</li>\n<li>Expected number of attendees </li>\n<li>Any special needs (for system demonstrations ...) </li>\n</ol>\n<p>The Workshop Selection Committee consists of  Mauricio Ayala<br>\nRincon (RDP'09 general chair), Pierre-Louis Curien (TLCA'09<br>\nprogram chair), and Ralf Treinen (RTA'09 program chair).</p>\n<p>-----------------------------------------<br>\n        |Nov 17, 2008|deadline for proposals    |<br>\n        -----------------------------------------<br>\n        |Nov 28, 2008|notification of acceptance|<br>\n        -----------------------------------------</p>\n<p>Prospective workshop organizers are welcome to contact the workshop<br>\nselection committee in advance before sending in a formal submission and<br>\nto discuss any questions. </p>\n<p>RDP'07 <a href=\"http://www.lsv.ens-cachan.fr/rdp07/index.html\">http://www.lsv.ens-cachan.fr/rdp07/index.html</a> <br>\n RDP'05 <a href=\"http://www.kurims.kyoto-u.ac.jp/rdp05/\">http://www.kurims.kyoto-u.ac.jp/rdp05/</a>        <br>\n RDP'03 <a href=\"http://www.dsic.upv.es/~rdp03/\">http://www.dsic.upv.es/~rdp03/</a>                <br>\n RTA    <a href=\"http://rewriting.loria.fr/rta/\">http://rewriting.loria.fr/rta/</a>                <br>\n TLCA   <a href=\"http://www.mimuw.edu.pl/tlca/\">http://www.mimuw.edu.pl/tlca/</a></p>",
        "id": 294063595,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660824607
    }
]