[
    {
        "content": "<p>From: Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt;<br>\nThis is how the gutter of jEdit normally works.  I merely imitated the <br>\nexisting ErrorList plugin here: if the gutter already shows line numbers, <br>\nicons are not drawn -- there is no space left for them.</p>\n<p>The reasoning behind this is probably as follows: either you have a dumb <br>\ncommand-line tool that prints error messages with line numbers and you <br>\nnavigate yourself, or you have a smart one where errors are inlined into <br>\nthe source.  Isabelle/jEdit follows the second model.</p>\n<p>What was your motivation to enable line numbers in the first place?</p>\n<p>Makarius</p>",
        "id": 294261116,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660914421
    },
    {
        "content": "<p>From: Gottfried Barrow &lt;<a href=\"mailto:gottfried.barrow@gmx.com\">gottfried.barrow@gmx.com</a>&gt;<br>\nIsabelle/jEdit, a multi-OS application, eliminates some of the <br>\nopportunity for engaging in Mac vs. PC type hostilities, but Eclipse vs. <br>\njEdit is there to take up the slack (where I'd rather have the <br>\ncontinuous proving and graphical symbols of Isabelle/jEdit any day).</p>\n<p>With Eclipse, one can have both information icons in the gutter and line <br>\nnumbers, so it can be done, at least in Eclipse.</p>\n<p>In general, I just like the extra information of line numbers, but I <br>\nneed them specifically with THY files because I use another editor to <br>\nrun macros that do some processing to build LaTeX files from the THY files.</p>\n<p>I compile small sections of a THY into a PDF. My macro takes a begin and <br>\nend line number.</p>\n<p>Regards,<br>\nGB</p>",
        "id": 294261558,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660914576
    },
    {
        "content": "<p>From: Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt;<br>\nI have no problems to paint icons along-side the line numbers, if jEdit <br>\nprovides free pixels for that.</p>\n<p>You can try to convince the guys at <a href=\"http://sourceforge.net/projects/jedit/\">http://sourceforge.net/projects/jedit/</a></p>\n<p>It might actually work out, since someone has enabled line numbers by <br>\ndefault in recent jEdit releases, but I reverted that for Isabelle/jEdit <br>\nto get the icons back.</p>\n<p>Makarius</p>",
        "id": 294261622,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660914599
    },
    {
        "content": "<p>From: Gottfried Barrow &lt;<a href=\"mailto:gottfried.barrow@gmx.com\">gottfried.barrow@gmx.com</a>&gt;<br>\nTo make a feature request, I would have to register with sourceforge, <br>\nand I try to be a part of as few Internet forums as possible. I would <br>\nmake a feature request as a half-hearted demonstration to show that I do <br>\nmy half-hearted part as a team player.</p>\n<p>But, you would have to tell me that line numbers and icons can't already <br>\ncoexist in the jEdit gutter, a statement I would include as part of a <br>\nfeature request.</p>\n<p>In Eclipse, it appears there are two vertical areas which make up the <br>\ngutter, an area for graphical feedback, and an area for the line numbers.</p>\n<p>In jEdit, there are two parts, an area for display of folding, and an <br>\narea which can only (apparently) show either line numbers, or graphical <br>\ninformation. There is the option \"Global Options / Gutter / Selection <br>\narea width (in pixels)\", but when line numbers are displayed, the option <br>\n\"Minimal number of digits to reserve for line numbers\" takes precedence, <br>\nand only line numbers are displayed. I don't know anything about it all <br>\nother than that.</p>\n<p>I did a few searches on the Web looking for how to show both line <br>\nnumbers and icons, but I didn't find anything.</p>\n<p>Regards,<br>\nGB</p>",
        "id": 294261715,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660914624
    },
    {
        "content": "<p>From: Gottfried Barrow &lt;<a href=\"mailto:gottfried.barrow@gmx.com\">gottfried.barrow@gmx.com</a>&gt;<br>\nI guess there's no need for that.</p>\n<p>I though hovering over the info icon is what makes the tooltip window <br>\nshow up, but it's actually hovering over the squiggly lines that does <br>\nit. Sometimes, hovering over the icon seems to do the trick, but it <br>\ncould be that the mouse cursor is close enough to the squiggly line to <br>\nmake it happen. Either way, the information is all the same, and <br>\nhovering over the squiggly line always works.</p>\n<p>A man does not need info icons when squiggly lines exist.</p>\n<p>To belabor the point, to show how it was possible to fool a tech savvy <br>\nperson such as myself, if I pass my mouse cursor over a \"theorem\" with a <br>\nsquiggly line, to get to the icon, the tooltip window will display.</p>\n<p>If I approach the icon from the top or bottom of the gutter, with my <br>\nmouse cursor, no tooltip window is displayed. Consequently, I thought I <br>\nwas getting information from the icon, when I was getting information <br>\nfrom the squiggly line.</p>\n<p>The use of the Isabelle icon at the top of the PIDE window, and in the <br>\ntask bar, is helpful. I use a non-modified jEdit, and the jEdit icon was <br>\ndisplayed for both jEdit and Isabelle/jEdit in the Windows task bar.</p>\n<p>Thanks,<br>\nGB</p>",
        "id": 294262280,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660914820
    },
    {
        "content": "<p>From: Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt;<br>\nGreat.  This proves that you have tested the latest (and last) release <br>\ncandidate <a href=\"http://isabelle.in.tum.de/website-Isabelle2013-2-RC3\">http://isabelle.in.tum.de/website-Isabelle2013-2-RC3</a> where I had <br>\nchanged the application icons.</p>\n<p>I have done myself a 1-2h tour-de-force on Windows 8, with 8 virtual <br>\ncores, and all the auto sledgehammer stuff enabled -- not a single stray <br>\nprocess.</p>\n<p>A bit more than 12 hours are left before I make the final ultimate <br>\nIsabelle2013-2 snapshot ...</p>\n<p>Makarius</p>",
        "id": 294262315,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660914832
    }
]