[
    {
        "content": "<p>From: Walter Guttmann &lt;<a href=\"mailto:walter.guttmann@canterbury.ac.nz\">walter.guttmann@canterbury.ac.nz</a>&gt;<br>\nHi Peter,</p>\n<p>well spotted. The proofs of one subgoal of that subclass statement and four lemmas further down have been generated automatically. I used Prover9 and wrote a simple translator to Isar.</p>\n<p>More details: the classes implement algebras. The assumptions are axioms, which are manually encoded as input for Prover9 together with the statement you want to prove. Prover9 generates quite detailed output including a deduction if it finds a proof. It is mostly straight-forward to translate to Isar (outside of Isabelle) and usually metis can prove the individual steps. Sometimes a bit of manual post-processing was needed, such as using smt or Sledgehammer if metis failed to prove a step. Also the translator currently does not handle constants which appear in some Prover9 proofs. The method worked quite well for this kind of reasoning in algebras. I only used it when I could not make any progress using Sledgehammer.</p>\n<p>Cheers,<br>\nWalter</p>",
        "id": 294767812,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661202747
    },
    {
        "content": "<p>From: Tobias Nipkow &lt;<a href=\"mailto:nipkow@in.tum.de\">nipkow@in.tum.de</a>&gt;<br>\nA Hierarchy of Algebras for Boolean Subsets<br>\nWalter Guttmann and Bernhard Möller</p>\n<p>We present a collection of axiom systems for the construction of Boolean <br>\nsubalgebras of larger overall algebras. The subalgebras are defined as the range <br>\nof a complement-like operation on a semilattice. This technique has been used, <br>\nfor example, with the antidomain operation, dynamic negation and Stone algebras. <br>\nWe present a common ground for these constructions based on a new equational <br>\naxiomatisation of Boolean algebras.</p>\n<p><a href=\"https://www.isa-afp.org/entries/Subset_Boolean_Algebras.html\">https://www.isa-afp.org/entries/Subset_Boolean_Algebras.html</a></p>\n<p>Enjoy!<br>\n<a href=\"/user_uploads/14278/aVsfL1LVakvNM8d0K8jvr5JB/smime.p7s\">smime.p7s</a></p>",
        "id": 294822072,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661242627
    },
    {
        "content": "<p>From: Peter Lammich &lt;<a href=\"mailto:lammich@in.tum.de\">lammich@in.tum.de</a>&gt;<br>\nHello Walter and Bernhard</p>\n<p>There seems to be some auto-generated proofs, e.g.</p>\n<p>subclass boolean_algebra<br>\nproof<br>\n ...</p>\n<p>however, I don't know a tool that would generate proofs that look like<br>\nthat? Are they actually auto-generated? What tool did you use?</p>\n<p>Best,<br>\n  Peter</p>",
        "id": 294822081,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661242634
    }
]