[
    {
        "content": "<p>From: Peter Lammich &lt;<a href=\"mailto:peter.lammich@uni-muenster.de\">peter.lammich@uni-muenster.de</a>&gt;<br>\nHi all,</p>\n<p>up to Isabelle2008, when quick-and-dirty mode was off and a lemma was<br>\n\"shown\" with sorry,<br>\nProofGeneral showed a [!] after the lemma and all lemmas depending on it.</p>\n<p>This does not occur in Isabelle2009, there I cannot see whether my<br>\nstatements depend on some unproven lemmas or not.<br>\nHow can I enable this feature also in version 2009 ?</p>\n<p>Best,<br>\n  Peter</p>",
        "id": 294076615,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660829155
    },
    {
        "content": "<p>From: Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt;<br>\nThe \"[!]\" was a visual rendering of the old \"oracle\" flag within internal <br>\nderivation objects.  In Isabelle2009 there is now a more elaborate notion <br>\nof \"derivation status\" that reflects how much of the formal proofs has <br>\nactually been conducted.  In particular, the standard mode of operation is <br>\nalready asynchronous in the sense that claims are immediately turned into <br>\ntheorems, and the actual proof is delivered later.  (The main application <br>\nat the moment is parallel proof checking in batch mode, but a more refined <br>\ninterface could also let the user edit proofs independently of toplevel <br>\nspecifications, for example.)</p>\n<p>The thm status can be queried in ML like this:</p>\n<p>lemma a: A sorry</p>\n<p>ML {* Thm.status_of @{thm a} *}</p>\n<blockquote>\n<p>val it = {failed = false, oracle = true, unfinished = false}</p>\n</blockquote>\n<p>There is also a visual rendering as combinations of \"?\" and \"!\", but this <br>\nis disabled in the toplevel goals, because it would be [?] (for <br>\n\"unfinished\") most of the time.  As long as the prover interface does not <br>\ngive any direct feedback on this information, you can query it manually <br>\nvia the plain 'thm' command:</p>\n<p>thm a</p>\n<blockquote>\n<p>True  [!]</p>\n</blockquote>\n<p>Makarius</p>",
        "id": 294076691,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660829167
    }
]