[
    {
        "content": "<p>From: Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt;<br>\nCICM 2013 - Conferences on Intelligent Computer Mathematics<br>\n          July 8-12, 2013 at University of Bath, Bath, UK</p>\n<p><a href=\"http://www.cicm-conference.org/2013/cicm.php\">http://www.cicm-conference.org/2013/cicm.php</a></p>\n<p>2nd Call for Papers</p>\n<hr>\n<ul>\n<li>\n<p>Invited Talks by<br>\n   Patrick Ion (Mathematical Reviews, American Mathematical<br>\n                Society, USA)<br>\n   Assia Mahboubi (École Polytechnique and  INRIA/Microsoft<br>\n                    Research Joint Centre, France)<br>\n   Ursula Martin (Queen Mary, University of London, UK)</p>\n</li>\n<li>\n<p>Co-Located Workshops:</p>\n<ul>\n<li>MathUI'13: Mathematical User Interfaces</li>\n<li>OpenMath Workshop 2013</li>\n<li>PLMMS'13: Programming Languages for Mechanized Mathematics Systems</li>\n<li>THedu'13: TP Components for Educational Software</li>\n</ul>\n</li>\n</ul>\n<hr>\n<p>As   computers   and   communications  technology   advance,   greater<br>\nopportunities  arise for  intelligent mathematical  computation. While<br>\ncomputer  algebra, automated  deduction,  mathematical publishing  and<br>\nnovel user interfaces individually have long and successful histories,<br>\nwe  are now seeing  increasing opportunities  for synergy  among these<br>\nareas. The  Conferences on  Intelligent Computer Mathematics  offers a<br>\nvenue for discussing these areas and their synergy.</p>\n<p>The   conference  will   take  place   at  the   University   of  Bath<br>\n(<a href=\"http://www.bath.ac.uk\">www.bath.ac.uk</a>),  with James  Davenport  as the  local organiser.  It<br>\nconsists of four tracks:</p>\n<p>Calculemus<br>\n   Chair: Wolfgang Windsteiger<br>\nDigital Mathematical Libraries (DML)<br>\n   Chair: Petr Sojka<br>\nMathematical Knowledge Management (MKM)<br>\n   Chair: David Aspinall<br>\nSystems and Projects<br>\n   Chair: Christoph Lange</p>\n<p>As  in  previous  years,  there  will  be  a  Doctoral  Programme  for<br>\npresentations by Doctoral students.</p>\n<p>The overall programme  will be organised by the  General Program Chair<br>\nJacques Carette.</p>\n<hr>\n<p>Important dates</p>\n<hr>\n<p>Abstract submission:          1 March 2013<br>\nSubmission deadline:          8 March 2013<br>\nReviews sent to authors:      5 April 2013<br>\nRebuttals due:                8 April 2013<br>\nNotification of acceptance:  14 April 2013<br>\nCamera ready copies due:     26 April 2013<br>\nConference:                 8-12 July 2013</p>\n<hr>\n<p>Tracks</p>\n<hr>\n<p>==========<br>\nCalculemus<br>\n==========</p>\n<p>Calculemus   2013  invites   the  submission   of   original  research<br>\ncontributions to be considered for publication and presentation at the<br>\nconference.  Calculemus  is a series  of conferences dedicated  to the<br>\nintegration  of  computer  algebra   systems  (CAS)  and  systems  for<br>\nmechanised  reasoning  like   interactive  proof  assistants  (PA)  or<br>\nautomated theorem  provers (ATP).  Currently,  symbolic computation is<br>\ndivided into several (more  or less) independent branches: traditional<br>\nones  (e.g., computer  algebra and  mechanised reasoning)  as  well as<br>\nnewly emerging ones (on  user interfaces, knowledge management, theory<br>\nexploration, etc.) The main concern  of the Calculemus community is to<br>\nbring these  developments together in order to  facilitate the theory,<br>\ndesign,  and  implementation   of  integrated  mathematical  assistant<br>\nsystems  that  will  be  used routinely  by  mathematicians,  computer<br>\nscientists and  all others who need  computer-supported mathematics in<br>\ntheir every day business.</p>\n<p>All  topics  in  the  intersection  of computer  algebra  systems  and<br>\nautomated  reasoning systems  are  of interest  for Calculemus.  These<br>\ninclude but are not limited to:</p>\n<ul>\n<li>Automated theorem proving in computer algebra systems.</li>\n<li>Computer algebra in theorem proving systems.</li>\n<li>Adding reasoning capabilities to computer algebra systems.</li>\n<li>Adding computational capabilities to theorem proving systems.</li>\n<li>\n<p>Theory, design and implementation of interdisciplinary systems for<br>\ncomputer mathematics.</p>\n</li>\n<li>\n<p>Case studies and applications that involve a mix of computation and<br>\nreasoning.</p>\n</li>\n<li>\n<p>Case studies in formalization of mathematical theories.</p>\n</li>\n<li>Representation of mathematics in computer algebra systems.</li>\n<li>Theory exploration techniques.</li>\n<li>Combining methods of symbolic computation and formal deduction.</li>\n<li>\n<p>Input languages, programming languages, types and constraint languages,<br>\nand modeling languages for mathematical assistant systems.</p>\n</li>\n<li>\n<p>Homotopy type theory.</p>\n</li>\n<li>Infrastructure for mathematical services.</li>\n</ul>\n<p>===<br>\nDML<br>\n===</p>\n<p>Mathematicians dream of a digital archive containing all peer-reviewed<br>\nmathematical literature ever published, properly linked, validated and<br>\nverified.   It is  estimated that  the entire  corpus  of mathematical<br>\nknowledge  published over  the centuries  does not  exceed 100,000,000<br>\npages,   an   amount   easily   manageable  by   current   information<br>\ntechnologies.</p>\n<p>Track objective  is to provide  a forum for development  of math-aware<br>\ntechnologies, standards, algorithms and formats towards fulfillment of<br>\nthe  dream  of global  digital  mathematical  library (DML).  Computer<br>\nscientists  (D)  and librarians  of  digital  age  (L) are  especially<br>\nwelcome to  join mathematicians  (M) and discuss  many aspects  of DML<br>\npreparation.</p>\n<p>Track topics  are all topics of mathematical  knowledge management and<br>\ndigital  libraries  applicable  in  the  context of  DML  building  --<br>\nprocessing of math knowledge expressed in scientific papers in natural<br>\nlanguages, namely:</p>\n<ul>\n<li>Math-aware text mining (math mining) and MSC classification</li>\n<li>Math-aware representations of mathematical knowledge</li>\n<li>Math-aware computational linguistics and corpora</li>\n<li>Math-aware tools for [meta]data and fulltext processing</li>\n<li>Math-aware OCR and document analysis</li>\n<li>Math-aware information retrieval</li>\n<li>Math-aware indexing and search</li>\n<li>Authoring languages and tools</li>\n<li>MathML, OpenMath, TeX and other mathematical content standards</li>\n<li>Web interfaces for DML content</li>\n<li>Mathematics on the web, math crawling and indexing</li>\n<li>Math-aware document processing workflows </li>\n<li>Archives of written mathematics</li>\n<li>DML management, business models</li>\n<li>DML rights handling, funding, sustainability </li>\n<li>DML content acquisition, validation and curation</li>\n</ul>\n<p>===<br>\nMKM<br>\n===</p>\n<p>Mathematical  Knowledge Management  is an  interdisciplinary  field of<br>\nresearch in the intersection of mathematics, computer science, library<br>\nscience, and scientific publishing. The objective of MKM is to develop<br>\nnew and better ways  of managing sophisticated mathematical knowledge,<br>\nbased on innovative technology  of computer science, the Internet, and<br>\nintelligent   knowledge   processing.  MKM   is   expected  to   serve<br>\nmathematicians,  scientists,   and  engineers  who   produce  and  use<br>\nmathematical  knowledge; educators  and students  who teach  and learn<br>\nmathematics;   publishers  who   offer   mathematical  textbooks   and<br>\ndisseminate   new    mathematical   results;   and    librarians   and<br>\nmathematicians who catalog and organize mathematical knowledge.</p>\n<p>The conference is concerned with all aspects of mathematical knowledge<br>\nmanagement. A non-exclusive list of important topics includes:</p>\n<p>* Representations of mathematical knowledge<br>\n  * Authoring languages and tools<br>\n  * Repositories of formalized mathematics<br>\n  * Deduction systems<br>\n  * Mathematical digital libraries<br>\n  * Diagrammatic representations<br>\n  * Mathematical OCR<br>\n  * Mathematical search and retrieval<br>\n  * Math assistants, tutoring and assessment systems<br>\n  * MathML, OpenMath, and other mathematical content standards<br>\n  * Web presentation of mathematics<br>\n  * Data mining, discovery, theory exploration<br>\n  * Computer algebra systems<br>\n  * Collaboration tools for mathematics<br>\n  * Challenges and solutions for mathematical workflows</p>\n<p>====================<br>\nSystems and Projects<br>\n====================</p>\n<p>The  Systems and  Projects  track of  the  Conferences on  Intelligent<br>\nComputer Mathematics  is a forum for presenting  available systems and<br>\nnew and ongoing  projects in all areas and topics  related to the CICM<br>\nconferences:</p>\n<ul>\n<li>Deduction and Computer Algebra (Calculemus)</li>\n<li>Digital Mathematical Libraries (DML)</li>\n<li>Mathematical Knowledge Management (MKM)</li>\n<li>Artificial Intelligence and Symbolic Computation (AISC)</li>\n</ul>\n<p>The track aims  to provide an overview of  the latest developments and<br>\ntrends within the CICM community  as well as to exchange ideas between<br>\ndevelopers and introduce systems to an audience of potential users.</p>\n<hr>\n<p>Submission Instructions</p>\n<hr>\n<p>Submissions to the  research tracks must not exceed  15 pages and will<br>\nbe reviewed and evaluated with respect to relevance, clarity, quality,<br>\noriginality,   and   impact.   Shorter   papers,   e.g.,  for   system<br>\ndescriptions, are welcome. Authors will have an opportunity to respond<br>\nto  their  papers' reviews  before  the  programme  committee makes  a<br>\ndecision.</p>\n<p>System descriptions and projects  descriptions should be 2-4 pages and<br>\nshould present</p>\n<ul>\n<li>newly developed systems,</li>\n<li>\n<p>systems that have not previously been presented to the CICM community,<br>\n   or</p>\n</li>\n<li>\n<p>significant updates to existing systems.<br>\nSystems must be available for download.</p>\n</li>\n</ul>\n<p>Project presentations should describe</p>\n<ul>\n<li>projects that are new or about to start,</li>\n<li>ongoing projects that have not yet been presented to the CICM community.</li>\n<li>significant new developments in ongoing previously presented projects.</li>\n</ul>\n<p>Presentations of  new projects  should mention relevant  previous work<br>\nand include  a roadmap that  outlines concrete steps.  All submissions<br>\nshould  contain  links  to  demos, downloadable  systems,  or  project<br>\nwebsites.</p>\n<p>Accepted  conference submissions  from all  tracks is  intended  to be<br>\npublished  as a  vo<br>\n[message truncated]</p>",
        "id": 294234282,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660904046
    }
]