[
    {
        "content": "<p>From: Leo Freitas &lt;<a href=\"mailto:leo.freitas@newcastle.ac.uk\">leo.freitas@newcastle.ac.uk</a>&gt;<br>\nHi,</p>\n<p>I use Isabelle for teaching and it was installed by an adjustment to the web-distribution for our Linux machines. <br>\nNow, I will need to use a lab running on Window, s and that created a few issues I couldn’t help our support team much.</p>\n<p>1) distributed config setup:<br>\nIs there any suggested / configuration-setup for distributed installations of Isabelle (Linux or Windows)? The support<br>\nguy said, for example, the the Window installation asking for a directory would be a problem for an administered install.</p>\n<p>In the end, I extracted the .exe and built HOL heaps and use that as a starting point to be shared (i.e. in the way Windows <br>\nlab is setup, that means running a shared copy of Isabelle remotely as local installations aren’t viable).</p>\n<p>2) sledgehammer file write access:</p>\n<p>This worked to a degree, but say, sledgehammer fails saying SysErr because of a file-write problem. Where is it SH is trying to write to?<br>\nOr in general, what would you suggest to make a distributed Windows installation viable for a teaching lab?</p>\n<p>This is for Isabelle2014 on Windows 8.1</p>\n<p>Many thanks.</p>\n<p>Best,<br>\nLeo<br>\n<a href=\"/user_uploads/14278/mTYyfml52_95agpXNQzcUshw/signature.asc\">signature.asc</a></p>",
        "id": 294306486,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660924461
    },
    {
        "content": "<p>From: Jasmin Christian Blanchette &lt;<a href=\"mailto:jasmin.blanchette@gmail.com\">jasmin.blanchette@gmail.com</a>&gt;<br>\nHi Leo,</p>\n<p>By default, Sledgehammer should be trying to write to</p>\n<p>ML {* getenv \"ISABELLE_TMP\" *}</p>\n<p>a subdirectory that is created at startup and removed upon exit. Since this is used not only by Sledgehammer, but also by other Isabelle subsystems, I would recommend trying to find out what goes wrong there. I am not very familiar with Windows or Cygwin, but I presume the Isabelle's System manual (\"isabelle doc system\") would be a good starting point for investigations.</p>\n<p>As a workaround for Sledgehammer, It is possible to specify another directory by adding</p>\n<p>declare [[sledgehammer_atp_dest_dir = \"/foo/bar/baz\"]]</p>\n<p>to the top of your theory file, or in an imported theory. If you already have a theory file with some basic setup for the students, this could go there.</p>\n<p>Regards,</p>\n<p>Jasmin</p>",
        "id": 294306530,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660924473
    },
    {
        "content": "<p>From: Leo Freitas &lt;<a href=\"mailto:leo.freitas@newcastle.ac.uk\">leo.freitas@newcastle.ac.uk</a>&gt;<br>\nHi Jasmin,</p>\n<p>Many thanks for this, very helpful. </p>\n<p>I had looked at the etc/settings file before, but not for Windows. I think the change to ISABELLE_TMP_PREFIX and ISABELLE_HOME_USER to a suitable directory for CS-support will suffice. Many thanks for pointing it out. </p>\n<p>PS:<br>\nthe whole thing came about because locally they had a last-minute change from a ready Linux-setup to what a new-Windows environment panic! <br>\nAs I divorced myself from windows a while ago, was just in a helpless situation to advice support on what to do on short notice. </p>\n<p>Thanks again.</p>\n<p>Best,<br>\nLeo<br>\n<a href=\"/user_uploads/14278/feIWceFno3AK9SeP2wgT7CE3/signature.asc\">signature.asc</a></p>",
        "id": 294306616,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660924502
    },
    {
        "content": "<p>From: Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt;<br>\nOn Thu, 25 Sep 2014, Leo Freitas wrote:</p>\n<blockquote>\n<p>I had looked at the etc/settings file before, but not for Windows. I <br>\nthink the change to ISABELLE_TMP_PREFIX and ISABELLE_HOME_USER to a <br>\nsuitable directory for CS-support will suffice.</p>\n</blockquote>\n<p>These are indeed the two main Isabelle settings for user-specific material <br>\nthat is written at run-time.  The central ISABELLE_HOME/etc/settings may <br>\nbe tweaked to change them.</p>\n<p>Note that there is also USER_HOME as a platform-independent version of <br>\nHOME known from Unix.</p>\n<blockquote>\n<p>the whole thing came about because locally they had a last-minute change <br>\nfrom a ready Linux-setup to what a new-Windows environment panic! As I <br>\ndivorced myself from windows a while ago, was just in a helpless <br>\nsituation to advice support on what to do on short notice.</p>\n</blockquote>\n<p>In Isabelle2014 the default USER_HOME is based on HOMEDRIVE and HOMEPATH, <br>\nand ISABELLE_TMP_PREFIX is within the Cygwin /tmp (i.e. within the <br>\ninstallation directory).  Both might need further refinements for <br>\nmulti-user environments.</p>\n<p>What we could need is some advice from a genuine Windows expert, to tell <br>\nwhere the canonical locations are in a networked environment.</p>\n<p>Makarius</p>",
        "id": 294306646,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660924515
    }
]