[
    {
        "content": "<p>From: \"Yannick Duchêne (Hibou57 )\" &lt;<a href=\"mailto:yannick_duchene@yahoo.fr\">yannick_duchene@yahoo.fr</a>&gt;<br>\nHi all,</p>\n<p>I wanted to know if there is a way to get in the output pan, the same kind  <br>\nof report as the one you have in an info‑bubble when the mouse is over an  <br>\nidentifier while you press command or ctrl.</p>\n<p>When there are a lot of things in the info bubble, it sometime disappears  <br>\nto much quickly, and also, you cannot copy/past from an the info bubble.</p>\n<p>I had a look at all “print_*”, but could not find something.</p>",
        "id": 294220637,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660897277
    },
    {
        "content": "<p>From: Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt;<br>\nOn Tue, 21 Aug 2012, Yannick Duchêne (Hibou57) wrote:</p>\n<blockquote>\n<p>I wanted to know if there is a way to get in the output pan, the same <br>\nkind of report as the one you have in an info‑bubble when the mouse is <br>\nover an identifier while you press command or ctrl.</p>\n</blockquote>\n<p>It is one of obvious the things that are just missing (but more important <br>\nthan imitating Proof General menus).  The output box is an HTML4 component <br>\nwith its own rules, not an editor buffer.  I had postponed too <br>\nsophisticated functionality there, bacause I was waiting for Sun/Oracle's <br>\nHTML5 component to be shipped with JDK.  This has happened just last week <br>\nwith Java 7u6, and I will see soon if the time of waiting was worthwhile.</p>\n<blockquote>\n<p>When there are a lot of things in the info bubble, it sometime <br>\ndisappears to much quickly, and also, you cannot copy/past from an the <br>\ninfo bubble.</p>\n</blockquote>\n<p>Yes, same situation.  I had made some experiments with better popups at <br>\nsome point, but postponed them.</p>\n<p>Makarius</p>",
        "id": 294220807,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660897376
    }
]