[
    {
        "content": "<p>From: June Andronick &lt;<a href=\"mailto:June.Andronick@nicta.com.au\">June.Andronick@nicta.com.au</a>&gt;<br>\n[Apologies for the cross-posting]</p>\n<p>=========================<br>\nCALL FOR PAPERS<br>\nWorkshop on Foundations of Computer Security (FCS 2015)<br>\n13 July 2015, Verona, Italy</p>\n<p><a href=\"http://software.imdea.org/~bkoepf/FCS15/\">http://software.imdea.org/~bkoepf/FCS15/</a></p>\n<p>Affiliated with IEEE CSF 2015</p>\n<p>=========================</p>\n<p>INVITED SPEAKER</p>\n<p>Dominique Unruh, University of Tartu</p>\n<p>IMPORTANT DATES</p>\n<p>Submission:                     April 10, 2015<br>\nNotification of acceptance:     May 29, 2015<br>\nWorkshop:                       July 13, 2015</p>\n<p>BACKGROUND, AIM AND SCOPE</p>\n<p>Computer security is an established field of both theoretical and<br>\npractical significance. In recent years, there has been sustained<br>\ninterest in the formal foundations of methods used in computer<br>\nsecurity. The aim of the FCS 2015 workshop is to provide a forum for<br>\ncontinued activity in this area.</p>\n<p>The scope of FCS 2015 includes, but is not limited to, the formal<br>\nspecification, analysis, and design of cryptographic protocols and<br>\ntheir applications; the formal definition of various aspects of<br>\nsecurity such as access control mechanisms, mobile code security and<br>\ndenial-of-service attacks; the modelling of information flow and its<br>\napplication to confidentiality policies, system composition, and<br>\ncovert channel analysis.</p>\n<p>We are interested both in new theoretical results in computer security<br>\nand also in more exploratory presentations that examine open questions<br>\nand raise fundamental concerns about existing theories, as well as in<br>\nnew results on developing and applying automated reasoning techniques<br>\nand tools for the formal specification and analysis of security<br>\nprotocols. We thus solicit submission of papers both on mature work<br>\nand on work in progress.</p>\n<p>SUBMISSION</p>\n<p>All submissions will be peer-reviewed. Authors of accepted papers must<br>\nguarantee that their paper will be presented at the workshop.</p>\n<p>FCS 2015 welcomes two kinds of submissions:</p>\n<ul>\n<li>short abstracts (1 page, including references and appendices), and</li>\n<li>full papers (at most 12 pages, excluding references and well-marked<br>\n   appendices).</li>\n</ul>\n<p>Short abstracts will receive as rigorous a review as full<br>\npapers. Short abstracts may receive shorter talk slots at the workshop<br>\nthan full papers, depending on the number of accepted<br>\nsubmissions. Papers should be submitted using the two-column IEEE<br>\nProceedings style available for various document preparation systems<br>\nat the IEEE Conference Publishing Services page:<br>\n<a href=\"http://www.ieee.org/conferences_events/conferences/publishing/templates.html\">http://www.ieee.org/conferences_events/conferences/publishing/templates.html</a></p>\n<p>Authors are invited to submit their papers electronically in portable<br>\ndocument format (pdf); please do not send files formatted for word<br>\nprocessing packages (e.g., Microsoft Word or WordPerfect files).<br>\nPapers must be submitted at the following site:<br>\n<a href=\"https://easychair.org/conferences/?conf=fcs2015\">https://easychair.org/conferences/?conf=fcs2015</a></p>\n<p>INFORMAL PROCEEDINGS</p>\n<p>FCS has no published proceedings. Presenting a paper at the workshop<br>\nshould not preclude submission to or publication in other<br>\nvenues. Papers presented at the workshop will be made publicly<br>\navailable, but this will not constitute an official proceedings.</p>\n<p>PROGRAM COMMITTEE</p>\n<p>June Andronick (NICTA and UNSW, Australia)<br>\nMichele Boreale (Università de Firenze, Italy)<br>\nKonstantinos Chatzikokolakis (École Polytechnique, France)<br>\nChristos Dimoulas (Harvard University, USA)<br>\nMarco Gaboardi (University of Dundee, UK)<br>\nDeepak Garg (Max Planck Institute for Software Systems, Germany, co-chair)<br>\nWilliam Harris (Georgia Institute of Technology, USA)<br>\nAniket Kate (Saarland University, Germany)<br>\nBoris Köpf (IMDEA Software Institute, Spain, co-chair)<br>\nSteve Kremer (INRIA Nancy - Grand Est, France)<br>\nStephen McCamant (University of Minnesota, USA)<br>\nSantosh Nagarakatte (Rutgers University, USA)<br>\nWillard Rafnsson (Carnegie Mellon University, USA)<br>\nBenedikt Schmidt (IMDEA Software Institute, Spain)<br>\nChristoph Sprenger (ETH Zurich, Switzerland)<br>\nDeian Stefan (Stanford University, USA)<br>\nTomasz Truderung (University of Trier, Germany)<br>\nLuca Viganò (King's College London, UK)</p>",
        "id": 294633575,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661159265
    }
]