[
    {
        "content": "<p>From: \"Thiemann, René\" &lt;<a href=\"mailto:Rene.Thiemann@uibk.ac.at\">Rene.Thiemann@uibk.ac.at</a>&gt;<br>\nA Formal Development of a Polychronous Polytimed Coordination Language<br>\n  by Hai Nguyen Van, Frédéric Boulanger and Burkhart Wolff</p>\n<p>The design of complex systems involves different formalisms for modeling their<br>\ndifferent parts or aspects. The global model of a system may therefore consist<br>\nof a coordination of concurrent sub-models that use different paradigms. We<br>\ndevelop here a theory for a language used to specify the timed coordination of<br>\nsuch heterogeneous subsystems by addressing the following issues:<br>\n  • the behavior of the sub-systems is observed only at a series of discrete<br>\n    instants,<br>\n  • events may occur in different sub-systems at unrelated times, leading to<br>\n    polychronous systems, which do not necessarily have a common base clock,<br>\n  • coordination between subsystems involves causality, so the occurrence of an<br>\n    event may enforce the occurrence of other events, possibly after a certain<br>\n    duration has elapsed or an event has occurred a given number of times,<br>\n  • the domain of time (discrete, rational, continuous...) may be different in<br>\n    the subsystems, leading to polytimed systems,<br>\n  • the time frames of different sub-systems may be related (for instance, time<br>\n    in a GPS satellite and in a GPS receiver on Earth are related although they<br>\n    are not the same).<br>\nFirstly, a denotational semantics of the language is defined. Then, in order to<br>\nbe able to incrementally check the behavior of systems, an operational semantics<br>\nis given, with proofs of progress, soundness and completeness with regard to the<br>\ndenotational semantics. These proofs are made according to a setup that can<br>\nscale up when new operators are added to the language. In order for<br>\nspecifications to be composed in a clean way, the language should be invariant<br>\nby stuttering (i.e., adding observation instants at which nothing happens). The<br>\nproof of this invariance is also given.</p>\n<p>See <a href=\"https://www.isa-afp.org/entries/TESL_Language.html\">https://www.isa-afp.org/entries/TESL_Language.html</a> for more details.</p>\n<p>Enjoy,<br>\nRené<br>\n<a href=\"/user_uploads/14278/zgnmHVS_JhUTpjUxa4G2a1c7/signature.asc\">signature.asc</a></p>",
        "id": 294759928,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661199073
    }
]