[
    {
        "content": "<p>From: \"Schmaltz, J.\" &lt;<a href=\"mailto:j.schmaltz@tue.nl\">j.schmaltz@tue.nl</a>&gt;<br>\nThe Eindhoven University of Technology invites applications for a postdoctoral position funded by the EU FP7 project “EURO-MILS: Secure European Virtualisation for Trustworthy Applications in Critical Domains” (www.euromils.eu&lt;<a href=\"http://www.euromils.eu\">http://www.euromils.eu</a>&gt;). The position is for an initial duration of 14 months. The applicant is expected to start any time from now.</p>\n<p>The deadline for applications is July 1st. Applications will be considered until the position is filled.</p>\n<p>Project Goals and Tasks</p>\n<p>Ubiquitous, highly critical systems go online and create a domain of mixed criticality’s, where security and safety requirements of different levels mix. The main goal of the project is to provide trustworthiness in two critical application domains: automotive and avionics. The project’s cornerstone is MILS (Multiple Independent Levels of Security), a high-assurance security architecture supporting the coexistence of untrusted and trusted components. For the first time in Europe, EURO-MILS does a complete “Common Criteria” security evaluation of a MILS system to its highest levels of assurance, including formal verification engineering. The project brings together eight leading industrial companies, a  research company, two research oriented SMEs, and three universities from five European countries to form a complete chain stretching from basic research, via applied research, up to end-user oriented service providers.</p>\n<p>The tasks of the successful applicant will be concerned with formal modelling and verification of an industrial separation kernel, formal modelling and verification of a generic MILS architecture, and the formulation of formal results for Common Criteria evaluation. Formal models and proofs are developed using the Isabelle/HOL theorem proving environment.</p>\n<p>Requirements</p>\n<p>We are looking for candidates with a PhD degree in computer science, mathematics, or a closely related field. A solid theoretical background with the desire and skill to let the research have practical impact. Knowledge about interactive theorem proving techniques or the Isabelle/HOL system are a real plus. The working language is English. Applicants are expected to have good communication skills and the ability to work in teams.</p>\n<p>Appointment and Salary</p>\n<p>We offer a challenging job in a dynamic and ambitious university and a stimulation research environment. The Eindhoven University of Technology also provides an extensive package of fringe benefits (e.g. excellent technical infrastructure, the possibility of child care and excellent sports facilities).</p>\n<p>The basic salary is 2916 Euro’s per months, with an 8% bonus for vacations and a 13th month. This amounts to about 40.750 Euro’s per year. Applicants coming from outside the Netherlands may qualify for a special 30% rule, where 30% of the growth income is tax free. Salary may be adjusted depending on your experience.</p>\n<p>Location</p>\n<p>The research will be conducted in the research group Formal System Analysis of the Mathematics and Computer Science department. The FSA group is concerned with modelling and formally verifying system behaviour, either by employing process equivalences, modal formulas or behavioural reduction and visual inspection. Lately, a lot of interest goes into parameterized boolean equation systems, especially employing the power of SMT solvers and other symbolic reduction techniques.</p>\n<p>Information</p>\n<p>For information about this position, please contact Julien Schmaltz per email (j.schmaltz@tue.nl&lt;mailto:<a href=\"mailto:j.schmaltz@tue.nl\">j.schmaltz@tue.nl</a>&gt;) or per phone +31 40 247 8691.</p>\n<p>Application</p>\n<p>The application should consist of a cover letter explaining your motivation and qualifications for this position, a detailed Curriculum Vitae including a list of publications, and contact information of two references. Please send your application before July 1st 2014 to j.schmaltz@tue.nl&lt;mailto:<a href=\"mailto:j.schmaltz@tue.nl\">j.schmaltz@tue.nl</a>&gt;.</p>\n<hr>\n<p>Dr. Julien Schmaltz<br>\nEindhoven University of Technology<br>\nDepartment of Computer Science<br>\nModel Driven Software Engineering<br>\nFormal System Analysis<br>\nRoom MF7.071b<br>\nPostbus 513 5600 MB Eindhoven<br>\nj.schmaltz@tue.nl&lt;mailto:<a href=\"mailto:j.schmaltz@tue.nl\">j.schmaltz@tue.nl</a>&gt;<br>\nTel.: +31 40 247 8691<br>\nFax: +31 24 246 8508</p>",
        "id": 294277443,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660919246
    }
]