[
    {
        "content": "<p>From: Sascha Boehme &lt;<a href=\"mailto:boehmes@in.tum.de\">boehmes@in.tum.de</a>&gt;<br>\n[Apologies for multiple postings.]</p>\n<p>Executive summary: The deadline for submission of (short and regular)<br>\npapers has been extended to May 11.</p>\n<hr>\n<p>The First International Workshop on<br>\nProof Exchange for Theorem Proving (PxTP)<br>\n<a href=\"http://pxtp2011.loria.fr/\">http://pxtp2011.loria.fr/</a></p>\n<p>associated with</p>\n<p>The Conference on Automated Deduction (CADE), 2011.</p>\n<hr>\n<p>The goal of this new workshop is to bring together researchers working<br>\non proof production from automated theorem provers with potential<br>\nconsumers of proofs. Machine-checkable proofs have been proposed for<br>\napplications like proof-carrying code and certified compilation, as<br>\nwell as for exchanging knowledge between different automated reasoning<br>\nsystems. For example, interactive theorem provers can import results<br>\nfrom otherwise untrusted high-performance solvers, by means of proofs<br>\nthe solvers produce. In such situations, one automated reasoning tool<br>\ncan make use of the results of another, without having to trust that<br>\nthe second tool is sound. It is only necessary to be able to<br>\nreconstruct a proof that the first tool will accept, in order to<br>\nimport the result without increasing the size of the trusted computing<br>\nbase.</p>\n<p>This simple idea of proof exchange for theorem proving becomes quite<br>\ncomplicated under the real-world constraints of highly complex and<br>\nheterogeneous proof producers and proof consumers. For example, even<br>\nthe issue of a standard proof format for a single class of solvers,<br>\nlike SMT solvers, is quite difficult to address, as different solvers<br>\nuse different inference systems. It may be quite challenging, from an<br>\nengineering and possibly also theoretical point of view, to fit these<br>\ninto a single standard format. Emerging work from several groups<br>\nproposes standard meta-languages or parametrized formats to achieve<br>\nflexibility while retaining a universal proof language.</p>\n<hr>\n<p>Topics of interest for this workshop include all aspects of proof<br>\nexchange among automated reasoning tools. More specifically, some<br>\nsuggested topics are:</p>\n<p>-- proposed proof formats for different classes of logic solvers (SAT,<br>\nSMT, QBF, First-Order ATP, Higher-Order ATP, Rewriting, etc.).</p>\n<p>-- meta-languages and logical frameworks for proofs, particularly<br>\nproof systems designed for solvers.</p>\n<p>-- proof checking tools and algorithms.</p>\n<p>-- proof translation and methods for importing proofs, including proof<br>\nreplaying or reconstruction.</p>\n<p>-- tools and case studies related to analyzing proofs produced by<br>\nsolvers, and proof metrics.</p>\n<p>-- applications relying on importing proofs from automated theorem<br>\nprovers, such as certified static analysis, proof-carrying code, or<br>\ncertified compilation.</p>\n<p>-- data structures and algorithms for improved proof production in<br>\nsolvers (for example, more time- or memory-efficient ways of<br>\nrepresenting proofs).</p>\n<hr>\n<p>Submissions</p>\n<p>Submitted papers must fall into one of the following two categories:</p>\n<ul>\n<li>Short papers: up to 6 pages, tool papers or experience reports</li>\n<li>Regular papers: 12-15 pages, research papers</li>\n</ul>\n<p>Submissions will be refereed by the program committee, which will<br>\nselect a balanced program of high-quality contributions.</p>\n<p>Submissions should be in standard-conforming Postscript or PDF. Final<br>\nversions should be prepared in LaTeX using the easychair.cls class<br>\nfile.</p>\n<p>To submit a paper, go to the EasyChair PxTP page<br>\n<a href=\"http://www.easychair.org/conferences/?conf=pxtp2011\">http://www.easychair.org/conferences/?conf=pxtp2011</a><br>\nand follow the instructions there.</p>\n<p>PxTP will have no formal proceedings, but we anticipate a joint open<br>\ncall, together with the PSATTT workshop (also at CADE 2011), for a<br>\nspecial issue of a journal with PxTP and PSATTT post-proceedings.</p>\n<hr>\n<p>Important dates</p>\n<p>Submission of papers: May 11th, 2011 (Extended)<br>\nNotification: May 30th, 2011<br>\nCamera ready versions due: June 27th, 2011<br>\nWorkshop: August 1st, 2011</p>\n<hr>\n<p>Organizers</p>\n<p>Pascal Fontaine (INRIA, University of Nancy)<br>\nAaron Stump (The University of Iowa)</p>\n<p>Program Committee</p>\n<p>Clark Barrett (New York University)<br>\nChristoph Benzmüller (Articulate Software)<br>\nSacha Böhme (Technische Universität München)<br>\nAmy Felty (University of Ottawa)<br>\nPascal Fontaine (INRIA, University of Nancy)<br>\nLeonardo de Moura (Microsoft research)<br>\nHans de Nivelle (University of Wrocław)<br>\nDavid Pichardie (INRIA Rennes)<br>\nStephan Schulz (Technische Universität München)<br>\nAaron Stump (The University of Iowa)<br>\nGeoff Sutcliffe (University of Miami)<br>\nLaurent Théry (INRIA)<br>\nTjark Weber (University of Cambridge)<br>\nBruno Woltzenlogel Paleo (Technische Universität Wien)</p>",
        "id": 294135971,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660844338
    }
]