[
    {
        "content": "<p>From: Ramana Kumar &lt;<a href=\"mailto:rk436@cam.ac.uk\">rk436@cam.ac.uk</a>&gt;<br>\nMatej (<a href=\"http://www.cl.cam.ac.uk/~mu232/\">http://www.cl.cam.ac.uk/~mu232/</a>) has been working on a different but<br>\nrelated problem of including diagrammatic proofs (for formulae that can be<br>\nspecified and proved in some diagrammatic language) within Isabelle proofs.<br>\nHe might have ideas about how to make (a frontend for) Isar itself more<br>\ngraphical.</p>",
        "id": 294161770,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660853398
    },
    {
        "content": "<p>From: John Wickerson &lt;<a href=\"mailto:jpw48@cam.ac.uk\">jpw48@cam.ac.uk</a>&gt;<br>\nGood idea, thanks Ramana :)</p>\n<p>John</p>",
        "id": 294162315,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660853597
    },
    {
        "content": "<p>From: Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt;<br>\nI have occasionally pondered the question how the implicit dependency <br>\nstructure and the primary Isar text can be linked in a user interface. <br>\nThis means some kind of augmented text editing as in Isabelle/jEdit with a <br>\nbit more than just a boring tree view on the side.  jEdit also has notions <br>\nfor drag-and-drop of text pieces and various operations on collections of <br>\ntext intervals.</p>\n<p>So one mainly needs to link existing concepts for plain text with the <br>\nstructural information of the semantic document model.  Advanced IDEs for <br>\nprogramming languages probably have something to offer here already, but I <br>\ndon't know anything from first sight.</p>\n<p>If anybody can point to examples from Eclipse, Netbeans, IntelliJ IDEA, or <br>\neven Visiual Studio, I would be interested to study them to learn how it <br>\nfits into the proof document model.</p>\n<p>Makarius</p>",
        "id": 294162364,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660853621
    },
    {
        "content": "<p>From: Gudmund Grov &lt;<a href=\"mailto:ggrov@staffmail.ed.ac.uk\">ggrov@staffmail.ed.ac.uk</a>&gt;<br>\nDear John,</p>\n<p>I am currently working on a graph based language to write techniques/tactics for (the Isabelle based) Isaplanner<br>\nproof planner (see <a href=\"http://dream.inf.ed.ac.uk/projects/isaplanner/\">http://dream.inf.ed.ac.uk/projects/isaplanner/</a> - although a bit out of date), but I am thinking of <br>\nways of doing this more directly in Isabelle. </p>\n<p>The plan is at some point to get some sort of drag and drop interface as you suggest. This is very much work <br>\nin progress, but I hope to have something working and written up in the not too distant future, which once written, I'll be <br>\nhappy to send to you.</p>\n<p>Cheers,</p>\n<p>Gudmund</p>",
        "id": 294162476,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660853650
    },
    {
        "content": "<p>From: Jens Doll &lt;<a href=\"mailto:jd@cococo.de\">jd@cococo.de</a>&gt;<br>\nHello Ramana ,</p>\n<p>a DAG is not the full picture. Proofs in general consist of forests, <br>\ni.e. several DAGs connected at different hierarchical levels.  Only in <br>\nthe case of axiomatic theories (Hilbert style ...) a single DAG is <br>\nsufficient.</p>\n<p>Happy Reasoning,<br>\nJens</p>",
        "id": 294162713,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660853734
    },
    {
        "content": "<p>From: John Wickerson &lt;<a href=\"mailto:jpw48@cam.ac.uk\">jpw48@cam.ac.uk</a>&gt;<br>\nDear Isabelle,</p>\n<p>It seems to me that proving a lemma in Isabelle is much like building a dag, where the facts are nodes and the implications between facts are arrows. When several nodes \"line up\" in a simple chain we can use the Isar construction \"hence\"; and for some other dag shapes the \"moreover/ultimately\" pattern works. But in general, one needs to invent names sometimes when the underlying proof dag doesn't conform to one of these templates.</p>\n<p>I was wondering: has there been any work on a UI that lets the user construct this dag <em>directly</em>? I'm imagining a sort of drag-and-drop interface that lets me drag arrows between boxes and move boxes around a canvas, and so on.</p>\n<p>Best wishes,<br>\nJohn</p>",
        "id": 294165008,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660854400
    }
]