[
    {
        "content": "<p>From: Pedro Quaresma &lt;<a href=\"mailto:pedro@mat.uc.pt\">pedro@mat.uc.pt</a>&gt;<br>\nCall for Workshops</p>\n<p>IJCAR 2016 - The 8th International Joint Conference on Automated Reasoning<br>\nCoimbra, Portugal<br>\nConference 27-30, June 2016<br>\nWorkshops 1-2, July 2016<br>\n<a href=\"http://www.uc.pt/en/congress/ijcar2016/\">http://www.uc.pt/en/congress/ijcar2016/</a></p>\n<p>Call for Workshop Proposals</p>\n<p>Workshop proposals on IJCAR-related topics are solicited. Proposals that promise to bring new topics into IJCAR, of either practical or theoretical importance, or provide a forum for more detailed discussion on central topics of continuing importance are highly welcome. Proposals that close the gap between automated reasoning and related areas, e.g., formal methods or software engineering, are especially encouraged.</p>\n<p>Proposals must contain information sufficient to judge the importance, quality and community interest in the proposed topic.  Each workshop must have one or more designated organizers, and may have a programme committee as well.</p>\n<p>Proposals must be limited to three pages and provide at least the following information:</p>\n<p>Title<br>\n     Description of the workshop topic and goals(Why do you believe this is an interesting and significant topic?)<br>\n     Intended audience(From which areas do you expect potential participants to come?How many participants do you expect?)<br>\n     Organization of the workshop(Describe the intended format of the workshop, its expected duration: one day, Friday, July 1st (preferred) or Saturday, 2nd; or two days, July 1st-2nd.)<br>\n     Information     a. whether papers presented to the workshiop are invited papers or are selected by peer review;     b. if the workshop makes makes part of a series (continuing the past workshops on a regular basis);     c. if the workshop comprises a program competition.<br>\n     Organizers' details(Provide affiliations, backgrounds and contact details (email, etc.) of organizers.)</p>\n<p>Proposals should be sent as plain text or as PDF to the workshop chair Reinhard Kahle: <a href=\"mailto:kahle@mat.uc.pt\">kahle@mat.uc.pt</a>.</p>\n<p>For more information, including fees and provided services, please contact also the workshop chair at <a href=\"mailto:kahle@mat.uc.pt\">kahle@mat.uc.pt</a>.</p>\n<p>Important dates</p>\n<p>Express of interest: at any time.<br>\nDeadline for proposal submissions: November 15th, 2015.<br>\nNotification: December 15th, 2015.<br>\nWorkshop Dates: July 1st-2nd, 2016.</p>\n<p>-- <br>\n---//---</p>\n<p>IJCAR 2016, International Joint Conference on Automated Reasoning, 27<br>\nJune-1 July, 2016, Coimbra, Portugal.</p>\n<p>CiEMeLP 2015, Conferência Internacional do Espaço Matemático em Língua<br>\nPortuguesa, 28 a 31 de Outubro de 2015 em Coimbra, Portugal.<br>\n---//---</p>\n<p>--</p>\n<p>At\\'e breve;Deica Logo;\\`A bient\\^ot;See you later;Vidimo se;</p>\n<p>Professor Auxiliar Pedro Quaresma<br>\nDepartamento de Matem\\'atica, Faculdade de Ci\\^encias e Tecnologia<br>\nUniversidade de Coimbra<br>\nP-3001-454 COIMBRA, PORTUGAL<br>\nElec. mail: <a href=\"mailto:pedro@mat.uc.pt\">pedro@mat.uc.pt</a><br>\nwebpage: <a href=\"http://www.mat.uc.pt/~pedro/\">http://www.mat.uc.pt/~pedro/</a><br>\nphone: +351 239 791 137; fax: +351 239 832 568</p>",
        "id": 294655801,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661167971
    }
]