[
    {
        "content": "<p>From: Andrei Popescu &lt;<a href=\"mailto:A.Popescu@mdx.ac.uk\">A.Popescu@mdx.ac.uk</a>&gt;<br>\nFroCoS 2019</p>\n<p>The 12th International Symposium on Frontiers of Combining Systems</p>\n<p>London, UK, September 4-6, 2019</p>\n<p>Website: <a href=\"https://www.frocos2019.org\">https://www.frocos2019.org</a></p>\n<p>Contact: <a href=\"mailto:chair@frocos2019.org\">chair@frocos2019.org</a></p>\n<p>Submission deadlines: 21 Apr 2019 (abstract), 24 Apr 2019 (paper)</p>\n<p>GENERAL INFORMATION</p>\n<p>The 12th International Symposium on Frontiers of Combining Systems (FroCoS 2019)  will take place in London. It will be hosted by the Department of Computer Science at the Middlesex University London, from 4 to 6 September 2019.</p>\n<p>FroCoS is the main international event for research on the development of techniques and methods for the combination and integration of formal systems, their modularization and analysis. The first FroCoS symposium was held in Munich, Germany, in 1996. Initially held every two years, since 2004 it has been organized annually with alternate years forming part of IJCAR. If we also count the IJCAR editions, this year FroCoS celebrates its 20th edition.</p>\n<p>FroCoS 2019 will be co-located with the 28th International Conference on Automated Reasoning with Analytic Tableaux and Related Methods (TABLEAUX 2019). The two conferences will provide a rich programme of workshops, tutorials, invited talks, paper presentations and system descriptions.</p>\n<p>SCOPE OF CONFERENCE</p>\n<p>In various areas of computer science, such as logic, computation, program development and verification, artificial intelligence, knowledge representation, and automated reasoning, there is an obvious need for using specialized formalisms and inference systems for selected tasks. To be usable in practice, these specialized systems must be combined with each other and integrated into general purpose systems. This has led to the development of techniques and methods for the combination and integration of dedicated formal systems, as well as for their modularization and analysis.</p>\n<p>FroCoS traditionally focuses on these types of research questions and activities. Like its predecessors, FroCoS 2019 seeks to offer a common forum for research in the general area of combination, modularization, and integration of systems, with emphasis on logic-based methods and their practical use.</p>\n<p>Topics of interest for FroCoS 2019 include (but are not restricted to):</p>\n<p>* combinations of logics (such as higher-order, first-order, temporal, modal, description or other non-classical logics)</p>\n<p>* combination and integration methods in SAT and SMT solving</p>\n<p>* combination of decision procedures, satisfiability procedures, constraint solving techniques, or logical frameworks</p>\n<p>* combination of logics with probability and/or fuzzy measures</p>\n<p>* combinations and modularity in ontologies</p>\n<p>* integration of equational and other theories into deductive systems</p>\n<p>* hybrid methods for deduction, resolution and constraint propagation</p>\n<p>* hybrid systems in knowledge representation and natural language semantics</p>\n<p>* combined logics for distributed and multi-agent systems</p>\n<p>* logical aspects of combining and modularizing programs and specifications</p>\n<p>* integration of data structures into constraint logic programming and deduction</p>\n<p>* combinations and modularity in term rewriting</p>\n<p>* methods and techniques for the verification and analysis of information systems</p>\n<p>* methods and techniques for combining logical reasoning with machine learning</p>\n<p>SUBMISSION GUIDELINES</p>\n<p>The program committee seeks high-quality submissions describing original work, written in English, not overlapping with published or simultaneously submitted work to a journal or conference with archival proceedings. Selection criteria include accuracy and originality of ideas, clarity and significance of results, and quality of presentation. The page limit in Springer LNCS style is 16 pages in total, including references and figures.</p>\n<p>Any additional material (going beyond the page limit) can be included in a clearly marked appendix. This appendix will be read at the discretion of the committee, and must be removed for the camera-ready version.</p>\n<p>Papers must be edited in LaTeX using the llncs style and must be submitted electronically as PDF files via EasyChair at <a href=\"https://easychair.org/conferences/?conf=frocos2019\">https://easychair.org/conferences/?conf=frocos2019</a></p>\n<p>For each accepted paper, at least one of the authors is required to attend the conference and present the work. Prospective authors must register a title and an abstract three days before the paper submission deadline.</p>\n<p>Formatting instructions and the LNCS style files can be obtained at <a href=\"http://www.springer.com/br/computer-science/lncs/conference-proceedings-guidelines\">http://www.springer.com/br/computer-science/lncs/conference-proceedings-guidelines</a></p>\n<p>IMPORTANT DATES</p>\n<p>Abstract submission: 21 Apr 2019</p>\n<p>Paper submission: 24 Apr 2019</p>\n<p>Notification of paper decisions: 6 Jun 2019</p>\n<p>Camera-ready papers due: 1 Jul 2019</p>\n<p>FroCoS conference: 4-6 Sep 2019</p>\n<p>PUBLICATION DETAILS</p>\n<p>The conference proceedings will be published in the Springer series Lecture Notes in Artificial Intelligence (LNAI/LNCS).</p>\n<p>BEST PAPER AWARD</p>\n<p>The program committee will select the FroCoS 2019 Best Paper, which will be awarded 500 Euros. The award will be presented at the conference.</p>\n<p>TRAVEL GRANTS FOR STUDENTS</p>\n<p>Some funding will be available to support students traveling to FroCoS 2019. More details will be given on the conference website in due time.</p>\n<p>PROGRAM COMMITTEE</p>\n<p>Carlos Areces, FaMAF - Universidad Nacional de Córdoba, Argentina</p>\n<p>Alessandro Artale, Free University of Bolzano-Bozen, Italy</p>\n<p>Franz Baader, TU Dresden, Germany</p>\n<p>Christoph Benzmüller, Free University of Berlin, Germany</p>\n<p>Jasmin Christian Blanchette, Vrije Universiteit Amsterdam, Netherlands</p>\n<p>Torben Braüner, Roskilde University, Denmark</p>\n<p>Clare Dixon, University of Liverpool, UK</p>\n<p>Marcelo Finger, University of São Paulo, Brazil</p>\n<p>Pascal Fontaine, LORIA, INRIA, University of Lorraine, France</p>\n<p>Didier Galmiche, LORIA, University of Lorraine, France</p>\n<p>Silvio Ghilardi, Università degli Studi di Milano, Italy</p>\n<p>Jürgen Giesl, RWTH Aachen, Germany</p>\n<p>Andreas Herzig, CNRS, IRIT, France</p>\n<p>Moa Johansson, Chalmers University, Sweden</p>\n<p>Jean Christoph Jung, University of Bremen, Germany</p>\n<p>Cezary Kaliszyk, University of Innsbruck, Austria</p>\n<p>Ekaterina Komendantskaya, Heriot-Watt University, UK</p>\n<p>Roman Kontchakov, Birkbeck, University of London, UK</p>\n<p>Alessio Lomuscio, Imperial College London, UK</p>\n<p>Assia Mahboubi, INRIA, France</p>\n<p>Stefan Mitsch, Carnegie Mellon University</p>\n<p>Cláudia Nalon, University of Brasília, Brazil</p>\n<p>Andrei Popescu, Middlesex University London, UK</p>\n<p>Silvio Ranise, Fondazione Bruno Kessler-Irst, Italy</p>\n<p>Christophe Ringeissen, LORIA-INRIA, France</p>\n<p>Philipp Rümmer, Uppsala University, Sweden</p>\n<p>Renate Schmidt, University of Manchester, UK</p>\n<p>Viorica Sofronie-Stokkermans, University Koblenz-Landau, Germany</p>\n<p>Christian Sternagel, University of Innsbruck, Austria</p>\n<p>Andrzej Szalas, Linköping University, Sweden</p>\n<p>Cesare Tinelli, University of Iowa, US</p>\n<p>Ashish Tiwari, SRI International, US</p>\n<p>Christoph Weidenbach, Max Planck Institute for Informatics, Germany</p>\n<p>PC CHAIRS</p>\n<p>Andreas Herzig, CNRS, IRIT, France</p>\n<p>Andrei Popescu, Middlesex University London, UK</p>\n<p>LOCAL ORGANIZATION COMMITTEE</p>\n<p>Kelly Androutsopoulos, Middlesex University London, UK</p>\n<p>Jaap Boender, Middlesex University London, UK</p>\n<p>Michele Bottone, Middlesex University London, UK</p>\n<p>Florian Kammueller, Middlesex University London, UK</p>\n<p>Rajagopal Nagarajan, Middlesex University London, UK</p>\n<p>Andrei Popescu, Middlesex University London, UK</p>\n<p>Franco Raimondi, Middlesex University London, UK</p>\n<p>LOCAL ORGANIZATION CHAIR</p>\n<p>Franco Raimondi, Middlesex University London, UK</p>",
        "id": 294749168,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661194744
    }
]