[
    {
        "content": "<p>From: Giles Reger &lt;<a href=\"mailto:giles.reger@manchester.ac.uk\">giles.reger@manchester.ac.uk</a>&gt;<br>\nHello,</p>\n<p>I am looking for academic or industrial users of Sledgehammer who are using Vampire via Sledgehammer or are interested in using Vampire via Sledgehammer. </p>\n<p>For context, I am asking for two reasons:</p>\n<ol>\n<li>\n<p>I often say “lots of people use Vampire via Sledgehammer” but I don’t really know if this is true and have very little evidence to support the statement — my only datapoint is the number of requests Geoff occasionally reports as sent to SystemOnTPTP from Sledgehammer (remote_vampire). But now that Isabelle comes with a (non-commercial) version of Vampire it might be that we have more users. It would be great to gain some awareness of some (if any) projects benefitting from Vampire via Sledgehammer.</p>\n</li>\n<li>\n<p>I would like to make Vampire “better\" at handling problems produced by Sledgehammer in the (nearish) future. Knowing some people who use Sledgehammer would be potentially useful in motivating and evaluating this work.</p>\n</li>\n</ol>\n<p>Cheers, Giles</p>",
        "id": 294768177,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661202935
    },
    {
        "content": "<p>From: Lawrence Paulson &lt;<a href=\"mailto:lp15@cam.ac.uk\">lp15@cam.ac.uk</a>&gt;<br>\nThis is undoubtedly true. Many (probably most) Isabelle users click their Sledgehammer button all the time, invoking Vampire as well as other provers. There are no statistics on how frequently Vampire is successful or how often it beats other systems. Vampire has been available to install for quite a long time already (a number of years, though often persistence was needed to grab a copy).</p>\n<p>Larry Paulson</p>",
        "id": 294768199,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661202947
    },
    {
        "content": "<p>From: Peter Lammich &lt;<a href=\"mailto:lammich@in.tum.de\">lammich@in.tum.de</a>&gt;<br>\nHi Giles.</p>\n<p>I use sledgehammer on a regular basis. However, neither which prover<br>\nfound the proof, nor how often I actually used sledgehammer during<br>\nproof exploration work, is somehow visible from the final theory.</p>\n<p>Nevertheless, it would be safe to say that, without sledgehammer, we<br>\nwould not have won interactive verification competitions (VerifyThis,<br>\nProofGround), and our daily proving work would be much more cumbersome.</p>",
        "id": 294768213,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661202953
    },
    {
        "content": "<p>From: \"Klein, Gerwin (Data61, Kensington NSW)\" &lt;<a href=\"mailto:Gerwin.Klein@data61.csiro.au\">Gerwin.Klein@data61.csiro.au</a>&gt;<br>\nSame here. I (and I suspect our entire team of about 10 fairly active Isabelle user)  use it often, but have no statistics.</p>\n<p>From memory, it does sometimes come up with the only proof, which then sometimes is too large to replay. (cvc4 and z3 also sometimes come up with proofs the other tools do not find, i.e. it’s not always the case that vampire is the only one who finds a proof).</p>\n<p>Cheers,<br>\nGerwin</p>",
        "id": 294821339,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661242281
    },
    {
        "content": "<p>From: Tobias Nipkow &lt;<a href=\"mailto:nipkow@in.tum.de\">nipkow@in.tum.de</a>&gt;<br>\nSame here. That is, sledgehammer is a major advance. Experts (incl myself) and <br>\nnovices (incl my students) alike love it.</p>\n<p>Tobias<br>\n<a href=\"/user_uploads/14278/BkCnEbSGV-iQve35hSbGsEnw/smime.p7s\">smime.p7s</a></p>",
        "id": 294821347,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661242284
    },
    {
        "content": "<p>From: \"John F. Hughes\" &lt;<a href=\"mailto:jfh@cs.brown.edu\">jfh@cs.brown.edu</a>&gt;<br>\nI'd say it accounts for about 80% of my (limited) success with Isabelle.<br>\nAnd it's clear I need to learn about this \"vampire\" thing as well. :)</p>",
        "id": 294821357,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661242294
    },
    {
        "content": "<p>From: \"Thiemann, René\" &lt;<a href=\"mailto:Rene.Thiemann@uibk.ac.at\">Rene.Thiemann@uibk.ac.at</a>&gt;<br>\nDear John,</p>\n<p>also here in Innsbruck, sledgehammer is heavily used.</p>\n<p>I personally turned on \"SLEDGEHAMMER_SPY=yes” in etc/settings some time<br>\nago, which generates statistics about sledgehammer usage in a separate file.</p>\n<p>I will send this file in a separate email to you (not the mailing list); <br>\nperhaps it is useful for your evaluation.</p>\n<p>Cheers,<br>\nRené</p>",
        "id": 294821399,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661242321
    },
    {
        "content": "<p>From: Manuel Eberl &lt;<a href=\"mailto:eberlm@in.tum.de\">eberlm@in.tum.de</a>&gt;<br>\nAs a bit of a counterpoint: I personally don't use sledgehammer very<br>\nmuch. Perhaps it is just a personal preference – I am a bit impatient<br>\nand don't like interrupting my work flow and wait for 20 or 30 seconds.</p>\n<p>I do use sledgehammer when I am frustrated by something that seems<br>\nintuitively obvious but I'm not quite sure what the easiest way to prove<br>\nit is. Most of the time, sledgehammer is then just as stumped as I am,<br>\nbut occasionally it comes up with a proof.</p>\n<p>However, sledgehammer proofs are often fairly clunky. I don't really<br>\nlike proofs that say \"by (metis …)\", where \"…\" is a list of 20 technical<br>\nlemmas, one of which is \"semiring_normalization_rules(37)\". That's<br>\nanother reason why I don't use sledgehammer as often as everyone else.</p>\n<p>In any case, it's a great tool, and it seems that it has continuously<br>\ngotten better since I started using Isabelle some 8 years ago.</p>\n<p>I've also heard that people sometimes use it as a sort of semantic<br>\n\"find_theorems\" command.</p>\n<p>Cheers,</p>\n<p>Manuel</p>",
        "id": 294821449,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661242326
    },
    {
        "content": "<p>From: Lawrence Paulson &lt;<a href=\"mailto:lp15@cam.ac.uk\">lp15@cam.ac.uk</a>&gt;<br>\nOn 20 Jan 2020, 10:05 +0000, Manuel Eberl &lt;<a href=\"mailto:eberlm@in.tum.de\">eberlm@in.tum.de</a>&gt;, wrote:</p>\n<blockquote>\n<p>As a bit of a counterpoint: I personally don't use sledgehammer very<br>\nmuch. Perhaps it is just a personal preference – I am a bit impatient<br>\nand don't like interrupting my work flow and wait for 20 or 30 seconds.</p>\n</blockquote>\n<p>A key design goal, realised already by 2007, was background operation: you can do other things while waiting for Sledgehammer to finish. So in particular, you can continue editing your document provided you confine your changes to below the cursor.</p>\n<blockquote>\n<p>I do use sledgehammer when I am frustrated by something that seems intuitively obvious</p>\n</blockquote>\n<p>Here we differ, because I often use Sledgehammer when I'm really not sure whether something is true or not.</p>\n<blockquote>\n<p>However, sledgehammer proofs are often fairly clunky. I don't really<br>\nlike proofs that say \"by (metis …)\", where \"…\" is a list of 20 technical<br>\nlemmas, one of which is \"semiring_normalization_rules(37)\".</p>\n</blockquote>\n<p>This certainly is annoying and requires a second pass through completed proofs. Once you know that you've actually got a theorem, it's worth the effort to make it look good.</p>\n<p>Larry</p>",
        "id": 294821470,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661242333
    }
]