[
    {
        "content": "<p>From: Baskar Anguraj &lt;<a href=\"mailto:baskar@mais.informatik.tu-darmstadt.de\">baskar@mais.informatik.tu-darmstadt.de</a>&gt;<br>\nThe TU Darmstadt is one of Germany's top technical universities with an<br>\noutstanding nation-wide and international reputation in research and education.<br>\nBeing part of Theoretical Computer Science, the chair Modeling and Analysis of<br>\nInformation Systems (MAIS) is currently offering positions for PhD students and<br>\nPostDocs.</p>\n<p>What are the positions about?</p>\n<hr>\n<p>Our aim is to make IT systems more reliable and secure than they are today. Due to<br>\nthe complexity of today's information systems and the manifold possibilities to attack<br>\nthese systems, the development of secure systems is a big technological challenge. To<br>\naddress this challenge, we develop formal methods and supporting tools that can be applied<br>\nin the software-development process and at runtime. We test our approaches in<br>\ncase-studies in our Mobile Devices Lab and in practice. In particular, we are<br>\nworking on information flow security, policy languages, refinement of<br>\nspecifications, runtime monitoring, static analysis and security engineering.<br>\nCurrently, we are looking for candidates who are interested in formal<br>\napproaches for information security in any of the above areas.</p>\n<p>The positions</p>\n<hr>\n<p>Suitable candidates should have a Master's degree (or equivalent) in Computer<br>\nScience or Mathematics.  For all our research topics, a solid background in formal<br>\nmethods or logic is required. A background in information security will be helpful,<br>\nbut is not a prerequisite. Prior knowledge in any of the following areas is also a plus:<br>\nAutomated Verification, Model Checking, Model-based Software Development, Concurrency<br>\nTheory, Program Analysis, Side-channel Analysis, Runtime Monitoring. Candidates<br>\nshould be highly motivated to tackle challenging research topics and to<br>\ncontribute to an open-minded team.</p>\n<p>We offer a productive and continuously evolving research environment, in which<br>\nyou can discuss ideas and collaborate with team members who are working on<br>\nrelated research topics. Our international connections as well as our<br>\ninvolvement in interesting research projects, for example the DFG priority<br>\nprogramme Reliably Secure Software Systems (RS3) and the Center for Advanced<br>\nSecurity Research Darmstadt (CASED), provide further opportunities for<br>\ninspiration and collaborations. The publication of your research results at<br>\nhighly ranked conferences will be expected and supported. The positions offered<br>\nare regular jobs with social benefits. The salary will be based on the TV-TU<br>\nDarmstadt public service salary scale (equivalent to former BAT IIa and TV-L).<br>\nGerman language skills are not required in the beginning, but the willingness<br>\nto learn German within the first year is expected.</p>\n<p>How to apply?</p>\n<hr>\n<p>Please submit your application, preferably on paper, including your detailed CV<br>\n(stating your language skills in English and German), complete educational<br>\ntranscripts with grades and degrees (copies, no originals), description of your<br>\nbackground and your research interests, and, if possible, the contact information<br>\nof one or two references to Prof. Dr. Heiko Mantel, TU Darmstadt, Department of<br>\nComputer Science, MAIS Group, Hochschulstraße 10, 64289 Darmstadt, Germany.</p>\n<p>Deadline for applications is 11 December 2011. However, we will consider applications<br>\nuntil the positions are filled. The positions are available immediately but a later start is also possible.</p>\n<p>TU Darmstadt is an equal opportunities employer and welcomes applications from<br>\nwomen. In case of equal qualifications, applicants with a degree of disability<br>\nof at least 50 or equal will be given preference.</p>\n<p>More information is available athttp://www.mais.informatik.tu-darmstadt.de. In case<br>\nof questions, please contact us by <a href=\"mailto:e-mailrecruiting@mais.informatik.tu-darmstadt.de\">e-mailrecruiting@mais.informatik.tu-darmstadt.de</a>.</p>",
        "id": 294148477,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660848405
    }
]