[
    {
        "content": "<p>From: Lawrence Paulson &lt;<a href=\"mailto:lp15@cam.ac.uk\">lp15@cam.ac.uk</a>&gt;<br>\nA journal cannot have a high impact unless it promotes the widest possible dissemination of the results. Most publishers that I am familiar with, including Springer, allow authors to publish their material on their own webpages. If you look at my webpage (<a href=\"http://www.cl.cam.ac.uk/~lp15/papers/refereed.html\">http://www.cl.cam.ac.uk/~lp15/papers/refereed.html</a>), you will see that practically everything that I've published is freely downloadable, and no publisher has objected to this. Recently they have recognised this de facto situation in their copyright agreements, which typically allow what they call self archiving provided a link is included to the official version. </p>\n<p>Springer also gives authors a PDF of the version typeset by their editorial staff (and their input is significant, as I have seen in my role as editor of the ITP proceedings). Springer also agreed to our making the Isabelle manual freely downloadable at the same time as they published the book version, and they agreed to our making the proceedings (prior to their editing) of all the FLoC conferences freely available on memory sticks, even though this directly competed with their own rather expensive proceedings-on-memory-stick product. Finally, on payment of a fee you can opt into the “author pays” model (nothing I would consider) and retain complete control over even the final typeset version. You will find more information here:</p>\n<p><a href=\"http://www.springer.com/open+access?SGWID=0-169302-0-0-0\">http://www.springer.com/open+access?SGWID=0-169302-0-0-0</a></p>\n<p>Larry Paulson</p>",
        "id": 294111378,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660836944
    },
    {
        "content": "<p>From: Jeremy Avigad &lt;<a href=\"mailto:avigad@cmu.edu\">avigad@cmu.edu</a>&gt;<br>\nI'd like to point out that at least part of Springer's recent <br>\nopen-access enlightenment is a response to the increasing number of <br>\n<em>real</em> open access journals. I have recently been involved in the <br>\nstartup of one of them, the Journal of Logic and Analysis:</p>\n<p><a href=\"http://logicandanalysis.org/\">http://logicandanalysis.org/</a></p>\n<p>We used the Public Knowledge Project's Open Journal Software:</p>\n<p><a href=\"http://pkp.sfu.ca/?q=ojs\">http://pkp.sfu.ca/?q=ojs</a></p>\n<p>Publishers like Springer still make a lot of money bundling their <br>\nofferings together and selling them to university libraries, which have <br>\nno choice but to pay the high prices. Going the real open access route <br>\nmeans having no revenue stream to support things like proofreading and <br>\ntypesetting, but in the long run I think it is better for the academic <br>\ncommunity, which currently does almost all the work and then makes the <br>\nlibraries pay for it.</p>\n<p>This is not to speak against the JAR, which is quite a good journal. But <br>\nif you don't submit there, I recommend considering an open access <br>\nalternative. Logical Methods in Computer Science is another good one:</p>\n<p><a href=\"http://www.lmcs-online.org\">http://www.lmcs-online.org</a></p>\n<p>I apologize that this has taken us far afield of Isabelle, but I wanted <br>\nto respond to Larry's message.</p>\n<p>Jeremy</p>\n<p>Lawrence Paulson wrote:</p>",
        "id": 294111529,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660836989
    },
    {
        "content": "<p>From: Tobias Nipkow &lt;<a href=\"mailto:nipkow@in.tum.de\">nipkow@in.tum.de</a>&gt;</p>\n<blockquote>\n<p>So, is JAR the kind of journal I'd object to?  Does it use <br>\ncopyright law to inhibit the dissemination of knowledge?</p>\n</blockquote>\n<p>It uses copyright, as do most books I have on my shelves. The fact that<br>\nthis does not inhibit the spread of knowledge was already argued by Larry.</p>\n<blockquote>\n<p>Does it pay the authors of its articles?  Does it pay its <br>\npeer reviewers?</p>\n</blockquote>\n<p>Neither. Please let me know which CS journals do.</p>\n<p>Tobias</p>",
        "id": 294111567,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660837005
    },
    {
        "content": "<p>From: Timothy McKenzie &lt;<a href=\"mailto:tjm1983@gmail.com\">tjm1983@gmail.com</a>&gt;<br>\nOn Sat, 03 Jul 2010 00:13:52 Tobias Nipkow wrote:</p>\n<blockquote>\n<blockquote>\n<p>So, is JAR the kind of journal I'd object to?  Does it use<br>\ncopyright law to inhibit the dissemination of knowledge?</p>\n</blockquote>\n<p>It uses copyright, as do most books I have on my shelves. The<br>\nfact that this does not inhibit the spread of knowledge was<br>\nalready argued by Larry.</p>\n</blockquote>\n<p>Thank you both for your responses.  You've reassured me that the <br>\nsituation with JAR is not as bad as it might have been.</p>\n<blockquote>\n<blockquote>\n<p>Does it pay the authors of its articles?  Does it pay its<br>\npeer reviewers?</p>\n</blockquote>\n<p>Neither. Please let me know which CS journals do.</p>\n</blockquote>\n<p>I don't know of any.  I was just trying to discover where the <br>\nmoney from library and individual subscriptions was going.</p>\n<p>Tim<br>\n&lt;&gt;&lt;<br>\n<a href=\"/user_uploads/14278/dcr-z6wqwvsBs_bkMXm5MdKM/signature.asc\">signature.asc</a></p>",
        "id": 294111585,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660837012
    },
    {
        "content": "<p>From: Lawrence Paulson &lt;<a href=\"mailto:lp15@cam.ac.uk\">lp15@cam.ac.uk</a>&gt;<br>\nNo doubt some of the money, in the case of commercial publishers, goes to shareholders. But even nonprofit academic societies find journal publication an expensive business. For example, although authors typeset manuscripts themselves using latex, they often have rather idiosyncratic ideas of what can pass for acceptable typography in a journal, not to mention their indifferent grasp of grammar and punctuation. Your typical referee is neither willing nor competent to identify such problems. So the journal has to pay somebody to make accepted manuscripts presentable, a skilled editor who possesses some competence in latex. And then the journal feels entirely justified in claiming copyright in the expensive product of their effort. That is why they allow authors to put their own version of the paper on their personal webpage, but not the journal's final version.</p>\n<p>Larry Paulson</p>",
        "id": 294111632,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660837025
    },
    {
        "content": "<p>From: Lawrence Paulson &lt;<a href=\"mailto:lp15@cam.ac.uk\">lp15@cam.ac.uk</a>&gt;<br>\nOne of Springer's highest impact journals is the Journal of Automated Reasoning, with an impact factor of 1.926. It is ranked number eight out of Springer's 146 journal titles! More information is available here:</p>\n<p><a href=\"http://www.springer.com/computer/computer+journals?SGWID=0-40100-0-0-0\">http://www.springer.com/computer/computer+journals?SGWID=0-40100-0-0-0</a></p>\n<p>I hope that all of you who have done high quality work will submit it to JAR.</p>\n<p>Larry Paulson</p>",
        "id": 294111906,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660837104
    },
    {
        "content": "<p>From: Timothy McKenzie &lt;<a href=\"mailto:tjm1983@gmail.com\">tjm1983@gmail.com</a>&gt;<br>\nIf I had high quality work to submit, I'd want to know that the <br>\njournal I was submitting it to wouldn't use copyright law to <br>\ninhibit the distribution of my work, reducing its potential <br>\naudience.</p>\n<p>In the past, because of my health, I've spent some time between <br>\nenrolments at universities, during which time I didn't have access <br>\nto any institutional subscriptions.  I was stymied by the prices <br>\nmany journals charged for access even to single articles (before I <br>\nknew whether they'd be interesting or not).</p>\n<p>These prices seemed particularly absurd when I considered that the <br>\nmarginal cost of a digital copy of an article is zero.  And in <br>\nmany cases it was hard to see what the fixed costs were, either.  <br>\nWere the authors of the articles paid?  Were the peer-reviewers <br>\npaid?  Any suggestion that the money was needed for quality <br>\ncontrol was called into doubt by the Chaos, Solitons &amp; Fractals <br>\ncontroversy (but to be fair, that journal is owned by Elsevier, <br>\nnot Springer).</p>\n<p>So, is JAR the kind of journal I'd object to?  Does it use <br>\ncopyright law to inhibit the dissemination of knowledge?  If so, <br>\nwhy?  Does it pay the authors of its articles?  Does it pay its <br>\npeer reviewers?</p>\n<p>The only reason I'm making an example of JAR is because it was <br>\nadvertised on this list; its high impact factor was mentioned, but <br>\nthe features I care more about were not.</p>\n<p>Tim<br>\n&lt;&gt;&lt;<br>\n<a href=\"/user_uploads/14278/dArnM3u8MVRinPTJbERY8fMb/signature.asc\">signature.asc</a></p>",
        "id": 294113019,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660837441
    }
]