[
    {
        "content": "<p>From: Helmut Seidl &lt;<a href=\"mailto:seidl@in.tum.de\">seidl@in.tum.de</a>&gt;<br>\n[[We apologize if you receive multiple copies!]]</p>\n<p>12 PhD Fellowships in the Doctorate Programme:<br>\n                      ``Program and Model Analysis''</p>\n<p><a href=\"http://puma.in.tum.de\">http://puma.in.tum.de</a></p>\n<p>The German Research Council (DFG) funds 12 doctoral fellowships through<br>\nthe new Doctorate Programme (Graduiertenkolleg) ``Program and Model<br>\nAnalysis''. The programme starts in July 2008. Applications are invited now.</p>\n<p>Hosting institutions.</p>\n<p>The programme is hosted by the Technische Universität and<br>\nLudwig-Maximilians-Universität München, two of the three universities<br>\nselected in the first round of the highly competitive Excellence<br>\nInitiative. Their Computer Science departments are among the most<br>\nreputed in Germany. The Professors involved in the programme are:<br>\nManfred Broy, Javier Esparza, Martin Hofmann, Alexander Knapp, Alois<br>\nKnoll, Tobias Nipkow, Helmut Seidl, Christian Urban, Helmut Veith and<br>\nMartin Wirsing.</p>\n<p>Objective.</p>\n<p>The programme will enable PhD students to conduct leading-edge research<br>\non methods, algorithms and tools for the analysis of programs and models<br>\nof information systems.  The research topics seek to establish and<br>\nexploit links between the four leading approaches for this task (theorem<br>\nproving, model checking, abstract interpretation and type systems) and<br>\nto apply them to software-intensive systems. PhD students will receive<br>\nindividual in-depth supervision and will participate in a structured<br>\nprogramme of courses and seminars offered by world experts.</p>\n<p>Positions.</p>\n<p>The doctorate programme offers 12 doctoral fellowships for a period of<br>\nthree years.  Renumeration is according to Level 13 of the TV-L German<br>\nsalary scale. This amounts to an initial gross salary of 2900 Euro per<br>\nmonth, increased to 3225 Euro per month after one year. Doctoral degrees<br>\nare awarded by the Technische Universität or the<br>\nLudwig-Maximilians-Universität. The earliest possible starting date is<br>\nJuly 2008.</p>\n<p>Eligibility.</p>\n<p>Applicants should be at most 28 years old and hold a MSc (or an<br>\nequivalent degree) in computer science or related disciplines (typically<br>\nmathematics, physics, or engineering). Applications from MSc candidates<br>\nwho expect to get their degrees within the next months are also welcome.<br>\nFluency in spoken and written English or German is required.</p>\n<p>Applications.</p>\n<p>Applications will be considered until all positions are filled. They<br>\nshould contain a full curriculum vitae, a statement on the candidate's<br>\nscientific interests, names and contact information of 2 references, and<br>\nshould be sent to</p>\n<p>Prof. Dr. Helmut Seidl<br>\n    Technische Universität München<br>\n    Institut für Informatik, Boltzmannstraße 3<br>\n    85748 Garching<br>\n    Email: <a href=\"mailto:puma@in.tum.de\">puma@in.tum.de</a></p>\n<p>Shortlisted applicants will usually be invited to visit München and give<br>\na talk on their Master's Thesis or on a scientific topic to be agreed<br>\nupon. The decision on admission will be communicated shortly after the talk.</p>",
        "id": 294058695,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660822666
    }
]