[
    {
        "content": "<p>From: Lukas Bulwahn &lt;<a href=\"mailto:bulwahn@in.tum.de\">bulwahn@in.tum.de</a>&gt;<br>\nHi everyone,</p>\n<p>in a private discussion with Andreas Lochbihler and Florian Haftmann, we <br>\nhave noticed that we should split the theories for data structures in <br>\nHOL-Library (currently: RBT_Impl, RBT, AssocList, DList, CSet, Mapping) <br>\ninto more fine-grained theories.</p>\n<p>If you require the implementation of one data structure, but you want to <br>\nconnect an abstract type with other data structure,<br>\nthe code equations must be manually deleted for one and added for the <br>\nother because implementation and their connection to abstract type are <br>\nwithin the same theory you would import from the Library.</p>\n<p>Therefore, we propose the following naming scheme:</p>\n<p>-- theories name of the representation types would end on \"Impl\", short <br>\nfor implementation.</p>\n<p>-- theories that define the invariant-ensuring type and lift operations <br>\nhave no suffix in its theory name.</p>\n<p>-- theories that connect the invariant-ensuring type and the abstract <br>\ntype are named by the scheme &lt;invariant-ensuring type&gt;_&lt;abstract type&gt;.</p>\n<p>This would result in the following renamings:</p>\n<p>for Red-Black trees: RBT_Impl remains RBT_Impl. RBT is split into RBT <br>\nand RBT_Mapping.</p>\n<p>for association lists: AssocList is split into AssocList_Impl and <br>\nAssocList_Mapping. [AssocList is removed because AssocList has no <br>\ninvariant-ensuring type (yet).]</p>\n<p>for distinct lists: DList is split into DList_Impl, DList, and DList_Cset.</p>\n<p>for computable sets: Cset is split into Cset and List_Cset.</p>\n<p>This way, the different layers are clearly separated in different theories.</p>\n<p>For most users, this would mainly be noticed one would have to import, <br>\ne.g., RBT_Mapping, instead of RBT to get executable Mappings based on <br>\nred-black trees.</p>\n<p>Any thoughts?</p>\n<p>Lukas</p>",
        "id": 294135555,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660844212
    }
]