[
    {
        "content": "<p>From: <a href=\"mailto:ciclops-org@clip.dia.fi.upm.es\">ciclops-org@clip.dia.fi.upm.es</a><br>\n[Apologies for cross and multiple postings]</p>\n<p>==============================================================================<br>\n                    C A L L   F O R   P A P E R S<br>\n==============================================================================</p>\n<p>CICLOPS 2008</p>\n<p>Colloquium on Implementation<br>\n             of Constraint and LOgic Programming Systems</p>\n<p>(URL: <a href=\"http://www.clip.dia.fi.upm.es/Conferences/CICLOPS-2008/\">http://www.clip.dia.fi.upm.es/Conferences/CICLOPS-2008/</a>)</p>\n<p>to be held in Udine (Italy) at the occasion of ICLP'08</p>\n<p>December, 2008</p>\n<p>Important dates and other relevant information</p>\n<hr>\n<p>* Abstract submission: September 1<br>\n  * Paper submission: September 8<br>\n  * Notification of acceptance: October 1<br>\n  * Final version due: October 17<br>\n  * Workshop dates: TBD</p>\n<p>Submission will be done through EasyChair using the URL<br>\n<a href=\"http://www.easychair.org/conferences/?conf=ciclops08\">http://www.easychair.org/conferences/?conf=ciclops08</a> .</p>\n<p>Topics of interest</p>\n<hr>\n<p>This  workshop aims  at discussing  and exchanging  experience  on the<br>\ndesign, implementation, and  optimization of logic, constraint (logic)<br>\nprogramming  systems, and  systems intimately  related to  logic  as a<br>\nmeans  to   express  computations.   Experience  backed  up   by  real<br>\nimplementations and their evaluation will be given preference, as well<br>\nas descriptions of work in progress in that direction.</p>\n<p>Topics include, but are not limited to:</p>\n<p>* Standard and alternative sequential implementation schemes (e.g.,<br>\n    generalization / modification of the WAM, translation to<br>\n    lower-level and/or general-purpose languages, etc.)</p>\n<p>* Implementation of parallel and concurrent logic and constraint<br>\n    programming systems.</p>\n<p>* Compile-time analysis and its application to code generation.</p>\n<p>* Interaction between high-level optimizations / transformations /<br>\n    specialization and low-level issues.</p>\n<p>* Memory management, indexing, and garbage collection issues.</p>\n<p>* Balance between compile-time effort and run-time machinery.</p>\n<p>* Implementation techniques for declarative programming paradigms<br>\n    with basis on, or extending, logic and constraint programming,<br>\n    such as non-monotonic reasoning, inductive logic programming,<br>\n    co-inductive logic programming, contextual logic programming, etc. </p>\n<p>* Implementation of systems closely related to, or based on, logic,<br>\n    such as theorem provers and natural language processing systems.</p>\n<p>* Automatic performance evaluation of logic and constraint<br>\n    programming systems.</p>\n<p>* User-oriented tools for performance evaluation and enhancement.</p>\n<p>* Software design with / for LP/CP systems: components, code<br>\n    patterns and rules, etc.</p>\n<p>* Design and implementation of programming environments.</p>\n<p>* Experiences from using systems in real-life applications.</p>\n<p>Workshop Goals</p>\n<hr>\n<p>Our  intent is  to  bring  together, in  an  informal setting,  people<br>\ninvolved  in  research   on  sequential  and  parallel  implementation<br>\ntechnologies  for  logic  and  constraint  programming  languages  and<br>\nsystems, in  order to  promote the exchange  of ideas and  feedback on<br>\nrecent developments. We hope that  the workshop will provide a meeting<br>\npoint for  people working  on implementation technology  for different<br>\naspects of logic and constraint-based languages and systems.</p>\n<p>Rationale and History</p>\n<hr>\n<p>Progress in computing technology,  including the now readily available<br>\nmulticore processors, increased  memory capacity and bandwidth, faster<br>\nnetworking  technology,  and   O.S.  support  for  cluster  computing,<br>\ncombined  with recent  advances  in compilation  technologies and  the<br>\nwider  adoption   of  alternative  constraint/logic-based  programming<br>\nlanguages,  are making  high-level languages  to be  regarded  as good<br>\ncandidates for programming  complex, demanding applications. A witness<br>\nof this  very interesting  trend is the  interest of Intel  with their<br>\nsponsorship  of the DAMP  series of  workshops. Logic  Programming and<br>\nConstraint  Programming,   in  particular,  offer  one   of  the  best<br>\nalternatives, as  they couple a very  high level of  abstraction and a<br>\ndeclarative nature with flexibility  its execution model, which can be<br>\nadapted to different scenarios.</p>\n<p>An orthogonal but synergistic  issue in the pursue of high-performance<br>\nand  high-level  languages   comes  from  advances  in  implementation<br>\ntechniques for logic and constraint languages. These techniques aim at<br>\nachieving  both design flexibility  and good  performance in  terms of<br>\nspeed and memory consumption,  thus making those languages and systems<br>\nmore  amenable  than ever  for  real  world applications.  Maintaining<br>\nflexibility without  unnecessarily sacrificing performance,  and while<br>\nretaining a  high level which  relieves the programmer  from burdening<br>\ntasks,  requires   sophisticated  technology  whose   exploration  and<br>\ndevelopment is one the aims of this workshop.</p>\n<p>This  workshop  continues  a  tradition  of  successful  workshops  on<br>\nImplementations of Logic Programming  Systems, previously held with in<br>\nBudapest  (1993) and  Ithaca  (1994), the  Compulog  Net workshops  on<br>\nParallelism and  Implementation Technologies held in  Madrid (1993 and<br>\n1994), Utrecht (1995) and Bonn (1996), the Workshop on Parallelism and<br>\nImplementation Technology for (Constraint) Logic Programming Languages<br>\nheld in  Port Jefferson (1997), Manchester (1998),  Las Cruces (1999),<br>\nand London (2000), and  more recently the Colloquium on Implementation<br>\nof Constraint and LOgic  Programming Systems in Paphos (Cyprus, 2001),<br>\nCopenhagen (2002),  Mumbai (2003),  Saint Malo (France,  2004), Sitges<br>\n(Spain, 2005), Seattle (U.S.A., 2006) and Porto (Portugal, 2007).</p>\n<p>Submission Information</p>\n<hr>\n<p>Authors  are invited  to  submit  papers written  in  English and  not<br>\nexceeding 12 pages and using  LNCS format. Authors who wish to prepare<br>\npapers in formats other than LaTeX are kindly requested to contact the<br>\norganization beforehand in  order to make sure that  we have available<br>\nthe  right tools  to process  the files  (if needed),  or in  order to<br>\nreceive detailed format instructions otherwise.</p>\n<p>Organization</p>\n<hr>\n<p>Program Committee:</p>\n<p>* Slim Abdennadher (Egypt)<br>\n  * Roberto Bagnara (Italy)<br>\n  * Amadeo Casas (U.S.A.)<br>\n  * Henning Christiansen (Denmark)<br>\n  * Gregory Duck (Australia)<br>\n  * Hai-Feng Guo (U.S.A.)<br>\n  * Remy Haemmerle (Spain)<br>\n  * José F. Morales (Spain)<br>\n  * Ulrich Neumerkel (Austria)<br>\n  * Phuong-Lan Nguyen (France)<br>\n  * Ricardo Rocha (Portugal)<br>\n  * Tom Schrijvers (Belgium)<br>\n  * Paul Tarau (U.S.A.)<br>\n  * Jan Wielemaker (The Netherlands)<br>\n  * Manuel Carro (Spain)<br>\n  * Bart Demoen (Belgium)</p>\n<p>Workshop Coordinators:</p>\n<p>Manuel Carro                            Bart Demoen<br>\n<a href=\"http://clip.dia.fi.upm.es/~mcarro\">http://clip.dia.fi.upm.es/~mcarro</a>       <a href=\"http://www.cs.kuleuven.be/~bmd/\">http://www.cs.kuleuven.be/~bmd/</a><br>\nPhone: +34-91-3367455                   Phone: +32 (0)16 327547</p>\n<p>Please address any question regarding the workshop organization to the<br>\naddress ciclops-org =at= <a href=\"http://clip.dia.fi.upm.es\">clip.dia.fi.upm.es</a></p>\n<p>Invited Speaker:</p>\n<p>TBD</p>\n<p>Proceedings</p>\n<hr>\n<p>We plan for the informal  workshop proceedings to be available on-line<br>\nat the Computing Research Repository after the workshop. An electronic<br>\ncopy will also be distributed during the conference.</p>\n<p>Acknowledgments and Support</p>\n<hr>\n<p>The organizers  wish to  thank the School  of Computer Science  of the<br>\nUPM, the Computer  Science Department of KU Leuven  for their support,<br>\nand the CLIP Lab of the UPM for the hosting and facilities provided.</p>",
        "id": 294064494,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660824961
    }
]