[
    {
        "content": "<p>From: Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt;<br>\njEdit is a plain text editor.  So you edit source text with it.</p>\n<p>Isabelle/jEdit augments that a little bit to add formal markup from the <br>\nmeaning of the source text right into the text view. This conforms to the <br>\ntraditional notion of theory source text that you are editing, while the <br>\nprover is telling about the formal content of it.</p>\n<p>Anyway, there is this old joke about \"HTML as programming language\".  For <br>\nplain HTML 1/2/3/4 it was indeed a rather bad joke.  For HTML5 I am not <br>\nsure anymore -- too many computational add-ons as it seems.</p>\n<p>Makarius</p>",
        "id": 294240666,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660906831
    },
    {
        "content": "<p>From: Gottfried Barrow &lt;<a href=\"mailto:gottfried.barrow@gmx.com\">gottfried.barrow@gmx.com</a>&gt;<br>\nOn 5/23/2013 6:32 AM, Makarius wrote:</p>\n<blockquote>\n<p>On Wed, 22 May 2013, Gottfried Barrow wrote:</p>\n<blockquote>\n<p>1) What is one word which I can use to label the many languages that <br>\nare used in what I see in jEdit?</p>\n</blockquote>\n<p>jEdit is a plain text editor.  So you edit source text with it.</p>\n</blockquote>\n<p>Makarius,</p>\n<p>See, it's not like I'm wanting to rebel on the words I'm going to choose <br>\nto start referring to Isabelle, but my needs aren't the needs of 99.9% <br>\nof the people who use Isabelle, and I am a member of the masses who will <br>\ncorrupt the language if given vocabulary that is too hard to use.</p>\n<p>I can program some, but I'm not a programmer. There was a point at which <br>\nI would have been a programer who wrote diagnostic software for embedded <br>\ncontrollers, but that fell by the wayside.</p>\n<p>The word \"source\" doesn't work in general.</p>\n<p>1) In conversation, do I say, \"The source on line 300 of Int.thy...\"? <br>\n(That's not too bad.)</p>\n<p>2) When I'm editing a THY, am I \"sourcing\"?</p>\n<p>3) If I get good at using the languages of Isabelle, am I a \"Isabelle <br>\nsourcer\"? (Not to be confused with a sorcerer, one who works software <br>\nmagic.)</p>\n<p>I can try other words, like \"specification\", \"formalize\", and \"proof\".</p>\n<p>1) \"The specification on line 300 of Int.thy...\".</p>\n<p>2) \"I myself, when specifying in Isabelle...\".</p>\n<p>3) \"Someday, I might have earned the right to be called an Isabelle <br>\nspecifier\".</p>\n<p>Will there come a day when I want to be called a \"formalizer\" or a <br>\n\"prover\"? Only if you take the lead and start calling yourself a <br>\n\"formalizer\" and a \"prover\" so that I have links to refer to when <br>\nsomeone says, \"Uh, you're a formalizer, you say?\"</p>\n<p>In Isar, with my awareness raised, and because vocabulary used in <br>\nisar-ref.pdf, I can see that Isar is a \"source language\" in general, and <br>\nparts of it are a \"proof language\", so I've figured out the vocabulary I <br>\nneed to use when referring to Isar.</p>\n<p>However, it's not a simple thing to try and talk about the combination <br>\nof Isabelle/Pure, Isabelle/Isar, and Isabelle/HOL.</p>\n<p>1) In a THY, you're always in Isar the source language, but from one <br>\nline to another, you may or may not be in Isar the proof language.</p>\n<p>2) On a particular line, you are always in Isar the source language, but <br>\nyour syntax may or may not be Isabelle/HOL syntax.</p>\n<p>3) An outer syntax keyword may be both an Isar keyword and  Isabelle/HOL <br>\nkeyword, or it may only be an Isar keyword. One may need to look in <br>\nisar-ref.pdf for the characters \"(HOL command)\" to find out.</p>\n<p>I suppose all this complexity is what gives Isabelle its power and <br>\nflexibility, but I'm talking about the need for the masses to engage in <br>\npolite conversation and not be saying things like, \"You really should <br>\ntry Isabelle, Joe. I've become an Isabelle specifier myself.\"</p>\n<p>Regards,<br>\nGB</p>\n<blockquote>\n<p>Isabelle/jEdit augments that a little bit to add formal markup from <br>\nthe meaning of the source text right into the text view. This conforms <br>\nto the traditional notion of theory source text that you are editing, <br>\nwhile the prover is telling about the formal content of it.</p>\n<p>Anyway, there is this old joke about \"HTML as programming language\".  <br>\nFor plain HTML 1/2/3/4 it was indeed a rather bad joke.  For HTML5 I <br>\nam not sure anymore -- too many computational add-ons as it seems.</p>\n<p>Makarius<br>\n</p>\n</blockquote>",
        "id": 294240968,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660906950
    },
    {
        "content": "<p>From: Gottfried Barrow &lt;<a href=\"mailto:gottfried.barrow@gmx.com\">gottfried.barrow@gmx.com</a>&gt;<br>\nThis email is one too many, other than I'd rather do this now, since the <br>\nthread has some momentum. Months from now, I don't want anyone to rehash <br>\nwhat's been said because I've decided to take the liberty to use <br>\nwhatever vocabulary I want to use.</p>\n<p>I'm settling on referring to Isabelle/HOL either as coding or as <br>\nprogramming, when I have a need to casually talk about it.</p>\n<p>There's textbook style vocabulary that's used and being used in lots of <br>\ndifferent places to label the languages of Isabelle, what Isabelle is, <br>\nand what you do when you're working with it. But I don't even see that <br>\nthe developers are heavily using that type of language in day to day talk.</p>\n<p>I'll take two words, \"formalize\" and \"specification\". To begin with, <br>\nthey use too many characters. If you use \"formalize\", then you need to <br>\nuse \"formalization\", which is even worse.</p>\n<p>If I saw the Isabelle developers using these kind of words in the same <br>\nway that people talk about \"programs\" and \"programming\", then I suppose <br>\nI'd do it too, but am I suppose to look like a fool by heavily using <br>\nthese formal sounding words when no one else has incorporated them into <br>\ntheir language similar to \"program\" and \"programming\"?</p>\n<p>I'm willing to look the fool if there's a good reason, but I prefer to <br>\nminimize that kind of thing. And there's the huge issue of something <br>\nbeing practical. You can't expect me to have to use long, two word <br>\nphrases to refer to Isabelle code, or to refer to what I'm doing with <br>\nthe Isabelle code.</p>\n<p>This is not directed to anyone in particular, and my bi-monthly email <br>\nquota is up. You can blame Christian for badly influencing me.</p>\n<p>Regards,<br>\nGB</p>",
        "id": 294240980,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660906954
    },
    {
        "content": "<p>From: Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt;<br>\nOn Fri, 24 May 2013, Gottfried Barrow wrote:</p>\n<blockquote>\n<p>On 5/23/2013 6:32 AM, Makarius wrote:</p>\n<p>On Wed, 22 May 2013, Gottfried Barrow wrote:</p>\n<blockquote>\n<blockquote>\n<p>1) What is one word which I can use to label the many languages that are <br>\nused in what I see in jEdit?</p>\n</blockquote>\n<p>jEdit is a plain text editor.  So you edit source text with it.</p>\n</blockquote>\n<p>The word \"source\" doesn't work in general.</p>\n<p>2) When I'm editing a THY, am I \"sourcing\"?</p>\n</blockquote>\n<p>You are a \"writer\" or \"author\" of formal source text, using a plain text <br>\neditor.</p>\n<p>What is the terminology you would use yourself for latex sources?  Latex <br>\nis also a programming language, but nobody \"codes\" papers, books, theses <br>\netc. with it.</p>\n<blockquote>\n<p>I suppose all this complexity is what gives Isabelle its power and <br>\nflexibility, but I'm talking about the need for the masses to engage in <br>\npolite conversation and not be saying things like, \"You really should <br>\ntry Isabelle, Joe. I've become an Isabelle specifier myself.\"</p>\n</blockquote>\n<p>In the worst case, something like \"user of Isabelle\" will always work.</p>\n<p>Makarius</p>",
        "id": 294240989,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660906960
    },
    {
        "content": "<p>From: Gottfried Barrow &lt;<a href=\"mailto:gottfried.barrow@gmx.com\">gottfried.barrow@gmx.com</a>&gt;<br>\nI don't think so Makarius. I'm still rebelling, and Larry has never <br>\nofficially backed out of saying that Isabelle/HOL is a programming language.</p>\n<p>There is \"program\", \"programming\", and \"programmer\", and \"code\", <br>\n\"coding\", and \"coder\", where right now I'm preferring \"programming\".</p>\n<p>If someone asks, \"What you do for a living?\", do I say, \"Well, I don't <br>\nget paid for it, but I'm a writer who writes writings.\"</p>\n<p>Wouldn't they be more likely to say or think, \"Oh, so you write novels, <br>\nor maybe you're a journalist?\"</p>\n<p>I am one over my bi-monthly quota of emails, but this is about the future.</p>\n<p>Again, this is not directed at anyone in particular, but in the future, <br>\nif I'm corrected for using \"programming\" in relation to Isabelle/HOL, I <br>\nwill reference the thread where Larry calls HOL a programming language, <br>\nand I will reference this thread.</p>\n<p>I will then say, \"then please give me three words to replace 'program', <br>\n'programming', and 'programmer'\".</p>\n<p>Me doing that will be much better than writing lengthy emails, as I have <br>\nbeen doing.</p>\n<p>My goal is to become a very competent Isabelle/HOL \"programmer\". It's <br>\nthe only \"programming language\" I use at this time. I do some scripting <br>\nand text processing, but there's already established vocabulary for <br>\nthose, which would be \"script\" and \"scripting\", and \"text\" and \"text <br>\nprocessing\".</p>\n<p>As a rebel, I can't see that it's reasonable for me to have to <br>\nfrequently resort to long phrases like \"I write formal source text\".</p>\n<p>Regards,<br>\nGB</p>",
        "id": 294241005,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660906966
    },
    {
        "content": "<p>From: Gottfried Barrow &lt;<a href=\"mailto:gottfried.barrow@gmx.com\">gottfried.barrow@gmx.com</a>&gt;<br>\nSo when the use of a language or product is prolific, such as with LaTeX <br>\nor Java, then using the name is enough to define what you do.</p>\n<p>\"What do you do?\"</p>\n<p>\"I do Oracle.\"</p>\n<p>If the use of Isabelle was prolific, then the use of \"Isabelle/HOL\" <br>\nwould set the context. But Isabelle/HOL is relatively unknown in the <br>\nprogramming world, and it wouldn't solve my need for a word like <br>\n\"programmer\". Or maybe it would.</p>\n<p>\"What do you do?\"</p>\n<p>\"I write HOL source.\"</p>\n<p>But it's not prolific. So to say, \"I write HOL source\", is to invite the <br>\nquestion, \"Oh, that sounds interesting. But what is that exactly?\"</p>\n<p>Instead of,</p>\n<p>\"What do you do?\"</p>\n<p>\"I'm a programmer.\"</p>\n<p>\"Oh.\" (Their eyes shift around, looking for someone else to talk to. <br>\nThat's good. You didn't feel like talking about it either.)</p>\n<p>Regards,<br>\nGB</p>",
        "id": 294241015,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660906972
    },
    {
        "content": "<p>From: Christian Sternagel &lt;<a href=\"mailto:c.sternagel@gmail.com\">c.sternagel@gmail.com</a>&gt;<br>\nDear Gottfried,</p>\n<p>my 2 cents concerning naming (everyone: please correct and/or complete):</p>\n<ul>\n<li>\n<p>Coq is a proof assistant (or interactive theorem prover)</p>\n</li>\n<li>\n<p>Isabelle is a generic proof assistant, where Isabelle/HOL is its <br>\ninstance for Higher-Order Logic. Thus I would call Isabelle/HOL a proof <br>\nassistant (omitting the term \"generic\"; also \"interactive\" from <br>\n\"interactive theorem prover\" is sometimes omitted, but I prefer not to <br>\ndo so).</p>\n</li>\n<li>\n<p>The main purpose of proof assistants, as their name suggests, is to <br>\nassist the user to make proofs. That is, <em>proving</em> as opposed to <br>\n<em>programming</em> is the main thing.</p>\n</li>\n<li>\n<p>In the recent literature developing a theory (or a proof for some <br>\nstatement) A in a proof assistant is called: mechanizing A, or <br>\nformalizing A, or certifying A, ... but never programming A</p>\n</li>\n</ul>\n<p>cheers</p>\n<p>chris</p>",
        "id": 294242465,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660907551
    },
    {
        "content": "<p>From: Gottfried Barrow &lt;<a href=\"mailto:gottfried.barrow@gmx.com\">gottfried.barrow@gmx.com</a>&gt;<br>\nChristian,</p>\n<p>There's no person on the face of the Earth more appropriate to continue <br>\nthis conversation with than with you. So now, having intentionally tried <br>\nto make Larry suffer less, I now make you suffer.</p>\n<p>There's a certain forum in which I deemphasized Isabelle as a <br>\n\"programming language\", a point which you countered, a counterpoint <br>\nwhich I partially countered.</p>\n<p>As many times, what I reject, after having some time to think, I then, <br>\nin some form, embrace. And so, my mental investigations, even now, is in <br>\ntrying to determine whether \"programming language\" can be legitimately <br>\napplied to Isabelle/HOL, where I'm leaning towards saying \"yes\", though <br>\nthat doesn't mean I'll use the label anymore.</p>\n<p>Having had my say with too many emails on this, I am now only interested <br>\nin choosing vocabulary for Isabelle for pure, practical reasons.</p>\n<p>Without explaining any of the thought process that's led to this, I seek <br>\none word, where the following describes some of the criteria:</p>\n<p>1) What is one word which I can use to label the many languages that are <br>\nused in what I see in jEdit?</p>\n<p>2) This word needs to general enough to describe the main languages that <br>\nI see: Pure, Isar, and Isabelle/HOL.</p>\n<p>3) This word needs to be able to be used as a noun and a verb.</p>\n<p>4) This word, as a noun, needs to describe what someone might want to <br>\ncall me.</p>\n<p>5) This word, as a verb, needs to describe I am doing when I use <br>\nIsabelle as a language.</p>\n<p>6) This word needs to be acceptable by the experts as being technically <br>\ncorrect.</p>\n<p>7) This words needs to have meaning to programmers who know nothing <br>\nabout Isabelle as a language.</p>\n<p>So the word \"programming\", because it's been used for years, and has <br>\naccumulated many connotations, doesn't work.</p>\n<p>Below, you give me vocabulary, and I am happy to follow the lead of the <br>\nofficial documentation, the principal developers, and the rest of the <br>\nprofessional developers, like you.</p>\n<p>But, as I said, my pursuit of a word is for everyday, practical usage.</p>\n<p>To make a long story short, the word is \"code\".</p>\n<p>Isabelle has source code files with the extension \"thy\".</p>\n<p>1) If they are source code files, then what I'm looking at in jEdit must <br>\nbe code.</p>\n<p>2) If I'm editing code in a THY file, then it must be I'm coding.</p>\n<p>3) If I ever get good enough at coding with the many languages of <br>\nIsabelle, then it must be that I'll be a \"coder\".</p>\n<p>4) \"Code\" has no connotational requirement that anything be executed.</p>\n<p>5) It doesn't have to be a recipe, as with programs.</p>\n<p>6) \"Code\" is merely information that is \"encoded\".</p>\n<p>So, at this point, seeing that \"code\", though commonly used, hasn't been <br>\ntotally corrupted, maybe the proof assistant community can usurp the <br>\nword for their purposes.</p>\n<p>Why? If leading authorities don't give the masses a practical word to <br>\nuse for something, they'll choose their own word. Compare Latin to <br>\nVulgar Latin. Language usage is heavily determined by anarchy.</p>\n<p>Hypothetical scenario: I have 350 characters to make a comment on a <br>\nforum. Do I say, \"When I myself am writing formal specifications with <br>\nIsabelle...\"</p>\n<p>Yes, I do, if I'm trying to be the benevolent educator, taking advantage <br>\nof what can be a teachable moment.</p>\n<p>However, no, I don't, not if I'm at 400 characters. The phrase \"writing <br>\nformal specifications with Isabelle\" becomes \"coding in Isa\".</p>\n<p>I've just mentioned an upside to the word \"code\". It's four letters. I <br>\ncan't think of a three letter word at all to replace \"code\".</p>\n<p>I'll check out of this thread on what is good or bad vocabulary.</p>\n<p>Regards,<br>\nGB</p>",
        "id": 294242490,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660907563
    }
]