[
    {
        "content": "<p>From: Artur Gomes &lt;<a href=\"mailto:gomesa@tcd.ie\">gomesa@tcd.ie</a>&gt;<br>\nDear Florian,</p>\n<p>Thank you for your replies. I've managed to work with Haskabelle using the<br>\n2015 version of Isabelle, and I think I'll stick with it. It works for me.<br>\nMoreover, I wrote a small script that extracts only the Haskell code from<br>\nmy<br>\nlatex+Haskell mixture. I'm not begin able to translate a few things, but<br>\nI'll have<br>\na closer look before coming back to you with further questions.</p>\n<p>Best regards,</p>",
        "id": 294701193,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661179232
    },
    {
        "content": "<p>From: Florian Haftmann &lt;<a href=\"mailto:florian.haftmann@informatik.tu-muenchen.de\">florian.haftmann@informatik.tu-muenchen.de</a>&gt;<br>\nDear Andrew,</p>\n<p>a problem with Haskabelle is that it is unmaintained and did not even<br>\nmake it into the current Isabelle2016-1 release.  It is however part of<br>\nthe earlier Isabelle2016 release, available at<br>\n<a href=\"http://isabelle.in.tum.de/website-Isabelle2016/index.html\">http://isabelle.in.tum.de/website-Isabelle2016/index.html</a>.  But note<br>\nthat the relevant parts of the Isar language have been stable enough<br>\nthat theory files generated by Haskabelle coming with older Isabelle<br>\nreleases should still be usable in Isabelle2016-1.</p>\n<p>Getting to the core of your question:</p>\n<blockquote>\n<p>However - we see that Haskabelle requires an earlier version of Haskell-src-exts than that installed by Artur,<br>\nand you talk about  GHC 7.6.3 in the documentation with Isabelle-2016.</p>\n</blockquote>\n<p>no, there isn't.</p>\n<p>As far as I remember, at some stage after giving Haskabelle maintainance<br>\nout of my hands more than six years ago, newer versions of<br>\nhaskell-src-exts changed their data model in a fashion that would have<br>\nrequired a substantial rethinking and reimplementation of parts of<br>\nHaskabelle, hence this stuck to a quite ancient version.</p>\n<p>I am at a loss to explain how Haskell maintainers / users coped with<br>\nthat over the last years; the documentation does not give specific hints.</p>\n<p>My experiments just revealed that newly emerged ingredients of the<br>\nHaskell Prelude clash with symbols defined in Haskabelle for ghc 7.10.3<br>\nwhich is shipped with my OS.</p>\n<p>Maybe the best solution is to place a wholly separate ghc installation<br>\non your machine that is only used for Haskabelle.</p>\n<p>The situation exhibits serious need for volunteers to step in and take<br>\nover Haskabelle maintainance.</p>\n<p>Hope this helps,<br>\n    Florian<br>\n<a href=\"/user_uploads/14278/MJ-lZ4EwETrIQkN-rf1Trlav/signature.asc\">signature.asc</a></p>",
        "id": 294703754,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661180037
    }
]