[
    {
        "content": "<p>From: Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt;<br>\nOn Thu, 13 Sep 2012, Gottfried Barrow wrote:</p>\n<blockquote>\n<p>I was using LaTeX to produce a readable document. Recently, I broke my <br>\nLaTeX build script, and before I got it fixed, I said, \"Forget LaTeX <br>\nright now. I have 500 pages of theorems I have to implement, and if I <br>\ncan't make it all work, then it's worthless to make something look good <br>\nthat's worthless.\"</p>\n</blockquote>\n<p>I've recently seen myself doing \"drafting\" directly in the editor buffer, <br>\nwith its slightly improved rendering quality in the last 12 months or so. <br>\nThe jEdit print operation also produces suprisingly good results with the <br>\nIsabelleText font.</p>\n<blockquote>\n<p>I attach a screen shot. How would it print out with LaTeX? It would look <br>\nterrible, I'm sure, but that's not the purpose. If I want to print it, I <br>\ncan print it out with a regular printer driver. But I read everything in <br>\nelectronic form, so I always need a tree view, and Sidekick gives me <br>\nthat in jEdit.</p>\n</blockquote>\n<p>The LaTeX appearance is defined by the .sty files you provide to render <br>\nit.  The default isabelle.sty would make inlined comments with \"--\" look <br>\nunsatisfactory, for example.  Normally you use the 'text' command for <br>\nlarger paragraphs of semi-formal text.</p>\n<p>What is the purpose of the paragraph signs in your source (in the <br>\n'section' command)?</p>\n<p>Makarius</p>",
        "id": 294222645,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660898326
    },
    {
        "content": "<p>From: Gottfried Barrow &lt;<a href=\"mailto:gottfried.barrow@gmx.com\">gottfried.barrow@gmx.com</a>&gt;<br>\nOn 9/17/2012 8:31 AM, Makarius wrote:</p>\n<blockquote>\n<p>The LaTeX appearance is defined by the .sty files you provide to <br>\nrender it.  The default isabelle.sty would make inlined comments with <br>\n\"--\" look unsatisfactory, for example.  Normally you use the 'text' <br>\ncommand for larger paragraphs of semi-formal text.</p>\n</blockquote>\n<p>As to why I use --\"......\" instead of \"text{<em>....</em>}\", (<em>....</em>), and <br>\n--{<em>...</em>}, that gets into the analysis of what I'm trying to accomplish <br>\nin my first phase of editing a THY file. I'm always happy to analyze things.</p>\n<p>My source code editing method could partially described with these <br>\nphrases: \"readability\", \"absorb information fast\", \"get around fast\", <br>\n\"don't let the code get so unwieldy you don't know what's there\", and <br>\n\"always have an idea of where you're at in the code on an outline level\".</p>\n<blockquote>\n<p>What is the purpose of the paragraph signs in your source (in the <br>\n'section' command)?</p>\n</blockquote>\n<p>The purpose is just visibility, so that as I'm scrolling down through a <br>\ndocument fast, I can see when there's a sectioning command, and I can <br>\nsee at what level it's at, that is, whether it's section, subsection, or <br>\nsubsubsection. One paragraph symbol means \"section\". Three paragraph <br>\nsymbols means \"subsubsection\".</p>\n<p>Graphics can, many times, help us absorb a lot more information, and <br>\nabsorb it faster than reading text.</p>\n<p>Here's where someone might think I would make a request of you. I could <br>\nrequest that you hide the syntax \"section{*\", and based on command <br>\ncontext, make the words inside \"section{<em>.....</em>}\" bold.</p>\n<p>But if you lock me into them, I might not like your decisions on font <br>\nstyle and font size. Mathematica is highly customizable, but at some <br>\npoint it becomes, \"I just want something that's basic, functional, looks <br>\ndecent, and doesn't require me to give people a style document.\"</p>\n<p>As it is, I'd rather be working in jEdit as I am now than in Mathematica.</p>\n<p>I'm still experimenting, but there are three types of information that I <br>\nwant to find and recognize fast:</p>\n<p>1) Sectioning: what level a section command is at, and what the heading <br>\nsays, both when scrolling and when looking at the Sidekick panel.</p>\n<p>(a) I do that as shown by the attached images; that is, using a <br>\n--\"....\" command with bold text for scrolling through the text, and <br>\nimmediately followed by a sectioning command underneath it for the <br>\nSidekick panel. I have to have two. I can't read the title in Sidekick <br>\nif it's full of \\&lt;bold&gt; symbols.</p>\n<p>2) The start of textual exposition, or text notes under theorems and <br>\nother keywords.</p>\n<p>(a) I do that with \\&lt;bullet&gt; and some scientific amount of <br>\nindentation, which I haven't locked in yet.</p>\n<p>3) Toplevel keywords such as theorem, definition, syntax, notation, and <br>\ndefinition.</p>\n<p>(a) I'm still experimenting. For example, the blue and boldfaced <br>\nkeyword \"theorem\" is not enough to make it stand out from lots of other <br>\nkeywords in its vicinity. I'm currently experimenting with this for <br>\nunnamed theorems, like this:</p>\n<p>theorem --\"\\&lt;^bold&gt;(*\\&lt;^bold&gt;) What the theorem does starts <br>\nhere...\"</p>\n<p>With that, I can also replace \"*\" with a number, if needed, so that I <br>\ncan reference it within a section.</p>\n<p>I'm still looking for a more perfect symbol than \"*\". \\&lt;bullet&gt; is not <br>\nvertically centered in the \"( )\", and \"*\" doesn't stand out enough. I <br>\ntry things like \\&lt;^bold&gt;(\\&lt;^bold&gt;\\&lt;^bold&gt;). I need to identify theorems <br>\nquick when they're interspersed with a bunch of bulleted text. But now, <br>\nI'm in realm of \"personal tweaking\".</p>\n<p>To find something that works, looks good, and helps me see it and <br>\nrecognize it fast, that takes a lot of experimenting. For my other <br>\neditor for LaTeX, I put a massive amount of work into syntax <br>\nhighlighting and making trees in a sidepanel.</p>\n<p>The \"looking good\" is not an unimportant part of it. It's for myself, <br>\nbut I don't like looking at obnoxious, gaudy looking code.</p>\n<p>I need dark, black symbols to stand out, like \\&lt;bullet&gt; and <br>\n\\&lt;paragraph&gt;, but there's not a lot of them available. I used <br>\n\\&lt;spadesuit&gt; for a while in place of \\&lt;paragraph&gt;, but it got on my nerves.</p>\n<p>Simplicity and full featured is a hard balance to find. The \\&lt;bold&gt; for <br>\nuse in identifiers will be a huge addition. I'll just grow with whatever <br>\nyou add, and hope you don't force something on me that doesn't look good <br>\nto me, but if you do, I'll live with it.</p>\n<p>Oh yea, as to why I don't use \"text{<em>......</em>}\". I don't like seeing <br>\n\"text\", and <code>--\".....\"</code> only uses 4 characters instead of 8 characters. <br>\nOf the options available for writing notes, it looks the best, but I do <br>\nresort to <code>--{*.....*}</code> if I need to do lots of quoting using double <br>\nquotes.</p>\n<p>Both \"text{<em>....</em>}\" and --\".....\" make the background grey, and I would <br>\nturn that off if I could. An example of \"I live with it\", because it's <br>\nnot a problem. The grey is a little too dark on my laptop monitor, but I <br>\nmainly have jEdit on my external monitor.</p>\n<p>If I ever do need to covert everything to use \"text{<em>.....</em>}\", I'll just <br>\ngo through lots pain and agony.</p>\n<p>The image attachments show how I'm trying to balance the need for <br>\nreading information in Sidekick with \"reading when scrolling\", all <br>\nwithout ending up with something ugly or obnoxiously cluttered up, and <br>\nwhere different symbols and formatting makes the 3 different categories <br>\nstand out in 3 different ways.</p>\n<p>Regards,<br>\nGB<br>\n<a href=\"/user_uploads/14278/QJRyXVc9hVv41-OfDRJ1YtHw/sectioning_paragraph_marks.png\">sectioning_paragraph_marks.png</a><br>\n<a href=\"/user_uploads/14278/9bitRnaX3jaguHkO7IeGngdv/trying_to_emphasize_theorem.png\">trying_to_emphasize_theorem.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/14278/QJRyXVc9hVv41-OfDRJ1YtHw/sectioning_paragraph_marks.png\" title=\"sectioning_paragraph_marks.png\"><img src=\"/user_uploads/14278/QJRyXVc9hVv41-OfDRJ1YtHw/sectioning_paragraph_marks.png\"></a></div><div class=\"message_inline_image\"><a href=\"/user_uploads/14278/9bitRnaX3jaguHkO7IeGngdv/trying_to_emphasize_theorem.png\" title=\"trying_to_emphasize_theorem.png\"><img src=\"/user_uploads/14278/9bitRnaX3jaguHkO7IeGngdv/trying_to_emphasize_theorem.png\"></a></div>",
        "id": 294222661,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660898341
    },
    {
        "content": "<p>From: Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt;<br>\nOn Mon, 17 Sep 2012, Gottfried Barrow wrote:</p>\n<blockquote>\n<p>As to why I use --\"......\" instead of \"text{<em>....</em>}\", (<em>....</em>), and <br>\n--{<em>...</em>}, that gets into the analysis of what I'm trying to accomplish in my <br>\nfirst phase of editing a THY file. I'm always happy to analyze things.</p>\n<p>My source code editing method could partially described with these <br>\nphrases: \"readability\", \"absorb information fast\", \"get around fast\", <br>\n\"don't let the code get so unwieldy you don't know what's there\", and <br>\n\"always have an idea of where you're at in the code on an outline <br>\nlevel\".</p>\n</blockquote>\n<p>Some of these aspects are shared by projects like Markdown, which I have <br>\nencountered just recently myself, although the ideas (and tools) are <br>\nalready there for several years.  The idea is to write plain text with <br>\nsome level of \"formality\", such that the immediately readable text can be <br>\ntypeset in reasonable quality offline (or as preview online, like in the <br>\n\"enki\" editor).</p>\n<p>I've started thinking about making Isabelle section / text / \"--\" follow <br>\nsome Markdown principles.  You have already \\&lt;bullet&gt; symbols that <br>\napproximate a formal itemization.  A bit more such things could become <br>\nstandard one day.</p>\n<blockquote>\n<p>Here's where someone might think I would make a request of you. I could <br>\nrequest that you hide the syntax \"section{*\", and based on command <br>\ncontext, make the words inside \"section{<em>.....</em>}\" bold.</p>\n</blockquote>\n<p>Maybe in the next round of jEdit trickery.  There is still the TokenMarker <br>\nlimitation imposed by the original code base, but I might eventually <br>\nmanage to get a tiny little modification accepted by the jEdit maintainers <br>\nto make font styles dependent on a semantic context, not just the plain <br>\ntext you see in the buffer.</p>\n<blockquote>\n<p>I'm still experimenting. For example, the blue and boldfaced keyword <br>\n\"theorem\" is not enough to make it stand out from lots of other keywords in <br>\nits vicinity. I'm currently experimenting with this for unnamed theorems, <br>\nlike this:</p>\n<p>theorem --\"\\&lt;^bold&gt;(*\\&lt;^bold&gt;) What the theorem does starts here...\"</p>\n<p>With that, I can also replace \"*\" with a number, if needed, so that I can <br>\nreference it within a section.</p>\n</blockquote>\n<p>BTW, there is a semiformal \"tag\" concept that could be used here:</p>\n<p>theorem %important ...</p>\n<p>Right now these tags are mainly relevant for LaTeX output, but one could <br>\nmake more of them.  You can also try to be creative with non-alphabetic <br>\ntag names, although LaTeX will choke on that.</p>\n<blockquote>\n<p>I'm still looking for a more perfect symbol than \"*\". \\&lt;bullet&gt; is not <br>\nvertically centered in the \"( )\", and \"*\" doesn't stand out enough.</p>\n</blockquote>\n<p>It seems that when merging Bitstream Vera and TeX fonts in IsabelleText, <br>\nI've got the spacing not exactly right.  This is the normal situation for <br>\na non-fontdesigner like myself tinkering with existing fonts. <br>\nNonetheless the outcome is so much better than anything we've had in the <br>\nlast 15 years, and also slightly better than STIX in many respects.</p>\n<blockquote>\n<p>I try things like \\&lt;^bold&gt;(\\&lt;^bold&gt;\\&lt;^bold&gt;). I need to identify <br>\ntheorems quick when they're interspersed with a bunch of bulleted text. <br>\nBut now, I'm in realm of \"personal tweaking\".</p>\n</blockquote>\n<p>Personal tweaking may be perfected by assigning your own (unused) Unicode <br>\npoints to (unused) Isabelle symbols in $ISABELLE_HOME_USER/etc/symbols <br>\nlike this:</p>\n<p>\\&lt;blob&gt;   code: 0x2593 font: STIXGeneral</p>\n<p>This gives you a 75% grey shade quad, assuming you and your recipients <br>\nhave that font and your etc/symbols file.  Otherwhise they will see a <br>\nliteral \\&lt;blob&gt; which is also OK.</p>\n<blockquote>\n<p>Both \"text{<em>....</em>}\" and --\".....\" make the background grey, and I would <br>\nturn that off if I could. An example of \"I live with it\", because it's <br>\nnot a problem. The grey is a little too dark on my laptop monitor, but I <br>\nmainly have jEdit on my external monitor.</p>\n</blockquote>\n<p>In the next Isabelle release, all these colors will be configurable via <br>\nuser options.  Then people can come up with their own \"themes\".</p>\n<p>Makarius</p>",
        "id": 294222822,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660898412
    },
    {
        "content": "<p>From: Gottfried Barrow &lt;<a href=\"mailto:gottfried.barrow@gmx.com\">gottfried.barrow@gmx.com</a>&gt;<br>\nMakarius,</p>\n<p>If you get some ideas from this that's good, but I'll do 6 things and <br>\nthen back out of 5 of them.</p>\n<p>I don't want to work with LaTeX right now, but I'm switching things <br>\naround so that I can either build a PDF through Isabelle, or through my <br>\nown scripts.</p>\n<p>I switch to \"text{<em>...</em>}\" to use it like it's typically used, and I use <br>\n<code>--\"....\"</code> for adding comments to proofs and other syntax.</p>\n<p>I get rid of the bullets and make more intelligent use of subsubsection. <br>\nWhen everything ends ups having a bullet, they lose their effect.</p>\n<p>I use the section commands like normal; I get rid of the bold text in <br>\nthe section title, and I get rid of the duplicate title.</p>\n<p>It's worth spending some time to try and format the code so that it's <br>\nmore readable in jEdit, but complexity can only be reduced so much.</p>\n<p>Cheap imitations aren't the way to go if they complicate things too <br>\nmuch. LaTeX is supposed to extend things, not be duplicated.</p>\n<p>Other than \\&lt;^bold&gt; in identifiers, you could lock in jEdit today for 2 <br>\nor 3 years, and it would be good enough.</p>\n<p>I see on [isabelle-dev] that it's not locked in, and the speed <br>\nimprovements sound good. If users can create huge theories beyond <br>\nComplex_Main, and other users can use those theories without having to <br>\nbuild the heap, that simplifies things. Speed can solve a lot of problems.</p>\n<p>Regards,<br>\nGB</p>",
        "id": 294222865,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660898449
    },
    {
        "content": "<p>From: Gottfried Barrow &lt;<a href=\"mailto:gottfried.barrow@gmx.com\">gottfried.barrow@gmx.com</a>&gt;<br>\nI might as well attach related requests, which would be a request for a <br>\nset of italic commands, like:</p>\n<p>\\&lt;^iitalic&gt;, \\&lt;^bitalic&gt;, and \\&lt;^eitalic&gt;,</p>\n<p>where \\&lt;^iitalic&gt; would be a command that could be used in an <br>\nidentitifer, like \\&lt;^isub&gt; and \\&lt;^isup&gt;.</p>\n<p>And I might as well request</p>\n<p>\\&lt;^ibold&gt;,</p>\n<p>for things like vectors and special sets.</p>\n<p>I'm sure Makarius has already thought of all this, and either doesn't <br>\nhave time to do it, or has already decided he doesn't want to do it, <br>\nmaybe because it can't be practically done.</p>\n<p>Regards,<br>\nGB</p>",
        "id": 294223621,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660898799
    },
    {
        "content": "<p>From: Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt;<br>\nImplementing, maintaining, discontinuing features is all very time <br>\nconsuming -- with increasing efforts on this scale.  The \\&lt;^sub&gt; \\&lt;^isub&gt; <br>\n\\&lt;^bsub&gt; \\&lt;^esub&gt; varieties emerged in historic sitations.  Even now it <br>\nshould be possible to get there with \\&lt;^sub&gt; alone in most applications, <br>\nbut it needs work to untangle all that.</p>\n<p>In formal text italic style does not make much sense, because the formal <br>\ntext is implicitly \"italic\" already.  You see this when printing in LaTeX <br>\nin the \"best style\" \\isabellestyle{it} that imiates Don Knuth as best as <br>\npossible.  If you need \"non-italic\" special styles, you can define your <br>\nown symbols like \\&lt;sin&gt; \\&lt;cos&gt; \\&lt;tan&gt; and render them in LaTeX as usual.</p>\n<p>In informal text, one could think of bold and italic in the sense of <br>\nMarkdown.  What is a good notation for that?  It needs to co-exist with <br>\nregular latex macros.</p>\n<p>Makarius</p>",
        "id": 294223887,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660898946
    },
    {
        "content": "<p>From: Gottfried Barrow &lt;<a href=\"mailto:gottfried.barrow@gmx.com\">gottfried.barrow@gmx.com</a>&gt;<br>\nOn 9/12/2012 1:43 PM, Makarius wrote:</p>\n<p>From the other email of yours:</p>\n<blockquote>\n<p>Just last week I was preparing some slides in Isabelle, and found the <br>\ntraditional latex batch-run quite cumbersome, so the obvious thing is <br>\nto renovate the HTML presentation instead and make it render on the <br>\nspot in real-time in Isabelle/jEdit (lets say in some Preview panel).<br>\n From this email:<br>\nIn formal text italic style does not make much sense, because the <br>\nformal text is implicitly \"italic\" already.  You see this when <br>\nprinting in LaTeX in the \"best style\" \\isabellestyle{it} that imiates <br>\nDon Knuth as best as possible.  If you need \"non-italic\" special <br>\nstyles, you can define your own symbols like \\&lt;sin&gt; \\&lt;cos&gt; \\&lt;tan&gt; and <br>\nrender them in LaTeX as usual.<br>\nIn informal text, one could think of bold and italic in the sense of <br>\nMarkdown.  What is a good notation for that?  It needs to co-exist <br>\nwith regular latex macros.</p>\n</blockquote>\n<p>Markarius, I'm not using your tool the same way you use it.</p>\n<p>To summarize, what I'm trying to get even more is a \"logical Mathematica <br>\nthing\". Ultimately, I don't have to have \\&lt;iitalic&gt; and \\&lt;ibold&gt;, my use <br>\nof jEdit as a \"Mathematica thing\" is already happening.</p>\n<p>I quoted from the last email because that applies, although not the <br>\n\"preview\", though that sounds like a good thing. I want to write like <br>\nI'm writing in a word processor, and that's what I'm already doing.</p>\n<p>My marked up THY file is what I'll call a pre-LaTeX version. LaTeX is <br>\ncompile, compile, compile, and compile after every few changes to <br>\nprevent having to track down errors. Plus, I'll spend an hour trying to <br>\nmake an equation look perfect, when all I'm doing is making notes about <br>\na textbook. That's a waste when I may delete much of what I do.</p>\n<p>There will be what I publish for public consumption, which will be a <br>\nLaTeX product, but my preliminary markup of a THY file is for me. I need <br>\nto not get lost in the details, which is a combination of markup using <br>\nbullets and other symbols, using section headings with bold titles, and <br>\nSidekick trees.</p>\n<p>So \\&lt;^iitalic&gt; is not a duplication of effort when a person is primarily <br>\nreading a theory with jEdit, rather than a PDF. Would I want to <br>\nitalicize every variable in a formula? I might. I can already subscript <br>\nand superscript every variable, and put things like \"\\&lt;^isub&gt;_\" in them.</p>\n<p>I can get LaTeX without your LaTeX tools, but I can only get in jEdit <br>\nwhat you provide in jEdit. But what you've given is very generous.</p>\n<p>Regards,<br>\nGB</p>",
        "id": 294223949,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660898994
    },
    {
        "content": "<p>From: Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt;<br>\nI think it is better to move in a presentational direction: you write the <br>\nformal text without special markup for italics, but the implicit markup as <br>\nlogical identifiers that the prover provides is turned into italics <br>\non-screen.  So it would be just a continuation of the blue, green, brown <br>\nvariable game with font-styles.</p>\n<p>I did not do this so far, because jEdit cannot change the font-style once <br>\nit has been assigned statically by its token marker.  It will require <br>\nanother round of convincing it to do it nonetheless -- like I already did <br>\nwith the text rendering as you see it in Isabelle2012.</p>\n<p>Makarius</p>",
        "id": 294223957,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660899001
    },
    {
        "content": "<p>From: Gottfried Barrow &lt;<a href=\"mailto:gottfried.barrow@gmx.com\">gottfried.barrow@gmx.com</a>&gt;<br>\nOn 9/12/2012 3:30 PM, Makarius wrote:</p>\n<blockquote>\n<p>I think it is better to move in a presentational direction: you write <br>\nthe formal text without special markup for italics, but the implicit <br>\nmarkup as logical identifiers that the prover provides is turned into <br>\nitalics on-screen.  So it would be just a continuation of the blue, <br>\ngreen, brown variable game with font-styles.</p>\n</blockquote>\n<p>It did occur to me that when \"every character\" is italicized, I really <br>\ndon't want to be putting an \\&lt;italic&gt; in front of \"every character\". <br>\nTrying to back out of that could end up being a nightmare, or really <br>\naggravate someone else wanting to use my stuff.</p>\n<p>It sounds like plans for even more of a Mathematica thing.</p>\n<blockquote>\n<p>I did not do this so far, because jEdit cannot change the font-style <br>\nonce it has been assigned statically by its token marker.  It will <br>\nrequire another round of convincing it to do it nonetheless -- like I <br>\nalready did with the text rendering as you see it in Isabelle2012.</p>\n</blockquote>\n<p>Actually, with Mathematica, their document model is way more complex <br>\nthan what I need, or have time to learn.</p>\n<p>A combination of basic text editing, with an 80 character column, a few <br>\nextra symbols, some consistent formatting using your comment command <br>\n<code>--\"........\"</code>, and section headings, are good enough to make things <br>\nreadable. The math formulas are pretty much readable by default.</p>\n<p>With Isabelle2011, I was using LaTeX to produce a readable document. <br>\nRecently, I broke my LaTeX build script, and before I got it fixed, I <br>\nsaid, \"Forget LaTeX right now. I have 500 pages of theorems I have to <br>\nimplement, and if I can't make it all work, then it's worthless to make <br>\nsomething look good that's worthless.\"</p>\n<p>I attach a screen shot. How would it print out with LaTeX? It would look <br>\nterrible, I'm sure, but that's not the purpose. If I want to print it, I <br>\ncan print it out with a regular printer driver. But I read everything in <br>\nelectronic form, so I always need a tree view, and Sidekick gives me <br>\nthat in jEdit.</p>\n<p>Regards,<br>\nGB<br>\n<a href=\"/user_uploads/14278/kQbF33_Y0cgqxPbglez2iZpc/jEdit_mathematica_thing.png\">jEdit_mathematica_thing.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/14278/kQbF33_Y0cgqxPbglez2iZpc/jEdit_mathematica_thing.png\" title=\"jEdit_mathematica_thing.png\"><img src=\"/user_uploads/14278/kQbF33_Y0cgqxPbglez2iZpc/jEdit_mathematica_thing.png\"></a></div>",
        "id": 294224104,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660899064
    }
]