[
    {
        "content": "<p>From: Philipp Ruemmer &lt;<a href=\"mailto:philipp.ruemmer@it.uu.se\">philipp.ruemmer@it.uu.se</a>&gt;<br>\n======================================================================<br>\n--                  PhD Position on SMT Reasoning                   --<br>\n--                   Uppsala University, Sweden                     --<br>\n======================================================================</p>\n<p>Applications are invited for a PhD student position in Computer<br>\nScience at Uppsala University, Sweden. The position is partly funded<br>\nthrough a Microsoft Research PhD scholarship, and includes benefits<br>\nsuch as a PhD summer school organised by Microsoft Research Cambridge.<br>\nResearch will be carried out in the context of a collaboration between<br>\nUppsala University and Microsoft Research Cambridge.</p>\n<p><a href=\"http://www.uu.se/jobb/phd-students/annonsvisning?tarContentId=248331\">http://www.uu.se/jobb/phd-students/annonsvisning?tarContentId=248331</a></p>\n<p>Information about the position can be given by<br>\n   Philipp Rümmer &lt;<a href=\"mailto:philipp.ruemmer@it.uu.se\">philipp.ruemmer@it.uu.se</a>&gt;<br>\n   Christoph Wintersteiger &lt;<a href=\"mailto:cwinter@microsoft.com\">cwinter@microsoft.com</a>&gt;</p>\n<p>Application deadline is 15 August, 2013.</p>\n<p>Subject Area</p>\n<hr>\n<p>SMT solvers are constraint solvers that combine highly efficient<br>\nreasoning about Boolean logic with decision procedures for domains<br>\nlike linear arithmetic, bit-vectors, or arrays. SMT solvers form the<br>\nbackbone of many of today's verification systems, responsible for<br>\ndischarging verification conditions that encode correctness properties<br>\nof hardware or software designs. Other application areas of SMT<br>\nsolvers include mechanised mathematical reasoning, operations<br>\nresearch, compilation techniques, or malware detection.</p>\n<p>Quantifier treatment in SMT is usually implemented by means of<br>\ninstantiation heuristics. For verification and other applications,<br>\nefficient handling of quantifiers has been identified as one of the<br>\nmain challenges in the development of solvers. The topic of this PhD<br>\nresearch is the extension of the SMT paradigm to the first-order<br>\nlevel, by including quantifiers as first-class citizens in<br>\nsolvers. This will be done by combining central SMT concepts, in<br>\nparticular the architecturing of SMT solvers as the combination of<br>\nlittle, domain-specific engines, with techniques developed in the<br>\ncontext of first-order logic, in particular delayed quantifier<br>\ninstantiation by means of free variables and unification. The research<br>\nwill partly build on tools previously developed in the Uppsala<br>\nUniversity and Microsoft Research, including the theorem provers Z3<br>\nand Princess.</p>\n<p>Research Environment</p>\n<hr>\n<p>The Department of Information Technology at Uppsala University has a<br>\nleading position in research as well as teaching at all levels. The<br>\nDepartment has about 200 employees, including 80 senior faculty and 80<br>\nPhD students. More than 3000 students are enrolled in one or more<br>\ncourses annually.</p>\n<p>Founded in 1991, Microsoft Research has become one of the largest,<br>\nfastest-growing, most respected software research organizations in the<br>\nworld. The Microsoft Research Cambridge branch was set up in July<br>\n1997, and today hosts over 100 researchers, mostly from Europe.</p>\n<p>Qualifications Required</p>\n<hr>\n<p>The candidates should have a Master of Science in Computer Science,<br>\nComputer Engineering, or equivalent. Experience in mathematical logic,<br>\nautomated reasoning, and formal methods are desirable, as are good<br>\nimplementation skills.</p>\n<p>The positions are for a maximum of five years and include departmental<br>\nduties at a level of at most 20% (typically teaching) as well as<br>\ncourse studies. You will be expected to teach in Swedish or<br>\nEnglish. Excellent skills in spoken and written English are an<br>\nabsolute requirement.</p>\n<p>The department is striving to achieve a more equal gender balance and<br>\nfemale candidates are particularly invited to apply.<br>\n<a href=\"/user_uploads/14278/W1iYUpjIpRSX2oEXIH2sS7yy/signature.asc\">signature.asc</a></p>",
        "id": 294245131,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660908602
    }
]