[
    {
        "content": "<p>From: Richard Molitor via Cl-isabelle-users &lt;<a href=\"mailto:cl-isabelle-users@lists.cam.ac.uk\">cl-isabelle-users@lists.cam.ac.uk</a>&gt;<br>\nOn Fri, 12 Feb 2016, Makarius wrote:</p>\n<blockquote>\n<p>On Fri, 12 Feb 2016, Richard Molitor via Cl-isabelle-users wrote:</p>\n<blockquote>\n<p>I originally intended to get it into the AFP, but then never pushed it<br>\n when I got busy with applying for jobs and other things. The code is on<br>\n github though (<a href=\"https://github.com/gattschardo/open-inductive\">https://github.com/gattschardo/open-inductive</a>) and I made<br>\n it work with Isabelle2015 (and this week Isabelle2016-RC4).</p>\n</blockquote>\n<p>I've already commented on an earlier version of this material, and you seem <br>\nto have improved it further. It generally looks good -- above the average of <br>\nvarious ML experiments that are already in AFP.</p>\n</blockquote>\n<p>Your comments have been very helpful! The main thing I wanted to finish<br>\nbefore submitting it to the \"lawnmower phase\" was to finish the move to<br>\nuse morphisms in all relevant places (which is only half-finished, if I<br>\nrecall correctly).</p>\n<p>Hopefully I will just sit down on a rainy weekend one day and do that,<br>\nonce that is done you'll hear back from me :)</p>\n<blockquote>\n<p>Some years ago, the AFP editors did not want to see actual ML tools there, <br>\nbut de-facto we have that already.</p>\n</blockquote>\n<p>That's what I've heard from the colleagues in Karlsruhe as well, so this<br>\nwas not a concern.</p>\n<blockquote>\n<p>I cannot say anything about the application, i.e. the problem that is <br>\naddressed here from a user perspective.</p>\n</blockquote>\n<p>At least in Karlsruhe there seemed to be some use-cases for it, although<br>\nsome additional hand-holding (i.e. automation) in my code would make it<br>\nconsiderably more user-friendly. That was labelled \"future work\" though,<br>\nmaybe for when another bachelor/master student is looking for thesis<br>\nmaterial -- or when I become very bored for a longer period of time.</p>\n<p>Richard</p>",
        "id": 294666415,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661171912
    }
]