[
    {
        "content": "<p>From: Jasmin Blanchette &lt;<a href=\"mailto:jasmin.blanchette@inria.fr\">jasmin.blanchette@inria.fr</a>&gt;<br>\nCall for Bids to Host ITP 2017<br>\n<a href=\"https://itp2016.inria.fr/\">https://itp2016.inria.fr/</a></p>\n<p>We call for bids to host ITP 2017, the 8th International Conference on Interactive Theorem Proving.</p>\n<p>As in previous years, the procedure consists of two phases: solicitation of bids and voting. This message concerns the first phase. A long-standing ITP/TPHOLs convention is that the conference should be held on a continent different from the location of the previous meeting. For 2017, we therefore solicit bids from prospective hosts located outside Europe. Similar to previous years, we expect bids to propose a date in July, August or September.</p>\n<p>Bids should be sent to itp2016 at <a href=\"http://inria.fr\">inria.fr</a> and should include at least the following information:</p>\n<p>• name and email address of a contact person<br>\n    • names of other people involved<br>\n    • address of website for the bid<br>\n    • approximate dates of the conference<br>\n    • structure (e.g., k workshop days and n days of presentations, excursion, etc.)<br>\n    • advantages of the proposed venue</p>\n<p>Example of previous winning bids follow:</p>\n<p>• <a href=\"http://itp2011.cs.ru.nl/ITP2011/Bid_ITP11.html\">http://itp2011.cs.ru.nl/ITP2011/Bid_ITP11.html</a><br>\n    • <a href=\"http://www.cs.princeton.edu/~appel/itp2012/bid.html\">http://www.cs.princeton.edu/~appel/itp2012/bid.html</a><br>\n    • <a href=\"http://www.irisa.fr/celtique/blazy/bid-itp13.html\">http://www.irisa.fr/celtique/blazy/bid-itp13.html</a></p>\n<p>The deadline for bids is Monday, 18 April 2016. Shortly after, all admitted bids will be made public and the voting phase will take place. The people eligible to vote are those who are seriously considering attending ITP 2017. The voting system used will be single transferable vote between all received bids.</p>",
        "id": 294669621,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661173005
    }
]