[
    {
        "content": "<p>From: Gottfried Barrow &lt;<a href=\"mailto:igbi@gmx.com\">igbi@gmx.com</a>&gt;<br>\nGreetings,</p>\n<p>As a formality, I state that I prefer no feedback, not that anyone wants <br>\nto give it, but if given feedback, I'll not respond to it, a suboptimal <br>\nformality, but necessary. That others might discuss what I report, I <br>\ndon't concern myself with that.</p>\n<p>This email is to show an example of what I had mentioned, that I can <br>\nscroll to the bottom of my THY and no errors show up in the <br>\nright-vertical-status-bar, but there are errors in my THY.</p>\n<p>Before I was doing periodic session runs, this was a huge source of <br>\nconsternation. Now that I'm doing sessions runs, it's not a problem at <br>\nall, it's a part of finding problems with the normal workflow.</p>\n<p>I wouldn't report this, but I don't recall seeing a report about this.</p>\n<p>(1) Below, I describe the circumstances surrounding the error, and to <br>\nsupport that, I attach a screenshot.</p>\n<p>(2) As a tangent to my talk about defining outer syntax commands, I <br>\nstate some opinions about the configurability of Isar, as a front-end <br>\nlanguage to a powerful logic engine, and front-end to powerful proof <br>\ntools, namely Sledgehammer, Nitpick, and the slew of proof methods, <br>\nalong with the absolute essential ability to perform single proof steps <br>\nwith natural deduction. But back to the configurability of Isar as a <br>\nlanguage,</p>\n<p>a) that the configurabilityis a great feature of Isabelle/HOL as a <br>\nsoftware product,</p>\n<p>b) another feature being the configurability of inner syntax, part of <br>\nthat being a good selection of graphical symbols,</p>\n<p>c) and another feature being a PIDE that allows these features to be <br>\nwhat they are, where from my observations, these front-end features are <br>\nnear exclusively because of one person, M.Wenzel, with whom I have no <br>\naffiliation, formally or informally, and did I forget to mention the <br>\nproof language as a front-end feature?</p>\n<p>d) There is also the Isar proof language as a front-end feature.</p>\n<p>e) Quoting myself from the past, everyone either gets too little <br>\ncredit, or way too much. You work to blow your horn, and I'll work to <br>\nblow mine.</p>\n<p>(3) As part of (2), I say that I hope the configurability of <br>\nIsar/Isabelle/HOL doesn't get locked down just to try and control the <br>\nlanguage. Fragmentation of language is only bad if the fragmentation <br>\ndestroys good unity or prevents eventual good unity. Locking something <br>\ndown can prevent innovation, and prevent people experimenting to find <br>\nthe best way to use a language.</p>\n<p><em>DESCRIPTION OF THE PROBLEM</em></p>\n<p>What I did was eliminate a custom outer syntax synonym for 'term'. This <br>\nresulted in some errors that I was notified about, and I changed those <br>\nuses of the eliminated synonym. I then scrolled to the bottom of the <br>\ntheory, at which time I ran the session command with the very useful <br>\n'I.prog'. When I did that, the console notified me of errors.</p>\n<p>In the image, it can be seen that the upper part of the <br>\nright-vertical-status-bar is light purple. I suppose the light-purple <br>\nmeans that area wasn't rechecked.</p>\n<p>As to PIDE options, the only change I remember, concerning this, is <br>\n\"Editor Reparse Limit 20000\", where originally it is '10000'. It seems a <br>\nbigger number there would make it better, but it may not matter. Before, <br>\nI had it at '100000', and I got these errors, which is why I made an <br>\neffort to implement session runs.</p>\n<p>It's not a problem. I report it to alert anyone who would care, and so <br>\nthat M.Wenzel knows, though there's a good chance he already knows about <br>\nsomething like this.</p>\n<p><em>ISAR AS A MATHEMATICAL LANGUAGE</em></p>\n<p>To say much more is to belabor the point of (3) above.</p>\n<p>I define any outer syntax I want, to get synonyms for the normal syntax. <br>\nEven so, it takes a lot of experimenting to find syntax that actually <br>\nadds some value. Part of what I'm trying to achieve is to get a look <br>\nsimilar to mathematical papers published with LaTeX. A big part of that <br>\nlook is the newtheorem environment.</p>\n<p>It occurred to me that when I engage in shameless advertising, M.Wenzel <br>\nmay not like my configuring the syntax of Isar, and decide to lock the <br>\nsyntax down.</p>\n<p>Ultimately, I assume everyone makes the best possible choices for their <br>\nneeds, whether personal or corporate, and so I look for independent <br>\nsolutions, rather than beg for features. It happens to be, I've <br>\ndiscovered that Isabelle has a lot ability to implement solutions with <br>\nML, and did I forget to mention 'Isabelle_System.bash_output', also <br>\nprovided by M.Wenzel?</p>\n<p>Fragmentation of technology can be bad, but it can also be good.</p>\n<p>I speak now as the EZProphet. Here's what will happen with the language <br>\nand logic of Isabelle/HOL and Isabelle/Isar:</p>\n<p>1) The language/syntax will fragment, because when you give people new <br>\ntools, they get original and new ideas, some good, but most being bad or <br>\nnothing better.</p>\n<p>2) After some period of time, there will be consolidation around the <br>\nbest use of the language/syntax.</p>\n<p>3) After that, I don't know. After all, I'm just the EZProphet.</p>\n<p>Regards,<br>\nGB<br>\n<a href=\"/user_uploads/14278/MVqCGHh_7Q_aWI4vnWNNFWWj/151110_session_error_no_PIDE_error.png\">151110_session_error_no_PIDE_error.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/14278/MVqCGHh_7Q_aWI4vnWNNFWWj/151110_session_error_no_PIDE_error.png\" title=\"151110_session_error_no_PIDE_error.png\"><img src=\"/user_uploads/14278/MVqCGHh_7Q_aWI4vnWNNFWWj/151110_session_error_no_PIDE_error.png\"></a></div>",
        "id": 294658613,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661169077
    }
]