[
    {
        "content": "<p>From: Dominique Unruh &lt;<a href=\"mailto:unruh@ut.ee\">unruh@ut.ee</a>&gt;<br>\nHi,</p>\n<p>when Isabelle generates proofterms, those contain the all steps <br>\nnecessary for replaying the proof, except when class instantiations <br>\n(OFCLASS(...)) are involved. In this case, a proofterm contains the <br>\nconstructor OfClass(T,c) (OfClass of typ * class) to represent the proof <br>\nof the theorem OFCLASS(T,c). This is justified because the OFCLASS(T,c) <br>\ntheorem was proven using an instance proof. However, I could not find <br>\nout where I can access the proofterm of instance proof. How can one <br>\nretrieve that proofterm (within Isabelle/ML) so that a complete replay <br>\nof a proofterm is possible?</p>\n<p>Best wishes,<br>\nDominique.</p>",
        "id": 294761277,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661199702
    },
    {
        "content": "<p>From: Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt;<br>\nThe original proofterm implementation from around 2000 by Stefan<br>\nBerghofer did not support type class proofs at all: the applications did<br>\nnot require it.</p>\n<p>In March 2010, I've revisited that together with Stefan, but we did not<br>\nget it fully through: some rudiments of it are still in Isabelle2019,<br>\nbut it requires more work to finish.</p>\n<p>Included is a minimal example. If you open it in Isabelle/jEdit together<br>\nwith $ISABELLE_HOME/src/Pure/ROOT.ML you can follow the definitions in<br>\nIsabelle/ML.</p>\n<p>Incidently, I am presently in the process to revisit all that. So there<br>\nis some chance that Isabelle2020 will be more complete in that respect.<br>\n(Right now I am facing certain performance problems that are to be<br>\nexpected whenever the old proofterm can is opened again.)</p>\n<p>Makarius<br>\n<a href=\"/user_uploads/14278/6wNVTAqM7AtNGLvaMe8hzpSx/Scratch.thy\">Scratch.thy</a></p>",
        "id": 294761306,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661199717
    }
]