[
    {
        "content": "<p>From: Nicole Rauch &lt;<a href=\"mailto:rauch@informatik.uni-kl.de\">rauch@informatik.uni-kl.de</a>&gt;<br>\nDear all,</p>\n<p>today I ran into a problem of how to add a search path and to import a  <br>\ntheory that is to be found in the search path.</p>\n<p>In order to make a search path available, I define a theory:</p>\n<p>theory Test1<br>\nimports Main<br>\nbegin</p>\n<p>ML {*<br>\nadd_path \"$ISABELLE_HOME/src/HOL/Word\";<br>\n*}</p>\n<p>end</p>\n<p>I then import that theory and simultaneously the theory that I  <br>\nactually want to import:</p>\n<p>theory Test2<br>\nimports Test1 Num_Lemmas<br>\nbegin</p>\n<p>end</p>\n<p>If I first load Test1 in Proof General and evaluate it, and afterwards  <br>\nload Test2 in Proof General and evaluate it, everything works fine.<br>\nBut if I start off with Test2, I get an error message that Num_Lemmas  <br>\ncannot be found because Isabelle (being strict) obviously first tries  <br>\nto locate all imports before evaluating them.</p>\n<p>I've also tried to add the ML command to the very top of Test2 (before  <br>\nthe theory definition), and this works fine for Test2, but then I get  <br>\nan error message when I try to import Test2 into some other theory  <br>\n(the import mechanism expects the imported theories to start with  <br>\n\"theory\").</p>\n<p>Is there any solution to this conflict? How can I make Isabelle first  <br>\nload the first imported theory before loading the second one?</p>\n<p>Thanks in advance for any help</p>\n<p>Nicole</p>",
        "id": 294058037,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660822414
    },
    {
        "content": "<p>From: Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt;<br>\nThis is correct.  The load path cannot be changed during loading.  <br>\nLuckily there is no need to change it at all, just specify the import as <br>\nfollows:</p>\n<p>theory Test<br>\n  imports Main \"~~/src/HOL/Word/Num_Lemmas\"<br>\n  begin</p>\n<p>...</p>\n<p>Makarius</p>",
        "id": 294058062,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660822420
    }
]