[
    {
        "content": "<p>From: \"julien@RadboudUniversity\" &lt;<a href=\"mailto:julien@cs.ru.nl\">julien@cs.ru.nl</a>&gt;<br>\n[ We apologize if you received multiple copies of this message. ]</p>\n<p>PhD Position on Formal Verification of Deadlock Avoidance Mechanisms  <br>\nin NoCs</p>\n<p>The Informatics for Technical Applications group at the Radboud  <br>\nUniversity Nijmegen invites applications for a PhD position in the  <br>\ncontext of the NWO project \"Formal Verification of Deadlock Avoidance  <br>\nMechanisms\" (see <a href=\"http://www.cs.ru.nl/~julien/Julien%20at%20Nijmegen/\">http://www.cs.ru.nl/~julien/Julien%20at%20Nijmegen/</a> <br>\nFVDAM.html).</p>\n<p>The Radboud University Nijmegen is one of the leading academic  <br>\ncommunities in the Netherlands. Renowned for its green campus, modern  <br>\nbuildings, and state-of-the-art equipment, it has nine faculties and  <br>\nenrolls over 17.500 students in approximately 90 study programs. The  <br>\nuniversity is situated in the oldest Dutch city, close to the German  <br>\nborder, on the banks of the river Waal (a branch of the Rhine). The  <br>\ncity has a rich history and one of the liveliest city centers in the  <br>\nNetherlands.</p>\n<p>The Informatics for Technical Applications (ITA) group is part of the  <br>\nInstitute for Computing and Information Sciences (ICIS). The group  <br>\ndevelops formal methods and tools for the specification, design,  <br>\nanalysis and testing of embedded systems, distributed algorithms and  <br>\nprotocols, and assesses and demonstrates the effectiveness of these  <br>\nmethods and tools in the industrial development process. ITA has an  <br>\nexcellent international reputation and its research program was  <br>\nsingled out as \"Excellent\" in the last national research assessment.</p>\n<p>Project Description</p>\n<p>Network-on-chip is an emerging paradigm that could meet future  <br>\napplications demand. The correctness of a system-on-chip will largely  <br>\ndepend on the correctness of the NoC. There has been little work on  <br>\nthe application of formal verification techniques to NoCs. This is a  <br>\nchallenging area, in particular, due to fact that the verification  <br>\nneeds to be done on parameterized networks.</p>\n<p>The goal of this project is to develop formal verification methods  <br>\nfor parameterized networks on a chip (NoCs). We aim at a general  <br>\nmodel and verification methodology that encompasses the essential  <br>\nconstituents of NoCs communication architectures -- that is,  <br>\nprotocols and topologies, routing algorithms, and scheduling policies  <br>\n-- and applies to a wide variety of systems. The project will tackle  <br>\nthe specification of properties about the absence of deadlock,  <br>\nlivelock, and will allow to quantify the routing performance of an  <br>\nNoC. In particular, the project will focus on deadlock avoidance  <br>\nmechanisms. Deadlocks may be generated at the protocol or at the  <br>\nstructural (for example, routing algorithms) level. The challenge of  <br>\nthe project lies in supporting the analysis of these two kinds of  <br>\ndeadlocks for parameterized, or unbounded, models.</p>\n<p>To begin with, we want to analyze practical case studies, either  <br>\npublicly available or provided by industrial partners. Our  <br>\nmethodology will be based on the Generic Network model (GeNoC) and  <br>\nits implementation in the ACL2 logic. From this practical  <br>\nexperiments, we plan to generalize our approach to generate ranking  <br>\nfunction for parameterized systems. One interesting research  <br>\ndirection is to combine the general formalization in ACL2 with  <br>\npowerful tools dedicated to termination proof, like Terminator.</p>\n<p>Requirements</p>\n<p>The candidate must hold an MSc or equivalent with top performance in  <br>\na field that is closely related to computer science or mathematics.  <br>\nHe or she should have interest in conducting original scientific  <br>\nresearch, publishing the results in top conferences and scientific  <br>\njournals, and participating in teaching duties. Maturity, self- <br>\nmotivation and the ability to work both independently and as a team  <br>\nplayer in local and international research teams are expected. Dutch  <br>\nlanguage skills are not required, English is mandatory.</p>\n<p>Conditions of employment</p>\n<p>The positions involve a normal employment contract for a period of up  <br>\nto 4 years, and is expected to lead to a Ph.D. degree. The salary  <br>\ngrows to approx. 2500 euro gross per month in the fourth year. For  <br>\nadditional information please see our website (http:// <br>\n<a href=\"http://www.ita.cs.ru.nl/\">www.ita.cs.ru.nl/</a>) and/or contact Julien Schmaltz:</p>\n<p>Phone: +31 (0)24-3652104<br>\n    E-mail: julien - at - cs - dot - ru - dot - nl</p>\n<p>Applicants</p>\n<p>should submit their application to <a href=\"mailto:pz@science.ru.nl\">pz@science.ru.nl</a> or via surface  <br>\nmail to</p>\n<p>Radboud University Nijmegen<br>\nFaculty of Science<br>\nP&amp;O Department<br>\nAttn. Drs. D. Reinders<br>\nPO Box 9010<br>\n6500 GL Nijmegen<br>\nThe Netherlands</p>\n<p>referring to number 62.69.08.</p>\n<p>Applications should include a cover letter, a curriculum vitae, and  <br>\ncontact details of at least 2 references.<br>\nReview of completed applications will begin October 1st, 2008. The  <br>\nposition remains open until filled.</p>\n<hr>\n<p>Dr. Julien Schmaltz<br>\nModel Based System Development (MBSD)<br>\nInstitute For Computing and Information Sciences<br>\nRadboud University  Nijmegen<br>\nThe Netherlands<br>\n<a href=\"mailto:julien@cs.ru.nl\">julien@cs.ru.nl</a>   --- <a href=\"http://www.cs.ru.nl/~julien/\">www.cs.ru.nl/~julien/</a><br>\nPhone: +31 24 36 52104  ---  Fax:   +31 24 365 2728</p>\n<hr>",
        "id": 294064259,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660824856
    }
]