[
    {
        "content": "<p>From: Ken Kubota &lt;<a href=\"mailto:mail@kenkubota.de\">mail@kenkubota.de</a>&gt;<br>\nDear List Members,</p>\n<p>Through Mark Adams' paper \"HOL Zero's Solutions for Pollack-Inconsistency\" <br>\n(2016) linked at the HOL Zero homepage, I became aware of the notion of <br>\nPollack-consistency coined by Freek Wiedijk for the property of \"a system being <br>\nable to correctly parse formulas that it printed itself\":</p>\n<p>Freek Wiedijk: Pollack-inconsistency<br>\n<a href=\"http://doi.org/10.1016/j.entcs.2012.06.008\">http://doi.org/10.1016/j.entcs.2012.06.008</a><br>\n<a href=\"http://www.cs.kun.nl/~freek/pubs/rap.pdf\">http://www.cs.kun.nl/~freek/pubs/rap.pdf</a></p>\n<p>It is amusing to see how the parsing and printing functions of John's HOL Light <br>\nare put on the rack and stretched quite a bit.<br>\nAlso Isabelle and other systems are examined.</p>\n<p>The interesting point for me was to see that somebody had the same idea. In the <br>\nR0 implementation, not only a formula, but whole printed proofs can be parsed <br>\nagain. In fact, if it is compiled and started with \"make check\", R0 loops <br>\nthrough all proofs, and this is done twice, with the output of the first run as <br>\nthe input of the second, stopping immediately with an error message if a proof <br>\nfails or if the output of the two runs differ. This was implemented quite <br>\nearly, so the system was designed from the very beginning to comply with a <br>\nnotion of Pollack-consistency not only in terms of formulae, but in terms of <br>\nwhole proofs. Like for HOL Zero, this was done in order \"to achieve the highest <br>\nlevels of reliability and trustworthiness through careful design and <br>\nimplementation of its core components\" - quoted from:</p>\n<p>Mark Adams: HOL Zero's Solutions for Pollack-Inconsistency<br>\n<a href=\"http://doi.org/10.1007/978-3-319-43144-4_2\">http://doi.org/10.1007/978-3-319-43144-4_2</a><br>\n<a href=\"http://www.proof-technologies.com/holzero/hzsyntax_itp2016.pdf\">http://www.proof-technologies.com/holzero/hzsyntax_itp2016.pdf</a></p>\n<p>Concerning HOL4 and HOL Zero, I am looking for introductions to them in the <br>\nliterature. The appropriate candidates seem to be, at the first glance (without <br>\nhaving read them already):</p>\n<p>Mark Adams: Introducing HOL Zero (Extended Abstract)<br>\n<a href=\"http://doi.org/10.1007/978-3-642-15582-6_25\">http://doi.org/10.1007/978-3-642-15582-6_25</a></p>\n<p>Konrad Slind, Michael Norrish: A Brief Overview of HOL4<br>\n<a href=\"http://doi.org/10.1007/978-3-540-71067-7_6\">http://doi.org/10.1007/978-3-540-71067-7_6</a></p>\n<p>The latter I found as reference no. 14 of Mark's 2016 paper.</p>\n<p>Please let me know if you have other suggestions.</p>\n<p>Kind regards,</p>\n<p>Ken Kubota</p>\n<hr>\n<p>Ken Kubota<br>\n<a href=\"http://doi.org/10.4444/100\">http://doi.org/10.4444/100</a></p>",
        "id": 294706219,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661180708
    },
    {
        "content": "<p>From: Mark Adams &lt;<a href=\"mailto:mark@proof-technologies.com\">mark@proof-technologies.com</a>&gt;<br>\nUnfortunately, and embarrassingly, there is not yet a system description <br>\npaper for HOL Zero.  I plan to write one soon (but I think I said that a <br>\nfew years ago..).</p>\n<p>I should take a good look at R0 some time and could then comment on it, <br>\nbut good to hear that steps have been taken to address concerns about <br>\npretty printing.  Clearly the qualities enumerated in Freek's paper are <br>\nall desirable, but remember that there is also \"faithfulness\", which <br>\nisn't fully addressed by the concept of Pollack-consistency.  You could <br>\nprint something wrongly but also parse it back in correspondingly <br>\nwrongly (so, for example, print &amp; parse \"true\" as \"false\" and vice <br>\nversa).</p>\n<p>Mark.</p>",
        "id": 294706232,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661180714
    }
]