[
    {
        "content": "<p>From: \"Roggenbach M.\" &lt;<a href=\"mailto:m.roggenbach@swansea.ac.uk\">m.roggenbach@swansea.ac.uk</a>&gt;<br>\nDear friends,</p>\n<p>it is my pleasure to invite you to participate in our Virtual WADT on</p>\n<p>Wednesday, 29.4.2020<br>\n 9.30 - 16.00 BST</p>\n<p>to be held using the Zoom Software. Please share this invitation with your students and scientific friends: the more participants the better.</p>\n<p>For more details, please see our webpage <a href=\"https://wadt2020.github.io\">https://wadt2020.github.io</a></p>\n<p>As a physical meeting, the 25th International Workshop on Algebraic Development Techniques 2020 will be co-located with ETAPS 2020 in Dublin. As ETAPS 2020 has been postponed due the pandemic, WADT 2020 will additionally happen as a virtual workshop, where a subset of the accepted abstracts will be presented. WADT focuses on the algebraic approach to system specification, which  encompasses many aspects of the formal design of software systems.</p>\n<p>The programme of the Virtual Worskhop, 29.4.2020, via Zoom is as follows:</p>\n<p>#Session 1: (Chair: Alexander Knapp - for the 3rd talk: Andrea Corradini)</p>\n<p>• 9.30 Conor Reynolds and Rosemary Monahan: Formalizing Institutions in the Coq Proof Assistant<br>\n• 10.00 Ionut Tutu, José Luiz Fiadeiro and Claudia Chirita: Dynamic reconfigurations through hybrid lenses<br>\n• 10.30 Tobias Rosenberger, Saddek Bensalem, Alexander Knapp and Markus Roggenbach: Unbabel your tools - Leveraging SPASS for UML</p>\n<p>– break, with the possibility for some social conversations in the virtual conference room –</p>\n<p>#Session 2: (Chair: Marieke Huismann)</p>\n<p>• 11.30 Wytse Oortwijn: Verifying Distributed Systems by Abstracting Channel Interaction<br>\n• 12.00 Dominik Klumpp and Philip Lenzen: K and KIV - Towards Deductive Verification for Arbitrary Programming Languages</p>\n<p>– lunch break –</p>\n<p>#Session 3: (Chair: Markus Roggenbach)</p>\n<p>• 14.00 Manisha Jain, Alexandre Madeira and Manuel A. Martins: Quotients and reductions in a simple Fuzzy Modal Logic<br>\n• 14.30 Navid Roux and Florian Rabe: Functorial Diagram Operators<br>\n• 15.00 Jan Bergstra and John Tucker: The wheel of rational numbers as an abstract data type<br>\n• 15.30 Filippo Bonchi, Robin Piedeleu, Pawel Sobocinski and Fabio Zanasi: From Linear to Concurrent Algebra: a Diagrammatic Approach</p>\n<p>All times are given in British Summer Time (BST)</p>\n<p>Not all papers that have been accepted for presentation at the physical workshop will be presented at the virtual workshop.</p>\n<p>With kind regards,<br>\n  Markus Roggenbach</p>",
        "id": 294826304,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661244603
    }
]