[
    {
        "content": "<p>From: Lawrence Paulson &lt;<a href=\"mailto:lp15@cam.ac.uk\">lp15@cam.ac.uk</a>&gt;<br>\nThanks for your email.</p>\n<p>The main issue may be whether the inductive method is a good fit to what you are working on. The network model embodied in the inductive method is an insecure network lacking confidentiality and authentication and where all traffic is visible to the Spy, who can also send spoof messages using any material at his disposal. But if you send a message to a cell phone over the cellular network, the network provides some security guarantees, confidentiality for sure as well as authentication for the device itself, and arguably (through the pass code mechanism) of the user as well. It's not clear what an external attacker can do in this context.</p>\n<p>Larry Paulson</p>",
        "id": 294745926,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661193446
    },
    {
        "content": "<p>From: Felipe Rodopoulos &lt;<a href=\"mailto:rodopoulos@aluno.unb.br\">rodopoulos@aluno.unb.br</a>&gt;<br>\nSorry, I should be more clear on the communication method. The <br>\nsmartphones<br>\ndo not use the cellular network. The communication between users and <br>\ntheir<br>\nphones are made through physical means instead. Agents input data <br>\nthrough the<br>\nsmartphone camera, using QR Code and the confirmation action is the only <br>\none<br>\ndone through touch. Smartphones output data thought its screen, showing <br>\nit<br>\nto agents (who should input it to a personal computer).</p>\n<p>My strategy was pretty similar to what G. Bella does with smartcards, <br>\nbut the<br>\ndifference is that the means are always secure. The protocol which I am<br>\nanalyzing assumes that the Smartphones are always secure, but I am also<br>\nverifying the case where they are not. Thus, the Spy can compromise some<br>\nphones, obtaining their data and showing spoofed messages to the agents.</p>\n<p>With this approach, I could devise the corresponding events and build a<br>\nsuitable model for Smartphones, where proofs resemble the ones in the <br>\nSmartcard<br>\ntheory.</p>\n<p>The problem with the confirmation step is whether there is a message <br>\ntype or<br>\nvalue that would reliably express this immutable acknowledgement for the<br>\nmessage confirmation.</p>\n<p>I hope that the question is more clear now. Thanks in advance,</p>\n<p>-<br>\nFelipe Rodopoulos<br>\nGrad. student @ University of Brasília, Brazil</p>",
        "id": 294745989,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661193470
    },
    {
        "content": "<p>From: Lawrence Paulson &lt;<a href=\"mailto:lp15@cam.ac.uk\">lp15@cam.ac.uk</a>&gt;<br>\nIt sounds like you want to investigate the case in which some of the smartphones have been compromised by malware. Is there a reason to believe the protocol will still work? For if not, obviously, you can't hope to prove it, and if you are looking for an attack you don't need Isabelle for that.</p>\n<p>But the model still isn't clear to me. Are you trying to verify the protocol even in the case that the current user's phone has been compromised? But in that case it's not clear what the user's acknowledgement would signify.</p>\n<p>But in general: you can represent an event that is outside the Spy's control by using something like Notes, which the Spy has no access to in the model.</p>\n<p>Larry Paulson</p>",
        "id": 294746024,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661193482
    },
    {
        "content": "<p>From: Jean Martina &lt;<a href=\"mailto:jean.martina@cl.cam.ac.uk\">jean.martina@cl.cam.ac.uk</a>&gt;<br>\nI believe that what you want is to model this protocol as a security<br>\nceremony by having different communication media, that is actually under<br>\ndifferent threat models, with or without knowledge sharing between the<br>\nlayers.</p>\n<p>With that you will be able to model two different threat models for the<br>\nprotocol executing on the PC and the software running on the smart-phone.</p>\n<p>I worked with that in the past with Isabelle trying to come with a<br>\ngeneric modelling for human-device and human-human medium, so that you<br>\ncould specify things as you explained bellow. You would only have to<br>\nplace each one of the devices in a different layer. These will make the<br>\nattacks available for the phone separated from the PC for example.</p>\n<p>Giampaolo also did some work on that, that I believe has a much more<br>\ncomprehensive formalisation than mine. Instead on only having three<br>\nchannels, he came up with 5 different layers (he called security<br>\nceremony concertina) and he did some experiments with two factor<br>\nauthentication.</p>\n<p>Regards,</p>\n<p>Jean Martina<br>\n<a href=\"/user_uploads/14278/cXwL2flYbMwbx79MYzcCn3fs/signature.asc\">signature.asc</a></p>",
        "id": 294746079,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661193492
    }
]