[
    {
        "content": "<p>From: Christian Sternagel &lt;<a href=\"mailto:c.sternagel@gmail.com\">c.sternagel@gmail.com</a>&gt;<br>\nShort-term PhD Student or Postdoc Position in Innsbruck<br>\n=======================================================</p>\n<p>Please do not hesitate to forward this job advertisement to<br>\nsuitable candidates you might be aware of.</p>\n<p>We invite candidates for a PhD student or Postdoc researcher<br>\nposition to start as soon as possible in the ongoing<br>\n\"Certification Redux\" project of the CL group at the<br>\nUniversity of Innsbruck:</p>\n<p><a href=\"http://cl-informatik.uibk.ac.at/research/projects/certification-redux/\">http://cl-informatik.uibk.ac.at/research/projects/certification-redux/</a></p>\n<p>Since the project officially ends on January 31, 2018, any<br>\ninitial contract will also have to end on this date.  However,<br>\nit is highly likely that the project can be extended for at<br>\nleast another year after January 2018.</p>\n<p>PhD student positions like Postdoc positions are formal<br>\nemployment in Austria, with a regular salary and benefits.<br>\nApplications before June 30 will receive a full<br>\nconsideration.</p>\n<p>A background in proof assistants (preferably Isabelle/HOL) or<br>\nterm rewriting will be of advantage. Knowledge of German is<br>\nnot required, the group is international and the language of<br>\ncommunication is English.</p>\n<p>Candidates for the PhD position must hold a master's degree<br>\nin computer science or mathematics and candidates for the<br>\nPostdoc position hold a doctoral degree in computer science<br>\nor mathematics.</p>\n<p>The main task of a successful applicant will be to<br>\ncollaborate with other project members in order to formalize<br>\n(first-order) AC-unification (that is, unification in the<br>\npresence of associative and commutative function symbols) as<br>\npart of the \"Isabelle Formalization of Rewriting\"</p>\n<p><a href=\"http://cl-informatik.uibk.ac.at/isafor\">http://cl-informatik.uibk.ac.at/isafor</a></p>\n<p>and further extend this formalization to cover AC-critical<br>\npairs and normalized completion.</p>\n<p>Applications and informal inquiries are welcome, please<br>\ncontact Christian Sternagel (<a href=\"mailto:christian.sternagel@uibk.ac.at\">christian.sternagel@uibk.ac.at</a>).<br>\nApplications should include a CV as well as names and contact<br>\ndetails of two references.</p>\n<p>The city of Innsbruck, which hosted the Olympic Winter Games<br>\nin 1964, 1976 and 2012 (YOG), is superbly located in the<br>\nbeautiful surroundings of the Tyrolean Alps. The combination<br>\nof the Alpine environment and urban life in this historic<br>\ntown provides a high quality of living. The CL group is one<br>\nof the leading groups in the area of rewriting, formalization<br>\nand certification in the world.</p>",
        "id": 294711075,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661182217
    }
]