[
    {
        "content": "<p>From: Ekaterina Komendantskaya &lt;<a href=\"mailto:komendantskaya@gmail.com\">komendantskaya@gmail.com</a>&gt;<br>\n22nd International Symposium on Practical Aspects of Declarative Languages<br>\n(PADL 2020)https://popl20.sigplan.org/home/PADL-2020,20-21 January 2019,<br>\nNew Orleans, Louisiana, United StatesCo-located with ACM POPL 2020 (<br>\n<a href=\"https://popl20.sigplan.org/\">https://popl20.sigplan.org/</a>)</p>\n<hr>\n<p><em>Declarative programming languages</em> is an umbrella term for functional,<br>\nlogic, answer-set and constraint-solving programming paradigms, as well as<br>\na range of verification and theorem proving methods that rely on such<br>\nlanguages. These languages have been successfully applied to many different<br>\nreal-world situations, ranging from data base management and active<br>\nnetworks to software engineering and decision support systems.</p>\n<p>New developments in theory and implementation have opened up new<br>\napplication areas. At the same time, applications of declarative languages<br>\nto challenging problems raise new intriguing research questions, such as<br>\nscalable design and implementation, language extensions for application<br>\ndeployment, and programming environments. Thus, applications drive the<br>\nprogress in the theory and implementation of declarative systems, and<br>\nbenefit from this progress as well.</p>\n<p>PADL is a well-established forum for researchers and practitioners to<br>\npresent original work emphasising novel applications and implementation<br>\ntechniques for all forms of declarative programming, including functional<br>\nand logic programming, data-base and constraint programming, theorem<br>\nproving. Topics of interest include, but are not limited to:</p>\n<p>- Innovative applications of declarative languages<br>\n   - Declarative domain-specific languages and applications<br>\n   - Practical applications of theoretical results<br>\n   - New language developments and their impact on applications<br>\n   - Declarative languages for software engineering<br>\n   - Evaluation of implementation techniques on practical applications<br>\n   - Practical experiences and industrial applications<br>\n   - Novel uses of declarative languages in the classroom<br>\n   - Practical languages and extensions such as probabilistic and reactive<br>\n   languages</p>\n<p>*PADL 2020 especially welcomes new ideas and approaches pertaining to<br>\napplications, design and implementation of declarative languages going<br>\nbeyond the scope of the past PADL symposia, for example database languages<br>\nand contract languages.*<br>\nImportant Dates and Submission Guidelines:</p>\n<p>- Abstracts due: 11 October 2019<br>\n   - Papers due: 18 October 2019<br>\n   - Notification to authors: 18 November 2019<br>\n   - Camera-ready: 29 November 2020</p>\n<p>Authors should submit an electronic copy of the full paper in PDF using the<br>\nSpringer LNCS format. The submission will be done through EasyChair<br>\nconference system: <a href=\"https://easychair.org/conferences/?conf=padl2020\">https://easychair.org/conferences/?conf=padl2020</a></p>\n<p>All submissions must be original work written in English. Submissions must<br>\nbe unpublished and not submitted for publication elsewhere. Work that<br>\nalready appeared in unpublished or informally published workshops<br>\nproceedings may be submitted but the authors should notify the program<br>\nchair about the place on which it has previously appeared.</p>\n<p>PADL 2020 will accept both technical and application papers:</p>\n<p><em>Technical papers</em> must describe original, previously unpublished research<br>\nresults. Technical papers must not exceed 15 pages (plus one page of<br>\nreferences) in Springer LNCS format.</p>\n<p><em>Application papers</em> are a mechanism to present important practical<br>\napplications of declarative languages that occur in industry or in areas of<br>\nresearch other than Computer Science. Application papers are expected to<br>\ndescribe complex and/or real-world applications that rely on an innovative<br>\nuse of declarative languages. Application descriptions, engineering<br>\nsolutions and real-world experiences (both positive and negative) are<br>\nsolicited. The limit for application papers is 8 pages in Springer LNCS<br>\nformat but such papers can also point to sites with supplemental<br>\ninformation about the application or the system that they describe.</p>\n<p>*The proceedings of PADL 2020 will appear in the LNCS series of Springer<br>\nVerlag: <a href=\"https://www.springer.com/gp/computer-science/lncs\">https://www.springer.com/gp/computer-science/lncs</a><br>\n&lt;<a href=\"https://www.springer.com/gp/computer-science/lncs&gt;.*\">https://www.springer.com/gp/computer-science/lncs&gt;.*</a></p>\n<hr>\n<p>For further questions, please contact the conference chairs:<br>\nEkaterina Komendantskaya &lt;<a href=\"mailto:ek19@hw.ac.uk\">ek19@hw.ac.uk</a>&gt;<br>\nand<br>\nAnnie Liu &lt;<a href=\"mailto:liu@cs.stonybrook.edu\">liu@cs.stonybrook.edu</a> &gt;</p>",
        "id": 294761514,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661199830
    }
]