[
    {
        "content": "<p>From: \"W. Douglas Maurer\" &lt;<a href=\"mailto:maurer@gwu.edu\">maurer@gwu.edu</a>&gt;<br>\nIn section 2.6 (\"Raw proof blocks\") of \"A Tutorial Introduction to <br>\nStructured Isar Proofs,\" there appears the following sentence at the <br>\ntop of page 13: \"Note that the conclusion of a raw proof block is <br>\nstated with 'have' rather than 'show' because it is not the <br>\nconclusion of some pending goal but some independent claim.\" Yet in <br>\ntheory Fields, in the section (14.1) on division rings, there is a <br>\nproof of the right-inverse-eq lemma that contains a raw proof block <br>\n(at least I assume it is a raw proof block -- it is contained in <br>\ncurly brackets) that ends in 'show.' Is this just a bug, or is it a <br>\nversion of raw proof blocks that isn't described in the Tutorial <br>\nIntroduction?</p>",
        "id": 294317907,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660926011
    },
    {
        "content": "<p>From: Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt;<br>\nWhenever the meaningless word \"bug\" comes up, there is a high chance that <br>\nit is a misunderstanding of the user.</p>\n<p>A tutorial is not necessarily complete and exhaustive, in contrast to a <br>\nreference manual.  Isabelle has lots of manuals with different approaches <br>\nto explain things.  Ultimately the authoritative source for Isar is the <br>\nisar-ref manual (and of course the implementation).  So if the system <br>\naccepts some proof text, it is probably right.</p>\n<p>According to the inner workings of Isar, it is of course possible to use <br>\nraw proof blocks { } together with fix-assume-show of regular proof <br>\nbodies.  It is not used very often, but it definitely has its uses.  It <br>\nallows to manage local contexts with further depth, instead of the <br>\nimmediate default context of the original goal statement.</p>\n<p>You can also use the block separator 'next' within { } even though some <br>\nexplanations sometimes tell a different story.</p>\n<p>Makarius</p>\n<hr>\n<p><a href=\"http://stop-ttip.org\">http://stop-ttip.org</a></p>\n<hr>",
        "id": 294317919,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660926018
    },
    {
        "content": "<p>From: Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt;<br>\nIt is a reference manual, which means you don't read it from start to end <br>\nin one go, but look occasionally if there are relevant bits and pieces. <br>\nTaking all that information together, some mental picture of what Isar <br>\nactually is should emerge.  You should skim through the table of contents <br>\nto get an idea of the different areas that are covered.</p>\n<p>Chapter 6 is about proofs.  Section 6.1 about proof structure.  Blocks are <br>\ndescribed in 6.1.2 --- some abstract text about that concept.  At least it <br>\nsays something about 'next' and also mentions 'show' in a way that <br>\nindicates that it can be used here.</p>\n<p>BTW, the current version of Isabelle is from August 2014 and the manual <br>\nhas the same date.  As a habit you should follow the normal Isabelle <br>\nrelease cycle, unless there are special reasons to stick to an older <br>\nversion.</p>\n<p>Makarius</p>\n<hr>\n<p><a href=\"http://stop-ttip.org\">http://stop-ttip.org</a></p>\n<hr>",
        "id": 294317987,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660926048
    },
    {
        "content": "<p>From: Lars Noschinski &lt;<a href=\"mailto:noschinl@in.tum.de\">noschinl@in.tum.de</a>&gt;<br>\nThe difference between show and have is that show uses the proven fact<br>\nto discharge a pending proof obligation.</p>\n<p>Now, when you open a raw proof block, you don't setup a proof obligation<br>\nto be discharged in this block, so there is no need to use show there.<br>\nRather, the last fact mentioned in this block (whether this be by means<br>\nof have or e.g. note) is exported, when you close the block.</p>\n<p>However, even though you don't setup a proof obligation to be discharged<br>\nin a raw proof block, you can still discharge all the pending proof<br>\nobligations which were there before you open the proof block -- and for<br>\nthis you use show, as you would usually do.</p>\n<p>-- Lars</p>",
        "id": 294318049,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660926072
    }
]