[
    {
        "content": "<p>From: Paolo Tranquilli &lt;<a href=\"mailto:tranquil@cs.unibo.it\">tranquil@cs.unibo.it</a>&gt;<br>\n=== Two New Post-Doc positions in the CerCo FET-Open EU Project ===</p>\n<p>** Job duration: 01/07/2012-30/06/2013 (one year)<br>\n** Deadline for reception of candidatures: 29/06/2011</p>\n<p>We are currently looking for two Post-Doc positions at the Department of<br>\nComputer Science, University of Bologna, to work on the CerCo FET-Open<br>\nEU Project (see description below). The gross salary is 26174 euros per<br>\nyear. Only a minimal amount of taxes is due.</p>\n<p>The University of Bologna is the oldest running western university and the<br>\nDepartment of Computer Science (<a href=\"http://www.cs.unibo.it/en/\">http://www.cs.unibo.it/en/</a>), located in<br>\nthe historic city center, has strong expertise in theoretical computer<br>\nscience and logic and it participates to several national and<br>\ninternational projects. The Post-Doc will join the HELM team, leaded by<br>\nProf. Asperti, whose members work in the domains of Type Theory and<br>\nMathematical Knowledge Management. The CerCo project is headed by<br>\nDr. Sacerdoti Coen. The candidates will benefit from exchange opportunity<br>\nwith the other project participants (University Paris-Diderot, Paris,<br>\nand University of Edinburgh, Edinburgh). The candidates will not have any<br>\nteaching duties.</p>\n<p>Requirements:</p>\n<p>We are looking for candidates with a Ph.D. in Computer Science and<br>\nprevious experience in Type Theory (in particular Interactive<br>\nTheorem Proving), and being proficient in functional programming languages.<br>\nWe also accept candidates that will defend their Ph.D. thesis in the near<br>\nfuture, if they can provide a formal proof that they will.</p>\n<p>Starting date:</p>\n<p>The proposed starting date is the 01/07/2012. The contract is for one<br>\nyear. The candidate should contact sacerdot at <a href=\"http://cs.unibo.it\">cs.unibo.it</a> for further<br>\ninformation.</p>\n<p>Project description:</p>\n<p>The CerCo FET-Open EU Project is aimed at producing the first _formally_<br>\n_verified_ _complexity_preserving_ compiler for a subset of C to the<br>\nobject code for a microprocessor used in embedded systems. The output of<br>\nthe compilation process will be the object code and a copy of the source<br>\ncode annotated with _exact_ computational complexities for each program<br>\nslice in O(1). The exact computational complexities (expressed in clock<br>\ncycles and parametric in the program input) can then be used to formally<br>\nreason on the overall code complexity. The source code of the compiler<br>\nwill be formally verified using the Matita Interactive Theorem Prover<br>\n(<a href=\"http://matita.cs.unibo.it\">http://matita.cs.unibo.it</a>), based on a variant of the Calculus of<br>\n(Co)Inductive Constructions. The candidate will contribute to the formal<br>\nproof of correctness of the compiler.</p>\n<p>How to submit candidatures:</p>\n<p>All candidates are invited to get in touch in advance with Dr. Claudio<br>\nSacerdoti Coen &lt;sacerdot at <a href=\"http://cs.unibo.it\">cs.unibo.it</a>&gt;, submitting a curriculum vitae.</p>\n<p>The official candidature must be received by standard mail (no<br>\nelectronic submission) before the 29/06/2011. Candidates must fill in the<br>\nforms (in Italian only) that can be found at the following address:</p>\n<p><a href=\"https://www.aric.unibo.it/AssegniRicerca/BandiPubblicati/zz_Bandi_din.aspx\">https://www.aric.unibo.it/AssegniRicerca/BandiPubblicati/zz_Bandi_din.aspx</a><br>\n(look for the word \"Matita\" in the second column)</p>\n<p>Candidates must also attach two recommendation letters.</p>\n<p>Foreign candidates will be helped in compiling the forms.</p>\n<p>Kind regards,<br>\n  Paolo Tranquilli</p>",
        "id": 294163694,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660854183
    }
]