[
    {
        "content": "<p>From: Oortwijn  Wytse &lt;<a href=\"mailto:woortwijn@inf.ethz.ch\">woortwijn@inf.ethz.ch</a>&gt;</p>\n<h1>CALL FOR PARTICIPATION</h1>\n<p>22th Workshop on Formal Techniques for Java-like Programs, FTfJP 2020<br>\n<a href=\"https://2020.ecoop.org/track/FTfJP-2020-papers\">https://2020.ecoop.org/track/FTfJP-2020-papers</a></p>\n<p>Virtual event, to be held using Zoom,<br>\non Thursday, 23 July 2020,<br>\nfrom 10:00 to 17:30 (GMT+2 Amsterdam time).</p>\n<p>Participation is free. For more details please see the webpage linked above.</p>\n<h2>INVITED SPEAKERS</h2>\n<ul>\n<li>\n<p>Frank de Boer and Hans-Dieter Hiep (CWI, the Netherlands):<br>\n  History-based Specification and Verification of Java Collections in KeY</p>\n</li>\n<li>\n<p>Sung-Shik Jongmans (Open University, CWI; the Netherlands):<br>\n  Discourje: Runtime Verification of Communication Protocols in Clojure</p>\n</li>\n</ul>\n<h2>INVITED TUTORIAL</h2>\n<ul>\n<li>Alexander Summers (University of British Columbia, Canada):<br>\n  Prusti – Deductive Verification for Rust</li>\n</ul>\n<h2>PROGRAM</h2>\n<p>The program of (virtual) FTfJP 2020, July 23th, is as follows.<br>\nAll times are in GMT+2 Amsterdam time.</p>\n<p>Session One</p>\n<ul>\n<li>\n<p>10:00 - 11:00: History-based Specification and Verification of Java Collections in KeY (invited talk)<br>\n  (Frank de Boer and Hans-Dieter Hiep)</p>\n</li>\n<li>\n<p>11:00 - 11:30: Dalarna: A Simplistic Capability-Based Dynamic Language Design For Data Race Freedom<br>\n  (Kiko Fernandez-Reyes, James Noble, Isaac Oscar Gariano, Erin Greenwood-Thessman, Michael Homer and Tobias Wrigstad)</p>\n</li>\n<li>\n<p>11:30 - 11:50: ConSysT: Tunable, Safe Consistency meets Object-Oriented Programming<br>\n  (Mirko Köhler, Nafise Eskandani Masoule, Alessandro Margara and Guido Salvaneschi)</p>\n</li>\n</ul>\n<p>-- lunch break --</p>\n<p>Session Two</p>\n<ul>\n<li>\n<p>13:15 - 13:45: Salsa: Static Analysis of Serialization Features<br>\n  (Joanna Cecilia da Silva Santos, Reese Jones and Mehdi Mirakhorli)</p>\n</li>\n<li>\n<p>13:45 - 14:05: Towards Verified Construction of Correct and Optimised GPU Software<br>\n  (Marieke Huisman and Anton Wijs)</p>\n</li>\n<li>\n<p>14:05 - 14:35: An inductive abstract semantics for coFJ<br>\n  (Pietro Barbieri, Francesco Dagnino and Elena Zucca)</p>\n</li>\n<li>\n<p>14:35 - 15:05: A Separation Logic to Verify Termination of Busy-Waiting for Abrupt Program Exit<br>\n  (Tobias Reinhard, Amin Timany and Bart Jacobs)</p>\n</li>\n</ul>\n<p>-- break --</p>\n<p>Session Three</p>\n<ul>\n<li>\n<p>15:30 - 16:30: Prusti – Deductive Verification for Rust (invited tutorial)<br>\n  (Alexander Summers)</p>\n</li>\n<li>\n<p>16:30 - 17:30: Discourje: Runtime Verification of Communication Protocols in Clojure (invited talk)<br>\n  (Sung-Shik Jongmans)</p>\n</li>\n</ul>\n<h2>ABOUT FTfJP 2020</h2>\n<p>Formal techniques can help analyse programs, precisely describe<br>\nprogram behaviour, and verify program properties. Modern programming<br>\nlanguages are interesting targets for formal techniques due to their<br>\nubiquity and wide user base, stable and well-defined interfaces and<br>\nplatforms, and powerful (but also complex) libraries. New languages<br>\nand applications in this space are continually arising, resulting in<br>\nnew programming languages (PL) research challenges.</p>\n<p>Work on formal techniques and tools and on the formal underpinnings of<br>\nprogramming languages themselves naturally complement each<br>\nother. FTfJP is an established workshop which has run annually since<br>\n1999 alongside ECOOP, with the goal of bringing together people<br>\nworking in both fields.</p>\n<p>The workshop has a broad PL theme; the most important criterion is<br>\nthat submissions will generate interesting discussions within this<br>\ncommunity. The term “Java-like” is somewhat historic and should be<br>\ninterpreted broadly: FTfJP solicits and welcomes submission relating<br>\nto programming languages in general, beyond Java, C#, Scala, etc.</p>",
        "id": 294830668,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661246475
    }
]