[
    {
        "content": "<p>From: Pedro Quaresma &lt;<a href=\"mailto:pedro@mat.uc.pt\">pedro@mat.uc.pt</a>&gt;</p>\n<hr>\n<ul>\n<li>CSL'09                              *</li>\n<li>Annual Conference of the European Association for        *</li>\n<li>Computer Science Logic                      *</li>\n<li>September 7 - 11, 2009, Coimbra, Portugal             *</li>\n<li><a href=\"http://www.mat.uc.pt/CSL09\">http://www.mat.uc.pt/CSL09</a>                    *</li>\n<li>CALL FOR PARTICIPATION                      *</li>\n</ul>\n<hr>\n<p>Computer Science Logic (CSL) is the annual conference of the European<br>\nAssociation for Computer Science Logic (EACSL). The conference is<br>\nintended for computer scientists whose research activities involve<br>\nlogic, as well as for logicians working on issues significant for<br>\ncomputer science.</p>\n<p>Registration is open:         <a href=\"http://www.mat.uc.pt/~csl/\">http://www.mat.uc.pt/~csl/</a><br>\nEarly registration deadline:  31 July, 2009.<br>\nList of accepted papers:      <a href=\"http://www.mat.uc.pt/~csl/ap.html\">http://www.mat.uc.pt/~csl/ap.html</a></p>\n<hr>\n<ul>\n<li>CALL FOR INFORMAL PRESENTATIONS                  *</li>\n</ul>\n<hr>\n<p>This year, CSL is opening a special session for Informal<br>\nPresentations. There are four categories for these presentations:</p>\n<p>1) PhD students. Students which are about to finish their PhD are<br>\ninvited to report on their results. It is expected that submissions<br>\nhave the support of the supervisor.</p>\n<p>2) Recent PhDs. Researchers which recently finished their PhD are<br>\ninvited to report on their theses.</p>\n<p>3) Work in progress. Researches who would like to discuss work in<br>\nprogress which is not yet in the stage for publications.</p>\n<p>4) Other conference papers. Researchers who have a paper of interest<br>\nfor the CSL community that has already been presented at another<br>\nconference.</p>\n<p>Informal presentations must be in English. Please send an abstract of<br>\n1 to 3 pages in Springer's LNCS style by 20 July 2009 to the CSL<br>\nsubmission server: <a href=\"http://www.easychair.org/conferences/?conf=csl2009\">http://www.easychair.org/conferences/?conf=csl2009</a><br>\nPlease provide, in the Abstract field of the Easychair form, the<br>\nfollowing information:<br>\nFor category 1: Name and e-mail of your supervisor.<br>\nFor category 2: Date and University of your PhD defense.<br>\nFor category 4: Conference where the paper is accepted.</p>\n<p>The submissions are evaluated by the programme committee chairs,<br>\ntaking into account the appropriateness for CSL and possible timetable<br>\nrestrictions.</p>\n<p>Suggested topics of interest include: automated deduction and<br>\ninteractive theorem proving, constructive mathematics and type theory,<br>\nequational logic and term rewriting, automata and games, modal and<br>\ntemporal logic, model checking, logical aspects of computational<br>\ncomplexity, finite model theory, computational proof theory, logic<br>\nprogramming and constraints, lambda calculus and combinatory logic,<br>\ncategorical logic and topological semantics, domain theory, database<br>\ntheory, specification, extraction and transformation of programs,<br>\nlogical foundations of programming paradigms, verification and program<br>\nanalysis, linear logic, higher-order logic, and nonmonotonic<br>\nreasoning.</p>\n<p>Young researchers are especially encouraged to send submissions for<br>\ninformal presentations.</p>\n<p>The submission deadline for informal presentations is 20 July, 2009.</p>",
        "id": 294080575,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660830529
    }
]