[
    {
        "content": "<p>From: <a href=\"mailto:leila@ufs.br\">leila@ufs.br</a><br>\nSBMF 2010</p>\n<p>13th BRAZILIAN SYMPOSIUM ON FORMAL METHODS<br>\nNatal, Rio Grande do Norte, Brazil November 8-12, 2010</p>\n<p>CALL FOR SATELLITE EVENTS</p>\n<p>The SBMF series of meetings has established an excellent international reputation as a venue for the presentation of the latest in formal techniques.  It has a strong regional focus and identity, as the national meeting for formal methods research and practice, with the highest quality rating from the Brazilian research agencies.  It attracts speakers and participants from around the world, from both academia and industry.  Its proceedings are published in Springer's LNCS.  </p>\n<p>SBMF 2010 is the thirteenth meeting in the series, and the second to be held in Natal, a major tourist destination with excellent facilities and communications. </p>\n<p>Proposals for the organisation of satellite events are now invited.  The proposed events should fall broadly within the established scope of SBMF: that is, they should address the design or application of formal, soundly-based techniques for the development of high-quality systems.   They may focus upon particular aspects of theory or practice, upon a particular method or application domain, or they may be based around a theme of particular relevance to an SBMF audience.</p>\n<p>Researchers or practitioners wishing to organise a satellite event are invited to submit proposals in PDF or Postscript format by email to the SBMF 2010 chair - <a href=\"mailto:sbmf2010@gmail.com\">sbmf2010@gmail.com</a> - on or before the 14th of November 2009.   Proposers will be notified of the decision of the steering committee on or before the 30th of November.  </p>\n<p>Proposals</p>\n<p>A proposal should be no more than 4 pages in length, and should include a short CV of the event chair or lead organiser.   It should explain: the name of the event (and any acronym); names and contact details of the organisers; the topic or theme, and its relevance to SBMF; event format, including its duration; expected number of participants; local support requirements.  If papers are to be invited, the proposal should explain the schedule for submission and notification, the means of evaluation, and any plans for publication.  If there is a programme or organisation committee, the proposal should list the names of those involved. In assessing each proposal, the steering committee will consider relevance to an SBMF audience as well as the likely quality of the event itself. </p>\n<p>Arrangements</p>\n<p>All participants, including chairs and organisers, will be required to register also for the main SBMF conference.   An additional fee will be charged for participation at a satellite event, set by the general chair of SBMF.  The organisers of SBMF will be responsible for providing local, logistical support: meeting rooms, presentation facilities, refreshments, and internet access.   The organisers of the satellite event will be responsible for: event publicity; handling of submissions; production of proceedings; financial support for invited speakers, authors, or organisers; special transportation facilities, if required by workshop participants.  Event organisers should be ready to provide material for inclusion in the main SBMF website, and to produce an extended abstract for inclusion in the main SBMF proceedings.</p>",
        "id": 294092456,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660832290
    }
]