[
    {
        "content": "<p>From: Cezary Kaliszyk &lt;<a href=\"mailto:cezarykaliszyk@gmail.com\">cezarykaliszyk@gmail.com</a>&gt;<br>\nWe invite applications for PhD student and PostDoctoral researcher<br>\npositions (3 years) funded by the Austrian Science Fund project<br>\n\"Interactive Proof: Proof Translation, Premise Selection, Rewriting\"<br>\nat the Computational Logic research group of the Institute of Computer<br>\nScience at the University of Innsbruck.</p>\n<p>The deadline for applications is 15th of December; the project starts<br>\n1 February 2014; but a later starting date can be negotiated.</p>\n<p>The main goal of the project is to create and further develop techniques<br>\nand tools for using automated approaches in interactive proof systems in<br>\norder to allow the mechanical construction of proofs that can be<br>\ncomputer-verified.  The project intends to develop and provide: a) proof<br>\ntranslation between various logics and external first and higher order<br>\nATPs (automated theorem provers); b) stronger machine learning-based<br>\npremise selection; c) automatic deriving and simplifying terminating and<br>\nconfluent rewrite databases for the interactive proof systems.</p>\n<p>The project is to be conducted in the Computational Logic group of the<br>\nInstitute of Computer Science at the University of Innsbruck.<br>\nThe research group is mainly concerned with the logical foundations of<br>\ncomputer science and their application to the analysis of complex<br>\nsystems. Our current work involves verification of algorithms and<br>\nresearch on complexity, as well as term rewriting.</p>\n<p>Candidates for a PhD position must hold a MSc in computer science or<br>\nmathematics and candidates for the postdoctoral position hold a PhD<br>\ndegree in computer science or mathematics. A background in<br>\ncomputational logic (proof assistants, functional programming, term<br>\nrewriting), as well as machine learning is an advantage.</p>\n<p>Knowledge of German is not required, as the group is international and<br>\nthe language of communication is English.</p>\n<p>Salary is paid according to the FWF funding scheme: for a postdoctoral<br>\nresearcher (40 hours) approximately EUR 47,000 per year (gross), and<br>\nfor a PhD student (30 hours) EUR 27,000 per year (gross).</p>\n<p>Send applications including CV and two references to Cezary Kaliszyk<br>\n(<a href=\"mailto:cezary.kaliszyk@uibk.ac.at\">cezary.kaliszyk@uibk.ac.at</a>) no later than 15 December 2013. Applicants<br>\nfor the PostDoc position should also send a brief research statement.<br>\nInformal inquiries are welcome via the same email address.</p>\n<p>The city of Innsbruck, which hosted the Olympic Winter Games in 1964,<br>\n1976 and 2012 (YOG), is superbly located in the beautiful surroundings<br>\nof the Tyrolean Alps. The combination of the Alpine environment and<br>\nurban life in this historic town provides a high quality of living.</p>\n<p>More information about the project, the group, the university and the<br>\ncity of Innsbruck can be found at:</p>\n<p><a href=\"http://cl-informatik.uibk.ac.at/~cek/positions.php\">http://cl-informatik.uibk.ac.at/~cek/positions.php</a></p>",
        "id": 294252760,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660911398
    }
]