[
    {
        "content": "<p>From: Luke Wagner &lt;<a href=\"mailto:andhow@gmail.com\">andhow@gmail.com</a>&gt;<br>\nHello, I had a code generation question.</p>\n<p>I am interested in imperative programs that are [mechanically] correct<br>\nby construction and I happened upon the \"Abstract Hoare Logics\" work<br>\nin the AFP.  My question is: can code be automatically generated from<br>\nthe commands in a Hoare triple?  I am relatively new to Isabelle, but<br>\nfrom what I have seen, this seems to be a different situation than<br>\ngenerating code from a function const.</p>\n<p>Thank you,<br>\nLuke</p>",
        "id": 294053442,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660820581
    },
    {
        "content": "<p>From: Tobias Nipkow &lt;<a href=\"mailto:nipkow@in.tum.de\">nipkow@in.tum.de</a>&gt;<br>\nIsabelle let's you generate code from inductive definitions (in certain <br>\ncases). But it will still be functional code, not imperative. And it is <br>\nunclear to me why you would need Hoare logic to generate the code. The <br>\nprogram already is the code (modulo unparsing it).</p>\n<p>Tobias</p>\n<p>Luke Wagner wrote:</p>",
        "id": 294053475,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660820593
    },
    {
        "content": "<p>From: Gerwin Klein &lt;<a href=\"mailto:gerwin.klein@nicta.com.au\">gerwin.klein@nicta.com.au</a>&gt;<br>\nIt's definitely possible in theory to do that for a restricted subset of the <br>\nabstract language (restricted, because the \"Basic\" command can be any <br>\nfunction, even one that is not computable). </p>\n<p>We did some experiments with this two years ago and it basically worked. We <br>\ndid not use the built-in code generator directly, though, but wrote a small <br>\nbit of ML code ourselves. This might not be necessary any more.</p>\n<p>Unfortunately (for you ;-)), we ended up going the other way (parsing) in the <br>\nend, because that fit better with what we wanted to do. So I can't give you <br>\nany concrete code to work from.</p>\n<p>Cheers,<br>\nGerwin</p>",
        "id": 294053486,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660820599
    }
]