[
    {
        "content": "<p>From: Christian Urban &lt;<a href=\"mailto:urbanc@in.tum.de\">urbanc@in.tum.de</a>&gt;<br>\nThe First International Conference on<br>\n           Certified Programs and Proofs (CPP 2011)<br>\n                PRELIMINARY CALL FOR PAPERS</p>\n<p>Kenting, Taiwan <br>\n                  December 7--9, 2011 <br>\n<a href=\"http://formes.asia/cpp\">http://formes.asia/cpp</a></p>\n<p>(co-located with APLAS 2011)</p>\n<p>CPP is a new international forum on theoretical and practical topics<br>\nin all areas, including computer science, mathematics, and education,<br>\nthat consider certification as an essential paradigm for their work.<br>\nCertification here means formal, mechanized verification of some sort,<br>\npreferably with production of independently checkable certificates.<br>\nWe invite submissions on topics that fit under this rubric.</p>\n<p>Suggested, but not exclusive, specific topics of interest for<br>\nsubmissions include: certified or certifying programming, compilation,<br>\nlinking, OS kernels, runtime systems, and security monitors; program<br>\nlogics, type systems, and semantics for certified code; certified<br>\ndecision procedures, mathematical libraries, and mathematical<br>\ntheorems; proof assistants and proof theory; new languages and tools<br>\nfor certified programming; program analysis, program verification, and<br>\nproof-carrying code; certified secure protocols and transactions;<br>\ncertificates for decision procedures, including linear algebra,<br>\npolynomial systems, SAT, SMT, and unification in algebras of interest;<br>\ncertificates for semi-decision procedures, including equality,<br>\nfirst-order logic, and higher-order unification; certificates for<br>\nprogram termination; logics for certifying concurrent and distributed<br>\nprograms; higher-order logics, logical systems, separation logics, and<br>\nlogics for security; and teaching mathematics and computer science<br>\nwith proof assistants.</p>\n<p>IMPORTANT DATES:</p>\n<p>Authors are required to submit a paper title and a short abstract<br>\nbefore submitting the full paper.  The submission should include when<br>\nnecessary a url where to find the formal development assessing the<br>\nessential aspects of the work.  All submissions will be<br>\nelectronic. All deadlines are at midnight (GMT).</p>\n<p>Abstract Deadline:           Monday, June 13, 2011<br>\n  Paper Submission Deadline:   Friday, June 17, 2011 <br>\n  Author Notification:         Monday, August 29, 2011<br>\n  Camera Ready:                Monday, September 19, 2011<br>\n  Conference:                  December 7-9, 2011</p>\n<p>SUBMISSION INSTRUCTIONS: </p>\n<p>Papers should be submitted electronically online via the conference<br>\nsubmission web page at URL: </p>\n<p><a href=\"http://www.easychair.org/conferences/?conf=cpp2011\">http://www.easychair.org/conferences/?conf=cpp2011</a></p>\n<p>Acceptable formats are PostScript or PDF, viewable by Ghostview or<br>\nAcrobat Reader. Submissions should not exceed 16 pages in LNCS format,<br>\nincluding bibliography and figures.  Submitted papers will be judged<br>\non the basis of significance, relevance, correctness, originality, and<br>\nclarity. They should clearly identify what has been accomplished and<br>\nwhy it is significant. The proceedings of the symposium will<br>\nbe published as a volume in Springer-Verlag's Lecture Notes in<br>\nComputer Science series. Submission instructions including Latex<br>\nstyle files are available from the CPP 2011 website.</p>\n<p>Each submission must be written in English and provide sufficient<br>\ndetail to allow the program committee to assess the merits of the<br>\npaper.  It should begin with a succinct statement of the issues, a<br>\nsummary of the main results, and a brief explanation of their<br>\nsignificance and relevance to the conference, all phrased for the<br>\nnon-specialist.  Technical and formal developments directed to the<br>\nspecialist should follow.  Whenever appropriate, the submission should<br>\ncome along with a formal development, using whatever prover, e.g.,<br>\nAgda, Coq, Elf, HOL, HOL-Light, Isabelle, Matita, Mizar, NQTHM, PVS,<br>\nVampire, etc. References and comparisons with related work should be<br>\nincluded.  Papers not conforming to the above requirements concerning<br>\nformat and length may be rejected without further consideration.</p>\n<p>The results must be unpublished and not submitted for publication<br>\nelsewhere, including the proceedings of other published conferences or<br>\nworkshops.  The PC chairs should be informed of closely related work<br>\nsubmitted to a conference or journal in advance of<br>\nsubmission. Original formal proofs of known results in mathematics or<br>\ncomputer science are among the targets.  One author of each accepted<br>\npaper is expected to present it at the conference.</p>\n<p>AWARD FOR BEST PAPER:</p>\n<p>An award will be given for the best accepted paper, as judged by the<br>\nprogram committee.  Details concerning eligibility criteria and<br>\nprocedure for consideration for this award will be posted at the CPP<br>\nwebsite.  The committee may decline to make the award or split it<br>\namong several papers.</p>\n<p>PROGRAM CO-CHAIRS:<br>\n Jean-Pierre Jouannaud   (INRIA and Tsinghua University)<br>\n Zhong Shao              (Yale University)<br>\n Email: <a href=\"mailto:cpp2011pc@gmail.com\">cpp2011pc@gmail.com</a></p>\n<p>GENERAL CHAIR:<br>\n Yih-Kuen Tsay           (National Taiwan University)</p>\n<p>PROGRAM COMMITTEE:</p>\n<p>Andrea Asperti          (University of Bologna)<br>\n Gilles Barthe           (IMDEA Software Institute)<br>\n Xiao-Shan Gao           (Chinese Academy of Sciences)<br>\n Georges Gonthier        (Microsoft Research Cambridge)<br>\n Chris Hawblitzel        (Microsoft Research Redmond)<br>\n John Harrison           (Intel Corporation)<br>\n Jean-Pierre Jouannaud   (INRIA and Tsinghua University)<br>\n Akash Lal               (Microsoft Research India) <br>\n Xavier Leroy            (INRIA Paris-Rocquencourt)<br>\n Yasuhiko Minamide       (University of Tsukuba)<br>\n Shin-Cheng Mu           (Academia Sinica)<br>\n Michael Norrish         (NICTA)<br>\n Brigitte Pientka        (McGill University)<br>\n Sandip Ray              (University of Texas at Austin)<br>\n Natarajan Shankar       (SRI International) <br>\n Zhong Shao              (Yale University) <br>\n Christian Urban         (TU Munich)<br>\n Viktor Vafeiadis        (Max Planck Institute for Software Systems)<br>\n Stephanie Weirich       (University of Pennsylvania)<br>\n Kwangkeun Yi            (Seoul National University)</p>\n<p>PUBLICITY CHAIR:<br>\n Bow-Yaw Wang            (Academia Sinica, INRIA and Tsinhua University)</p>\n<p>ORGANIZING COMMITTEE: <br>\n Tyng-Ruey Chuang (chair), Shin-Cheng Mu, Yih-Kuen Tsay<br>\n                         (Academia Sinica and National Taiwan University)<br>\n Email: <a href=\"mailto:cpp2011oc@gmail.com\">cpp2011oc@gmail.com</a></p>",
        "id": 294134423,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660843888
    }
]