[
    {
        "content": "<p>From: Alessandro Armando &lt;<a href=\"mailto:armando@dist.unige.it\">armando@dist.unige.it</a>&gt;<br>\nCALL FOR PAPERS<br>\n===============</p>\n<p>ARSPA-WITS'10</p>\n<p>Joint Workshop on<br>\nAutomated Reasoning for Security Protocol Analysis <br>\nand<br>\nIssues in the Theory of Security</p>\n<p><a href=\"http://www.avantssar.eu/arspa-wits10\">http://www.avantssar.eu/arspa-wits10</a></p>\n<p>March 27-28, 2010<br>\nPaphos, Cyprus</p>\n<p>Affiliated with ETAPS 2010</p>\n<p>IMPORTANT DATES<br>\n===============</p>\n<p>Abstract due: December 5, 2009<br>\nPapers due: December 13, 2009<br>\nNotification: January 21, 2010</p>\n<p>SCOPE<br>\n=====</p>\n<p>Computer security is an established field of computer science of both<br>\ntheoretical and practical significance. In recent years, there has<br>\nbeen increasing interest in logic-based foundations for various<br>\nmethods in computer security, including the formal specification,<br>\nanalysis and design of security protocols and their applications, the<br>\nformal definition of various aspects of security such as access<br>\ncontrol mechanisms, mobile code security and denial-of-service<br>\nattacks, and the modeling of information flow and its application to<br>\nconfidentiality policies, system composition, and covert channel<br>\nanalysis.</p>\n<p>We are interested both in new results in theories of computer security<br>\nand also in more exploratory presentations that examine open questions<br>\nand raise fundamental concerns about existing theories, as well as in<br>\nnew results on developing and applying automated reasoning techniques<br>\nand tools for the formal specification and analysis of security<br>\nprotocols. We thus solicit submissions of papers both on mature work<br>\nand on work in progress.</p>\n<p>Possible topics include, but are not limited to:</p>\n<p>Automated reasoning techniques, Composition issues, Formal<br>\nspecification, Foundations of verification, Information flow analysis,<br>\nLanguage-based security, Logic-based design, Program transformation,<br>\nSecurity models, Static analysis, Statistical methods, Tools, Trust<br>\nmanagement</p>\n<p>for</p>\n<p>Access and resource usage control, Authentication, Availability and<br>\ndenial of service, Covert channels, Confidentiality, Integrity and<br>\nprivacy, Intrusion detection, Malicious code, Mobile code, Mutual<br>\ndistrust, Privacy, Security policies, Security protocols</p>\n<p>ARSPA is a series of workshops on Automated Reasoning for Security<br>\nProtocol Analysis, bringing together researchers and practitioners<br>\nfrom both the security and the formal methods communities, from<br>\nacademia and industry, who are working on developing and applying<br>\nautomated reasoning techniques and tools for the formal specification<br>\nand analysis of security protocols. The first two ARSPA workshops were<br>\nheld as satellite events of the 2nd International Joint Conference on<br>\nAutomated Reasoning (IJCAR'04) and of the 32nd International<br>\nColloquium on Automata, Languages and Programming (ICALP'05),<br>\nrespectively. ARSPA then joined forces with the workshop FCS<br>\n(Foundations of Computer Security): FCS-ARSPA'06 was affiliated with<br>\nLICS'06, in the context of FLoC'06, and FCS-ARSPA'07 was affiliated<br>\nwith LICS'07 and ICALP'07.</p>\n<p>WITS is the official annual workshop organised by the IFIP WG 1.7 on<br>\n\"Theoretical Foundations of Security Analysis and Design\", established<br>\nto promote the investigation on the theoretical foundations of<br>\nsecurity, discovering and promoting new areas of application of<br>\ntheoretical techniques in computer security and supporting the<br>\nsystematic use of formal techniques in the development of security<br>\nrelated applications. This is the tenth meeting in the series.</p>\n<p>In 2008, ARSPA and WITS joined with the workshop on Foundations of<br>\nComputer Security FCS for a joint workshop FCS-ARSPA-WITS'08<br>\nassociated with LICS 2008 and CSF 21. In 2009, ARSPA and WITS joined<br>\nforces for the joint workshop ARSPA-WITS'09, which was associated with<br>\nETAPS 2009.  In 2010, ARSPA and WITS will again join forces for the<br>\njoint workshop ARSPA-WITS'10, which is associated with ETAPS 2010. <br>\nThe aim of the joint workshop ARSPA-WITS'10 is to provide a forum for<br>\ncontinued activity in different areas of computer security, bringing<br>\ncomputer security researchers in closer contact with the ETAPS<br>\ncommunity and giving ETAPS attendees an opportunity to talk to experts<br>\nin computer security, on the one hand, and contribute to bridging the<br>\ngap between logical methods and computer security foundations, on the<br>\nother.</p>\n<p>SUBMISSION AND PUBLICATION<br>\n==========================</p>\n<p>All submissions will be peer-reviewed. Authors of accepted papers must<br>\nguarantee that their paper will be presented at the workshop. To<br>\npreserve ARSPA-WITS's tradition of being an open forum, authors may<br>\ndecide whether they would like a revised version of a paper to appear<br>\nin the post-proceedings. Authors should clearly state at time of<br>\nsubmission whether a paper is intended for presentation only or also<br>\nfor publication: this should be stated at the end of the abstract of<br>\nthe paper. Papers for presentation only may substantially overlap<br>\nother (cited) work of the authors. This choice will not affect the<br>\nselection procedure in any other way.</p>\n<p>Submissions should be at most 16 page long excluding references and<br>\nappendices with a total length not exceeding 20 pages. Manuscripts<br>\nshould be written in the Springer LNCS style available at the URL<br>\n<a href=\"http://www.springer.com/lncs\">http://www.springer.com/lncs</a>. If your paper does not fit into this<br>\npage limit, please contact the Program Chairs before submitting your<br>\npaper.</p>\n<p>Authors are invited to submit their papers electronically, as portable<br>\ndocument format (pdf) or postscript (ps); please, do not send files<br>\nformatted for work processing packages (e.g., Microsoft Word or<br>\nWordperfect files). The only mechanism for paper submissions is via<br>\nthe electronic submission web-site powered by EasyChair:</p>\n<p><a href=\"http://www.easychair.org/conferences/?conf=arspawits10\">http://www.easychair.org/conferences/?conf=arspawits10</a></p>\n<p>The post-proceedings of the workshop will be published by in the<br>\nseries.  A special issue of the Journal of Computer Security, with an<br>\nadditional reviewing process, is also planned.</p>\n<p>PROGRAM COMMITTEE<br>\n=================</p>\n<p>Alessandro Armando (Universita<code> di Genova, Italy; co-chair)\nLujo Bauer (CMU, USA)\nYannick Chevalier (Universite' Toulouse III, France)\nLuca Compagna (SAP Research, France)\nCas Cremers (ETHZ, Switzerland)\nJorge Cuellar (Siemens, Germany)\nPierpaolo Degano (Universita</code> di Pisa, Italy)<br>\nSandro Etalle (Technical U. of Eindhoven and U. of Twente, The Netherlands)<br>\nRiccardo Focardi (Universita<code> di Venezia, Italy)\nDieter Gollman (Hamburg University of Technology, Germany)\nJoshua Guttman (MITRE, USA)\nJan Jurjens (TU Dortmund and Fraunhofer ISST, Germany)\nGavin Lowe (Oxford University, UK; co-chair)\nCatherine Meadows (Naval Research Laboratory, USA)\nJohn Mitchell (Stanford University, USA)\nSebastian Moedersheim (IBM Zurich Research Lab, Switzerland)\nMichael Rusinowitch (INRIA-Lorraine, France)\nMark Ryan (University of Birmingham, UK)\nGraham Steel (INRIA, France)\nLuca Vigano</code> (Universita` di Verona, Italy)<br>\nBogdan Warinschi (University of Bristol, UK)</p>\n<p>ADDITIONAL INFORMATION<br>\n======================</p>\n<p>The workshop is supported by the AVANTSSAR project.</p>",
        "id": 294092722,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660832385
    }
]