[
    {
        "content": "<p>From: Ken Kubota &lt;<a href=\"mailto:mail@kenkubota.de\">mail@kenkubota.de</a>&gt;<br>\nDear Members of the Research Community,</p>\n<p>I am pleased to announce the publication of the mathematical logic R0, a <br>\nfurther development of Peter B. Andrews' logic Q0. The syntactic features <br>\nprovided by R0 are type variables (polymorphic type theory), the binding of <br>\ntype variables with the abstraction operator and single variable binder λ (type <br>\nabstraction), and (some of) the means necessary for dependent types (dependent <br>\ntype theory).</p>\n<p>The publication is available online at<br>\n<a href=\"http://www.owlofminerva.net/files/formulae.pdf\">http://www.owlofminerva.net/files/formulae.pdf</a></p>\n<p>The introduction can be found on pp. 11 f.</p>\n<p>A printed copy can be ordered with ISBN 978-3-943334-07-4. The software <br>\nimplementation is expected to be published in due course. For more information, <br>\nplease visit: <a href=\"http://doi.org/10.4444/100.3\">http://doi.org/10.4444/100.3</a></p>\n<p>The expressiveness of the formal language obtained with type abstraction allows <br>\nfor a natural formulation of group theory [cf. p. 12 of <br>\n<a href=\"http://www.owlofminerva.net/files/formulae.pdf\">http://www.owlofminerva.net/files/formulae.pdf</a> ]. With the set (type) of Boolean <br>\nvalues o, the exclusive disjunction XOR, and an appropriate definition of <br>\ngroups Grp [p. 362], the fact that (o, XOR) is a group can be expressed in <br>\nlambda notation with [p. 420]<br>\n    Grp o XOR</p>\n<p>This enhancement of the expressiveness of the formal language overcomes the <br>\n\"limitation of the simple HOL type system [...] that there is no explicit <br>\nquantifier over polymorphic type variables, which can make many standard <br>\nresults [...] awkward to express [...]. [...] For example, in one of the most <br>\nimpressive formalization efforts to date [Gonthier et al., 2013] the entire <br>\ngroup theory framework is developed in terms of subsets of a single universe <br>\ngroup, apparently to avoid the complications from groups with general and <br>\npossibly heterogeneous types.\" [Harrison, Urban, and Wiedijk, 2014, pp. 170 f.]</p>\n<p>Furthermore, the enhanced expressiveness provided by R0 avoids the <br>\ncircumlocutions connected with preliminary solutions like axiomatic type <br>\nclasses recently developed and discussed for Isabelle/HOL. The expressiveness <br>\nof type abstraction also replaces the notion of compound types, which in HOL <br>\nare used for ordered pairs (the Cartesian product, see section 1.2 of <br>\n<a href=\"http://freefr.dl.sourceforge.net/project/hol/hol/kananaskis-11/kananaskis-11-logic.pdf\">http://freefr.dl.sourceforge.net/project/hol/hol/kananaskis-11/kananaskis-11-logic.pdf</a> ), <br>\nthat in R0 can be formalized without compound types [cf. pp. 378 f. of <br>\n<a href=\"http://www.owlofminerva.net/files/formulae.pdf\">http://www.owlofminerva.net/files/formulae.pdf</a> ].</p>\n<p>Mike Gordon's HOL developed at Cambridge University is, like Andrews' logic Q0, <br>\nbased on the Simple Theory of Types (1940) developed by Alonzo Church, Andrews' <br>\nPh.D. advisor at Princeton University. Among the HOL group, there has always <br>\nbeen the awareness that besides automation, there is the philosophical <br>\n(logical) desire to reduce the means of the logic to a few principles. In the <br>\nHOL handbook, Andrew M. Pitts wrote the legendary sentence: \"From a logical <br>\npoint of view, it would be better to have a simpler substitution primitive, <br>\nsuch as 'Rule R' of Andrews' logic Q0, and then to derive more complex rules <br>\nfrom it.\" [Gordon and Melham, 1993, p. 213]</p>\n<p>In the same spirit, Mike Gordon wrote on the genesis of HOL: \"[T]he terms [...] <br>\ncould be encoded [...] in such a way that the LSM expansion-law just becomes a <br>\nderived rule [...]. This approach is both more elegant and rests on a firmer <br>\nlogical foundation, so I switched to it and HOL was born.\" [Gordon, 2000, p. <br>\n173]</p>\n<p>The general principle of reducing the logic (including the language) to a few <br>\nprinciples is the main criterion for the design of Q0 (having only a single <br>\nprimitive rule of inference, Rule R), which is summarized by Peter B. Andrews <br>\nas follows: \"Therefore we shall turn our attention to finding a formulation of <br>\ntype theory which is as expressive as possible, allowing mathematical ideas to <br>\nbe expressed precisely with a minimum of circumlocutions, and which is as <br>\nsimple and economical as is possible without sacrificing expressiveness. The <br>\nreader will observe that the formal language we find arises very naturally from <br>\na few fundamental design decisions.\" [Andrews, 2002, pp. 205 f.]</p>\n<p>R0 \"follows Andrews' concept of expressiveness (I also use the term <br>\nreducibility), which aims at the ideal and natural language of formal logic and <br>\nmathematics.“ [p. 11 of <a href=\"http://www.owlofminerva.net/files/formulae.pdf\">http://www.owlofminerva.net/files/formulae.pdf</a> ]</p>\n<p>Like John Harrison's HOL Light, R0 has an extremely small kernel. R0 resembles <br>\nNorman Megill's Metamath, which \"attempts to use the minimum possible framework <br>\nneeded to express mathematics and its proofs.“ ( <a href=\"http://us.metamath.org/\">http://us.metamath.org/</a> ) For <br>\nthe same reason, R0 is, unlike most other systems, a Hilbert-style system.</p>\n<p>R0 uses, like Q0, the description operator, avoiding the problems of the <br>\nepsilon operator already discussed by Mike Gordon himself for HOL: \"It must be <br>\nadmitted that the ε-operator looks rather suspicious.\" [Gordon, 2001, p. 24] <br>\n\"The inclusion of ε-terms into HOL 'builds in' the Axiom of Choice [...].\" <br>\n[Gordon, 2001, p. 24]</p>\n<p>Unlike in Coq, in R0, the Curry-Howard isomorphism is not used, favoring a <br>\ndirect (unencoded) expression rather than the encoding of proofs. For the same <br>\nreason, it is an object logic and not a logical framework (such as Larry <br>\nPaulson's Isabelle and Norman Megill's Metamath). Like Cris Perdue’s Prooftoys <br>\n( <a href=\"http://prooftoys.org\">http://prooftoys.org</a> , <a href=\"http://mathtoys.org\">http://mathtoys.org</a> ) - a natural deduction variant of <br>\nAndrews' Q0 - in R0, the turnstile symbol is replaced by the logical <br>\nimplication [p. 12].</p>\n<p>Kind regards,</p>\n<p>Ken Kubota</p>\n<hr>\n<p>Ken Kubota<br>\n<a href=\"http://doi.org/10.4444/100\">http://doi.org/10.4444/100</a></p>\n<p>References</p>\n<p>Kubota, Ken (2017), Mathematical Formulae. Available online at <br>\n<a href=\"http://www.owlofminerva.net/files/formulae.pdf\">http://www.owlofminerva.net/files/formulae.pdf</a> (April 9, 2017). SHA-512: <br>\n2ca7be176113ddd687ad8f7ef07b6152 770327ea7993423271b84e399fe8b507 <br>\n67a071408594ec6a40159e14c85b97d2 168462157b22017d701e5c87141157d8. ISBN: <br>\n978-3-943334-07-4. DOI: 10.4444/100.3. See: <a href=\"http://doi.org/10.4444/100.3\">http://doi.org/10.4444/100.3</a></p>\n<p>For further references, please see<br>\n<a href=\"http://www.owlofminerva.net/files/fom.pdf\">http://www.owlofminerva.net/files/fom.pdf</a> (direct link)<br>\n<a href=\"http://doi.org/10.4444/100.111\">http://doi.org/10.4444/100.111</a> (persistent link)</p>",
        "id": 294709924,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661181830
    }
]