[
    {
        "content": "<p>From: \"Tim (McKenzie) Makarios\" &lt;<a href=\"mailto:tjm1983@gmail.com\">tjm1983@gmail.com</a>&gt;<br>\nI just tried adding a reference list to an Isabelle-generated pdf.<br>\nInstead of writing a new .bib file, I decided just to link root.bib to<br>\nan existing .bib file that had the necessary reference.  Unfortunately,<br>\nthis didn't result in the reference list being generated and added to<br>\nthe final Isabelle-generated pdf.  It took me quite a while to figure<br>\nout what was wrong, because I haven't used .bib files with Isabelle much<br>\nbefore, so I didn't know if I'd inadvertently done something else wrong.</p>\n<p>Because of the re-usability of .bib files in general, it would be useful<br>\nto be able to link to a large .bib file that contains all the references<br>\nan Isabelle-generated document needs.  Is the present behaviour a<br>\nfeature or a bug?  (I'm using Isabelle 2009-2.)</p>\n<p>Tim<br>\n&lt;&gt;&lt;<br>\n<a href=\"/user_uploads/14278/Q42UQY_HQBoYDLyPC6safDum/signature.asc\">signature.asc</a></p>",
        "id": 294151287,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660849396
    },
    {
        "content": "<p>From: Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt;<br>\nHistorically there have been occasional surprises about the generated <br>\ndocument directory, so the system is as defensive as feasible, and there <br>\nare always ways to deactivate default behaviour and do whatever you like <br>\nby hand -- the usedir option -D is particularly useful for that.</p>\n<p>Nonetheless, brief inspection of the default way of copying the document <br>\nsources in Isabelle2009-2 (and current Isabelle2011-1) reveals that it is <br>\ndone by \"cp -r -f\", which should normally dereference symlinks (unless you <br>\nhave a very odd version of \"cp\", which has also happened to some users in <br>\nthe past).</p>\n<p>Is dereferencing what you have expected?  Or the other way round?  You may <br>\nalso consider absolute symlinks or hardlinks.</p>\n<p>Makarius</p>",
        "id": 294152222,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660849726
    },
    {
        "content": "<p>From: \"Tim (McKenzie) Makarios\" &lt;<a href=\"mailto:tjm1983@gmail.com\">tjm1983@gmail.com</a>&gt;<br>\nOn 15/02/12 23:52, Makarius wrote:</p>\n<blockquote>\n<p>Historically there have been occasional surprises about the generated<br>\ndocument directory, so the system is as defensive as feasible, and there<br>\nare always ways to deactivate default behaviour and do whatever you like<br>\nby hand -- the usedir option -D is particularly useful for that.</p>\n<p>Nonetheless, brief inspection of the default way of copying the document<br>\nsources in Isabelle2009-2 (and current Isabelle2011-1) reveals that it<br>\nis done by \"cp -r -f\", which should normally dereference symlinks<br>\n(unless you have a very odd version of \"cp\", which has also happened to<br>\nsome users in the past).</p>\n</blockquote>\n<p>I have the cp that comes by default with Ubuntu 10.04 --- it reports<br>\nitself as \"cp (GNU coreutils) 7.4\".</p>\n<blockquote>\n<p>Is dereferencing what you have expected?  Or the other way round?  You<br>\nmay also consider absolute symlinks or hardlinks.</p>\n</blockquote>\n<p>What happens is that in the directory of generated LaTeX sources, I get<br>\na copy of the \"root.bib\" symlink, which is a relative link, and does, in<br>\nfact, point to the right file.  This is because in my \"geometry\"<br>\ndirectory, which has my .thy files and ROOT.ML, I have the<br>\nsubdirectories \"document\" and \"generated\".  The former has \"root.tex\"<br>\nand \"root.bib\", which is a link to \"../../thesis/references.bib\".  As a<br>\nconsequence, when this link is copied to the \"generated\" directory,<br>\n\"../../thesis/references.bib\" still points to the correct file.</p>\n<p>However, the \"document.pdf\" that ends up being generated has only [?]<br>\ninstead of [1], and has no reference list at the end.</p>\n<p>An absolute symlink would be difficult to arrange, because I'm using<br>\nSubversion to work on the same files in two locations, and the directory<br>\nlayout differs between the locations.  I don't have experience with<br>\nhardlinks, but I could find out about them if necessary.  At the moment<br>\nit's not necessary, though, because my current workaround is to have<br>\n\"root.bib\" as an ordinary file, and \"../../thesis/references.bib\" as a<br>\nsymlink to \"root.bib\".</p>\n<blockquote>\n<p>Makarius</p>\n</blockquote>\n<p>Tim<br>\n&lt;&gt;&lt;<br>\n<a href=\"/user_uploads/14278/zRQwIuxrp6_lwneXnEiPcLjy/signature.asc\">signature.asc</a></p>",
        "id": 294152370,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660849786
    },
    {
        "content": "<p>From: \"Tim (McKenzie) Makarios\" &lt;<a href=\"mailto:tjm1983@gmail.com\">tjm1983@gmail.com</a>&gt;<br>\nFurther investigation reveals that \"cp -r\" behaves differently depending<br>\non whether you're using Linux or BSD.  In fact, the BSD man page for cp<br>\nsays \"Historic versions of the cp utility had a -r option.  This<br>\nimplementation supports that option, however, its use is strongly<br>\ndiscouraged, as it does not correctly copy special files, symbolic links<br>\nor fifo's.\"</p>\n<p>I suggest that Isabelle should use \"cp -R -L -f\" instead of \"cp -r -f\",<br>\nin order to behave the same way on Linux and BSD.</p>\n<p>Tim<br>\n&lt;&gt;&lt;<br>\n<a href=\"/user_uploads/14278/-MOlwYQ6ZeqYhTlj_NtLVVAx/signature.asc\">signature.asc</a></p>",
        "id": 294152382,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660849790
    },
    {
        "content": "<p>From: Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt;<br>\nIt is indeed a running gag of POSIX standards that the meaning of options <br>\nfor cp changes in delicate ways over the decades.  We've had to adjust it <br>\nalready 2-3 times before.</p>\n<p>I've myself grown up in a classic SunOS / Solaris environment, where -r <br>\nwas the only recursive option, and it did not preserve symlinks.  Later <br>\nGNU cp introduced the more convenient -R and even better the -a option; a <br>\nbit later they unfortunately made -r coincide with -R.  The latter could <br>\nhave dire effects when an avarage Linux user would try to copy directory <br>\nhierarchies on Solaris, if cp -r in the sense of -R was intended, but <br>\nwould suddenly dereference symlinks -- including cyclic directory links!</p>\n<p>Anyway, I've briedly reviewed our current state of affairs, and the man <br>\npages for cp of GNU, BSD, POSIX.</p>\n<p>I think the intention of cp -r the Isabelle_System.copy_dir function that <br>\nis used here is to copy a hierarchy without as little surprises as <br>\npossible.  This means to preserve most things, including symlinks.  To <br>\nmake this a bit more robust on old-style BSD (i.e. Mac OS X), I am <br>\nre-using already established option from the Isabelle/jEdit script in <br>\nIsabelle2011-1: cp -p -R -f.</p>\n<p>Since your application of document preparations needs it the other way <br>\nround, the standard way is to break up the default generation process <br>\n(e.g. in the makefile).  Options of \"isabelle usedir\" such as -C false and <br>\n-D generated produce exactly the freshly generated files in generated/. <br>\nYou can then augment the content in any way with cp etc. and finally run <br>\nsomething like \"isabelle latex -o pdf\" on the result.  These Isabelle <br>\ntools are have their man pages in the Isabelle system manual as usual.</p>\n<p>Makarius</p>",
        "id": 294152473,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660849818
    },
    {
        "content": "<p>From: \"Tim (McKenzie) Makarios\" &lt;<a href=\"mailto:tjm1983@gmail.com\">tjm1983@gmail.com</a>&gt;<br>\nThanks for doing all this.  For now I think it is sufficient for me to<br>\navoid the problem by linking into \"root.bib\" in the \"document\"<br>\ndirectory, instead of making \"root.bib\" a link pointing out of the<br>\ndirectory.  In future, if I have a more complex situation, I'll keep in<br>\nmind the possibility of putting more fine-grained commands in the<br>\nmakefile, as you suggest.</p>\n<p>Tim<br>\n&lt;&gt;&lt;<br>\n<a href=\"/user_uploads/14278/ETOir99dW1_2H-9kHjTRCumC/signature.asc\">signature.asc</a></p>",
        "id": 294152494,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660849828
    }
]