[
    {
        "content": "<p>From: Sylvia Grewe &lt;<a href=\"mailto:sylvia.gruener@googlemail.com\">sylvia.gruener@googlemail.com</a>&gt;<br>\nHello everybody,</p>\n<p>I am currently writing a master's thesis which includes a lot of Isabelle formalizations and proofs. So of course, I would like to write sections in which I show for example some \"highlights\" of the formalization or of the proofs, but not entire Isabelle theories (this being saved for the appendix).</p>\n<p>I have already written a few \"bigger\" documents where I also used Isabelle's Latex generation, so I know the basics of how to generate Latex documents and how to use antiquotations etc. But as \"solution\" to the above scenario, I have always simply copied the parts of the .tex code generated from my theory files and inserted them in my tex source files where I wanted them. But obviously, this can be a lot of work, and if you change just a minor thing like a variable name in your theory files, you have to do this all over again and it is very likely you forget something and in the end, your Latex document is not consistent with your Isabelle theories. Also, I guess the Isabelle latex support is not really meant to be used like this ;).</p>\n<p>So basically, I am looking for a good way to combine Isabelle and Latex such that</p>\n<ul>\n<li>I do not need to invest a lot of work to make my tex code consistent with my Isabelle theories whenever I change something in the Isabelle theories</li>\n<li>I do not need to create very obfuscated versions of my Isabelle theories, writing all the explanatory text in between definitions and proof commands, blocking out unwanted parts using %invisible (This would obviously be one answer to ensure only my first condition, but I would like to keep and to work on \"clean\" versions of my theories, and also to include these \"clean\" versions in my appendix. However, if there is a way of managing a \"clean\" version of an Isabelle theory file next to a \"heavily commented and annotated\" version such that all the definitions inside both versions are consistent, I would also be interested in that.)</li>\n<li>(optionally, if you know anything about it) I can use this way together with latexmk such that the Isabelle .tex representation I need is updated every time I change the .thy files. For this to work, one needs to provide a perl method that tells latexmk how to generate a tex/pdf file from a .thy file. But for example with isabelle make, you usually produce .tex output for a bunch of Isabelle theory files, so if you used this, it would regenerate the .tex output of all Isabelle theory files even though you only changed one .thy file (which can then take quite long if you have a lot of .thy files that belong together...).</li>\n</ul>\n<p>How do you deal with such problems when you create large documents and want to show parts of your Isabelle theories inside the text?</p>\n<p>Thanks in advance,<br>\nSylvia Grewe</p>",
        "id": 294157007,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660851608
    },
    {
        "content": "<p>From: Tobias Nipkow &lt;<a href=\"mailto:nipkow@in.tum.de\">nipkow@in.tum.de</a>&gt;<br>\nMaybe this helps: <a href=\"https://isabelle.in.tum.de/community/Generate_TeX_Snippets\">https://isabelle.in.tum.de/community/Generate_TeX_Snippets</a><br>\nThe example is a bit simple, but you can probably do something like this:</p>\n<p>text_raw{*<br>\n\\DefineSnippet{name}{<br>\n*}</p>\n<p>&lt;your Isabelle text&gt;</p>\n<p>text_raw{* } *}</p>\n<p>However, I haven't tried this. I have another way of achieving what you want,<br>\nbut it needs a lengthier piece of latex code. I can send it to you if you want.</p>\n<p>Tobias</p>",
        "id": 294157036,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660851622
    },
    {
        "content": "<p>From: Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt;<br>\nOn Mon, 14 May 2012, Sylvia Grewe wrote:</p>\n<blockquote>\n<p>I am currently writing a master's thesis which includes a lot of <br>\nIsabelle formalizations and proofs. So of course, I would like to write <br>\nsections in which I show for example some \"highlights\" of the <br>\nformalization or of the proofs, but not entire Isabelle theories (this <br>\nbeing saved for the appendix).</p>\n</blockquote>\n<blockquote>\n<p>But as \"solution\" to the above scenario, I have always simply copied the <br>\nparts of the .tex code generated from my theory files and inserted them <br>\nin my tex source files where I wanted them.</p>\n</blockquote>\n<blockquote>\n<p>Also, I guess the Isabelle latex support is not really meant to be used <br>\nlike this ;).</p>\n</blockquote>\n<p>Copying generated material by hand is not a solution, as you have already <br>\nnoticed.  In some situations one can copy formally, using perl in a smart <br>\nway, say by integrating it into the isabelle make process. This is useful <br>\nfor some hardcore re-organizations of the .tex sources. I used to have it <br>\nin my own setup, when subscripts where not yet supported by default, to <br>\nturn foo_42 to foo$_{42}$ etc. or to change the font/color of the symbol <br>\nfollowing some funny Isabelle control symbol.</p>\n<blockquote>\n<ul>\n<li>I do not need to create very obfuscated versions of my Isabelle <br>\ntheories, writing all the explanatory text in between definitions and <br>\nproof commands, blocking out unwanted parts using %invisible (This would <br>\nobviously be one answer to ensure only my first condition, but I would <br>\nlike to keep and to work on \"clean\" versions of my theories, and also to <br>\ninclude these \"clean\" versions in my appendix. However, if there is a <br>\nway of managing a \"clean\" version of an Isabelle theory file next to a <br>\n\"heavily commented and annotated\" version such that all the definitions <br>\ninside both versions are consistent, I would also be interested in <br>\nthat.)</li>\n</ul>\n</blockquote>\n<p>This might point to a more high-level way to organize certain sections in <br>\nthe sources.  The interpretation of %invisible tags is just an example <br>\nthat is provided by default.  The underlying \"comment\" package of latex <br>\ncan do more things, or one can use other packages to shuffle regions <br>\nwithin latex.</p>\n<p>So assuming that the amount of hilighted things is relatively low, you <br>\ncould tag them as %hilighted and then include the generated .tex sources <br>\ntwice, with different definitions of the underlying latex macros.</p>\n<blockquote>\n<ul>\n<li>(optionally, if you know anything about it) I can use this way <br>\ntogether with latexmk such that the Isabelle .tex representation I need <br>\nis updated every time I change the .thy files. For this to work, one <br>\nneeds to provide a perl method that tells latexmk how to generate a <br>\ntex/pdf file from a .thy file. But for example with isabelle make, you <br>\nusually produce .tex output for a bunch of Isabelle theory files, so if <br>\nyou used this, it would regenerate the .tex output of all Isabelle <br>\ntheory files even though you only changed one .thy file (which can then <br>\ntake quite long if you have a lot of .thy files that belong <br>\ntogether...).</li>\n</ul>\n</blockquote>\n<p>Many years ago, when I wrote my own thesis with the Isabelle document <br>\npreparation system, it was taking really long (45min IIRC).  I organized <br>\nthe \"make\" process mainly by hand, activating or deactivating theories in <br>\nROOT.ML and in root.tex via \\includeonly{} of latex.</p>\n<p>The usedir -D options helps here, because it will dump the generated stuff <br>\nin some place and not delete it.  So you can include old versions of <br>\ngenerated sources that where not checked again via ROOT.ML.</p>\n<p>On the other hand, current machines might be fast enough to rebuild <br>\neverything on the spot in a few seconds/minutes.  It also gives some <br>\nopportunity to rethink the content of the document in the meantime.</p>\n<p>Makarius</p>",
        "id": 294157371,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660851776
    },
    {
        "content": "<p>From: \"Tim (McKenzie) Makarios\" &lt;<a href=\"mailto:tjm1983@gmail.com\">tjm1983@gmail.com</a>&gt;<br>\nI used this sort of thing for my MSc thesis.  I used text (and sometimes<br>\ntxt) instead of text_raw, and found it useful to include the %EndSnippet<br>\ncomment suggested in the page Tobias linked to.  Together with the other<br>\nsuggestions in that page, including using a Makefile, I found a solution<br>\nbased on this that was adequate for my needs.</p>\n<p>Tim<br>\n&lt;&gt;&lt;<br>\n<a href=\"/user_uploads/14278/1FwaYd_ibg51qXx5lAIE0CzO/signature.asc\">signature.asc</a></p>",
        "id": 294164032,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660854303
    }
]