[
    {
        "content": "<p>From: Lennart Beringer &lt;<a href=\"mailto:beringer@tcs.ifi.lmu.de\">beringer@tcs.ifi.lmu.de</a>&gt;<br>\nThe Institute for Computer Science at the University of Munich offers</p>\n<p>2 PhD studentships/research assistant positions</p>\n<p>with effect of June, 1st, 2006, or as soon as possible.  Both<br>\npositions are available in the DFG funded project ``InfoZert -<br>\nspecification, verification, and certification of information flow'',<br>\nand are in the first instance for a duration of two years.</p>\n<p>The aim of the project is to develop a proof-carrying code<br>\narchitecture, where programs are equipped with formal proofs which<br>\ncertify the absence of flow of private data to public agents. We offer<br>\nthe opportunity to work on theoretically challenging and practically<br>\nrelevant topics in a young group in an international research<br>\nenvironment, and collaboration with an industrial research group<br>\n(Siemens).  Candidates are expected to have earned a good first degree<br>\nin computer science or a closely related subject.  Applications by<br>\ncandidates with a strong background in</p>\n<ul>\n<li>programming languages (type systems, program logics, compilers)</li>\n<li>verification techniques (model checking, theorem proving)</li>\n<li>security architectures</li>\n</ul>\n<p>are particularly welcome. One of the positions is intended for a PhD<br>\nstudent, while the other one would also be suitable for a<br>\npost-doctorate.  Renumeration will be according to age and<br>\nqualification, following the German public service payment scheme (BAT<br>\nIIA).</p>\n<p>To apply please send as soon as possible, but no later than April 30,<br>\n2006, a letter of application to the address given below, including a<br>\nCV, degree certificates, and contact details of at least one<br>\nreferee. The University of Munich is an equal opportunities employer<br>\nand aims to increase the ratio of women in academia. We therefore<br>\nparticularly encourage female candidates to apply. Applications of<br>\nhandicapped candidates are treated with priority.</p>\n<p>For further enquiries, please contact Lennart Beringer, PhD or<br>\nDr.~Alexander Knapp, Institut fuer Informatik,<br>\nLudwig-Maximilians-Universitaet Muenchen, Oettingenstrasse 67,<br>\n80538 Muenchen, <a href=\"http://www.tcs.ifi.lmu.de/~beringer\">www.tcs.ifi.lmu.de/~beringer</a> and<br>\n<a href=\"http://www.pst.ifi.lmu.de/personen/knapp\">www.pst.ifi.lmu.de/personen/knapp</a>.</p>",
        "id": 293905236,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660745758
    }
]