[
    {
        "content": "<p>From: Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt;<br>\nThat is subsumed by \"its traditional helper scripts\".  If you initialize <br>\nthe mentioned \"ProofGeneral-4.2-2\" component in a standard way, it will <br>\nwork out of the box.</p>\n<p>Makarius</p>",
        "id": 294294724,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660924244
    },
    {
        "content": "<p>From: Ian Zimmerman &lt;<a href=\"mailto:itz@buug.org\">itz@buug.org</a>&gt;<br>\nCan Isabelle2014 work with ProofGeneral at all?  The NEWS file says:</p>\n<p>Proof General with its traditional helper scripts is now an optional<br>\n Isabelle component, e.g. see ProofGeneral-4.2-2 from the Isabelle<br>\n component repository <a href=\"http://isabelle.in.tum.de/components/\">http://isabelle.in.tum.de/components/</a>.  Note that<br>\n the \"system\" manual provides general explanations about add-on<br>\n components, especially those that are not bundled with the release.</p>\n<p>So I unpacked the PG tarball.  Within it is the directory isar and files<br>\nisar/interface and isar/README.  And the latter says:</p>\n<p>The script `interface' and file 'interface-setup.el' are used<br>\n internally to start Isabelle Proof General via the 'isabelle' shell<br>\n command.  This is the default way to invoke Proof General from the<br>\n Isabelle perspective; it enables Isabelle to provide a consistent<br>\n process and file-system environment, including the all-important<br>\n isar-keywords.el file.</p>\n<p>But:</p>\n<p>$ /opt/Isabelle2014/bin/isabelle</p>\n<h3>Cannot execute Poly/ML in 32bit mode (missing shared libraries for C/C++)</h3>\n<h3>Using bulky 64bit version of Poly/ML instead</h3>\n<p>Usage: isabelle NAME [ARGS ...]</p>\n<p>Start Isabelle tool NAME with ARGS; pass \"-?\" for tool specific help.</p>\n<p>Available tools:<br>\n  browser - Isabelle graph browser<br>\n  build - build and manage Isabelle sessions<br>\n  codegen - issue code generation from shell<br>\n  components - resolve Isabelle components<br>\n  console - run Isabelle process with raw ML console and line editor<br>\n  display - display document (in DVI or PDF format)<br>\n  doc - view Isabelle documentation<br>\n  document - prepare theory session document<br>\n  env - run a program in a modified environment<br>\n  getenv - get values from Isabelle settings environment<br>\n  haskabelle - Haskabelle interface wrapper<br>\n  install - install standalone Isabelle executables<br>\n  java - invoke Java within the Isabelle environment<br>\n  jedit - Isabelle/jEdit interface wrapper<br>\n  keywords - generate keyword files for Emacs Proof General<br>\n  latex - run LaTeX (and related tools)<br>\n  logo - create an instance of the Isabelle logo<br>\n  mirabelle - testing tool for automated proof tools<br>\n  mkroot - prepare session root directory<br>\n  mutabelle - mutant-testing for counterexample generators and automated tools<br>\n  options - print Isabelle system options<br>\n  scala - invoke Scala within the Isabelle environment<br>\n  scalac - invoke Scala compiler within the Isabelle environment<br>\n  tptp_graph - TPTP visualisation utility<br>\n  tptp_isabelle - Isabelle tactics for TPTP competitive division<br>\n  tptp_isabelle_hot - Isabelle tactics for TPTP demo division<br>\n  tptp_nitpick - Nitpick for TPTP<br>\n  tptp_refute - Refute for TPTP<br>\n  tptp_sledgehammer - Sledgehammer for TPTP<br>\n  tptp_translate - translate between TPTP formats<br>\n  update_sub_sup - update Isabelle symbols involving sub/superscripts<br>\n  version - display Isabelle version<br>\n  yxml - simple XML to YXML converter</p>\n<p>... no obvious way to start PG.</p>\n<p>So, is this a miscommunication between the 2 projects, missing<br>\ndocumentation, or has PG interface simply been dropped altogether?</p>",
        "id": 294308963,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660925197
    },
    {
        "content": "<p>From: Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt;<br>\nHow about actually reading the \"system\" manual concerning Isabelle <br>\ncomponents?</p>\n<p>Alternatively, you can get some additional explanations on the parallel <br>\nthread \"Isabelle 2014 and proof general\".</p>\n<p>I now regret that I made Proof General optional in Isabelle2014.  It <br>\nshould have been deleted outright, without further comments.</p>\n<p>Nonetheless, there is always the possibility to put genuine reasons for <br>\nremaining uses of Proof General on the table for discussion, but excluding <br>\nanything that is isomorphic to \"I don't want to change my habits\".</p>\n<p>Makarius</p>",
        "id": 294309023,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660925221
    },
    {
        "content": "<p>From: Ian Zimmerman &lt;<a href=\"mailto:itz@buug.org\">itz@buug.org</a>&gt;<br>\nMakarius &lt;makarius@...&gt; writes:</p>\n<p>Makarius&gt; How about actually reading the \"system\" manual concerning<br>\nMakarius&gt; Isabelle components?</p>\n<p>I had done so.  I wouldn't presume to post here without doing so.<br>\nI should have mentioned this, sorry.</p>\n<p>I added the unzipped PG location to the $ISABELLE_HOME/etc/components<br>\nfile, as the system manual directed me.  It didn't change anything.</p>\n<p>Makarius&gt; Alternatively, you can get some additional explanations on the<br>\nMakarius&gt; parallel thread \"Isabelle 2014 and proof general\".</p>\n<p>Makarius&gt; I now regret that I made Proof General optional in<br>\nMakarius&gt; Isabelle2014.  It should have been deleted outright, without<br>\nMakarius&gt; further comments.</p>\n<p>Makarius&gt; Nonetheless, there is always the possibility to put genuine<br>\nMakarius&gt; reasons for remaining uses of Proof General on the table for<br>\nMakarius&gt; discussion, but excluding anything that is isomorphic to \"I<br>\nMakarius&gt; don't want to change my habits\".</p>\n<p>I have read that thread now, thanks.  I disagree with most of what you<br>\nsay there, but I can see there's no changing your position, so I will<br>\nresist the urge to jump in.</p>",
        "id": 294309102,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660925251
    },
    {
        "content": "<p>From: Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt;<br>\nThis strange game around Proof General is already quite old.  De-facto, I <br>\nam the only one who ever invested serious work in its Isabelle <br>\nconnectivity, and there were many calls to action to continue that by <br>\nsomeone else after the start of PIDE in 2007/2008.  Nothing has ever <br>\nhappened, though.  Proof General users are characterised by inactivity.</p>\n<p>To disprove that, are you willing to do anything yourself? Today it would <br>\nmean doing a few reforms in the Emacs LISP implementation to work directly <br>\nwith Isabelle process protocol functions, not the obsolete Isar TTY <br>\ntoplevel anymore.</p>\n<p>If there are no hard facts showing up to continue classic Proof General <br>\nIsabelle support one more season, it will be removed without further ado <br>\nin the next Isabelle release.</p>\n<p>Makarius</p>",
        "id": 294309125,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660925257
    },
    {
        "content": "<p>From: Ian Zimmerman &lt;<a href=\"mailto:itz@buug.org\">itz@buug.org</a>&gt;<br>\nMakarius &lt;makarius@...&gt; writes:</p>\n<p>Ian&gt; I have read that thread now, thanks.  I disagree with most of what<br>\nIan&gt; you say there, but I can see there's no changing your position, so<br>\nIan&gt; I will resist the urge to jump in.</p>\n<p>Makarius&gt; This strange game around Proof General is already quite old.<br>\nMakarius&gt; De-facto, I am the only one who ever invested serious work in<br>\nMakarius&gt; its Isabelle connectivity, and there were many calls to action<br>\nMakarius&gt; to continue that by someone else after the start of PIDE in<br>\nMakarius&gt; 2007/2008.  Nothing has ever happened, though.  Proof General<br>\nMakarius&gt; users are characterised by inactivity.</p>\n<p>I think what happened is that David A., the main PG developer, had a<br>\nconversion similar to yours (but in his case to eclipse rather than jedit).</p>\n<p>Makarius&gt; To disprove that, are you willing to do anything yourself?<br>\nMakarius&gt; Today it would mean doing a few reforms in the Emacs LISP<br>\nMakarius&gt; implementation to work directly with Isabelle process protocol<br>\nMakarius&gt; functions, not the obsolete Isar TTY toplevel anymore.</p>\n<p>I hope the \"today\" is not literal, but soon, Yes.  I am here to help.</p>\n<p>Makarius&gt; If there are no hard facts showing up to continue classic<br>\nMakarius&gt; Proof General Isabelle support one more season, it will be<br>\nMakarius&gt; removed without further ado in the next Isabelle release.</p>\n<p>By \"classic\" do you mean \"TTY\"?  So if the new work is successful PG<br>\nlives on?  Deal.  I have a reservation, though: will this fundamentally<br>\nchange the feel of Isabelle/PG?  For instance, will it now start working<br>\nmagically in the background instead of synchronously?</p>\n<p>Now to return to my immediate problem, after I register the PG<br>\ncomponent, do I still need the \"emacs\" script?  I think this might be<br>\nthe case from reading the other thread.  If yes this would be a handy<br>\nbit of information to put in the NEWS file.</p>",
        "id": 294309140,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660925263
    },
    {
        "content": "<p>From: Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt;<br>\nOn Sat, 13 Sep 2014, Ian Zimmerman wrote:</p>\n<blockquote>\n<p>Makarius&gt; To disprove that, are you willing to do anything yourself?<br>\nMakarius&gt; Today it would mean doing a few reforms in the Emacs LISP<br>\nMakarius&gt; implementation to work directly with Isabelle process protocol<br>\nMakarius&gt; functions, not the obsolete Isar TTY toplevel anymore.</p>\n<p>I hope the \"today\" is not literal, but soon, Yes.  I am here to help.</p>\n<p>Makarius&gt; If there are no hard facts showing up to continue classic<br>\nMakarius&gt; Proof General Isabelle support one more season, it will be<br>\nMakarius&gt; removed without further ado in the next Isabelle release.</p>\n<p>By \"classic\" do you mean \"TTY\"?</p>\n</blockquote>\n<p>Classic means the current \"optional\" Proof General component with its use <br>\nof the obsolete TTY loop.  That is in the way for a long time, and it is <br>\nabout to disappear soon.</p>\n<blockquote>\n<p>So if the new work is successful PG lives on?  Deal.</p>\n</blockquote>\n<p>I am not even required in that deal.</p>\n<p>The regular Isabelle process interface provides official ways to define <br>\nprotocol functions, and thus implement front-ends in user-space without <br>\nthe old TTY loop.  Thus it should be relatively easy to re-implement old <br>\nPG interaction, although the relative weak Emacs LISP infrastructure might <br>\nrequire some tricks to make it work.</p>\n<p>Anything else should be discussed on the <a href=\"mailto:proofgeneral-devel@inf.ed.ac.uk\">proofgeneral-devel@inf.ed.ac.uk</a></p>\n<blockquote>\n<p>For instance, will it now start working magically in the background <br>\ninstead of synchronously?</p>\n</blockquote>\n<p>It depends how this is done.  Nothing of that is hard-wired into Isabelle. <br>\nOld-fashioned synchronous interaction can be implemented independently of <br>\nthe PIDE interaction model.</p>\n<blockquote>\n<p>Now to return to my immediate problem, after I register the PG <br>\ncomponent, do I still need the \"emacs\" script?  I think this might be <br>\nthe case from reading the other thread.  If yes this would be a handy <br>\nbit of information to put in the NEWS file.</p>\n</blockquote>\n<p>The NEWS file provides all relevant entry points.  On the other thread, <br>\nLars Noschinski also provided concrete examples how to apply that <br>\ninformation in practice.</p>\n<p>Isabelle components are well-documented, although this knowledge is not <br>\nrequired by default for regular Isabelle releases.  In Isabelle2014 the <br>\ndefaults have been changed such that Proof General users have to stand up <br>\nand do some tiny bit of work by themselves, just as a symbolic gesture.</p>\n<p>Makarius</p>",
        "id": 294309164,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660925275
    },
    {
        "content": "<p>From: Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt;<br>\nI don't think that \"conversion\" is the right word.</p>\n<p>When we did Proof General many years ago, we were quite realistic about <br>\nthe side-conditions that Emacs would impose on the project.  There was <br>\nnever the idea that Emacs would be the best editor ever, so that it had to <br>\nbe used without question.  Rather, there was no alternative: Emacs was the <br>\nonly major editor at that time with arbitrary extensibility.</p>\n<p>So we knew already about the inherent limitations, and moving forwards was <br>\nnothing revolutionary.</p>\n<p>That is all long past ...</p>\n<p>Makarius</p>",
        "id": 294309189,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660925281
    },
    {
        "content": "<p>From: Ian Zimmerman &lt;<a href=\"mailto:itz@buug.org\">itz@buug.org</a>&gt;<br>\nMakarius &lt;makarius@...&gt; writes:</p>\n<p>Makarius&gt; The NEWS file provides all relevant entry points.</p>\n<p>I am sorry, but this is simply not true.  The crucial fact that the<br>\nnecessary script $ISABELLE_HOME/lib/Tools/emacs has been removed is not<br>\nmentioned.</p>\n<p>Thanks for your other information, it will be very helpful if / when I<br>\ntry to do the PG overhaul.  I understand now that you don't want to be<br>\ninvolved in any way, and I respect your reasons.</p>",
        "id": 294309242,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660925288
    }
]