[
    {
        "content": "<p>From: Lennart Beringer &lt;<a href=\"mailto:eberinge@CS.Princeton.EDU\">eberinge@CS.Princeton.EDU</a>&gt;<br>\n[Despite the focus on Coq, we're more than happy to have Isabelle users participate <br>\n in the summer school! -- Lennart.]</p>\n<p>The first DeepSpec Summer School on Verified Systems will be held in Philadelphia from July 17 to 28, 2017, preceded by an introductory Coq Intensive from July 13 to 15. </p>\n<p>Overview </p>\n<p>Can critical systems be built with no bugs whatsoever in hardware, operating systems, compilers, crypto, or other key components? It may seem a pipe dream, but in fact the past decade has seen explosive advances in the technology required to realize it. </p>\n<p>This summer school aims to give participants a wide-ranging overview of several ambitious projects currently underway in this space. </p>\n<p>Participants will complete the summer school with a thorough understanding of the conceptual underpinnings of these projects plus considerable hands-on experience with state-of-the-art tools for building verified systems. </p>\n<p>Dates </p>\n<p>The summer school will open with a three-day intensive course on Coq fundamentals, for participants who are new to Coq. The main lectures take place during the weeks of July 17 and 24. <br>\nJuly 13-15 (Thu-Sat)    Coq intensive <br>\nJuly 17-21  Week 1 <br>\nJuly 24-28  Week 2</p>\n<p>Lecturers and Topics </p>\n<p>Andrew Appel        Verified functional algorithms <br>\nAdam Chlipala       Program-specific proof automation <br>\nFrans Kaashoek &amp;<br>\n Nickolai Zeldovich Certifying software with crashes <br>\nXavier Leroy        The structure of a verified compiler <br>\nBenjamin Pierce     Property-based random testing with QuickChick <br>\nZhong Shao      CertiKOS: Certified kit operating systems <br>\nStephanie Weirich   Language specification and variable binding <br>\nSteve Zdancewic     Vellvm: Verifying the LLVM </p>\n<p>Prerequisites </p>\n<p>The DeepSpec summer school is aimed at a wide range of participants, including graduate students, academics, and industrial engineers and researchers. </p>\n<p>The Coq proof assistant will serve as a lingua franca for all the lectures. Participants who are not already familiar with Coq at the level of Software Foundations should plan on attending the Coq Intensive before the summer school. Costs and Financial Aid <br>\nThe total cost (for lectures, meals, and dormitory lodging) is expected to be roughly $2000 per participant. </p>\n<p>Substantial subsidies are available, courtesy of the NSF (thank you!), for students requiring financial assistance to attend. More details will be announced when applications open. </p>\n<p>Applications </p>\n<p>Applications will be accepted beginning on Jan 15; please subscribe to the DeepSpec mailing list to receive an announcement when applications open. Applications received by Feb 15 will be given equal consideration; applications received after Feb 15 will be considered on a space-available basis. </p>\n<hr>\n<p>deepspec mailing list<br>\n<a href=\"mailto:deepspec@lists.cs.princeton.edu\">deepspec@lists.cs.princeton.edu</a><br>\n<a href=\"https://lists.cs.princeton.edu/mailman/listinfo/deepspec\">https://lists.cs.princeton.edu/mailman/listinfo/deepspec</a></p>",
        "id": 294705015,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661180390
    }
]