[
    {
        "content": "<p>From: Michael Norrish &lt;<a href=\"mailto:Michael.Norrish@nicta.com.au\">Michael.Norrish@nicta.com.au</a>&gt;<br>\nThe comment is</p>\n<p>(*Substitute arguments for loose bound variables.<br>\n  Beta-reduction of arg(n-1)...arg0 into t replacing (Bound i) with (argi).<br>\n  Note that for ((%x y. c) a b), the bound vars in c are x=1 and y=0<br>\n        and the appropriate call is  subst_bounds([b,a], c) .<br>\n  Loose bound variables &gt;=n are reduced by \"n\" to<br>\n     compensate for the disappearance of lambdas.<br>\n*)</p>\n<p>The behaviour is to substitute the first term in the list for Bound 0, the second for Bound 1, etc.  This doesn't seem to be what the second line of the comment is implying.</p>\n<p>Behaviour is visible in</p>\n<p>ML {*<br>\n  Term.subst_bounds ([@{term \"x::'a\"}, @{term \"f::'a =&gt; 'b\"}], Bound 0 $ Bound 1)<br>\n*}</p>\n<p>which gives x $ f, rather than f $ x.</p>\n<p>Michael</p>\n<hr>\n<p>The information in this e-mail may be confidential and subject to legal professional privilege and/or copyright. National ICT Australia Limited accepts no liability for any damage caused by this email or its attachments.</p>",
        "id": 294658500,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661169026
    },
    {
        "content": "<p>From: Jasmin Blanchette &lt;<a href=\"mailto:jasmin.blanchette@inria.fr\">jasmin.blanchette@inria.fr</a>&gt;<br>\nI believe the comment is fine, or at least internally consistent. The second line does say \"replacing (Bound i) with (argi)\", which is what you found out too.</p>\n<p>The first half of line 2, about \"beta-reduction of arg(n-1)...arg0 into t\", did not immediately deliver its meaning to me, but the example \"subst_bounds([b,a], c)\" (with [b, a] and not [a, b]) illustrates what is meant. In your example, this means you must write</p>\n<p>Term.subst_bounds ([@{term \"f::'a =&gt; 'b\"}, @{term \"x::'a\"}], Bound 0 $ Bound 1)</p>\n<p>to obtain f $ x, which is consistent with the beta-reduction</p>\n<p>(%y g. g y) x f == f x</p>\n<p>i.e. the beta-redex has x f, the list argument to \"subst_bounds\" has [f, x] in reverse (cf. arg(n-1)...arg0).</p>\n<p>Jasmin</p>",
        "id": 294658513,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661169032
    },
    {
        "content": "<p>From: Michael Norrish &lt;<a href=\"mailto:Michael.Norrish@nicta.com.au\">Michael.Norrish@nicta.com.au</a>&gt;<br>\nRight, but why does it then list the args in the order</p>\n<p>arg(n-1), ... arg1, arg0</p>\n<p>?</p>\n<p>I read that as meaning that Bound 0 gets replaced with arg0, and that arg0 is the rightmost element of the list.</p>\n<p>If it makes sense to everyone else, I don't mind.</p>\n<p>Michael</p>\n<hr>\n<p>The information in this e-mail may be confidential and subject to legal professional privilege and/or copyright. National ICT Australia Limited accepts no liability for any damage caused by this email or its attachments.</p>",
        "id": 294658547,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661169045
    },
    {
        "content": "<p>From: Jasmin Blanchette &lt;<a href=\"mailto:jasmin.blanchette@inria.fr\">jasmin.blanchette@inria.fr</a>&gt;<br>\nWell, the input list is always [args0, ..., args(n-1)]. It's just the corresponding \"beta-reduction\" that takes the elements in reverse. This could be clearer, but when reading the text under the assumption that \"args0\" is the first element of the input list (which is reasonable), everything makes sense.</p>\n<p>I'm not sure I'd dare to touch any old Larry (?) documentation, but if anybody is willing to clarify the text, I certainly won't stop them. ;)</p>\n<p>Jasmin</p>",
        "id": 294658558,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661169051
    },
    {
        "content": "<p>From: Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt;<br>\nThese comments belong indeed to ancient tradition from Cambridge.  Over <br>\nthe years, we have fine-tuned many of them, and actually removed the <br>\nmajority -- because the informal text and the formal explanation in ML did <br>\nnot agree.</p>\n<p>Term.subst_bounds looks a bit old and confusing in various respects, but <br>\nit still has a correct reading in the historical context of term.ML, as <br>\nalready explained by Jasmin.</p>\n<p>In general, Isabelle sources are understood as follows (in that order):</p>\n<p>(1) reading the definition in ML</p>\n<p>(2) looking through typical uses in ML</p>\n<p>(3) peeking at the informal snippets around the formal text, without<br>\n       taking them too seriously</p>\n<p>Makarius</p>",
        "id": 294658565,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661169057
    },
    {
        "content": "<p>From: Till Mossakowski &lt;<a href=\"mailto:till@iws.cs.uni-magdeburg.de\">till@iws.cs.uni-magdeburg.de</a>&gt;<br>\nNote that good software engineering practices would imply the opposite <br>\norder.</p>\n<p>Best, Till</p>",
        "id": 294658581,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661169063
    },
    {
        "content": "<p>From: Lawrence Paulson &lt;<a href=\"mailto:lp15@cam.ac.uk\">lp15@cam.ac.uk</a>&gt;<br>\nAs the author of both the code and the comment, I can confirm that I always preferred to call this function with singleton lists.<br>\nLarry</p>",
        "id": 294658596,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661169069
    },
    {
        "content": "<p>From: Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt;<br>\nYes, this is what people sometimes say.  I am following that with some <br>\ninterest over 20 years, which some amusement about the fundamental <br>\ndivergence of theory and practice.</p>\n<p>Systems like Isabelle of approx. 30 years of history define their own <br>\nsingle-element category in this game.  It would be interesting to look <br>\nclosely how it was all done, to learn systematically both from the <br>\nsuccesses and mistakes.</p>\n<p>Apart from the Isabelle sources, I am routinely exposed to the JVM <br>\nsources, which are younger and less advanced in many respects.  Despite <br>\nthe relative success of the JVM platform, I see it as a counterexample in <br>\nsoftware engineering.</p>\n<p>A positive example is probably the Glasgow Haskell Compiler, see also <br>\n<a href=\"http://www.aosabook.org/en/ghc.html\">http://www.aosabook.org/en/ghc.html</a> -- although I have never looked at the <br>\nactual sources.</p>\n<p>Makarius</p>",
        "id": 294658626,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661169082
    },
    {
        "content": "<p>From: Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt;<br>\nThat is why I have called it old-fashioned: in present-day Isabelle, the <br>\ncanonical operations take only a single argument, and are then used with <br>\n\"fold\" or \"fold_rev\" for iteration. There is in fact the one-argument <br>\nTerm.subst_bound as well, although its signature is old-style and requires <br>\nan older fold combinator.</p>\n<p>The reason why these ancient and important term operations have not been <br>\nreformed significantly, is that they are ancient and important.  Certain <br>\ncritical operations depend on them.  Too much ambition is likely to cause <br>\nproblems.</p>\n<p>When they are touched again, one question would be if the (raise <br>\nSame.SAME) performance tuning is still relevant.  The current Poly/ML <br>\nruntime system might cope without, but it requires serious empirical <br>\nstudies.</p>\n<p>Makarius</p>",
        "id": 294658634,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661169088
    },
    {
        "content": "<p>From: Joachim Breitner &lt;<a href=\"mailto:breitner@kit.edu\">breitner@kit.edu</a>&gt;<br>\nHi,</p>\n<p>I have. The GHC sources are full of comments, and one of the main jobs<br>\nof Simon Peyton Jones these days seems to be to reply to people who<br>\nsubmit patches to fix bugs or implement new features: „More Notes!“</p>\n<p>The concept of Notes is worth describing: Simon has noticed that your<br>\ncode get harder to read if it is too cluttered by inline comments –<br>\nafter all, one huge benefit of functional code is its conciseness that<br>\nallows you to see more code at once.</p>\n<p>OTOH, such code, even if written carefully, often does not explain<br>\nitself fully, in particular its interaction with other parts of the<br>\nsystem. So the question arises, where to add this information? Inline<br>\ncomments are to be avoided if they are longer than a few words. But<br>\nstuff in wikis or user guides, or – worse – trac ticket, code reviews,<br>\nrandom READMES or mailing list, quickly goes out of sync with the code.</p>\n<p>So the solution is to have Notes, which are extended comments (from a<br>\nfew lines to several paragraphs), with examples, in the source file,<br>\nnot within the code in question, but near it (e.g. the bottom of the<br>\nfie). They are then referenced from all relevant positions in the code<br>\nwith, say \"See Note [Asymmetry of 'both' for DmdType and DmdResult]\".<br>\nThis alerts everyone who touches an affected function that there is<br>\nsomething non-trivial and non-obvious about the code.</p>\n<p>Also, whenever you make a small change to existing code, you are<br>\nencouraged to write a Note about it: Because if it were obvious, then<br>\nit would have been done like that in the first, place, wouldn’t it?</p>\n<p>A quick grep finds 1067 such Notes in GHC’s HEAD.</p>\n<p>It still happens that I submit a patch which I think is obvious, and<br>\nyet Simon asks me to write a Note, and indeed: Often it would not have<br>\nbeen obvious to me any more after a few months. So all in all, I am<br>\nquite fond of this approach, and GHC ability to still evolve and to<br>\ntake up new contributors shows its strength. But naturally, it needs to<br>\nbe taken serious, with new contributors trained to follow this style.</p>\n<p>Greetings,<br>\nJoachim<br>\n<a href=\"/user_uploads/14278/uq1dVGInfWuV_yZRFUn4xao2/signature.asc\">signature.asc</a></p>",
        "id": 294658648,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661169095
    }
]