[
    {
        "content": "<p>From: Lee Pike &lt;<a href=\"mailto:leepike@galois.com\">leepike@galois.com</a>&gt;<br>\n========================================================================<br>\n                         CALL FOR PARTICIPATION<br>\n========================================================================</p>\n<p>FMCAD 2008<br>\n  International Conference on Formal Methods in Computer-Aided Design<br>\n<a href=\"http://fmcad.org/2008\">http://fmcad.org/2008</a></p>\n<p>November 17-20, 2008<br>\n                   Embassy Suites Portland--Downtown<br>\n                            Portland, Oregon</p>\n<p>========================================================================</p>\n<p>Important Dates<br>\n===============<br>\n   Early Registration Deadline: October 14, 2008<br>\n   Hotel Registration Deadline: October 18, 2008</p>\n<p>Conference Overview<br>\n===================<br>\n   FMCAD 2008 is the eighth in a series of conferences on the theory<br>\n   and application of formal methods in hardware and system design and<br>\n   verification. In 2005, the bi-annual FMCAD and sister conference<br>\n   CHARME decided to merge to form an annual conference with a unified<br>\n   community. The resulting unified FMCAD provides a leading<br>\n   international forum to researchers and practitioners in academia and<br>\n   industry for presenting and discussing groundbreaking methods,<br>\n   technologies, theoretical results, and tools for formally reasoning<br>\n   about computing systems, as well as open challenges therein.</p>\n<p>Local Information<br>\n=================<br>\n   The Conference will be held at the Embassy Suites (Downtown) in<br>\n   Portland, Oregon.  We have negotiated a special rate with the hotel<br>\n   for conference attendees.  Please book early to secure the reduced<br>\n   rate.  For details, please see the conference web page.  A dinner<br>\n   cruise on the Willamette River is planned.</p>\n<p>Technical Program<br>\n=================<br>\n   The technical program is available at the conference web page.  It<br>\n   includes 2 invited keynotes, 4 invited tutorials, 24 regular papers,<br>\n   4 short papers, and 2 panels.</p>\n<p>Keynotes</p>\n<hr>\n<p>o Ken McMillan (Cadence): Interpolation -- Theory and Applications<br>\n   o Carl Seger (Intel): Formal Methods and Physical Design: Match Made<br>\n     in Heaven or Fools' Paradise?</p>\n<p>Tutorials</p>\n<hr>\n<p>o Kevin Jones (Rambus): Analog and Mixed Signal Verification: The<br>\n     State of the Art and some Open Problems<br>\n   o Moshe Levinger (IBM): Building a Bridge: From Pre-Silicon<br>\n     Verification to Post-Silicon Validation<br>\n   o Byron Cook (Microsoft): Computing Bounds on Space and Time for<br>\n     Hardware Compilation.<br>\n   o David Hardin (Rockwell Collins): Considerations in the Design and<br>\n     Verification of Microprocessors for Safety-Critical and<br>\n     Security-Critical Applications.</p>\n<p>Panels</p>\n<hr>\n<p>o High Level Design and ESL: Who Cares?<br>\n   o The Future of Formal: Academic, IC, EDA, and Software Perspectives</p>\n<p>Sponsors<br>\n========<br>\n          Sponsored by: IEEE CEDA<br>\n   In cooperation with: ACM SIGDA<br>\n     Financial support: Cadence, Galois, IBM, Intel, NEC, Synopsys</p>\n<p>========================================================================</p>",
        "id": 294066216,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660825509
    }
]