[
    {
        "content": "<p>From: Ken Kubota &lt;<a href=\"mailto:mail@kenkubota.de\">mail@kenkubota.de</a>&gt;<br>\nDear Members of the Research Community,</p>\n<p>After a very fruitful debate with Russell O'Connor (who provided the proof of <br>\nGoedel's First Incompleteness Theorem in Coq) I would like to correct and <br>\nupdate some of my earlier publications.</p>\n<p>Also, with the kind permission of Russell O'Connor, his definitions for <br>\ncarrying out Goedel's First Incompleteness Theorem in Peter B. Andrews' logic <br>\nQ0, an improved variant of Church's type theory, including a sample proof for a <br>\ncase of theorem V, are attached at the end of this e-mail. Andrews' logic Q0 is <br>\nspecified in [Andrews, 2002, pp. 210-215; Andrews, 1986, pp. 161-165]. A short <br>\ndescription is available online at [Andrews, 2014]:<br>\n<a href=\"http://plato.stanford.edu/archives/spr2014/entries/type-theory-church/#ForBasEqu\">http://plato.stanford.edu/archives/spr2014/entries/type-theory-church/#ForBasEqu</a></p>\n<p>Finally, a comparison of the proofs of Goedel's First Incompleteness Theorem by <br>\nRussell O'Connor (in Coq) and Lawrence C. Paulson (in Isabelle) is undertaken <br>\nin order to foster the understanding of the proof. The type system implemented <br>\nby O'Connor is particularly well suited for demonstrating the three different <br>\nlanguage levels in the proof.</p>\n<p>Kind regards,</p>\n<p>Ken Kubota</p>\n<p>I. Corrections</p>\n<ol>\n<li>\n<p>The critique of a presentation of Goedel's First Incompleteness Theorem in <br>\nmy 2013 article [Kubota, 2013] applies to that particular presentation only, <br>\nbut not to the original publication of Goedel's First Incompleteness Theorem <br>\n[Gödel, 1931]. Since the work with the criticized presentation is a standard <br>\nwork on higher-order logic, and the author of that work is usually extremely <br>\nprecise and accurate, I did not expect the criticized presentation to <br>\nsubstantially differ from Goedel's original proof.</p>\n</li>\n<li>\n<p>The hypothesis in my 2015 article [Kubota, 2015] that there is a significant <br>\ndifference in the results between axiomatic (Hilbert-style) deductive systems <br>\n(called \"object logics\" in the article) and natural deduction systems (called <br>\n\"meta-logics\" in the article) cannot be upheld.</p>\n</li>\n</ol>\n<p>In summary, although some presentations of Goedel's First Incompleteness <br>\nTheorem fail, this doesn't seem to apply to Goedel's original proof, nor does <br>\nit apply to the formalized (mechanized) proofs provided by Russell O'Connor (in <br>\nCoq) and others. The result of the formal proof can be interpreted in the sense <br>\nthat there is a formula (having the form of a sentence) that is neither <br>\nprovable nor refutable, but calling this \"incompleteness\" depends on a specific <br>\nphilosophical view, the semantic approach (model theory). If one doesn't share <br>\nthe semantic view, Goedel's theorem, although it seems formally correct, <br>\ndoesn't have the philosophical relevance often associated with it.</p>\n<p>II. Summary of the Proof</p>\n<ol>\n<li>Mathematical (formal) part</li>\n</ol>\n<p>a) Goedel begins with the introduction of a number of definitions supposed to <br>\nrepresent the form of a mathematical proof using mathematical (arithmetic) <br>\nmeans, up to the last definition \"Bew\" (for \"beweisbare Formel\", i.e., <br>\n\"provable formula\").</p>\n<p>b) In theorem V, Goedel shows that each relation R (with the property of being <br>\nprimitive recursive) is definable within the logistic system by syntactical <br>\nmeans (i.e., provability) only, in other words, for each R, there is an r (with <br>\nthe free variables u_1, ..., u_n), such that<br>\n    R(x_1, ..., x_n) -&gt; Bew(  Sb(r, u_1, Z(x_1), ..., u_n, Z(x_n))  )<br>\nwhere Z is the numeral function, which returns the number in the language of <br>\nthe embedded language when supplying a (natural) number of the logistic system <br>\nin which the proof is undertaken.<br>\nThe proof is of a rather technical nature and quite lengthy, and, <br>\nunfortunately, in his presentation Goedel only sketched the idea. For an <br>\nexample, see the attached presentation by Russell O'Connor.</p>\n<p>c) Newer presentations refer to a fixed-point theorem called the diagonal lemma <br>\n(or diagonalization lemma), which is rather implicit in Goedel's original <br>\nproof. It can be used to construe a formula with the form of a sentence (a <br>\nboolean-valued well-formed formula with no free variables) g of the embedded <br>\nlanguage, such that (simplified)<br>\n    ~Bew(g)<br>\nand<br>\n    ~Bew(not g).</p>\n<p>For an excellent introduction to the diagonal lemma, see [Raatikainen, 2015], <br>\navailable online at<br>\n<a href=\"http://plato.stanford.edu/archives/spr2015/entries/goedel-incompleteness/sup2.html\">http://plato.stanford.edu/archives/spr2015/entries/goedel-incompleteness/sup2.html</a></p>\n<p>In order to use the least amount of prerequisites, one may consider Goedel's <br>\nproof of the (simplified) formula<br>\n    ~Bew(g) /\\ ~Bew(not g)<br>\nas a purely formal proof, where the definition of \"Bew\" is simply an <br>\nabbreviation of a more complex number-theoretic well-formed formula.</p>\n<p>However, for establishing the philosophical meaning associated with Goedel's <br>\nFirst Incompleteness Theorem, namely incompleteness, two philosophical <br>\nassumptions are necessary.</p>\n<ol start=\"2\">\n<li>Philosophical part I: Correctness of definitions</li>\n</ol>\n<p>The first philosophical assumption is the correspondence of the definitions up <br>\nto \"Bew\" with the form of mathematical proofs. Although it is obvious that the <br>\ndefinitions do establish a proper representation of mathematical proofs, this <br>\nfact goes beyond the formal part. For example, a proof verification system (or <br>\nproof assistant) may prove<br>\n    ~Bew(g) /\\ ~Bew(not g)<br>\nas a formal theorem, showing that, given the definitions, this theorem can be <br>\nobtained. But the software does not verify whether the definitions actually <br>\nmatch the form of mathematical proofs; this task is left to the reader. Goedel <br>\nhimself emphasizes that the definability of (primitive) recursive relations in <br>\nthe system P is expressed by theorem V \"_without_ reference to any <br>\ninterpretation of the formulas of P\" [Gödel, 1931, p. 606, emphasis in the <br>\noriginal].</p>\n<p>Goedel speaks of yielding \"an isomorphic image of the system PM in the domain <br>\nof arithmetic, and all metamathematical arguments can just as well be carried <br>\nout in this isomorphic image.\" [Gödel, 1931, p. 597, fn. 9] The isomorphism <br>\nitself, however, can only be seen from top, from the meta-perspective, i.e., <br>\nfrom outside of the logistic system in which the proof is undertaken. A direct <br>\nreference of the formal system to its own propositions is not possible.</p>\n<p>Accordingly, O'Connor distinguishes between a Goedel quote function and a <br>\nGoedel numbering (or encoding) function, saying that propositions are \"opaque\". <br>\nThe Goedel numbering (or encoding) function \"G isn't a function from <br>\npropositions to natural numbers. It is supposed to be a function from <br>\n<em>syntactic</em> formulas to natural numbers and the type of syntactic formulas is <br>\ncompletely different from the type of propositions.  Computations over <br>\nsyntactic formulas can inspect the intension[al] structure of the formula, but <br>\npropositions are opaque and no such computation is possible.\" [Russell <br>\nO'Connor, e-mail to Ken Kubota, February 8, 2016]</p>\n<p>The same consideration was made by the author when mentioning the <br>\n\"non-definability of the Goedel encoding function\" previously at<br>\n<a href=\"https://lists.cam.ac.uk/pipermail/cl-isabelle-users/2016-January/msg00029.html\">https://lists.cam.ac.uk/pipermail/cl-isabelle-users/2016-January/msg00029.html</a></p>\n<p>By verifying the definitions (which is not a purely mathematical / formal task) <br>\none then can reasonably state that \"Bew\" can be interpreted as \"provable\", and <br>\nthat there is a formula with the form of a sentence (a proposition with no free <br>\nvariables) that is neither provable nor refutable.</p>\n<ol start=\"3\">\n<li>Philosophical part II: The semantic approach</li>\n</ol>\n<p>Assuming<br>\n    1. the correctness of the formal proof, and<br>\n    2. the correctness of the definitions,<br>\nthe result obtained so far is that a well-formed formula exists, or more <br>\nspecifically, a formula of the form of an arithmetic proposition exists, which <br>\ncan neither be proven nor refuted.</p>\n<p>Following the semantic approach, according to which meaning is obtained by an <br>\ninterpretation in some kind of meta-theory, either \"g\" or \"not g\" must be true, <br>\nhence there must be a true but unprovable theorem. This discrepancy between <br>\nsyntax (provability) and semantics (truth, meaning) is what is commonly called <br>\n\"incompleteness\".</p>\n<p>The implicit assumption made here and not discussed in the original publication <br>\nof Goedel's First Incompleteness Theorem in [Gödel, 1931] is the use of the <br>\nsemantic approach (also called model-theoretic approach). In his completeness <br>\nessay published a year earlier, Goedel already makes use of the model-theoretic <br>\napproach in which semantic evaluation is performed by substitution at a <br>\nmeta-level, without explicitly pointing out the use of a specific philosophical <br>\nassumption: \"A formula of this kind is said to be valid (tautological) if a <br>\ntrue proposition results from every substitution of specific propositions and <br>\nfunctions for X, Y, Z, ... and F(x), G(x,y), ..., respectively [...].\" [Gödel, <br>\n1930, p. 584, fn. 3]</p>\n<p>In order to speak of \"incompleteness\", an expectation of \"completeness\" is <br>\nnecessary, which is generally defined as the provability of all true <br>\npropositions. Hence, incompleteness is only possible if semantics (meaning) <br>\ndiffers from syntax, as is the case with model theory (the semantic approach).</p>\n<p>But the semantic approach itself is a specific philosophical view and not <br>\ninherent in mathematics. If one, like the author, does not share the semantic <br>\napproach, but a purely syntactic approach, such that meaning in mathematics is <br>\nobtained by syntactical inference only (and the few rules of inference have <br>\ntheir legitimation in philosophy, outside of formal logic and mathematics), <br>\nthen by definition there is no distinction between syntax and semantics.</p>\n<p>In summary, if one assumes the philosophical assumption of the semantic <br>\napproach, then there is mathematical (arithmetic) incompleteness. But if one <br>\ndoesn't, Goedel's First Incompleteness Theorem only shows that there is a <br>\nformula with the form of a well-formed (arithmetic) proposition which is <br>\nneither provable nor refutable, but may also be considered meaningless. Not <br>\nevery well-formed formula (proposition) necessarily has to have a meaning, if <br>\none doesn't follow the semantic approach. \"Mathematics is liquid\" is <br>\ngrammatically corre<br>\n[message truncated]</p>",
        "id": 294678625,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661175869
    }
]