[
    {
        "content": "<p>From: \"W.H. Billingsley\" &lt;<a href=\"mailto:whb21@cam.ac.uk\">whb21@cam.ac.uk</a>&gt;<br>\nHow long do you reckon it would take a novice first year undergraduate (no <br>\nsignificant programming or proving experience) to learn to use <br>\nIsabelle/Isar well enough to complete induction or case proofs on the <br>\nFibonacci sequence? For example, homework questions like Prove that \"fib(n </p>\n<ul>\n<li>k + 1) = fib(k + 1) * fib(n + 1) + fib(k) * fib(n)\"</li>\n</ul>\n<p>I've found a few courses in Isabelle/HOL that seem to be aimed at the <br>\npostgraduate/researcher level, in either 8 * 90 mins or 4*90 mins sessions, <br>\nbut I can't find much aimed at the first year level.</p>\n<p>Sorry to ask a straw poll on the list, but there doesn't appear to be any <br>\nliterature on this, and I'd like to get a rough idea.</p>\n<p>cheers,<br>\nWill.</p>",
        "id": 294046708,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660817572
    },
    {
        "content": "<p>From: Robert Lamar &lt;<a href=\"mailto:rlamar@stetson.edu\">rlamar@stetson.edu</a>&gt;<br>\nWill,</p>\n<p>W.H. Billingsley wrote:<br>\nJust last year, I was a fourth-year undergraduate performing a year-long<br>\ncapstone project for my BSc in mathematics at Stetson University in<br>\nDeLand, FL, USA.  A large portion of this project was figuring out how<br>\nto formalise a bit of ring theory in Isabelle/Isar.  If it is helpful,<br>\nyou may find the fruits of my labor at<br>\n<a href=\"http://www.macs.hw.ac.uk/~rob/docs/papers/rings.pdf\">http://www.macs.hw.ac.uk/~rob/docs/papers/rings.pdf</a> .</p>\n<p>The project was independent with weekly meetings with an adviser.<br>\nAccording to my memory, I started working through the Isabelle/HOL<br>\nsystem and reference manuals around the beginning of October 2005, and <br>\ndidn't really feel comfortable with the system until February 2006.  By <br>\nthe end of November 2005, I had gathered enough ability to make a <br>\nsemester's-end presentation to my department and compose a paper <br>\nsummarising my progress.</p>\n<p>If you are exploring the issues of a taught course for first-year<br>\nundergraduates, I would suspect that they could do simple things within<br>\n10 weeks.  It might take as long as 20 weeks for an average student to<br>\nbe proficient at the level you are suggesting.  The trouble is that I<br>\nleaned on much of my undergraduate coursework (in both mathematics and<br>\ncomputer science) in grasping the concepts from Isabelle, Higher-Order<br>\nlogic, and functional programming.  If a student comes to the course<br>\nwithout that preparation, it is hard for me to guess the speed at which<br>\nthey could move through the material.  Another concern is that they have <br>\nthe ability to do this sort of mathematics by hand.  If you can't write <br>\na proof for Theorem X in (say) English, you won't be able to prove it in <br>\nIsabelle.</p>\n<p>If I may suggest, there is one important thing which should be impressed<br>\nupon these students.  This is something I missed almost completely for<br>\nthe longest time, but which is being corrected now in my work as a PhD<br>\nstudent.  When one is trying to develop proofs in Isabelle and other<br>\nproof assistants, it is very desirable to model the proof structure upon<br>\nan existing, natural-language proof.  For one reason or another, I got<br>\nit into my head that it would be a good idea for my Isar proofs to have<br>\nsome semblance of originality.  Looking back, I see that this was only a<br>\nhindrance to me, and potentially harmful to the exercise itself:<br>\nFormalised mathematics is best when it has an obvious relationship with<br>\nthe original text.  The student of proof who can grasp this is likely to<br>\nhave a gentler experience.</p>\n<p>I wish you well in the development of this course.  I would be <br>\ninterested in seeing the plan of instruction at which you arrive.</p>\n<p>Robert Lamar</p>",
        "id": 294046890,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660817643
    },
    {
        "content": "<p>From: Lawrence Paulson &lt;<a href=\"mailto:lp15@cam.ac.uk\">lp15@cam.ac.uk</a>&gt;<br>\nYes yes yes! A machine proof is much easier if you already understand  <br>\nthe intuition behind the traditional proof.  It is a myth that  <br>\nmachine assistance can replace the need for competence and  <br>\nunderstanding. The machine magnifies competence, but it also  <br>\nmagnifies incompetence...</p>\n<p>Larry Paulson</p>",
        "id": 294046909,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660817655
    }
]