[
    {
        "content": "<p>From: Joachim Breitner &lt;<a href=\"mailto:breitner@kit.edu\">breitner@kit.edu</a>&gt;<br>\nHi,</p>\n<p>I’m not sure if this is an issue with jEdit or with Isabelle/jEdit, but<br>\nI find the default number of 100 undo steps very low, and I occasionally<br>\nlose work when some change turned out to be contraproductive and I want<br>\nto go back.</p>\n<p>Given the resource demands that Isabelle has anyways (16GB RAM was<br>\nsuggested recently, I think), I don’t believe that there is a problem<br>\nraising that limit by an order of magnitude or two.</p>\n<p>I know I can change it myself locally, but</p>\n<ul>\n<li>\n<p>when upgrading Isabelle my settings are lost, so unless I’m very <br>\n   careful I’ll be bitten by the problem at least once per release.</p>\n</li>\n<li>\n<p>other users might learn about the setting the hard way.</p>\n</li>\n</ul>\n<p>So I suggest to change the default as distributed with Isabelle.</p>\n<p>Thanks,<br>\nJoachim<br>\n<a href=\"/user_uploads/14278/OTtLLhJZQorXbjLPIu74rBGm/signature.asc\">signature.asc</a></p>",
        "id": 294307225,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660924718
    },
    {
        "content": "<p>From: bnord &lt;<a href=\"mailto:bnord01@gmail.com\">bnord01@gmail.com</a>&gt;<br>\nI wouldn't recommend using jEdit undo at all, you can't undo undos (as <br>\nin emacs) so you live with the illusion you can get back to previous <br>\nstates while a single edit after an undo can cut of arbitrary parts of <br>\nyour documents history.</p>",
        "id": 294307256,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660924727
    },
    {
        "content": "<p>From: Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt;<br>\nOn Tue, 30 Sep 2014, Joachim Breitner wrote:</p>\n<blockquote>\n<p>I’m not sure if this is an issue with jEdit or with Isabelle/jEdit, but <br>\nI find the default number of 100 undo steps very low, and I occasionally <br>\nlose work when some change turned out to be contraproductive and I want <br>\nto go back.</p>\n</blockquote>\n<p>I have never encountered this limit myself in 8 years of using jEdit as my <br>\nmain editor, as well as a few years of using Isabelle/jEdit as Prover IDE.</p>\n<p>After spending 5min with the sources and properties of jEdit, I now see <br>\nthat there is buffer.undoCount, which can be changed in Global Options / <br>\nEditing / Number of undos.  The change is made persistent in <br>\n$ISABELLE_HOME_USER/jedit/properties as usual.</p>\n<p>It is normal that personal properties accumulate, and require manual <br>\nmaintenance on Isabelle releases.  The main inconvenience here is the <br>\nerratic order of the lines in the file -- something that is worth <br>\nimproving and submitting to one of the trackers at <br>\n<a href=\"http://sourceforge.net/projects/jedit\">http://sourceforge.net/projects/jedit</a></p>\n<p>I could add more Isabelle/jEdit default changes to <br>\n$ISABELLE_HOME/src/Tools/jEdit/src/jEdit.props, but it needs a minimum <br>\nlevel of significance to diverge further from the defaults.</p>\n<blockquote>\n<p>Given the resource demands that Isabelle has anyways (16GB RAM was <br>\nsuggested recently, I think)</p>\n</blockquote>\n<p>There is a misunderstanding: Isabelle/jEdit resource requirements are not <br>\nvery special.  A small machine for small applications (4 GB RAM), a medium <br>\nmachine for medium applications (8 GB RAM), a slightly bigger machine for <br>\nbig applications (16 GB).  Really big machines by today's standards have <br>\n32-128 GB RAM.</p>\n<p>That may sound hilarious, but Proof General with XEmacs required much more <br>\nresources in relation to the hardware of its time.  When crafting <br>\nIsabelle/jEdit over so many years, I always kept an eye on current <br>\nconsumer hardware parameters.  One problem that I did not foresee is the <br>\ngeneral stagnation of the market: people don't upgrade their machines <br>\nanymore as they used to do in the past.</p>\n<blockquote>\n<p>I don’t believe that there is a problem raising that limit by an order <br>\nof magnitude or two.</p>\n</blockquote>\n<p>I don't know much about the jEdit undo manager, so I can't tell.  This <br>\ndiscussion is better moved to <br>\n<a href=\"http://sourceforge.net/p/jedit/mailman/jedit-devel\">http://sourceforge.net/p/jedit/mailman/jedit-devel</a></p>\n<p>So far I have been mostly alone on that mailing list to represent the <br>\nneeds of Isabelle/jEdit users.</p>\n<p>I need to emphasize once more that Isabelle/jEdit is not a fork of jEdit, <br>\nbut an application on top of it.  As much required changes as possible <br>\nshould be handed back to the main project, even though this is some extra <br>\nwork.</p>\n<p>Makarius</p>",
        "id": 294307269,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660924735
    },
    {
        "content": "<p>From: Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt;<br>\nUsing Emacs myself over 15 years, I never understood its way of undo or <br>\nundo-undo.</p>\n<p>jEdit is more standard in that sense: it follows customs from the <br>\n1980/1990-ies that are well-established in many applications.  There is <br>\nundo and redo to move in the history in the normal way. There might be <br>\nquestions how the graniularity of history steps is actually determined, <br>\nbut that is something for regular jEdit user channels.  Myself I just <br>\nadopted the mechanics of the existing editor in my editing -- as I did for <br>\nother editors in the past.</p>\n<p>How about someone opnening a question on stackoverflow with tag \"jedit\" <br>\n(not \"isabelle\")?  Or posting on some jedit mailing list?</p>\n<p>Makarius</p>",
        "id": 294307282,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660924741
    },
    {
        "content": "<p>From: bnord &lt;<a href=\"mailto:bnord01@gmail.com\">bnord01@gmail.com</a>&gt;<br>\njEdit:</p>\n<p>A -edit-&gt; B -edit-&gt; C -undo-&gt; B -edit-&gt; D -undo-&gt; B (*) -undo-&gt; A<br>\n(*) no way to get back to C from here</p>\n<p>emacs:</p>\n<p>A -edit-&gt; B -edit-&gt; C -undo-&gt; B -edit-&gt; D -undo-&gt; B -undo-&gt; C -undo-&gt; B <br>\n-undo-&gt; ...</p>\n<p>There is an edit stack with an undo pointer, each edit command sets the <br>\nundo pointer to the latest element except the undo command which is an <br>\nedit command that decrements the undo pointer and reverts the command <br>\npointed to by the undo pointer.</p>",
        "id": 294307357,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660924766
    },
    {
        "content": "<p>From: Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt;<br>\nI still don't quite understand the point. Is this now something for the <br>\nmailing list of jEdit or Emacs?</p>\n<p>Isabelle/jEdit is the second major prover front-end, after Proof General <br>\nEmacs, where I was also involved. The editor substrate at the bottom is <br>\ngiven as-is.  It has strengths and weaknesses. As an editor I've found <br>\njEdit more onvincing than Emacs, which is why I started this insane PIDE <br>\nproject, but PIDE is actually independent of editors.</p>\n<p>There are two main routes to go from here:</p>\n<p>* participate in improvements of jEdit on the jEdit mailing lists,<br>\n     trackers etc.</p>\n<p>* participate in other PIDE implementations, e.g. Isabelle/Eclipse.</p>\n<p>Makarius</p>",
        "id": 294307394,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660924778
    }
]