[
    {
        "content": "<p>From: Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt;<br>\nTypes Meeting 2013<br>\n                     Toulouse, 23-26 April 2013</p>\n<p><a href=\"http://www.irit.fr/TYPES2013/\">http://www.irit.fr/TYPES2013/</a></p>\n<p>SECOND CALL FOR CONTRIBUTIONS</p>\n<p>The 19th Conference \"Types for Proofs and Programs\" will take place in<br>\nToulouse, France, from 23 to 26 April 2013.</p>\n<p>The Types Meeting is a forum to present new and on-going work in all<br>\naspects of type theory and its applications, especially in formalized<br>\nand computer assisted reasoning and computer programming.</p>\n<p>Invited speakers:</p>\n<ul>\n<li>\n<p>Steve Awodey, Department of Philosophy, Carnegie Mellon University,<br>\nU.S.A.</p>\n</li>\n<li>\n<p>Lars Birkedal, Department of Computer Science, Aarhus University,<br>\nDenmark</p>\n</li>\n<li>\n<p>Ulrich Kohlenbach, Department of Mathematics, TU Darmstadt, Germany</p>\n</li>\n</ul>\n<p>We invite all researchers to contribute talks on subjects related to<br>\nthe Types area of interest. These include, but are not limited to:</p>\n<ul>\n<li>Foundations of type theory and constructive mathematics;</li>\n<li>Applications of type theory;</li>\n<li>Dependently typed programming;</li>\n<li>Industrial uses of type theory technology;</li>\n<li>Meta-theoretic studies of type systems;</li>\n<li>Proof assistants and proof technology;</li>\n<li>Automation in computer-assisted reasoning;</li>\n<li>Links between type theory and functional programming;</li>\n<li>Formalizing mathematics using type theory.</li>\n</ul>\n<p>We would like to especially encourage talks proposing new ways of<br>\napplying type theory.</p>\n<p>The talks may be based on newly published papers or work submitted for<br>\npublication, but also work in progress. There are no formal<br>\npre-proceedings, but we will make available the abstract book for the<br>\nconference.</p>\n<p>Meanwhile, post-proceedings are confirmed to appear in LIPIcs (Leibniz<br>\nInternational Proceedings in Informatics), Schloss Dagstuhl, see<br>\n<a href=\"http://www.dagstuhl.de/en/publications/lipics\">http://www.dagstuhl.de/en/publications/lipics</a><br>\n(the same publisher as for the last TYPES meeting in Bergen in 2011)<br>\nThere will be a separate call for papers, and participation in TYPES<br>\n2013 is no prerequisite for submission to the post-proceedings.</p>\n<p>TYPES 2013 is intended to be a conference in our traditional workshop<br>\nstyle. We expect submission of short abstracts that fit on one or two<br>\npages, presenting in sufficient detail the content of the talk and its<br>\nrelevance for TYPES, as judged by the program committee.</p>\n<p>Submission is exclusively admitted electronically, through the<br>\nEasyChair system. The submission site is<br>\n<a href=\"https://www.easychair.org/conferences/?conf=types2013\">https://www.easychair.org/conferences/?conf=types2013</a></p>\n<p>Deadline for proposing a contributed talk: Monday, February 25<br>\nThis means registering a submission to the EasyChair system, including<br>\na short text-only abstract, and submitting the PDF file of an abstract<br>\ntypeset in LaTeX that fits on one or two pages, conforming to the<br>\nEasyChair LaTeX class - for technical details, see the web page.<br>\n(In the first call for papers, there was a second, earlier deadline<br>\nfor registering the submission to EasyChair.)</p>\n<p>Notification of acceptance: Friday, March 8</p>\n<p>Deadline for final version of LaTeX sources for inclusion of the<br>\nabstract into the abstract book: Monday, April 1st</p>\n<p>The conference itself: Tuesday to Friday, April 23-26</p>\n<p>The venue: Toulouse in the South West of France is the fourth largest<br>\ncity of France and a lively university center with way over 100000<br>\nstudents. Toulouse offers numerous inexpensive accommodations,<br>\nincluding student residences.</p>\n<p>Thanks to our sponsors, notably Université Toulouse 1 Capitole,<br>\ngranting the lecture hall in the city center, and IRIT (Institut de<br>\nRecherche en Informatique de Toulouse) with financial support (other<br>\nsources pending), we will be able to keep the participation fee<br>\nmoderate. Moreover, we will operate a scheme of additional fee<br>\nreduction for master and PhD students (details will be given later on<br>\nthe web site).</p>\n<hr>\n<p>Satellite event: On Monday, April 22, the twelfth international<br>\nworkshop Proof, Computation, Complexity (PCC 2013) will be held<br>\non the campus of Toulouse Technical University.</p>\n<p>Abstract submission deadline: February 25<br>\nNotification of acceptance: March 8</p>\n<p>For the details, see <a href=\"http://www.irit.fr/TYPES2013/PCC2013/\">http://www.irit.fr/TYPES2013/PCC2013/</a></p>\n<hr>\n<p>Program Committee TYPES 2013</p>\n<p>José Espírito Santo, University of Minho, Braga, Portugal<br>\nHerman Geuvers, Radboud University Nijmegen, Netherlands<br>\nSilvia Ghilezan, University of Novi Sad, Serbia<br>\nHugo Herbelin, PPS, INRIA Rocquencourt-Paris, France<br>\nMartin Hofmann, Ludwig-Maximilians-Universität München, Germany<br>\nZhaohui Luo, Royal Holloway, University of London, UK<br>\nRalph Matthes, IRIT, CNRS and Univ. de Toulouse, France (co-chair)<br>\nMarino Miculan, University of Udine, Italy<br>\nBengt Nordström, Chalmers University of Technology, Göteborg, Sweden<br>\nErik Palmgren, Stockholm University, Sweden<br>\nAndy Pitts, University of Cambridge, UK<br>\nSergei Soloviev, IRIT, Univ. de Toulouse, France (co-chair)<br>\nPaweł Urzyczyn, University of Warsaw, Poland<br>\nTarmo Uustalu, Tallinn Technical University, Estonia</p>",
        "id": 294235864,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660904728
    }
]