[
    {
        "content": "<p>From: Tobias Nipkow &lt;<a href=\"mailto:nipkow@in.tum.de\">nipkow@in.tum.de</a>&gt;<br>\nA Meta-Model for the Isabelle API<br>\nFrédéric Tuong and Burkhart Wolff<br>\n<a href=\"http://afp.sourceforge.net/entries/Isabelle_Meta_Model.shtml\">http://afp.sourceforge.net/entries/Isabelle_Meta_Model.shtml</a></p>\n<p>We represent a theory of (a fragment of) Isabelle/HOL in Isabelle/HOL. The <br>\npurpose of this exercise is to write packages for domain-specific specifications <br>\nsuch as class models, B-machines, ..., and generally any languages that can be <br>\ndescribed with a sequence of datatypes in HOL itself; the Isabelle <br>\ncode-generator can then be used to generate tactic code.</p>\n<p>Consequently the package is geared towards parsing, printing and code-generation <br>\nto the Isabelle API. It is at the moment not sufficiently rich for doing meta <br>\ntheory on Isabelle itself. Extensions in this direction are possible though.</p>\n<p>Moreover, the chosen fragment is fairly rudimentary. However it should be easily <br>\nadapted to one's needs if a package is written on top of it. The supported API <br>\ncontains types, terms, transformation of global context like definitions and <br>\ndata-type declarations as well as infrastructure for Isar-setups.</p>\n<p>This theory is drawn from the Featherweight OCL project where it is used to <br>\nconstruct a package for object-oriented data-type theories generated from UML <br>\nclass diagrams. The Featherweight OCL, for example, allows for both the direct <br>\nexecution of compiled tactic code by the Isabelle API as well as the generation <br>\nof \".thy\"-files for debugging purposes.</p>\n<p>Gained experience from this project shows that the compiled code is sufficiently <br>\nefficient for practical purposes while being based on a formal \"model\" on which <br>\nproperties of the package can be proven such as termination of certain <br>\ntransformations, correctness, etc.</p>\n<p>Enjoy!<br>\n<a href=\"/user_uploads/14278/a9PMyj6sYOydgCWECuEw0wY9/smime.p7s\">smime.p7s</a></p>",
        "id": 294653786,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661167187
    }
]