[
    {
        "content": "<p>From: Alwen Tiu &lt;<a href=\"mailto:alwen.tiu@gmail.com\">alwen.tiu@gmail.com</a>&gt;<br>\nOne postdoc and two PhD positions are available at the School of Computer<br>\nEngineering, Nanyang Technological University (NTU)  Singapore.</p>\n<p>The postdocs and the PhDs positions are for a project on verification of<br>\nsecurity<br>\nprotocols funded by the Ministry of Education of Singapore. A particular<br>\nemphasis will be on designing and implementing decision procedures for<br>\nfinding attacks on protocols or producing formal proofs of their security.<br>\nWe will be using a mixture of process algebraic and logical frameworks to<br>\nexpress protocols and their properties.</p>\n<p>For the postdoc position:<br>\n=========================<br>\nCandidates must possess a PhD degree in Computer Science or related areas.<br>\nCandidates with strong backgrounds in process calculus, such as the<br>\npi-calculus and its variants, and/or formal logic and theorem proving are<br>\npreferred. For further details, including the salary range, please refer to<br>\nthe job ads at:</p>\n<p><a href=\"https://www.jobsbank.gov.sg/ICMSPortal/portlets/JobBankHandler/SearchDetail.do?id=JOB-2015-0238754\">https://www.jobsbank.gov.sg/ICMSPortal/portlets/JobBankHandler/SearchDetail.do?id=JOB-2015-0238754</a></p>\n<p>The position will be initially offered for one year, but can be extended up<br>\nto three years, subject to satisfactory performance and availability of<br>\nfunding.</p>\n<p>To apply for the position, please send a cover letter and your latest CV<br>\n(please indicate names of three referees in your CV) by email to Alwen Tiu (<br>\n<a href=\"mailto:atiu@ntu.edu.sg\">atiu@ntu.edu.sg</a>, <a href=\"mailto:alwen.tiu@gmail.com\">alwen.tiu@gmail.com</a>). Applications will be accepted until<br>\nthe position is filled, but to ensure the full consideration of your<br>\napplication, please send your application by 21 August 2015. Only<br>\nshortlisted candidates will be notified of the results of their<br>\napplications. The selected candidate is expected to commence in October<br>\n2015.</p>\n<p>For the PhD positions:<br>\n======================<br>\nplease send an email to Alwen Tiu (<a href=\"mailto:atiu@ntu.edu.sg\">atiu@ntu.edu.sg</a>) to express your<br>\ninterests. Please refer to the following website for application procedures<br>\nand requirements.</p>\n<p>For the intake of January 2016, applications must be received by 31 August<br>\n2015.</p>\n<p><a href=\"http://admissions.ntu.edu.sg/graduate/Pages/home.aspx\">http://admissions.ntu.edu.sg/graduate/Pages/home.aspx</a></p>\n<p>If you have any further questions, please contact <a href=\"mailto:atiu@ntu.edu.sg\">atiu@ntu.edu.sg</a>.</p>\n<p>Regards,<br>\nAlwen Tiu</p>",
        "id": 294647703,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661164771
    }
]