[
    {
        "content": "<p>From: Gudmund Grov &lt;<a href=\"mailto:ggrov@staffmail.ed.ac.uk\">ggrov@staffmail.ed.ac.uk</a>&gt;<br>\n<strong>*            Note: due to a clash with SEFM 2011,             </strong>*<br>\n<strong>* we have moved the competition to November 8-10 </strong>*</p>\n<p>VSTTE 2012 Verification Competition</p>\n<hr>\n<p>A software verification competition is organized on behalf of the<br>\nVSTTE 2012 conference (<a href=\"https://sites.google.com/site/vstte2012\">https://sites.google.com/site/vstte2012</a>).<br>\nThe purposes of this competition are: to help promote approaches and<br>\ntools, to provide new verification benchmarks, to stimulate further<br>\ndevelopment of verification techniques, and to have fun.</p>\n<p>The contest takes place during 48 hours, on 8-10 November 2011, two<br>\nmonths prior to the conference. Problems will be put on the website of<br>\nthe conference.  Solutions must be sent by email to the competition<br>\norganizers. Any programming language, specification language, and<br>\nverification tool is allowed.</p>\n<p>Problems</p>\n<hr>\n<p>There will be several, independent problems.  Each problem is<br>\npresented as a sequential algorithm, using English or pseudocode, and<br>\na list of properties to formally prove about it, also expressed in<br>\nplain English and standard mathematical notation. Participants have<br>\nliberty to implement the proposed algorithms in functional,<br>\nimperative, object-oriented, or any other programming style.</p>\n<p>Evaluation</p>\n<hr>\n<p>Submissions are ranked according to the total sum of points they<br>\nscore.  Each problem includes several sub-tasks, e.g. safety,<br>\ntermination, behavioral correctness, etc., and each sub-task is given<br>\na number of points.  While evaluating the submissions, judges take<br>\ninto account the accuracy and thoroughness of solutions as well as<br>\ntheir terseness and elegance.  (Clarity is more important than brevity.)<br>\nA certain degree of subjectivity is inevitable and should be<br>\nconsidered as part of the game.</p>\n<p>Participants</p>\n<hr>\n<p>Anybody interested can take part in the contest. Team work is allowed.<br>\nOnly teams up to 4 members are eligible for the first prize.<br>\nIndividual participants may belong to several teams.<br>\nHowever, the same solution cannot appear in different submissions.</p>\n<p>The technical requirements are as follows:</p>\n<ul>\n<li>access to the web to download the problems (PDF file);</li>\n<li>access to the email to submit the solutions;</li>\n<li>any software used in the solutions should be freely available for<br>\n noncommercial use to the public. This does not exclude closed source<br>\n programs (such as Microsoft's Z3). Software must be usable on an x86<br>\n Linux or Windows machine. Participants are authorized to modify<br>\n their tools during the competition.</li>\n</ul>\n<p>Submission</p>\n<hr>\n<p>A submission is a (possibly compressed) tarball that contains exactly<br>\none directory (named by the team, for instance). This directory should<br>\ncontain at least a text file named README, and one directory for each<br>\nproblem solved. Thus it must look like:</p>\n<p>team/ -+<br>\n         +- README<br>\n         +- problem1/<br>\n         +- problem2/</p>\n<p>+  ...<br>\n         +- problemN/<br>\n         +- other stuff...</p>\n<p>The README file should contain the following information:</p>\n<ul>\n<li>contact information (email);</li>\n<li>\n<p>detailed description of the submitted solutions: properties that<br>\n have been specified and/or proved, restrictions and/or<br>\n generalizations, anything that may facilitate the review;</p>\n</li>\n<li>\n<p>detailed instructions to replay the solutions, including the<br>\n software to use, URLs to get it from, compilation commands, etc.</p>\n</li>\n</ul>\n<p>Several solutions can be submitted for the same problem (for instance,<br>\nusing different tools). They should be stored in separate subdirectories<br>\nof problemI/. During evaluation, only the best-faring solution will be<br>\ntaken into account.</p>\n<p>Organizers</p>\n<hr>\n<ul>\n<li>Jean-Christophe Filliâtre (CNRS, France)</li>\n<li>Andrei Paskevich (Univ Paris Sud, France)</li>\n<li>Aaron Stump (University of Iowa, USA)</li>\n</ul>\n<p>Schedule</p>\n<hr>\n<p>Tuesday   8 Nov 2011, 15:00 UTC - competition starts<br>\n Thursday 10 Nov 2011, 15:00 UTC - competition stops</p>\n<p>Monday 12 Dec 2011 - the winner is notified<br>\n 28-29 Jan 2012 - results are announced at VSTTE 2012</p>\n<p>Prize</p>\n<hr>\n<p>The winner is awarded a talk slot at VSTTE 2012, to present any<br>\nresearch of his/her choice of interest for the VSTTE community. In<br>\nparticular, a presentation of solutions to the competition problems<br>\nand/or of the techniques and system used would be appreciated.</p>",
        "id": 294145760,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660847432
    }
]