[
    {
        "content": "<p>From: Christoph Sprenger &lt;<a href=\"mailto:sprenger@inf.ethz.ch\">sprenger@inf.ethz.ch</a>&gt;<br>\nOpen Position in Information Security at ETH Zurich on</p>\n<p>Formally Certified Secure Boot Processes</p>\n<p>The research group headed by Prof. David Basin at the Swiss Federal<br>\nInstitute of Technology, Zurich (ETH Zurich) has an open position for<br>\na PhD student or postdoctoral researcher. The position is within the<br>\nZurich Information Security Center (ZISC) and is in collaboration with<br>\nresearchers at the IBM Zurich Research Laboratory.</p>\n<p>The project addresses methods for the design, analysis, and<br>\ncertification of secure boot processes. In particular, we investigate<br>\nthe construction of abstract models from the boot code that are<br>\namenable to algorithmic verification techniques.  For this open<br>\nposition, we are looking for an enthusiastic student or researcher<br>\nwith a strong interest in formal methods, in particular abstraction<br>\ntechniques and model checking, and computer security. Additionally,<br>\nexperience with cryptographic coprocessors would be an asset.</p>\n<p>PhD students and postdoctoral researchers are paid employees of the<br>\nuniversity, and salary and employment conditions are attractive. The<br>\nPhD student employed will be given the opportunity to carry out a PhD<br>\nin Computer Science at ETH Zurich, on a topic related to the<br>\nproject. ETH Zurich regulations require doctoral students to hold a<br>\nMaster's or equivalent degree (e.g. Diplom).</p>\n<p>Zurich is a diverse and multicultural city which is consistently rated<br>\namong the best cities in the world in which to live. We favor the same<br>\nsort of diversity that defines Zurich's cultural makeup and encourage<br>\nanyone to apply with interest in formal methods and security, regardless<br>\nof where you are from.</p>\n<p>For further information please contact Christoph Sprenger at:</p>\n<p><a href=\"mailto:sprenger@inf.ethz.ch\">sprenger@inf.ethz.ch</a></p>\n<p>Applications should also be sent to Christoph Sprenger at the email<br>\naddress above.</p>\n<p>Applications should include a curriculum vitae, a brief description of<br>\nresearch interests, and, if possible, letters of recommendation from<br>\nteachers or employers.</p>",
        "id": 294091175,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660831901
    }
]