[
    {
        "content": "<p>From: \"M.M. Bonsangue\" &lt;<a href=\"mailto:marcello@liacs.nl\">marcello@liacs.nl</a>&gt;<br>\nApologies if you receive multiple copies of this message!</p>\n<p>===============================================================================</p>\n<p>CALL FOR TUTORIAL PAPERS</p>\n<p>4th International Symposium on                      1 - 4 November 2005<br>\nFormal Methods for Objects and Components                        CWI, Amsterdam<br>\n(FMCO 2005)                                                     The Netherlands</p>\n<p><a href=\"http://fmco.liacs.nl/fmco05.html\">http://fmco.liacs.nl/fmco05.html</a></p>\n<p>The FMCO symposium is an annual international event on the application and <br>\ndevelopment of formal methods in software engineering, with a special focus on <br>\ncomponent-based and object-oriented software systems. We invite submissions of <br>\ntutorial papers on topics that fit under that rubric. Suggested, but not <br>\nexclusive, topics of interest for submissions include: models and logics for <br>\nobject-oriented and component-based systems; formal aspects of analysis of <br>\nlarge systems; prediction, analysis and monitoring of extra-functional system <br>\nproperties; applications of modal logics, temporal logics, and model checking <br>\nfor the specification and verification of object-oriented languages; type <br>\nsystems and type theory for objects and components; probabilistic systems, <br>\nprocess calculi, and semantics of object and component oriented languages; <br>\nreasoning about security, trustworthiness and dependability of component-based <br>\nsystems.</p>\n<p>Important Dates</p>\n<hr>\n<p>Authors are invited to submit a title and a short abstract of one or two pages <br>\nproviding a tutorial perspective on research results or experiences related to <br>\nthe topics above.  Accepted abstracts will be presented at the symposium and <br>\nan extended tutorial paper of about 20 pages in LNCS style will be refereed  <br>\nand eventually published together with the contributions of the keynote <br>\nspeakers after the symposium, in a proceeding of Lecture Notes in Computer <br>\nScience by Springer-Verlag. Selected papers will be published in revised and <br>\nextended version in the Elsevier journal Theoretical Computer Science.</p>\n<p>Title and short abstract due:   5 Sep 2005  Tutorial paper due:     28 Feb 2006<br>\nAuthor notification:            1 Oct 2005  Author notification:    15 Apr 2006<br>\nSymposium:                    1-4 Nov 2005  Camera-ready paper due: 15 May 2006</p>\n<p>The short abstracts must be in English and provide sufficient details to allow <br>\nthe organizing committee and the advisory board to assess the merits of the <br>\nrelated tutorial papers. One author of each accepted abstract will be expected <br>\nto present the tutorial at the symposium. The tutorial papers must be <br>\nunpublished and not submitted for publication, but may contain previously <br>\npublished material. Short abstracts and tutorial papers must be submitted <br>\nelectronically to F.S. de Boer (<a href=\"mailto:frb@cwi.nl\">frb@cwi.nl</a>) or <br>\nM.M. Bonsangue (<a href=\"mailto:marcello@liacs.nl\">marcello@liacs.nl</a>).</p>\n<p>Format </p>\n<hr>\n<p>The symposium is a four days event organised to provide an atmosphere that <br>\nfosters collaborative work, discussions and interactions. Lectures are given <br>\nby the keynote speakers listed below and by authors of accepted abstract. </p>\n<p>Keynote speakers and advisory board</p>\n<hr>\n<p>Michael Barnett (Microsoft, USA)<br>\nLuis Caires (New University of Lisbon, PT)<br>\nPatrick Cousot (ENS, FR)<br>\nDennis Dams (Bell Labs, USA)<br>\nWan Fokkink (Free University, NL)<br>\nOrna Grumberg (Technion, ISR)<br>\nJoost-Pieter Katoen (RWTH Aachen, DE)<br>\nKung-Kiu Lau (University of Manchester, UK)<br>\nPeter O' Hearn (Queen Mary University of London, UK)<br>\nArnd Poetzsch-Heffter (University of Kaiserslautern, DE)<br>\nJohn Reynolds (Carnegie Mellon University, USA)<br>\nDavide Sangiorgi (University of Bologna, IT)</p>\n<p>Organizing committee </p>\n<hr>\n<p>F.S. de Boer (CWI and LIACS-Leiden University) <br>\nM.M. Bonsangue (LIACS-Leiden University) <br>\nS. Graf (Verimag) <br>\nW.-P. de Roever (Christian-Albrechts University of Kiel)</p>\n<p>Sponsorship</p>\n<hr>\n<p>The symposium is sponsored by NWO, KNAW, CWI, and LIACS. </p>\n<p>================================================================================<br>\n   For more information about the symposium see the FMCO site above or consult <br>\n     either F.S. de Boer (<a href=\"mailto:frb@cwi.nl\">frb@cwi.nl</a>) or M.M. Bonsangue (<a href=\"mailto:marcello@liacs.nl\">marcello@liacs.nl</a>).</p>",
        "id": 293896350,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660742813
    }
]