[
    {
        "content": "<p>From: <a href=\"mailto:Jeremy.Gibbons@comlab.ox.ac.uk\">Jeremy.Gibbons@comlab.ox.ac.uk</a><br>\nSPRING SCHOOL ON GENERIC AND INDEXED PROGRAMMING<br>\nWadham College, Oxford, 22nd to 26th March 2010</p>\n<p>TOPIC</p>\n<p>\"Generic programming\" is about making programs more widely applicable<br>\nvia exotic kinds of parametrization - not just along the dimensions of<br>\nvalues or of types, but of things such as the shape of data, algebraic<br>\nstructures, strategies, computational paradigms, and so on. \"Indexed<br>\nprogramming\" is a lightweight form of dependently typed programming,<br>\nconstraining flexibility by allowing one to state and check<br>\nrelationships between parameters: that the shapes of two arguments<br>\nagree, that an encoded value matches to some type, that values<br>\ntransmitted along a channel conforms to some protocol, and so on.</p>\n<p>The two forces of genericity and indexing balance each other nicely,<br>\nsimultaneously promoting and controlling generality.  The EPSRC-funded<br>\nGeneric and Indexed Programming project at Oxford has been exploring<br>\ntheir interaction over the period 2006 - 2010; this school is the<br>\nclosing activity of the project.</p>\n<p>LECTURERS</p>\n<p>Six lecturers from the Programming Languages community, each an<br>\nacknowledged expert in their specialism, will cover various aspects of<br>\ngeneric and indexed programming. Each will give about four hours'<br>\nlectures, distributed throughout the week.</p>\n<p>Nate Foster (Princeton University)<br>\n  \"Bidirectional Programming\"</p>\n<p>Ralf Hinze (University of Oxford)<br>\n  \"Generic Programming with Adjunctions\"</p>\n<p>Oleg Kiselyov (Fleet Numerical Meteorology and Oceanography Center)<br>\n  \"Typed Tagless Interpreters\"</p>\n<p>Simon Peyton Jones (Microsoft Research Cambridge)<br>\n  \"Type Functions\"</p>\n<p>Jeremy Siek (University of Colorado at Boulder)<br>\n  \"Concepts in C++\"</p>\n<p>Stephanie Weirich (University of Pennsylvania)<br>\n  \"Generic Programming with Dependent Types\"</p>\n<p>PREREQUISITES</p>\n<p>The school is aimed at doctoral students in programming languages and<br>\nrelated areas; however, researchers and practitioners will be very<br>\nwelcome, as will strong masters students with the support of a<br>\nsupervisor. It will be assumed that participants have a good<br>\nunderstanding of typed functional programming, as in Haskell or<br>\nO'Caml.</p>\n<p>DATES</p>\n<p>Registration deadline: 19th February<br>\nSchool:                22nd March (0900) to 26th March (lunchtime)</p>\n<p>VENUE</p>\n<p>Lectures will be held and accommodation provided in Wadham College in<br>\nthe centre of Oxford. The college celebrates its 400th anniversary in<br>\n2010; notable past members include Sir Christopher Wren, the founder<br>\nof the Royal Society, and notable present ones Marcus du Sautoy, the<br>\nmathematician and TV presenter.</p>\n<p>COSTS</p>\n<p>Costs will be kept low, thanks to support from EPSRC. There will be a<br>\nnominal registration fee, and B&amp;B accommodation in college will be<br>\nabout 55 per night. (Precise costs are yet to be determined.)</p>\n<p>FURTHER INFORMATION</p>\n<p>Further information, including instructions on how to register,<br>\nwill be available soon at the website:</p>\n<p><a href=\"http://www.comlab.ox.ac.uk/projects/gip/school.html\">http://www.comlab.ox.ac.uk/projects/gip/school.html</a></p>",
        "id": 294098427,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660833014
    }
]