[
    {
        "content": "<p>From: Jeremy Avigad &lt;<a href=\"mailto:avigad@cmu.edu\">avigad@cmu.edu</a>&gt;<br>\nFriends,</p>\n<p>As program committee co-chairs of Interactive Theorem Proving 2018, we<br>\nwould like to share the information below. We have also added it to the ITP<br>\nweb pages:</p>\n<p><a href=\"https://itp2018.inria.fr/venue/\">https://itp2018.inria.fr/venue/</a></p>\n<p>The FLoC web pages are here:</p>\n<p><a href=\"http://www.floc2018.org/\">http://www.floc2018.org/</a></p>\n<p>Best wishes,</p>\n<p>Jeremy Avigad and Assia Mahboubi</p>\n<hr>\n<p>FLoC’18 Travel Support<br>\nApplication Deadline: 18 May 2018</p>\n<p>Applicants will be informed of decision by 1 June 2018</p>\n<p>FLoC has some funds to provide travel grants of up to $1000 (USD) for<br>\nstudent attendees of FLoC’18. Funds can be requested to cover airfare and<br>\nlodging (registration fees and meals will not be funded). We expect to<br>\naward about 100 grants. The application deadline is May 18, 2018, and<br>\nrecipients will be notified by June 1.</p>\n<p>Funds will be provided after the conference, upon submission of receipts<br>\nand a short report detailing the student’s experience at and benefit from<br>\nFLoC’18 (these reports will be used to compile a final report to our<br>\nsponsors). Awardees are expected to spend up to one day during the meeting<br>\nhelping with logistics.</p>\n<p>Applicants’ advisors should send a brief statement certifying their<br>\neducational status and describing their financial need, and merits.</p>\n<p>Special efforts will be made to bring to FLoC students from<br>\nunder-represented groups. Applications must be received by the deadline.</p>\n<p>Applicants are required to apply using the following web form:<br>\n<a href=\"https://goo.gl/forms/5WyCcf6J5zVwoFwJ3\">https://goo.gl/forms/5WyCcf6J5zVwoFwJ3</a></p>\n<p>Advisor letters (plain text only) should be sent to <a href=\"mailto:floc18student@gmail.com\">floc18student@gmail.com</a><br>\nby May 18, 2018.</p>\n<p>If you have questions, please contact <a href=\"mailto:floc18student@gmail.com\">floc18student@gmail.com</a>.</p>",
        "id": 294729301,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661187456
    }
]