[
    {
        "content": "<p>From: Gerwin Klein &lt;<a href=\"mailto:Gerwin.Klein@nicta.com.au\">Gerwin.Klein@nicta.com.au</a>&gt;<br>\nFormal Specification of a Generic Separation Kernel</p>\n<p>Freek Verbeek         (Open University of The Netherlands)<br>\nSergey Tverdyshev     (SYSGO AG)<br>\nOto Havle             (SYSGO AG)<br>\nHolger Blasum         (SYSGO AG)<br>\nBruno Langenstein     (DFKI GmbH)<br>\nWerner Stephan        (DFKI GmbH)<br>\nYakoub Nemouchi       (University Paris Sud)<br>\nAbderrahmane Feliachi (University Paris Sud)<br>\nBurkhart Wolff        (University Paris Sud)<br>\nJulien Schmaltz       (Open University of The Netherlands)</p>\n<p>Abstract:<br>\nIntransitive noninterference has been a widely studied topic in the last few<br>\ndecades. Several well-established methodologies apply interactive theorem<br>\nproving to formulate a noninterference theorem over abstract academic models.<br>\nIn joint work with several industrial and academic partners throughout Europe,<br>\nwe are helping in the certification process of PikeOS, an industrial separation<br>\nkernel developed at SYSGO. In this process, established theories could not be<br>\napplied. We present a new generic model of separation kernels and a new theory<br>\nof intransitive noninterference. The model is rich in detail, making it suitable<br>\nfor formal verification of realistic and industrial systems such as PikeOS.<br>\nUsing a refinement-based theorem proving approach, we ensure that proofs remain<br>\nmanageable.</p>\n<p><a href=\"http://afp.sf.net/entries/CISC-Kernel.shtml\">http://afp.sf.net/entries/CISC-Kernel.shtml</a></p>\n<p>Enjoy!<br>\nGerwin</p>\n<hr>\n<p>The information in this e-mail may be confidential and subject to legal professional privilege and/or copyright. National ICT Australia Limited accepts no liability for any damage caused by this email or its attachments.</p>",
        "id": 294283216,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660921041
    }
]