[
    {
        "content": "<p>From: <a href=\"mailto:werner@lix.polytechnique.fr\">werner@lix.polytechnique.fr</a><br>\nDear Colleagues,</p>\n<p>We plan a workshop on the upcoming research field of interactions<br>\nbetween numerical computations and formal proofs. The workshop will<br>\ntake place over 1 and 1/2 days, on June 12th and 13th in Orsay; it will<br>\nfollow a more general seminar the 12th in the morning.</p>\n<p>We encourage you to participate and to present work on the topic. The<br>\naim is to bring together from different fields; please feel free to<br>\nforward this announcement to other possibly interested colleagues.</p>\n<p>More information is given below and can also be found on :</p>\n<p><a href=\"http://www-sop.inria.fr/marelle/Laurent.Thery/microsoft/Workshop%20on%20numbers%20and%20proofs.html\">http://www-sop.inria.fr/marelle/Laurent.Thery/microsoft/Workshop%20on%20numbers%20and%20proofs.html</a></p>\n<p>Given the short delay, the program will be established as propositions<br>\ncome in and the web-site will grow progressively.  We already plan<br>\ntalks about formal primality proofs, representation of numbers in type<br>\ntheory, formal real optimization, representation of arbitrary<br>\nprecision real numbers in Coq...</p>\n<p>The workshop will be supported by the EU TYPES project and the new<br>\njoint laboratory of INRIA and Microsoft Research. Members of TYPES can<br>\ntherefore use their TYPES money to fund their trip.</p>\n<p>Hoping to see many of you in Orsay,</p>\n<p>Benjamin Grégoire,<br>\nLaurent Théry,<br>\nBenjamin Werner</p>\n<hr>\n<p>TYPES Workshop on Numbers and Proofs<br>\n                                Orsay (France), June 12-13 2006</p>\n<p>Scope</p>\n<hr>\n<p>There is a growing trend of bringing together formal proofs and<br>\n efficient numerical computations.  On one hand, people working<br>\n designing efficient numerical libraries are more and more interested<br>\n by proving their correctness.</p>",
        "id": 293911675,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660747589
    }
]