[
    {
        "content": "<p>From: Florian Haftmann &lt;<a href=\"mailto:florian.haftmann@informatik.tu-muenchen.de\">florian.haftmann@informatik.tu-muenchen.de</a>&gt;<br>\nHi all,</p>\n<p>during some recent hobby work involving combinatorial coefficients, I<br>\nfound that a lot of relevant stuff is already present in Binomial.thy.<br>\nBut there are also some open questions / improvements here.</p>\n<ul>\n<li>\n<p>The theory name »Binomial« is very specific, and from and outside<br>\nperspective you would not expect falling factorial etc. residing there.<br>\nHow could we make this material more prominent? An extension / appendix<br>\nto »What's in Main«?</p>\n</li>\n<li>\n<p>There is the tendency to generalize combinatorial functions from<br>\nnatural numbers to suitable algebraic type classes, as e.g. for ‹fact›.<br>\nIn the case of the falling factorial, this leads to something having a<br>\ndedicated name in literature, the pochhammer symbol. However, if I as a<br>\ntheory writer was just looking for a vanilla falling factorial on the<br>\nnatural numbers (cf. the AFP entry on discrete summation), I would not<br>\nhave the idea for looking for »pochhammer«. Maybe an input abbreviation<br>\nwould make sense here?</p>\n</li>\n<li>\n<p>There are two different binomial coefficients formalized separately,<br>\nthe nat-based ‹binomial› and the generalized ‹gbinomial›. In the long<br>\nrun there should be only one generalized version.</p>\n</li>\n<li>\n<p>In Library/Stirling.thy there is a wonderful algorithm for computing<br>\nelements of a (Pascal, Stirling) triangle. Maybe it makes sense to be<br>\ngeneralized and used also here since it would avoid the big products<br>\nwhen computing binomial coefficients via factorials.</p>\n</li>\n<li>\n<p>In my eyes the existing infix syntax on binomial coefficients does not<br>\nmake much sense. Its precedence is the same addition, which means that<br>\nprecedence in ‹m choose n * q› is different from ‹m choose n + q›. It<br>\ndoes only meagrely improve readability, since the operation is usually<br>\nnot nested, there is no kind of associativity (as far as I know), it<br>\nuses letters rather than symbols, and »m choose n« is also customary<br>\nspelt as »n over m«.</p>\n</li>\n</ul>\n<p>So much to say about that.</p>\n<p>Cheers,<br>\n    Florian<br>\n<a href=\"/user_uploads/14278/m2bHI6M8gZVVmp1qel2_5PKO/signature.asc\">signature.asc</a></p>",
        "id": 294679676,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661176267
    }
]