[
    {
        "content": "<p>From: David Pichardie &lt;<a href=\"mailto:David.Pichardie@irisa.fr\">David.Pichardie@irisa.fr</a>&gt;<br>\nITP 2013: Fourth Conference on Interactive Theorem Proving</p>\n<p>Rennes, France, July 23 - 26, 2013<br>\n<a href=\"http://itp2013.inria.fr\">http://itp2013.inria.fr</a></p>\n<p>THE ITP CONFERENCE SERIES</p>\n<p>SCOPE AND ORGANIZATION OF WORKSHOPS</p>\n<p>The ITP conference series is concerned with all topics related to <br>\nInteractive Theorem Proving, ranging from theoretical foundations <br>\nto implementation aspects and applications in program verification, <br>\nsecurity, and formalization of mathematics.</p>\n<p>The fourth ITP conference, ITP 2013, will be held in Rennes, France,<br>\nbetween July 23th and July 26th, 2013.  </p>\n<p>Similar to previous iterations of the conference, researchers and <br>\npractitioners are invited to submit proposals for colocated <br>\nworkshops on topics relating to interactive theorem proving. Workshops <br>\ncan target the ITP community in general, focus on a <br>\nparticular ITP system, or highlight more specific issues or recent <br>\ndevelopments.Proposals for in-depth tutorials or tool introductions are<br>\nalso welcome.<br>\nAll colocated events will precede the main conference, and will be<br>\nheld in the Inria Rennes research center. Conference facilities <br>\n(meeting rooms, standard technical equipment) are offered free of<br>\ncharge to the organizers; workshop-only attendees will enjoy a <br>\nsignificantly reduced registration fee. Detailed organizational <br>\nmatters such as paper submission and review process, or publication <br>\nof proceedings, are up to the organizers of individual workshops.<br>\nAll accepted workshops will be expected to have the program ready by<br>\nMay 1st 2013.</p>\n<p>FORMAT OF PROPOSALS<br>\nProposals for workshops should contain at least the following pieces<br>\nof information.<br>\n• name and contact details of the main organizer(s)<br>\n• names of additional organizers (optional)<br>\n• title and organizational style of workshop (tutorial, public<br>\n  workshop, project workshop, etc)<br>\n• preferred length of workshop (half day, full day etc)<br>\n• estimated number of attendees<br>\n• short (up to 1 page) description of topic<br>\n• (if applicable) pointers to previous editions of the workshop, <br>\n  or to similar events</p>\n<p>SUBMISSION AND NOTIFICATION DETAILS<br>\nProposals are invited to be submitted by email to <a href=\"mailto:itp2013@easychair.org\">itp2013@easychair.org</a>, <br>\nno later than December 20th, 2012.<br>\nSelected workshops will be notified by January 9th, 2013.</p>",
        "id": 294226198,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660900100
    }
]