[
    {
        "content": "<p>From: Xiao Qu &lt;<a href=\"mailto:xiao.qu@us.abb.com\">xiao.qu@us.abb.com</a>&gt;<br>\nASE 2015 UPCOMING DATES:</p>\n<p>- Workshop Proposal: April 24<br>\n      - Research Paper (Abstract): May 8<br>\n      - Research Paper (Full): May 15</p>\n<p>=======================================================================<br>\nCALL FOR PAPERS<br>\nASE 2015 - 30th IEEE/ACM International Conference on Automated<br>\nSoftware Engineering</p>\n<p><a href=\"http://ase2015.unl.edu/\">http://ase2015.unl.edu/</a></p>\n<p>November 9-13, Lincoln, Nebraska, USA</p>\n<p>=======================================================================</p>\n<ul>\n<li>Conference * Tool Demos * Workshops * Tutorials * Doctoral Symposium<br>\n=======================================================================</li>\n</ul>\n<p>IMPORTANT DATES</p>\n<p>Abstract Submission: May 8, 2015<br>\nPaper Submission: May 15, 2015<br>\nNotification: July 20, 2015<br>\nCamera-Ready: August 4, 2015</p>\n<p>Workshop proposal submission: April 24, 2015<br>\nTutorial proposal submission: June 1, 2015<br>\nTool demonstration paper submission: July 23,2015<br>\nDoctoral symposium submission: June 26, 2015</p>\n<p>=======================================================================</p>\n<p>GENERAL THEME</p>\n<p>The IEEE/ACM Automated Software Engineering (ASE) Conference series is the<br>\npremier research forum for automated software engineering. Each year, it<br>\nbrings together researchers and practitioners from academia and industry<br>\nto discuss foundations, techniques and tools for automating the analysis,<br>\ndesign, implementation, testing, and maintenance of large software systems.<br>\nIn 2015, ASE will be celebrating its 30th year as a premier venue for novel<br>\nwork in software automation.</p>\n<p>=== CONFERENCE PAPERS ================================================</p>\n<p>ASE 2014 invites high quality contributions describing significant,<br>\noriginal, and unpublished results.</p>\n<p>Solicited topics include, but are not limited to:</p>\n<p>o Automated reasoning techniques<br>\no Open systems development<br>\no Component-based systems<br>\no Product line methods<br>\no Computer-supported cooperative work<br>\no Program understanding<br>\no Configuration management<br>\no Program synthesis<br>\no Data mining for software engineering<br>\no Program transformation<br>\no Domain modeling and meta-modeling<br>\no Re-engineering<br>\no Empirical software engineering<br>\no Requirements engineering<br>\no Human-computer interaction<br>\no Specification languages<br>\no Knowledge acquisition and management<br>\no Software analysis o Maintenance and evolution<br>\no Software architecture and design o Testing, verification,<br>\n and validation<br>\no Model-based software development<br>\no Software visualization<br>\no Model transformation<br>\no Model-driven engineering<br>\no Modeling language semantics</p>\n<p>Three categories of submissions are solicited:</p>\n<ol>\n<li>\n<p>Technical Research Papers should describe innovative research in<br>\nautomating software development activities or automated support to users<br>\nengaged in such activities. They should describe a novel contribution to<br>\nthe field and should carefully support claims of novelty with citations<br>\nto the relevant literature. Where a submission builds upon previous work<br>\nof the author(s), the novelty of the new contribution must be clearly<br>\ndescribed with respect to the previous work. Papers should also clearly<br>\ndiscuss how the results were validated.</p>\n</li>\n<li>\n<p>Experience Papers should describe a significant experience in applying<br>\nautomated software engineering technology and should carefully identify<br>\nand discuss important lessons learned so that other researchers and/or<br>\npractitioners can benefit from the experience. Of special interest are<br>\nexperience papers that report on industrial applications of automated<br>\nsoftware engineering.</p>\n</li>\n<li>\n<p>New Ideas Papers should describe novel research directions in<br>\nautomating software development activities or automated support to users<br>\nengaged in such activities. New ideas submissions are intended to<br>\ndescribe well- defined research ideas that are at an early stage of<br>\ninvestigation and may not be fully validated.</p>\n</li>\n</ol>\n<p>Submission:</p>\n<p>All submissions must come in PDF format and conform, at time of<br>\nsubmission, to the IEEE Formatting Guidelines. For details and<br>\ntemplates see:</p>\n<p><a href=\"http://www.ieee.org/conferences_events/conferences/publishing/templates.html\">http://www.ieee.org/conferences_events/conferences/publishing/templates.html</a></p>\n<p>Technical Research Papers and Experience Papers must not exceed 10<br>\npages (including figures and appendices) plus up to 2 pages that<br>\ncontain ONLY references. New Ideas Papers must not exceed 6 pages<br>\n(including figures, appendices AND references). Submissions that do<br>\nnot adhere to these limits or that violate the formatting guidelines<br>\nwill be desk-rejected without review. All submissions must be in<br>\nEnglish.</p>\n<p>Papers submitted to ASE 2015 must not have been previously published<br>\nand must not be under review for publication elsewhere. All papers<br>\nthat conform to submission guidelines will be peer-reviewed by members<br>\nof the Program Committee and members of the Expert Review Panel.<br>\nSubmissions will be evaluated on the basis of originality, soundness,<br>\nrelevance, importance of contribution, evaluation, quality of<br>\npresentation and appropriate comparison to related work. Note that<br>\nthe Program Committee may re-assign a submission into a different<br>\ncategory than the one it is submitted to if it decides that it is a<br>\nbetter fit for that category.</p>\n<p>Acceptance:</p>\n<p>All accepted papers will be published by IEEE, provided that at least<br>\none author of each accepted paper registers as a full registration for<br>\nthe conference and presents the paper. Failure to do so may result in<br>\nthe paper being pulled out of the Digital Library.</p>\n<p>Program Chairs:<br>\nLars Grunske, University of Stuttgart, Germany<br>\nMichael Whalen, University of Minnesota, USA</p>\n<p>=== TOOL DEMONSTRATIONS ==============================================</p>\n<p><a href=\"http://ase2015.unl.edu/#tab-demos\">http://ase2015.unl.edu/#tab-demos</a></p>\n<p>Automated software engineering consists of automating processes related<br>\nto requirements, design, implementation, testing, and maintenance of<br>\nsoftware systems. Automating these processes in the form of tools<br>\nfacilitates better productivity and improve the overall quality of software.<br>\nThe tool demonstrations track provides an opportunity for researchers and<br>\npractitioners to present and discuss their most recent advances,<br>\nexperiences, and challenges in the field of automated software engineering.</p>\n<p>ASE 2015 solicits high-quality submissions for its tool demonstrations<br>\ntrack. We invite submission on tools that are either (a) early research<br>\nprototypes or (b) mature tools, with a significant novel Improvement,<br>\nand that have not yet been commercialized. Submissions should highlight<br>\nthe underlying scientific contributions, engineering ingenuity,<br>\napplicability to a broader software engineering audience, and/or potential<br>\nfor or realization of scaling the tool. In contrast to a Technical Research<br>\ntrack paper intended to provide details of a novel automated software<br>\nengineering technique, a tool demonstration paper should indicate how the<br>\ntechnique has been implemented as a functioning tool and how that tool<br>\nshould be used by its intended audience. We encourage authors of papers<br>\nsubmitted to the Technical Research track to submit an accompanying tool<br>\ndemonstration paper.</p>\n<p>The tool demonstration program committee will review each submission to<br>\nassess the relevance and quality of the proposed tool demonstration<br>\nin terms of the usefulness of the tool, its ease of use by its intended<br>\nusers, its presentation quality, and a limited, but appropriate discussion<br>\nof related tools. Accepted tool demonstrations will be allocated 5 pages<br>\nin the conference proceedings: 4 pages for prose and up to one additional<br>\npage for references. Authors of accepted tool demonstrations papers<br>\nare required to give a presentation (read: live demo) of the tool during<br>\nthe conference.  There will also be an area open to attendees at scheduled<br>\ntimes during the conference during which demonstrators will also present<br>\ntheir work in an more informal manner.</p>\n<p>Tool Demonstration Co-Chairs:</p>\n<p>Andrew Begel, Microsoft Research, USA<br>\nAlessandra Gorla, IMDEA Software Institute, Spain</p>\n<p>=== WORKSHOPS ========================================================</p>\n<p><a href=\"http://ase2015.unl.edu/#tab-workshops\">http://ase2015.unl.edu/#tab-workshops</a></p>\n<p>A workshop co-located with the ASE 2015 conference should provide an<br>\nopportunity for exchanging views, advancing ideas, and discussing<br>\npreliminary results on topics related to Automated Software<br>\nEngineering. Workshops may also serve as platforms to nurture new<br>\nscientific communities. Workshops should not be seen as an alternative<br>\nforum for presenting full research papers. The workshops co-located<br>\nwith the conference will be organized before the main conference<br>\n(Monday, Tuesday). The organizers will decide the exact day after the<br>\nproposals have been reviewed and accepted. A workshop may last one or<br>\ntwo days.</p>\n<p>Workshop Co-Chairs:</p>\n<p>David Lo, Singapore Management University, Singapore<br>\nAnita Sarma, University of Nebraska—Lincoln, USA</p>\n<p>=== TUTORIALS ========================================================</p>\n<p><a href=\"http://ase2015.unl.edu/#tab-tutorials\">http://ase2015.unl.edu/#tab-tutorials</a></p>\n<p>Tutorials address a wide range of mature topics from theoretical<br>\nfoundations to practical techniques and tools for automated software<br>\nengineering. Tutorials are intended to provide independent instruction<br>\non a relevant theme; therefore, no commercial or sales-oriented<br>\nproposals will be accepted. The tutorials will be organized either on<br>\nthe Monday or Tuesday before the main conference. The general chair<br>\nand organizers will decide the exact dates after all proposals have<br>\nbeen reviewed and accepted.</p>\n<p>Tutorial Co-Chairs:</p>\n<p>Henry Muccini,University of L'Aquila, Italy<br>\nTien Nguyen, Iowa State University, USA</p>\n<p>=== DOCTORAL SYMPOSIUM ===============================================</p>\n<p><a href=\"http://ase2015.unl.edu/#tab-doctoral\">http://ase2015.unl.edu/#tab-doctoral</a></p>\n<p>The goal of the ASE 2015 Doctoral Symposium is to provide a supportive<br>\nyet questioning setting in which the PhD students have an opportunity<br>\nto present and discuss their research with other researchers in the<br>\nASE community. The symposium aims a<br>\n[message truncated]</p>",
        "id": 294634453,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661159573
    }
]