[
    {
        "content": "<p>From: Cas Cremers &lt;<a href=\"mailto:cas.cremers@inf.ethz.ch\">cas.cremers@inf.ethz.ch</a>&gt;<br>\nETH Zurich, Switzerland<br>\nOpen PhD and postdoc positions on formal methods and cryptographic<br>\nprotocols: security strengthening transformations</p>\n<p>The research group headed by Prof. David Basin at the Swiss Federal Institute<br>\nof Technology, Zurich (ETH Zurich) has two open positions for PhD students or<br>\npostdoctoral researchers.</p>\n<p>The project aims to develop security-strengthening transformations for<br>\ncryptographic protocols and provide both formal analysis methods as well as<br>\ncryptographic (indistinguishability-based) proof methods for establishing the<br>\ncorrectness of the transformations.  The research of one candidate will focus<br>\non the formal modeling and analysis of the transformations. The other<br>\ncandidate will focus on developing cryptographic proof methods for such<br>\ntransformations.</p>\n<p>For this project, we are looking for enthusiastic students or researchers with<br>\ninterests in the intersection of formal methods and cryptography. A background<br>\nin either formal methods or cryptographic proof methods for protocols would be<br>\nan asset.</p>\n<p>PhD students and postdoctoral researchers are paid employees of the university,<br>\nand salary and employment conditions are attractive. The PhD student employed<br>\nwill be given the opportunity to carry out a PhD in Computer Science at ETH<br>\nZurich, on a topic related to the project. ETH Zurich regulations require<br>\ndoctoral students to hold a Master's or equivalent degree (e.g. Diplom).</p>\n<p>Zurich is a diverse and multicultural city which is consistently rated among<br>\nthe best cities in the world in which to live. We favor the same sort of<br>\ndiversity that defines Zurich's cultural makeup and encourage anyone to apply<br>\nwith interest in formal methods and security, regardless of where you are from.</p>\n<p>For further information please contact Cas Cremers at:</p>\n<p><a href=\"mailto:cas.cremers@inf.ethz.ch\">cas.cremers@inf.ethz.ch</a></p>\n<p>Applications should also be sent to Cas Cremers at the email address above.</p>\n<p>Applications should include a curriculum vitae, a brief description of research<br>\ninterests, and, if possible, letters of recommendation from teachers or<br>\nemployers.</p>\n<p>The website of the Information Security Group can be found at<br>\n<a href=\"http://www.infsec.ethz.ch/\">http://www.infsec.ethz.ch/</a><br>\nand the open positions are described at<br>\n<a href=\"http://people.inf.ethz.ch/cremersc/open-positions.html\">http://people.inf.ethz.ch/cremersc/open-positions.html</a></p>",
        "id": 294093177,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660832523
    }
]