[
    {
        "content": "<p>From: \"Thiemann, Rene\" &lt;<a href=\"mailto:Rene.Thiemann@uibk.ac.at\">Rene.Thiemann@uibk.ac.at</a>&gt;<br>\nDear all,</p>\n<p>if you or your students want to know within an area related to Isabelle’s simplifier <br>\n— rewriting — then the following call for participation might be interesting.</p>\n<p>Cheers,<br>\nRené</p>\n<p>=====================================================================</p>\n<p>8th International School on Rewriting - ISR 2015<br>\nAugust 10-14, Leipzig, Germany</p>\n<p><a href=\"http://www.imn.htwk-leipzig.de/ISR2015/\">http://www.imn.htwk-leipzig.de/ISR2015/</a>   (+)</p>\n<ul>\n<li>early registration deadline: July 1</li>\n<li>student research posters welcome, deadline: June 21</li>\n</ul>\n<p>The program (see web site) contains pre-proceedings<br>\nwith extended course descriptions, including motivation,<br>\noutline, prerequisites, and example problems.</p>\n<p>(+) the URL might be rewritten to  nfa..., this is OK.</p>\n<p>=====================================================================</p>\n<p>The 8th International School on Rewriting (ISR 2015)<br>\nis aimed at master and PhD students, researchers, and practitioners<br>\ninterested in the study of rewriting concepts and their applications.</p>\n<p>The school features lectures by renowned researchers in rewriting,<br>\nand is organized in two parallel tracks:</p>\n<p>Basic: aimed at students that enter the field.</p>\n<p>Aart Middeldorp and Sarah Winkler: Introductory Course</p>\n<p>Advanced: several shorter courses, showing different areas<br>\nof rewriting research, with applications.</p>\n<p>David Sabel and Manfred Schmidt-Schauß:<br>\nRewriting Techniques for Correctness of Program Transformations<br>\nMakoto Hamana: Algebraic Semantics of Higher-Order Abstract Syntax<br>\nand Second-Order Rewriting<br>\nSantiago Escobar: Term Rewriting applied to<br>\nCryptographic Protocol Analysis<br>\nHans Zantema: SAT/SMT encodings for rewrite problems<br>\nFemke van Raamsdonk: Higher-Order Rewriting<br>\nAlfons Geser: Proving Abstract Rewriting Properties with PVS<br>\nGeorg Moser: Termination and Complexity<br>\nDetlef Plump: Rule-based Graph Programming</p>\n<p>Also, we encourage participants to submit a presentation of<br>\ntheir research, in the form of a poster. These posters will be reviewed<br>\nby experts in rewriting, and will be displayed and discussed during<br>\nthe school.</p>\n<p>====================================================================</p>\n<p>Rewriting is a branch of computer science whose origins go back<br>\nto the origins of computer science itself (with Thue, Church, Post,<br>\nand many other prominent researchers). It has strong links with<br>\nmathematics, algebra, and logic, and it is the basis of well-known<br>\nprogramming paradigms like functional and equational programming.<br>\nIn these programming paradigms and corresponding languages, the notions<br>\nof reduction, pattern matching, confluence, termination, strategy,<br>\netc., are essential. Rewriting provides a solid framework for<br>\nunderstanding, using, and teaching all these notions. Rewriting<br>\ntechniques are also used in many other areas of software engineering<br>\n(scripting, prototyping, automated transformation of legacy systems,<br>\nrefactoring, web services, etc.) Rewriting techniques play a relevant<br>\nrole in computing research, education, and industry.</p>\n<p>International Schools on Rewriting are promoted<br>\nby the IFIP Working Group 1.6 Term Rewriting.</p>\n<p>ISR 2015 organizing committee:<br>\nAlfons Geser, Christine Klöden, and Johannes Waldmann.</p>\n<p>====================================================================</p>\n<p>Note: ISR 2015 is right after CADE<br>\n( <br>\n<a href=\"http://www.inf.fu-berlin.de/cade25/\">http://www.inf.fu-berlin.de/cade25/</a><br>\n )<br>\nYou can go from Berlin to Leipzig in 1 hour by train.</p>",
        "id": 294644286,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661163398
    }
]