[
    {
        "content": "<p>From: Lucia Kapova &lt;<a href=\"mailto:kapova@ipd.uka.de\">kapova@ipd.uka.de</a>&gt;<br>\n***   Please accept our apologies should you receive multiple copies of <br>\nthis call from different lists.   ***</p>\n<p>2nd Call for Papers</p>\n<ul>\n<li>FESCA 2012 -</li>\n</ul>\n<p>9th International Workshop on<br>\nFormal Engineering approaches to Software Components and Architectures</p>\n<p>Satellite event of ETAPS<br>\nMarch 31st 2012, Tallinn, Estonia</p>\n<p><a href=\"http://fesca.ipd.kit.edu/fesca2012/\">http://fesca.ipd.kit.edu/fesca2012/</a></p>\n<p>WORKSHOP AIM</p>\n<p>Component-based software design has received considerable attention in <br>\nindustry and academia in the past decade. In recent years, the growing <br>\nneed for trustworthy software systems and the increased relevance of <br>\nsystems quality properties (e.g. reliability, performance, and <br>\nscalability) have stimulated the emergence of formal techniques and <br>\narchitecture modelling approaches for the specification and <br>\nimplementation of component-based software architectures. Both have to <br>\ndeal with an increasing complexity in software systems challenging <br>\nanalytical methods as well as modelling techniques.</p>\n<p>FESCA aims to address the open question of how formal methods can be <br>\napplied effectively to these new contexts and challenges. FESCA is <br>\ninterested in both the development and application of formal methods in <br>\ncomponent-based development and tries to cross-fertilize their research <br>\nand application.</p>\n<hr>\n<p>NEW: We are pleased to announce invited speaker:</p>\n<p>SAMUEL KOUNEV, chair of SPEC Research Group (RG) and  Descartes RG at <br>\nKarlsruhe Institute of Technology (Germany), has agreed to deliver the <br>\nFESCA 2012 keynote speech on the topic:<br>\n\"Modeling of Event-based Communication in Component-based <br>\nArchitectures:State-of-the-Art and Future Directions\"</p>\n<hr>\n<p>TOPICS</p>\n<p>One strength of FESCA is the link established between the formal methods <br>\ncommunity and the software engineering community by exploring how formal <br>\napproaches can be exploited for the analysis of large software <br>\narchitectures.</p>\n<p>We encourage submissions on formal techniques and their application that <br>\naid reasoning, analysis and certification of component-based <br>\napplications. In this context, the following topics are of particular <br>\nconcern:</p>\n<p>*   Architecture as a language: Building Domain-Specific Languages<br>\n      (DSLs)<br>\n          o Modelling formalisms for the analysis of concurrent, embeded<br>\n            or model-driven systems assembled of components;<br>\n          o Modelling formalisms in prediction, analysis and measurement<br>\n            of software quality attributes such as reliability,<br>\n            performance, or security;</p>\n<p>* Properties of component-based models<br>\n          o Temporal properties (including liveness and safety) and<br>\n            their formal verification;<br>\n          o Interface compliance (interface-to-interface and<br>\n            interface-to implementation) and contractual use of components;</p>\n<p>* Formal methods in Component-Based Software Development<br>\n          o Techniques for prediction and formal verification of system<br>\n            properties, including static and dynamic analysis;<br>\n          o Instrumentation and monitoring approaches, runtime<br>\n            management of applications;<br>\n          o (Semi-) automatic inference of analytical models for<br>\n            existing software systems;</p>\n<p>* Formal methods in Model-Driven Software Development<br>\n          o Abstraction level in modelling formalisms;<br>\n          o Safer MDA through integration with formal methods;<br>\n          o Correctness of model transformations;</p>\n<p>* Industrial case studies and experience reports.</p>\n<p>Submissions concentrating on specification techniques should involve an <br>\nevaluation of the practical merit of their research and clearly state <br>\nthe analysis and reasoning techniques they enable. We also appreciate <br>\nwork of a formal nature with immediate value to the industrial context. <br>\nWe encourage not only mature research results, submissions presenting <br>\ninnovative ideas and early results are also of interest.</p>\n<p>SUBMISSIONS</p>\n<p>Three kinds of submissions are considered:</p>\n<p>* Regular papers (up to 15 pages in ENTCS format), presenting<br>\n      original and unpublished work related to the workshop topics.</p>\n<p>* Position papers (up to 10 pages in ENTCS format) presenting ideas<br>\n      and directions of interesting ongoing and yet unpublished research<br>\n      related to the workshop topics.</p>\n<p>* Tool demonstration papers (up to 5 pages in ENTCS format),<br>\n      presenting and highlighting the distinguishing features of a<br>\n      topic-related tool (co-developed by the authors).</p>\n<p>PROCEEDINGS</p>\n<p>*   Regular and position papers will be published in a special issue<br>\n      of the Electronic Notes in Theoretical Computer Science (ENTCS)<br>\n      after the workshop.</p>\n<p>* All regular, position and tool demonstration papers will appear in<br>\n      electronic pre-proceedings distributed at the workshop.</p>\n<p>IMPORTANT DATES</p>\n<p>*     Paper registration: December 2, 2011<br>\n    *     Submission deadline: December 9, 2011<br>\n    *     Notification of acceptance: January 20, 2012<br>\n    *     Final versions due: February 3, 2012<br>\n    *     Workshop date:  March 31, 2012</p>\n<p>PROGRAMME COMMITTEE</p>\n<p>*      Ivana Cerna (Masaryk University, Czech Republic)<br>\n    *      Jens Happe (SAP Research, Germany)<br>\n    *      Ludovic Henrio (CNRS, France)<br>\n    *      Holger Hermanns (Universität des Saarlandes, Germany)<br>\n    *      Petr Hnetynka (Charles University in Prague, Czech Republic)<br>\n    *      Samuel Kounev (Karlsruhe Institute of Technology, Germany)<br>\n    *      Heiko Koziolek (ABB Research Ladenburg, Germany)<br>\n    *      Ralf Kuesters (Universität Trier, Germany)<br>\n    *      Markus Lumpe (Swinburne University of Technology, Australia)<br>\n    *      Raffaela Mirandola (Politecnico di Milano, Italy)<br>\n    *      Dorina Petriu (Carleton Univesity, USA)<br>\n    *      Ralf Reussner (Karlsruhe Institute of Technology, Germany)<br>\n    *      Cristina Seceleanu (Mälardalen University, Sweden)<br>\n    *      Steffen Zschaler (King's College London, UK)</p>\n<p>PC CO-CHAIRS</p>\n<p>*      Barbora Buhnova (Masaryk University, Czech Republic)<br>\n    *      Lucia Kapova (Karlsruhe Institute of Technology, Germany)<br>\n    *      Jan Kofron (Charles University in Prague, Czech Republic)</p>",
        "id": 294147434,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660848019
    }
]