[
    {
        "content": "<p>From: David MENTRÉ &lt;<a href=\"mailto:david.mentre@bentobako.org\">david.mentre@bentobako.org</a>&gt;<br>\nHello,</p>\n<p>My company, Mitsubishi Electric R&amp;D Centre Europe (MERCE), is opening a <br>\nnew permanent Researcher position in Formal Methods located in Rennes, <br>\nFrance.</p>\n<p>MERCE is part of Mitsubishi Electric Corporate R&amp;D and directly works <br>\nfor various research labs and business units of the group to fulfill <br>\ntheir needs in formal methods or popularize the use of formal methods. <br>\nWe work from first research ideas to production-ready tools.</p>\n<p>One core goal of our research is to acquire state-of-the-art in Formal <br>\nMethods (on all the various kinds of formal methods) and adapt and <br>\nenhance it to fulfill industrial needs of Mitsubishi Electric. We have <br>\nmany collaboration with academics through collaborative projects, PhD <br>\nco-advising or direct collaborations. We work on real, industrial <br>\nchallenges.</p>\n<p>Our research environment is obviously different from academic research <br>\nbut as we don't work directly for a business unit it is closer to <br>\nacademic research than business unit development. Rennes city is very <br>\nnice to live in. Our research team is small and growing in a cheerful <br>\nand open-minded work environment.</p>\n<p>You'll find a more detailed announce with details on how to apply here <br>\nin English:<br>\n<a href=\"http://www.fr.mitsubishielectric-rce.eu/images/fck_upload/1905_Annonce_INS_EN_072019_VF.pdf\">http://www.fr.mitsubishielectric-rce.eu/images/fck_upload/1905_Annonce_INS_EN_072019_VF.pdf</a><br>\nOr in French:<br>\n<a href=\"http://www.fr.mitsubishielectric-rce.eu/images/fck_upload/1905_Annonce_INS_FR_072019_VF.pdf\">http://www.fr.mitsubishielectric-rce.eu/images/fck_upload/1905_Annonce_INS_FR_072019_VF.pdf</a></p>\n<p>Fill free to forward this announce to friends or other relevant mailing <br>\nlists.</p>\n<p>Best regards,<br>\nD. Mentré</p>",
        "id": 294759198,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661198775
    }
]