[
    {
        "content": "<p>From: Andrei Popescu &lt;<a href=\"mailto:A.Popescu@mdx.ac.uk\">A.Popescu@mdx.ac.uk</a>&gt;<br>\nMiddlesex University London is offering a number of fully funded doctoral research studentships.<br>\nThese are three-year scholarships, covering a maintenance award and fee payments, currently £14,057 and £4,052 (UK/EU rate) respectively, including London weighting and free of tax and national insurance contributions. For more information on this program, please visit:</p>\n<p><a href=\"http://www.mdx.ac.uk/courses/postgraduate-research-degrees/research-studentships\">http://www.mdx.ac.uk/courses/postgraduate-research-degrees/research-studentships</a></p>\n<p>The Foundations of Computing group, part of the School of Science and Technology, is keen to support qualified candidates  (preferably with a master's degree in a relevant area) who are interested in applying for this program and who wish to pursue a PhD in areas such as</p>\n<ul>\n<li>software analysis</li>\n<li>theory of programming languages</li>\n<li>formal proofs</li>\n<li>program verification and model checking</li>\n<li>algorithms and complexity</li>\n<li>computational geometry</li>\n<li>quantum computing</li>\n</ul>\n<p>For more information on our group, please visit:</p>\n<p><a href=\"http://www.cs.mdx.ac.uk/foundations/\">http://www.cs.mdx.ac.uk/foundations/</a></p>\n<p>Interested candidates should initially contact one of the group members</p>\n<p><a href=\"http://www.cs.mdx.ac.uk/foundations/sample-page/\">http://www.cs.mdx.ac.uk/foundations/sample-page/</a></p>\n<p>as soon as possible to informally discuss a possible project (candidates are asked to submit a personal research statement as part of their application).</p>\n<p>For general inquiries, please contact Dr. Andrei Popescu at <a href=\"mailto:a.popescu@mdx.ac.uk\">a.popescu@mdx.ac.uk</a></p>\n<p>The formal deadline for applications is 5th of June but candidates should contact our group by 29th of May at latest.</p>\n<hr>\n<p>Please note that Middlesex University's preferred way of receiving all correspondence is via email in line with our Environmental Policy. All incoming post to Middlesex University is opened and scanned by our digital document handler, CDS, and then emailed to the recipient.</p>\n<p>If you do not want your correspondence to Middlesex University processed in this way please email the recipient directly. Parcels, couriered items and recorded delivery items will not be opened or scanned by CDS.  There are items which are \"exceptions\" which will be opened by CDS but will not be scanned a full list of these can be obtained by contacting the University.</p>",
        "id": 294640132,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661161753
    }
]