[
    {
        "content": "<p>From: Steve W &lt;<a href=\"mailto:s.wong.731@gmail.com\">s.wong.731@gmail.com</a>&gt;<br>\nHi again,</p>\n<p>Firstly, thanks for advising against using axioms. I understand the danger<br>\nof axiomatisation, but deriving everything from first principles isn't my<br>\ncurrent focus at the moment -- perhaps, I'll do that once the more urgent<br>\nstuff are sorted.</p>\n<p>That said, are these axioms inconsistent as well?</p>\n<p>axiomatization<br>\nS :: \"real set\" and<br>\nfoo :: \"real =&gt; real\" and<br>\nbar :: \"real =&gt; real\" and<br>\nbax :: \"real =&gt; real\"<br>\nwhere ax1: \"ALL f g. (ALL x y. x : S &amp; y : S --&gt; f x = g y) --&gt; f = g\"<br>\nand ax2: \"ALL x y. foo (bax x) = bar (bax y)\"<br>\nand ax3: \"ALL x. bax x : S\"</p>\n<p>lemma \"foo = bar\"<br>\nusing ax1 ax2 ax3</p>\n<p>Is that the reason why the lemma can't be proved? It's ok if ax2 was \"ALL x<br>\ny. foo x = bar y\", satisfying the antecedent of ax1. Is something more<br>\nneeded in order to prove \"foo = bar\"?</p>\n<p>Thanks again</p>\n<p>Steve</p>",
        "id": 294126417,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660841433
    },
    {
        "content": "<p>From: Thomas Sewell &lt;<a href=\"mailto:Thomas.Sewell@nicta.com.au\">Thomas.Sewell@nicta.com.au</a>&gt;<br>\nThe obvious way to prove that your axioms are consistent would be to present a model of them, that is, define some S, foo, bar, bax which satisfy this property. A quick glance suggests that S=UNIV and foo=bar ought to do the trick.</p>\n<p>Yours,<br>\n    Thomas.</p>",
        "id": 294126438,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660841439
    },
    {
        "content": "<p>From: Brian Huffman &lt;<a href=\"mailto:brianh@cs.pdx.edu\">brianh@cs.pdx.edu</a>&gt;<br>\nIndeed, these axioms are consistent because it is possible to find a<br>\nmodel. Furthermore, you can also show that \"foo = bar\" is unprovable<br>\nfrom these axioms, since it is possible to find a model where all<br>\naxioms are satisfied, but foo is not equal to bar:</p>\n<p>S = UNIV<br>\nfoo x = x<br>\nbar x = 2 * x<br>\nbax x = 0</p>\n<ul>\n<li>Brian</li>\n</ul>",
        "id": 294126475,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660841452
    },
    {
        "content": "<p>From: Stephan Merz &lt;<a href=\"mailto:Stephan.Merz@loria.fr\">Stephan.Merz@loria.fr</a>&gt;<br>\nAs others have pointed out, this set of axioms is consistent, and they don't imply your lemma. However, note that ax1 implies that S must be UNIV, and then ax1 is just equivalent to the extensionality theorem ext of HOL, and ax3 becomes trivial. (If S were different from UNIV, you could prove a contradiction by picking f and g such that they return a different result for some argument x that is not in S.)</p>\n<p>So unless this is just something you made up for the list and that is very different from your actual work, it doesn't look like the axiomatic approach is really much easier than defining things properly. And if your axioms are more complex, the danger of introducing inconsistencies is even greater.</p>\n<p>Stephan</p>",
        "id": 294126501,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660841462
    }
]