[
    {
        "content": "<p>From: Cas Cremers &lt;<a href=\"mailto:cremersc@inf.ethz.ch\">cremersc@inf.ethz.ch</a>&gt;<br>\nOPEN POSITIONS AT ETH ZURICH<br>\n           Automated Validation of Trust and Security<br>\n           of Service-oriented Architectures</p>\n<p>The research group headed by Prof. David Basin at the Swiss Federal<br>\nInstitute of Technology, Zurich (ETH Zurich) has two open positions.<br>\nThese positions can be filled either by PhD students, or a PhD student<br>\nand a Post-doctoral researcher (PostDoc).</p>\n<p>Our project will focus on the automated validation of trust and security<br>\nproperties of service oriented architectures. Hence we are looking for<br>\nenthusiastic young researchers with a strong interest in formal methods<br>\nand computer security. Additionally, experience in higher-order logic,<br>\ntheorem proving, or model checking would be an asset.</p>\n<p>The PhD students employed will be given the opportunity to carry out a<br>\nPhD in Computer Science at ETH Zurich, on a topic related to the<br>\nproject. ETH Zurich regulations require doctoral students to hold a<br>\nMaster's or equivalent degree (e.g. Diplom). PhD students are paid<br>\nemployees of the university, and salary and employment conditions are<br>\nattractive.</p>\n<p>Zurich is a diverse and multicultural city which is consistently rated<br>\namong the best cities in the world in which to live. We favor the same<br>\nsort of diversity that defines Zurich's cultural makeup and encourage<br>\nanyone to apply with interest in formal methods and security, regardless<br>\nof where you are from.</p>\n<p>For further information please contact Cas Cremers at:</p>\n<p><a href=\"mailto:cremersc@inf.ethz.ch\">cremersc@inf.ethz.ch</a></p>\n<p>Applications should be sent to Cas Cremers at the address above, and<br>\nalso to:</p>\n<p><a href=\"mailto:infsec.positions@lists.inf.ethz.ch\">infsec.positions@lists.inf.ethz.ch</a></p>\n<p>Applications should include a curriculum vitae, a brief description of<br>\nresearch interests, and, if possible, letters of recommendation from<br>\nteachers or employers.</p>",
        "id": 294051271,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660819576
    }
]