[
    {
        "content": "<p>From: Gottfried Barrow &lt;<a href=\"mailto:gottfried.barrow@gmx.com\">gottfried.barrow@gmx.com</a>&gt;<br>\nHi,</p>\n<p>I summarize my question first.</p>\n<p>I have two theorems, SigmaE_is_unique and SigmaE_is_unique2. In the <br>\nfirst, I end up with \"u\" as a universally quantified bound variable, <br>\nbecause that's how I specified it in the formula. In the second, I end <br>\nup with \"u\" as a schematic variable, because I left it as a free <br>\nvariable in the formula.</p>\n<p>Which of these do I want? This question also applies to my axiom Sigma_exA.</p>\n<p>I read this thread, \"Free variables vs schematic variables\":</p>\n<p><a href=\"https://lists.cam.ac.uk/mailman/htdig/cl-isabelle-users/2012-June/msg00048.html\">https://lists.cam.ac.uk/mailman/htdig/cl-isabelle-users/2012-June/msg00048.html</a></p>\n<p>I've also read this email, which is an aside:</p>\n<p><a href=\"https://lists.cam.ac.uk/mailman/htdig/cl-isabelle-users/2012-June/msg00172.html\">https://lists.cam.ac.uk/mailman/htdig/cl-isabelle-users/2012-June/msg00172.html</a></p>\n<p>The context of that thread was meta-logic, so when Makarius says, <br>\n\"Outermost quantifiers are circumvented... there is an explicit core <br>\ninference that removes the quantifiers and expresses the generality in <br>\nterms of schematic variables\", I conclude that he's talking about the <br>\n\\&lt;And&gt; quantifier. This is because I don't see any removal of \\&lt;forall&gt;.</p>\n<p>I do notice in proof steps and theorem results, that Isabelle may <br>\nrearrange a \\&lt;forall&gt; in a formula, such as taking  a \\&lt;forall&gt; to the <br>\noutside of some parentheses. That's fine with me.</p>\n<p>Here, I use my limited knowledge to determine the difference in my two <br>\ntheorems mentioned above. If all the variables in the theorem are bound, <br>\nthen the formula in the theorem will simply be used as a fact.</p>\n<p>If there are schematic variables in the theorem, then schematic <br>\nvariables will first be instantiated, and the instantiated formula of <br>\nthe theorem will be used as a fact.</p>\n<p>I don't know why I need variables  to be instantiated to make it more <br>\ngeneral, or whether I don't want variables to be instantiated so that <br>\nit's tighter.</p>\n<p>This also applies to my axiom Sigma_exA. I can strip out all the <br>\nuniversal quantifiers, and everything still works, but I end up with <br>\nschematic variables being used, as shown by \"thm show_info2\", although <br>\nit may be the proof step of show_info2 that's really a true reflection <br>\nof Sigma_EeA, in which the variables are still free.</p>\n<p>I attached the theory, where some names above are rough translations.</p>\n<p>Thanks,<br>\nGB<br>\n<a href=\"/user_uploads/14278/3vLGjhmGy9rl9BmZCgX2Iesp/sTs_.thy\">sTs_.thy</a></p>",
        "id": 294166071,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660854757
    },
    {
        "content": "<p>From: Gottfried Barrow &lt;<a href=\"mailto:gottfried.barrow@gmx.com\">gottfried.barrow@gmx.com</a>&gt;<br>\nThis reply to my email is a basic logic fix, in case it matters to someone.</p>\n<p>For my equality axiom, I was using something like this:</p>\n<p>(1) \"!u. !v. !x. ((x &lt;\\in&gt; u &lt;-&gt; x &lt;\\in&gt; v) --&gt; u=v)\",</p>\n<p>with a corresponding theorem like this:</p>\n<p>(2) \"!u. !x. (~(x \\&lt;in&gt; u)  --&gt;  u = Sigma_E)\".</p>\n<p>The textbook formula came to my mind, so I changed the axiom to:</p>\n<p>(3) \"!u. !v. ((!x.(x \\&lt;in&gt; u &lt;-&gt; x \\&lt;in&gt; v)) --&gt; u=v)\".</p>\n<p>Which then required a corresponding change to my theorem to not get an <br>\nerror:</p>\n<p>(4) \"!u. ((!x. ~(x \\&lt;in&gt; u))  --&gt;  u = Sigma_E)\".</p>\n<p>My questions about schematic vs. universal bound variables stay the same.</p>\n<p>Regards,<br>\nGB</p>",
        "id": 294166081,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660854763
    },
    {
        "content": "<p>From: John Wickerson &lt;<a href=\"mailto:jpw48@cam.ac.uk\">jpw48@cam.ac.uk</a>&gt;<br>\nI think you should state the theorem without the \\&lt;forall&gt;, because it makes it easier to use the theorem later on. For instance, you can say </p>\n<blockquote>\n<p>... using SigmaE_is_unique[of \"foo\"]...</p>\n</blockquote>\n<p>to obtain SigmaE_is_unique in the case when u is foo. You can't do this so easily when you have the \\&lt;forall&gt; there.</p>\n<p>john</p>",
        "id": 294166091,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660854769
    },
    {
        "content": "<p>From: Gottfried Barrow &lt;<a href=\"mailto:gottfried.barrow@gmx.com\">gottfried.barrow@gmx.com</a>&gt;<br>\nJohn,</p>\n<p>That sounds like it could be the biggest reason. I was only thinking <br>\nabout schematic variables being instantiated automatically. The idea of <br>\ncalling theorems like in a programming language hasn't occurred to me, <br>\nuntil now.</p>\n<p>So, I guess I want a schematic variable in a theorem when I know I'm <br>\ngoing to want to instantiate it manually. However, I now have the <br>\nquestion of whether automatic proof methods need the schematic variables <br>\nso that they can instantiate them.</p>\n<p>It's my healthy paranoia kicking in here. I'm using axioms, so I'm <br>\ntrying to use everything I know right now to keep from being inconsistent.</p>\n<p>Another question I would have for a person is whether I'm protected in <br>\nany way by making a variable bound so that it doesn't become a schematic <br>\nvariable.</p>\n<p>Thanks,<br>\nGB</p>",
        "id": 294166117,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660854781
    },
    {
        "content": "<p>From: Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt;<br>\nThe best way is not to use axioms then.  In mathematics you define new <br>\nthings by using old ones, and then prove the desired properties. <br>\nSometimes you work with abstract theories, but that corresponds to a <br>\nlocale or class definition in Isabelle/HOL, not axiomatization.</p>\n<p>Makarius</p>",
        "id": 294216787,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660895321
    },
    {
        "content": "<p>From: Gottfried Barrow &lt;<a href=\"mailto:gottfried.barrow@gmx.com\">gottfried.barrow@gmx.com</a>&gt;<br>\nI'll try to make a short sales speech here to spin the pro-axiom side of <br>\nthings.</p>\n<p>Suppose there are 10 standard axioms for a language of FOL that have <br>\nheld up for many years. Then there's no more risk in using those axioms <br>\nthan there's ever been.</p>\n<p>Suppose a person implements those axioms on top of Isabelle/HOL with a <br>\nslight modification, and others build a lot of standard math on top of <br>\nthose axioms, and no inconsistency shows up.</p>\n<p>The scenario I just described would be completely beneficial to <br>\nIsabelle/HOL as a product. What's done as HOL is just HOL, where HOL is <br>\nobviously very useful. But if HOL is used as a meta-language to <br>\nimplement another standard logic on top of it, in a way that's <br>\nreasonably pure, which might require axioms to do, then that's something <br>\ndifferent.</p>\n<p>I'm interested in certain non-applied math, but with Isabelle I take the <br>\nattitude that all math implemented in Isabelle is applied math, with the <br>\napplication being the attempt to find out how powerful Isabelle is. If <br>\nno one successfully uses axioms on top of Isabelle/HOL, then that <br>\npotential power of Isabelle/HOL never gets demonstrated.</p>\n<p>Church's logic was shown to be inconsistent. The possibility of that <br>\nhappening is all part of the game.</p>\n<p>Giving opinions. That's the easy part.</p>\n<p>Regards,<br>\nGB</p>",
        "id": 294216843,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660895358
    },
    {
        "content": "<p>From: Christian Sternagel &lt;<a href=\"mailto:c-sterna@jaist.ac.jp\">c-sterna@jaist.ac.jp</a>&gt;<br>\nWhat you describe is all possible without using axioms (which are <br>\nusually just used to initially set up a logic like HOL in Isabelle). <br>\nJust use a locale that has all your \"axioms\" as assumptions and inside <br>\nthis locale you can work as if you had introduced the axioms. However, <br>\nyou avoid the risk of anything outside the locale being effected. E.g., <br>\nwhen adding inconsistent axioms to HOL the combination is just <br>\ninconsistent (and because of this risk I would not build on any theory <br>\nwith \"unnecessary\" axioms). Defining a locale with inconsistent <br>\nassumptions just means that the locale itself is useless but does not <br>\neffect the whole logic.</p>\n<p>The bottom line: avoid using axioms (as long as you are not setting up a <br>\nnew object logic for Isabelle).</p>\n<p>On 07/22/2012 03:29 PM, Gottfried Barrow wrote:</p>\n<blockquote>\n<p>On 7/21/2012 1:32 PM, Makarius wrote:</p>\n<blockquote>\n<p>On Wed, 18 Jul 2012, Gottfried Barrow wrote:</p>\n<blockquote>\n<p>It's my healthy paranoia kicking in here. I'm using axioms, so I'm<br>\ntrying to use everything I know right now to keep from being<br>\ninconsistent.</p>\n</blockquote>\n<p>The best way is not to use axioms then. In mathematics you define new<br>\nthings by using old ones, and then prove the desired properties.<br>\nSometimes you work with abstract theories, but that corresponds to a<br>\nlocale or class definition in Isabelle/HOL, not axiomatization.</p>\n</blockquote>\n<p>I'll try to make a short sales speech here to spin the pro-axiom side of<br>\nthings.</p>\n<p>Suppose there are 10 standard axioms for a language of FOL that have<br>\nheld up for many years. Then there's no more risk in using those axioms<br>\nthan there's ever been.<br>\nRight, but combining those axioms with others (say those of HOL) is a risk.</p>\n<p>Suppose a person implements those axioms on top of Isabelle/HOL with a<br>\nslight modification, and others build a lot of standard math on top of<br>\nthose axioms, and no inconsistency shows up.<br>\nThis sounds all very risky ;) \"a person\" (as in <em>a single</em> person), <br>\n\"slight modification\", \"no inconsistency shows up\".</p>\n<p>The scenario I just described would be completely beneficial to<br>\nIsabelle/HOL as a product. What's done as HOL is just HOL, where HOL is<br>\nobviously very useful. But if HOL is used as a meta-language to<br>\nimplement another standard logic on top of it, in a way that's<br>\nreasonably pure, which might require axioms to do, then that's something<br>\ndifferent.<br>\nWhat you describe is not using HOL as a meta-language to reason about <br>\nanother standard logic (which is a reasonable thing to do), but <br>\nextending HOL itself by additional axioms (which I would consider risky).</p>\n</blockquote>\n<p>If you use HOL to reason about another logic, you will <em>define</em> (not <br>\naxiomatize) the formulas of this logic as HOL-type and also define its <br>\nsemantics by HOL-functions. In that way you can talk <em>about</em> the other <br>\nlogic <em>in</em> HOL.</p>\n<p>just my 2 cents,</p>\n<p>chris</p>",
        "id": 294216856,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660895370
    },
    {
        "content": "<p>From: Gottfried Barrow &lt;<a href=\"mailto:gottfried.barrow@gmx.com\">gottfried.barrow@gmx.com</a>&gt;<br>\nOn 7/22/2012 3:19 AM, Christian Sternagel wrote:</p>\n<blockquote>\n<p>What you describe is all possible without using axioms (which are<br>\nusually just used to initially set up a logic like HOL in Isabelle).<br>\nJust use a locale that has all your \"axioms\" as assumptions and inside<br>\nthis locale you can work as if you had introduced the axioms.</p>\n</blockquote>\n<p>Christian, I'd be more than happy to take a disciplined approached, but <br>\nhow is it possible for a beginner to take a disciplined approach and <br>\ndevelop what normally should be developed by an advanced user? It's not.</p>\n<p>However, I don't want anyone to consider me as complaining about <br>\nIsabelle, because I've ceased to have any complaints about it. There are <br>\nno problems with Isabelle. There are only workarounds, and I can't think <br>\nof any significant workaround that I'm having to resort to yet.</p>\n<p>I'm also more than happy to be told two things by experts: that a <br>\ncertain thing has been proved to be wrong or impossible, or that a <br>\nparticular way is the right way to do something.</p>\n<p>You tell me locales is what I want, and I listen to you, and I make it <br>\nmy goal to learn how to use locales in place of axioms. But I search on <br>\n\"locale\" in prog-prove.pdf and in tutorial.pdf and it doesn't show up. I <br>\nopen up locales.pdf, which is 20 pages long, and I briefly look at it. I <br>\nconclude, locales is m number of months down the road.</p>\n<p>You say, \"Don't use the GOTO statement.\" I say, \"Okay, then be my <br>\npersonal tutor, and give me what will take me months to learn on my <br>\nown.\" You say, \"I'm a busy person, and everyone has to largely learn <br>\nthis on their own.\" I say, \"I understand that, but I'm going to use the <br>\nGOTO statement until I learn a better way.\"</p>\n<p>I go on at length below, but I take your advice. If you hadn't told me <br>\nexplicitly that locales is what I really want, then I wouldn't know <br>\ntoday that locales is the goal I'm supposed to shoot for.</p>\n<blockquote>\n<p>However,<br>\nyou avoid the risk of anything outside the locale being effected. E.g.,<br>\nwhen adding inconsistent axioms to HOL the combination is just<br>\ninconsistent (and because of this risk I would not build on any theory<br>\nwith \"unnecessary\" axioms). Defining a locale with inconsistent<br>\nassumptions just means that the locale itself is useless but does not<br>\neffect the whole logic.</p>\n</blockquote>\n<p>Now we're in the territory that what's important to two different people <br>\ndoesn't necessarily intersect.</p>\n<p>You care that your theories don't make Isabelle/HOL inconsistent, and I <br>\nwant you to care about that because I would hate for you to give me a <br>\nHOL product that would allow me to prove everything.</p>\n<p>Today, right now, I only care about a particular language of FOL that I <br>\nwant to \"put on top\" of HOL with some minimal number of HOL functions <br>\nthat are required to make it practical.</p>\n<p>If I introduce inconsistency (not because of combining HOL axioms with <br>\nmine), what difference does it make if I mess up a locale or all of <br>\nIsabelle/HOL? I'm not bummed that I messed up HOL. I'm bummed that my <br>\naxioms didn't work out.</p>\n<p>In fact, it's possible that the best way for me to look for flawed logic <br>\nfast is to use axioms, where \"fast\" is a synonym for Sledgehammer and <br>\nNitpick. I wait to say more about that below.</p>\n<blockquote>\n<blockquote>\n<p>Suppose there are 10 standard axioms for a language of FOL that have<br>\nheld up for many years. Then there's no more risk in using those axioms<br>\nthan there's ever been.</p>\n</blockquote>\n</blockquote>\n<blockquote>\n<p>Right, but combining those axioms with others (say those of HOL) is a risk.</p>\n</blockquote>\n<p>That idea has occurred to me some. The m number of HOL axioms haven't <br>\nbeen shown to be inconsistent, and my desired 10 axioms haven't been <br>\nshown to be inconsistent. I talk about FOL on top of HOL, but I know <br>\nthat it's really a logic 10 + m axioms, so the question becomes, \"Has <br>\nanyone proved that the 10 + m axioms together are inconsistent?\"</p>\n<p>If you tell me the answer is yes, then I listen to you because you have <br>\ngood credentials. If you tell me, \"I don't even know what your 10 <br>\nspecific axioms are\", then I say, \"He didn't say yes, the 10 + m axioms <br>\nare inconsistent, so I'll take that as meaning no one knows\".</p>\n<blockquote>\n<blockquote>\n<p>The scenario I just described would be completely beneficial to<br>\nIsabelle/HOL as a product. What's done as HOL is just HOL, where HOL is<br>\nobviously very useful. But if HOL is used as a meta-language to<br>\nimplement another standard logic on top of it, in a way that's<br>\nreasonably pure, which might require axioms to do, then that's something<br>\ndifferent.</p>\n</blockquote>\n</blockquote>\n<blockquote>\n<p>What you describe is not using HOL as a meta-language to reason about<br>\nanother standard logic (which is a reasonable thing to do), but<br>\nextending HOL itself by additional axioms (which I would consider risky).</p>\n</blockquote>\n<p>Okay, but it seems to me there's a meta-something in there. HOL is the <br>\nlanguage that I use to implement another language, and I hide as much as <br>\npossible that HOL is the primary foundation. If nobody imports my theory <br>\nwith the additional axioms, then the standard Isabelle/HOL distribution <br>\nis completely unchanged.</p>\n<p>Larry set up Pure so that it's the meta-logic that's used to create the <br>\nobject-logic HOL. HOL uses axioms. If HOL is built on Pure with axioms, <br>\nthen why shouldn't I add axioms to HOL to get what I want?</p>\n<p>Well, I shouldn't; that's what we're discussing. But now we're back into <br>\nend goals and purpose. For your purposes, no axiom should ever be added <br>\nto HOL. For my purposes, there is a seed that's been planted which gives <br>\nme the thought that I may want axioms in spite of being able to use <br>\nlocales for the same purpose.</p>\n<p>If an expert gives me the right information, I stop thinking that way.</p>\n<p>To make a long story short, if I give Sledgehammer a theorem that's only <br>\nHOL, and HOL is consistent, then Sledgehammer can only prove that the <br>\ntheorem is true or that its negation is false. But if I give <br>\nSledgehammer a theorem that's built on axioms, and my axioms are time <br>\ntested axioms, but yet they are inconsistent, but yet not because of <br>\ntheir combination with the HOL axioms, then Sledgehammer will try all <br>\nsorts of unnatural combinations that a human would never try, with the <br>\npossible result that both the theorem and its negation is proved true.</p>\n<p>Similarly, Nitpick might prove both the theorem and its negation false. <br>\nNow, because at least one of the axioms is \"polluted\" with a little bit <br>\nof HOL, then I have to work really hard to show that the inconsistency <br>\nis not because of that, but I might want that challenge.</p>\n<p>I've already learned things that I wouldn't have learned if I wouldn't <br>\nhave been using axioms.</p>\n<p>Here, I point out that anything I've said above could be totally flawed. <br>\nHowever, good things can come out of clueless people using software in <br>\nunorthodox ways that initially appall the developers.</p>\n<blockquote>\n<p>If you use HOL to reason about another logic, you will <em>define</em> (not<br>\naxiomatize) the formulas of this logic as HOL-type and also define its<br>\nsemantics by HOL-functions. In that way you can talk <em>about</em> the other<br>\nlogic <em>in</em> HOL.</p>\n<p>just my 2 cents,</p>\n<p>chris</p>\n</blockquote>\n<p>And so your 2 cents is very valuable due to the exchange rate between my <br>\neconomy of the beginner and your economy of the expert.</p>\n<p>Let's say that due to the weakness of my beginner's economy, 2 cents in <br>\nyour economy of the expert is worth at least $150 in my economy. I make <br>\nthat estimate because I figure you could charge $150 an hour working in <br>\nU.S. industry as a consultant, maybe more or maybe less, not that a <br>\nprice can really be put on the value of information provided by an <br>\nexpert, because it generally takes a person years to obtain expert <br>\nknowledge.</p>\n<p>So now, you talk about not merely \"using a logic\" but \"reasoning about a <br>\nlogic\". You should understand that a formal, mathematics education <br>\ngenerally only gives a person the bare minimum to \"use a logic\".</p>\n<p>DeMorgan's laws, the equivalence (A --&gt; B)==(~A \\/ B), how to negate <br>\nstatements with quantifiers, proof by induction, proof by contradiction <br>\nand little bit more is about all you're taught and all you need to do <br>\ntypical math. The math gets complicated, but the logic never does, so I <br>\nthink \"reasoning about logic\" will be m+n number of months down the road <br>\nfor me. But I set \"reasoning about another logic\" as another goal to <br>\nachieve based on your advice.</p>\n<p>Regards,<br>\nGB</p>",
        "id": 294216894,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660895401
    },
    {
        "content": "<p>From: Gottfried Barrow &lt;<a href=\"mailto:gottfried.barrow@gmx.com\">gottfried.barrow@gmx.com</a>&gt;<br>\nI read my emails over and over again before I send them out, but I still <br>\nend up having to clutter up the list with two emails instead of one to <br>\nclarify something.</p>\n<p>Sledgehammer proves things true. Nitpick proves things false. Like I <br>\nsaid, negative logic can mess me up in the most simple ways.</p>\n<p>Explicitly correcting what I said, if a logic is consistent, then <br>\nSledgehammer can prove a theorem true or proves its negation true, but <br>\nnot both.</p>\n<p>Regards,<br>\nGB</p>",
        "id": 294216943,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660895406
    },
    {
        "content": "<p>From: Christian Sternagel &lt;<a href=\"mailto:c-sterna@jaist.ac.jp\">c-sterna@jaist.ac.jp</a>&gt;<br>\nDear Gottfried,</p>\n<p>On 07/23/2012 12:57 AM, Gottfried Barrow wrote:</p>\n<blockquote>\n<p>You say, \"Don't use the GOTO statement.\" I say, \"Okay, then be my<br>\npersonal tutor, and give me what will take me months to learn on my<br>\nown.\" You say, \"I'm a busy person, and everyone has to largely learn<br>\nthis on their own.\" I say, \"I understand that, but I'm going to use the<br>\nGOTO statement until I learn a better way.\"<br>\nUnderstandable ;)</p>\n</blockquote>\n<blockquote>\n<p>I go on at length below, but I take your advice. If you hadn't told me<br>\nexplicitly that locales is what I really want, then I wouldn't know<br>\ntoday that locales is the goal I'm supposed to shoot for.<br>\nMaybe I should put my claim into perspective: I <em>think</em> locales are the <br>\nway to go for you. However, I do not even know what exactly you are <br>\nheading at.</p>\n</blockquote>\n<blockquote>\n<p>That idea has occurred to me some. The m number of HOL axioms haven't<br>\nbeen shown to be inconsistent, and my desired 10 axioms haven't been<br>\nshown to be inconsistent. I talk about FOL on top of HOL, but I know<br>\nthat it's really a logic 10 + m axioms, so the question becomes, \"Has<br>\nanyone proved that the 10 + m axioms together are inconsistent?\"</p>\n<p>If you tell me the answer is yes, then I listen to you because you have<br>\ngood credentials. If you tell me, \"I don't even know what your 10<br>\nspecific axioms are\", then I say, \"He didn't say yes, the 10 + m axioms<br>\nare inconsistent, so I'll take that as meaning no one knows\".<br>\nI don't even know what your 10 specific axioms are. That does not mean <br>\nthat no one knows, only that I don't know.</p>\n</blockquote>\n<blockquote>\n<blockquote>\n<blockquote>\n<p>The scenario I just described would be completely beneficial to<br>\nIsabelle/HOL as a product. What's done as HOL is just HOL, where HOL is<br>\nobviously very useful. But if HOL is used as a meta-language to<br>\nimplement another standard logic on top of it, in a way that's<br>\nreasonably pure, which might require axioms to do, then that's something<br>\ndifferent.<br>\nWhat exactly are you describing here? From this statement I gathered <br>\nthat you wanted to reason about your 10 axioms inside HOL (but <br>\napparently that's not the case; see below).</p>\n</blockquote>\n</blockquote>\n</blockquote>\n<blockquote>\n<blockquote>\n<p>What you describe is not using HOL as a meta-language to reason about<br>\nanother standard logic (which is a reasonable thing to do), but<br>\nextending HOL itself by additional axioms (which I would consider risky).</p>\n</blockquote>\n<p>Okay, but it seems to me there's a meta-something in there. HOL is the<br>\nlanguage that I use to implement another language, and I hide as much as<br>\npossible that HOL is the primary foundation.<br>\nNot exactly, you do not implement your 10 axioms <em>in</em> HOL when using <br>\naxioms, you <em>extend</em> HOL. What I'm trying to say is that I don't see the <br>\nmeta-role of HOL in your situation.</p>\n</blockquote>\n<blockquote>\n<p>Larry set up Pure so that it's the meta-logic that's used to create the<br>\nobject-logic HOL. HOL uses axioms. If HOL is built on Pure with axioms,<br>\nthen why shouldn't I add axioms to HOL to get what I want?<br>\nMy feeling is that Pure vs. HOL is a different story from your HOL vs. <br>\n10 axioms (but I might be wrong). Pure is the logical framework of <br>\nIsabelle which just provides some infrastructure that is typically <br>\nneeded in interactive theorem provers for many specific logics (like <br>\nunification, natural deduction, etc.). In a sense, Pure is \"built-in\". <br>\nFor a specific logic (like FOL, HOL, etc.) we give the basic axioms once <br>\nand than work on top of them.</p>\n</blockquote>\n<p>When you extend HOL by + 10 axioms I don't see why you could just use <br>\nyour 10 axioms as the basis for a different logic (but again, I don't <br>\neven know your specific axioms). Maybe it would help if you could <br>\ndescribe precisely (and preferably compactly) what it is that you want <br>\nto achieve.</p>\n<blockquote>\n<p>To make a long story short, if I give Sledgehammer a theorem that's only<br>\nHOL, and HOL is consistent, then Sledgehammer can only prove that the<br>\ntheorem is true or that its negation is false. But if I give<br>\nSledgehammer a theorem that's built on axioms, and my axioms are time<br>\ntested axioms, but yet they are inconsistent, but yet not because of<br>\ntheir combination with the HOL axioms, then Sledgehammer will try all<br>\nsorts of unnatural combinations that a human would never try, with the<br>\npossible result that both the theorem and its negation is proved true.</p>\n<p>Similarly, Nitpick might prove both the theorem and its negation false.<br>\nNow, because at least one of the axioms is \"polluted\" with a little bit<br>\nof HOL, then I have to work really hard to show that the inconsistency<br>\nis not because of that, but I might want that challenge.<br>\nYou said it yourself \"the possible result\". Your approach looks like <br>\ntesting to me. You might find a problem, however if you don't, you <br>\nhaven't learned anything new.</p>\n</blockquote>\n<blockquote>\n<blockquote>\n<p>If you use HOL to reason about another logic, you will <em>define</em> (not<br>\naxiomatize) the formulas of this logic as HOL-type and also define its<br>\nsemantics by HOL-functions. In that way you can talk <em>about</em> the other<br>\nlogic <em>in</em> HOL.</p>\n</blockquote>\n<p>So now, you talk about not merely \"using a logic\" but \"reasoning about a<br>\nlogic\". You should understand that a formal, mathematics education<br>\ngenerally only gives a person the bare minimum to \"use a logic\".</p>\n<p>DeMorgan's laws, the equivalence (A --&gt; B)==(~A \\/ B), how to negate<br>\nstatements with quantifiers, proof by induction, proof by contradiction<br>\nand little bit more is about all you're taught and all you need to do<br>\ntypical math. The math gets complicated, but the logic never does, so I<br>\nthink \"reasoning about logic\" will be m+n number of months down the road<br>\nfor me. But I set \"reasoning about another logic\" as another goal to<br>\nachieve based on your advice.<br>\nI was under the impression that \"reasoning about the 10 axioms\" is what <br>\nyou wanted to do, sorry if I was wrong. I'm not saying you should do <br>\nthat. And you are definitely right that this would be time-consuming.</p>\n</blockquote>\n<p>cheers</p>\n<p>chris</p>",
        "id": 294216973,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660895425
    },
    {
        "content": "<p>From: Lawrence Paulson &lt;<a href=\"mailto:lp15@cam.ac.uk\">lp15@cam.ac.uk</a>&gt;<br>\nPersonally, I think there is nothing wrong with asserting some axioms as the foundation of a brand-new development. If they are inconsistent, your work is worthless, but if they are the sole basis of your work, putting them in a locale wouldn't change things even a little bit.</p>\n<p>If you already have a sound and working development, that's a different situation altogether. Then it would make sense to encapsulate the axioms.</p>\n<p>Larry Paulson</p>",
        "id": 294217027,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660895452
    },
    {
        "content": "<p>From: Gottfried Barrow &lt;<a href=\"mailto:gottfried.barrow@gmx.com\">gottfried.barrow@gmx.com</a>&gt;<br>\nIt helps to know that you don't think it's total loser idea, and \"sole <br>\nbasis\" would capture what I care about at this point in time. <br>\nHypothetically, in the future I'll want to be messing around with <br>\nconcrete numbers, so I certainly wouldn't want to be using a theory with <br>\nan axiom which might mess up HOL's binary and decimal number systems.</p>\n<p>I try to keep confessions and overflowing praise to a minimum on the <br>\nlist, but other theorem provers don't even allow axioms to be a point of <br>\ncontention, because it's set in stone what axioms we can used. Your Pure <br>\nsetup captures the reality of the freedom that logic gives us, which is <br>\nour ability to start with any set of axioms and undefined terms we want, <br>\nand see where they lead us.</p>\n<p>Also, I've known about Isabelle/ZF and Steven Obua's HOLZF.thy, so I <br>\nhaven't felt completely free to talk about what it is I'm trying to do <br>\n(where doing it is, of course, the hard part; concepts only get me so far).</p>\n<p>I did look at Isabelle/ZF some. I didn't understand anything but the <br>\nbuzz words, but it is where I got the idea that I need 2 and only 2 <br>\ntypes, which are your \"i\" and \"o\". It seems like that should be obvious, <br>\nbut if I didn't get the idea until I looked at Isabelle/ZF, it must not <br>\nbe accurate to describe it as an obvious idea.</p>\n<p>I just now opened Obua's HOLZF.thy, but I closed it real quick. I know <br>\nenough now to recognize a little of what he's doing, and I don't want to <br>\nsee his way right now. I did see axiomatization in it. After about 9 <br>\nmonths, due to this discussion about axioms, I now have an answer as to <br>\nwhy HOLZF is not allowed to be a part of what's imported with \"imports <br>\nMain\".</p>\n<p>Regards,<br>\nGB</p>",
        "id": 294217127,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660895513
    },
    {
        "content": "<p>From: Gottfried Barrow &lt;<a href=\"mailto:gottfried.barrow@gmx.com\">gottfried.barrow@gmx.com</a>&gt;<br>\nOn 7/22/2012 9:45 PM, Christian Sternagel wrote:</p>\n<blockquote>\n<blockquote>\n<blockquote>\n<blockquote>\n<p>The scenario I just described would be completely beneficial to<br>\nIsabelle/HOL as a product. What's done as HOL is just HOL, where <br>\nHOL is<br>\nobviously very useful. But if HOL is used as a meta-language to<br>\nimplement another standard logic on top of it, in a way that's<br>\nreasonably pure, which might require axioms to do, then that's <br>\nsomething<br>\ndifferent.<br>\nWhat exactly are you describing here? From this statement I gathered <br>\nthat you wanted to reason about your 10 axioms inside HOL (but <br>\napparently that's not the case; see below).</p>\n</blockquote>\n</blockquote>\n</blockquote>\n</blockquote>\n<p>Christian, remember, you asked. I work some to keep my speculative, <br>\nphilosophical, and undereducated opinions off the list.</p>\n<p>First, I define an acronym, FOLZFS, which means \"the first-order <br>\nlanguage of Zermelo-Fraenkel sets\". Below, I use the term HOL+FOLZFS, <br>\nwhich would be the axioms of HOL plus my axioms, however bogus my axioms <br>\nmay be.</p>\n<p>I now pose a question to set the context for everything that's <br>\ncompletely driving how I'm trying to use Isabelle as a proof assistant.</p>\n<p>QUESTION: Why am I being forced to choose between HOL and a reasonably <br>\npure implementation of FOLZFS?</p>\n<p>Mike Gordon was thinking about  this conflict between HOL and FOLZFS a <br>\nlong time ago in \"Set Theory, Higher Order Logic or Both?\" (PDF link <br>\nunder \"Download Links\").</p>\n<p><a href=\"http://citeseerx.ist.psu.edu/viewdoc/summary?doi=10.1.1.36.7899\">http://citeseerx.ist.psu.edu/viewdoc/summary?doi=10.1.1.36.7899</a></p>\n<p>His HOLZF was the concept behind Steven Obua's src/HOL/ZF/HOLZF.thy, <br>\nwritten about in \"Partizan Games in Isabelle HOLZF\":</p>\n<p><a href=\"http://citeseerx.ist.psu.edu/viewdoc/summary?doi=10.1.1.83.2131\">http://citeseerx.ist.psu.edu/viewdoc/summary?doi=10.1.1.83.2131</a></p>\n<p>I continue below because our comments below are related to your question.</p>\n<blockquote>\n<blockquote>\n<blockquote>\n<p>What you describe is not using HOL as a meta-language to reason about<br>\nanother standard logic (which is a reasonable thing to do), but<br>\nextending HOL itself by additional axioms (which I would consider <br>\nrisky).</p>\n</blockquote>\n<p>Okay, but it seems to me there's a meta-something in there. HOL is the<br>\nlanguage that I use to implement another language, and I hide as much as<br>\npossible that HOL is the primary foundation.<br>\nNot exactly, you do not implement your 10 axioms <em>in</em> HOL when using <br>\naxioms, you <em>extend</em> HOL. What I'm trying to say is that I don't see <br>\nthe meta-role of HOL in your situation.</p>\n</blockquote>\n</blockquote>\n<p>The terms \"meta-language\" and \"object-language\" are fairly imprecise <br>\nterms. I'm a generalist, so I've been trying to use those terms instead <br>\nof Larry's \"meta-logic\" and \"object-logic\". I think I could justify how <br>\nI've been using them.</p>\n<p>However, you've clarified and made clear to me two important concepts, <br>\nwhich are:</p>\n<p>1) extending a logic vs. using it to define a higher-level language,  and<br>\n2) reasoning about a logic vs. using a logic.</p>\n<p>I know that I'm extending HOL, especially now, but I still want \"meta\". <br>\nAlright, so I try to use \"meta\" and conform to a reasonable dictionary <br>\nmeaning. I take the definition of meta- to be \"outside of\".</p>\n<p><a href=\"http://en.wikipedia.org/wiki/Meta\">http://en.wikipedia.org/wiki/Meta</a></p>\n<p>Is HOL a usable logic? Yes. Are my FOLZFS axioms a usable logic? No. I <br>\nneed HOL to implement them in a concrete way. So HOL+FOLZFS becomes the <br>\nlogic, and though both HOL and FOLZFS are inside the logic, the most <br>\nimportant point is that HOL is outside of FOLZFS.</p>\n<p>In fact, I say that FOL is embedded in HOL, and because my FOLZFS is <br>\nalmost exclusively made of FOL formulas, where the rest is made up of <br>\nHOL functions, and where every FOL logical symbol is implemented as a <br>\nHOL function, can I not think of, for my own purposes, FOLZFS as \"on top <br>\nof\" HOL?</p>\n<p>Here, feel free to throw away what you don't want in the above paragraph.</p>\n<p>I continue below.</p>\n<blockquote>\n<blockquote>\n<p>Larry set up Pure so that it's the meta-logic that's used to create the<br>\nobject-logic HOL. HOL uses axioms. If HOL is built on Pure with axioms,<br>\nthen why shouldn't I add axioms to HOL to get what I want?<br>\nMy feeling is that Pure vs. HOL is a different story from your HOL vs. <br>\n10 axioms (but I might be wrong). Pure is the logical framework of <br>\nIsabelle which just provides some infrastructure that is typically <br>\nneeded in interactive theorem provers for many specific logics (like <br>\nunification, natural deduction, etc.). In a sense, Pure is \"built-in\". <br>\nFor a specific logic (like FOL, HOL, etc.) we give the basic axioms <br>\nonce and than work on top of them.</p>\n</blockquote>\n</blockquote>\n<p>I'm no expert on Pure, but the many papers about Isabelle's meta-logic <br>\nemphasize primarily that Pure gives us a minimal logic of \\&lt;And&gt;, \"==&gt;\", <br>\nand \"==\".</p>\n<p>By default, with no HOL axioms, we have the three logical operators <br>\nabove. Would it not be mathematically disciplined to build up all of the <br>\nHOL theorems from the logic available from Pure? Are there no theorems <br>\nwhich can be shown to be true with only those three logical operators, <br>\nand whatever it is that Pure can prove? So there are theorems that could <br>\nbe proved, but those three logical operators can only get you so far <br>\nwithout being axiomatically extended. Here, I adopt your phrase above, <br>\n\"but I might be wrong\".</p>\n<p>Makarius is basically telling me to build up my theorems only from the <br>\navailable HOL axioms. It's not that I don't want to, I just don't think <br>\nI can ever get my 10 very specific FOL formulas from the m number of HOL <br>\naxioms.</p>\n<p>I tie into everything this below.</p>\n<blockquote>\n<blockquote>\n<p>Similarly, Nitpick might prove both the theorem and its negation false.<br>\nNow, because at least one of the axioms is \"polluted\" with a little bit<br>\nof HOL, then I have to work really hard to show that the inconsistency<br>\nis not because of that, but I might want that challenge.<br>\nYou said it yourself \"the possible result\". Your approach looks like <br>\ntesting to me. You might find a problem, however if you don't, you <br>\nhaven't learned anything new.</p>\n</blockquote>\n</blockquote>\n<p>Lots of tangents are getting mixed up here, but yea, part of what I'm <br>\ntalking about is 100% testing. The biggest thing I got out of last week <br>\nwas my script to take a theorem and run 4 different tests on it. When <br>\ntesting theorems with powerful tools becomes free time-wise, it's <br>\nsomething I want available in my arsenal.</p>\n<p>It's like syntax errors. It's not that you can't find them, but you can <br>\nwork a whole lot faster when the IDE finds the error, takes you to the <br>\ncode, and highlights the error.</p>\n<blockquote>\n<p>I was under the impression that \"reasoning about the 10 axioms\" is <br>\nwhat you wanted to do, sorry if I was wrong. I'm not saying you should <br>\ndo that. And you are definitely right that this would be time-consuming.</p>\n<p>cheers</p>\n<p>chris<br>\n</p>\n</blockquote>\n<p>Now I tie back into the first three parts. If you were wrong, that's <br>\nfortunate because the two concepts I listed above are important <br>\nconcepts, especially \"extending a logic\", where I wasn't even <br>\nconsidering HOL's ability to allow me to reason about another logic. It <br>\nturns out that's not what I want at all. No, I need a logic \"to use\". If <br>\nI can't use it, then the best I could do when reasoning about it is to <br>\nfind out that I can't use it.</p>\n<p>As to locales, compartmentalization is a good thing that I want at my <br>\ndisposal as soon as possible.</p>\n<p>I try to finish answering your question, \"What exactly are you <br>\ndescribing here?\"</p>\n<p>First, there's the general concept that you take an old, existing <br>\nlanguage, and you use it to implement another language.</p>\n<p>For example, you take assembly language, and you create C. You take <br>\nPure, and you create Isabelle/HOL or Isabelle/FOL.</p>\n<p>It doesn't have to be tied into logic. We can take English, and teach <br>\nsomeone Chinese. We find a primitive tribe, and we use the Latin <br>\nalphabet and English morphemes to create a written language for the tribe.</p>\n<p>There's the meta-language that we have to use, and the object-language <br>\nwhich we cannot create or get access to without the use of the <br>\nmeta-language, at least in the formative stages.</p>\n<p>Whether extending HOL with axioms to get FOLZFS, or coming up with a <br>\nnovel solution to get the same \"model\" without any new axioms, HOL is <br>\nabsolutely essential as the underlying language of logic (having <br>\nchosen), and I find it hard not to call HOL the meta-language for both <br>\nscenarios.</p>\n<p>As to whether I'm misusing vocabulary and language, I'll let you decide, <br>\nthough I might not agree with your decision.</p>\n<p>RUNNING OUT OF STEAM</p>\n<p>I've suddenly run out of steam to go into great detail about my <br>\nformative ideas of FOLZFS on top of HOL, so I just make a few comments. <br>\nIf you want info, just ask.</p>\n<p>HOL gives me a form of sets, but these sets cannot be used in the same <br>\nway ZF sets can be used. I make no moral judgements about that. The <br>\napplication at hand is merely to explore what is achievable by either <br>\nextending HOL with axioms to get FOLZFS or find that elusive novel <br>\nsolution without using axioms. The axiomatic approach is possibly more <br>\nof a no-brainer algorithm. See FOL formula in textbook? Put FOL formula <br>\nin Isabelle. Go back to \"see FOL\" step.</p>\n<p>There are 9 axioms and 1 axiom scheme. I say above that \"FOL is embedded <br>\nin HOL\", so my assumption is that if I used 100% FOL formulas with <br>\nIsabelle/HOL, then I'm 100% safe.</p>\n<p>Without having gone down the road very far, I replace the axiom scheme <br>\nwith one axiom in which I quantify over \"sT =&gt; sT =&gt; bool\". One thing <br>\nleads to another. If it doesn't work, I try to figure out why, which <br>\nwill require me to learn something. If I can't figure it out, I go onto <br>\nsomething more productive, and keep that in the back of my mind.</p>\n<p>After reading my email over, I remembered some more reasons why I want <br>\nHOL. I had deleted the following part of your reply:</p>\n<blockquote>\n<p>When you extend HOL by + 10 axioms I don't see why you could just use <br>\nyour 10 axioms<br>\nas the basis for a different logic (but again, I don't even know your <br>\nspecific axioms). Maybe<br>\nit would help if you could describe precisely (and preferably <br>\ncompactly) what it is that you<br>\nwant to achieve.</p>\n</blockquote>\n<p>1) Because nobody will care about my FOLZFS as a standalone logic, but <br>\nthey might care about it if it's riding on the coattails of <br>\n[message truncated]</p>",
        "id": 294217131,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660895518
    }
]