[
    {
        "content": "<p>From: Christian Urban &lt;<a href=\"mailto:urbanc@in.tum.de\">urbanc@in.tum.de</a>&gt;<br>\nOne-Day Tutorial on Nominal Isabelle at IJCAR 2008</p>\n<hr>\n<p>Time: 11th August (just before main conference) <br>\nLocation: Sydney, Australia. </p>\n<p>Overview:</p>\n<p>Dealing with binders, renaming of bound variables, capture-avoiding<br>\nsubstitution, etc., is very often a major problem in formal proofs about the<br>\nlambda-calculus and programming language theory. Nominal Isabelle provides an<br>\ninfrastructure for reasoning conveniently about bound variables and<br>\nalpha-equivalence classes in the proof assistant Isabelle. The aim of this<br>\ntutorial is to give participants a reading knowledge of nominal techniques and<br>\nallow them to start using Nominal Isabelle in their own work. The tutorial<br>\nwill be hands-on and therefore participants are encouraged to bring their own<br>\nlaptop.</p>\n<p>Programme:</p>\n<p>The tutorial will be organised around four sessions: </p>\n<p>Session I:   basics, substitution lemma, Isar proof language <br>\nSession II:  strong induction principles, contexts with holes, beta-reduction <br>\nSession III: variable convention and rule inductions, evaluation relation <br>\nSession IV:  function definitions, freshness, support </p>\n<p>Target audience for the tutorial:</p>\n<p>Researchers and doctoral students who want to use Nominal Isabelle to<br>\nformalise proofs from the lambda-calculus, from programming language theory or<br>\nfrom proof theory, such as type soundness, Church Rosser, strong normalisation<br>\nand so on. The tutorial is designed for people who have not necessarily used<br>\nIsabelle or Nominal Isabelle before, nor have used any other proof assistant. </p>\n<p>HTML version of this announcement:</p>\n<p><a href=\"http://isabelle.in.tum.de/nominal/activities/nominal-ijcar08/\">http://isabelle.in.tum.de/nominal/activities/nominal-ijcar08/</a></p>",
        "id": 294058578,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660822609
    }
]