[
    {
        "content": "<p>From: Lawrence Paulson &lt;<a href=\"mailto:lp15@cam.ac.uk\">lp15@cam.ac.uk</a>&gt;<br>\nAUTOMATIC PROOF PROCEDURES FOR POLYNOMIALS AND SPECIAL FUNCTIONS</p>\n<p>A Postdoc and PhD Studentship are available on our EPSRC-funded<br>\nCambridge/Edinburgh project, which concerns scalable proof procedures<br>\nfor real arithmetic involving polynomials and special functions<br>\n(transcendental, hyperbolic, etc.). The project will create new<br>\nverification techniques for hybrid and control systems by developing<br>\npowerful arithmetic proof procedures targeted to classes of problems<br>\narising in engineering practice. Our approach combines intensive work<br>\non the procedures themselves with careful study of application areas<br>\nin collaboration with specialists.</p>\n<p>Specifically, we have available</p>\n<ul>\n<li>\n<p>a 4 year Postdoctoral Research Associate position (Automated Reasoning <br>\n  Group, Computer Laboratory, University of Cambridge), and</p>\n</li>\n<li>\n<p>a 3.5 year PhD studentship (Laboratory for Foundations of Computer <br>\n  Science, School of Informatics, University of Edinburgh).</p>\n</li>\n</ul>\n<p>The PhD student and postdoc will join an energetic and highly<br>\ncollaborative team of two Principal Investigators</p>\n<ul>\n<li>Prof. Lawrence C. Paulson  <a href=\"http://www.cl.cam.ac.uk/~lp15/\">http://www.cl.cam.ac.uk/~lp15/</a></li>\n<li>Dr. Paul B. Jackson        <a href=\"http://homepages.inf.ed.ac.uk/pbj/\">http://homepages.inf.ed.ac.uk/pbj/</a></li>\n</ul>\n<p>one additional postdoc </p>\n<ul>\n<li>Grant Olney Passmore   <a href=\"http://homepages.inf.ed.ac.uk/s0793114/\">http://homepages.inf.ed.ac.uk/s0793114/</a></li>\n</ul>\n<p>and an already-appointed PhD student.  Visits between the two sites<br>\nwill be encouraged.</p>\n<p>REQUIREMENTS FOR THE POST-DOCTORAL RESEARCH ASSOCIATE </p>\n<p>We are especially interested in the process of transforming an<br>\nengineering problem (perhaps expressed by differential equations) into<br>\na form acceptable to our tools (inequalities involving special<br>\nfunctions), and further transforming the problem to make it easier to<br>\nsolve. This process then needs to be automated using computer algebra<br>\ntechniques. Another important task is further development of the<br>\ntheorem proving technology itself. The applicant should therefore have<br>\nstrong software development skills and either a firm knowledge of<br>\nengineering mathematics or a background in automated theorem proving.</p>\n<p>REQUIREMENT FOR PHD STUDENTSHIP</p>\n<p>The applicant should have a strong grounding in logical and<br>\nmathematical aspects of computer science, with a keen interest in<br>\ndeveloping and applying software tools for the formal verification of<br>\nreal-world engineering artefacts.</p>\n<p>FURTHER DETAILS</p>\n<p>Applications for both positions are due by Monday 15th November 2010.</p>\n<p>We expect both post-holders to start before 1st May 2011, preferably<br>\nsooner.</p>\n<p>For additional information on the project and the positions, please<br>\nvisit our project website</p>\n<p><a href=\"http://www.cl.cam.ac.uk/~lp15/Grants/AutoPolyFun/\">http://www.cl.cam.ac.uk/~lp15/Grants/AutoPolyFun/</a>. </p>\n<p>Follow the links on the right-hand side of the page for specific<br>\ninformation on how to apply for either for these positions.</p>",
        "id": 294119263,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660839276
    }
]