[
    {
        "content": "<p>From: Peter Lammich &lt;<a href=\"mailto:lammich@in.tum.de\">lammich@in.tum.de</a>&gt;<br>\nHi List,</p>\n<p>I just typed in Isabelle/jedit:</p>\n<p>export_code foo in SML file \"benchmarks/foo.sml\"</p>\n<p>The result is, that it created, in the current folder, the files:<br>\n  be<br>\n  benchmar</p>\n<p>both containing the sml-code. Yep, I'm a slow typer but my machine is<br>\nalso slow ;). </p>\n<p>What probably happened here is that jedit re-processed the line<br>\ncontinuously, and generated all the files while I was still typing the<br>\nname.</p>\n<p>How to avoid such strange things in jedit, except for trying to<br>\nhigh-speed typing, or adding a line containing only \".xxx\" before the<br>\nexport_code line while typing?</p>\n<p>Best,<br>\n  Peter</p>",
        "id": 294633107,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661159066
    },
    {
        "content": "<p>From: Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt;<br>\nHow about disabling \"Continuous checking\" in the Theory panel?</p>\n<p>In some sense, the export_code command is still in a stateful TTY-oriented <br>\nmode.  If TTY mode had been removed 2 years earlier, there would already <br>\nbe a proper integration into the PIDE document model.</p>\n<p>Side-remarks: the text editor is called \"jEdit\" with that spelling -- it <br>\nis a branding of that project.</p>\n<p>The default Isabelle/PIDE implementation is called \"Isabelle/jEdit\".</p>\n<p>Makarius</p>",
        "id": 294633116,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661159072
    },
    {
        "content": "<p>From: Lars Hupel &lt;<a href=\"mailto:hupel@in.tum.de\">hupel@in.tum.de</a>&gt;<br>\nJust today I was thinking about that very issue, because I too find it annoying. So here are my two cents on how I envision a proper jEdit integration:</p>\n<p>The command 'export_code' doesn't perform a side effect, but rather produces a special document result containing the generated code, which is then interpreted by jEdit. This could just be a button in the output panel. Clicking the button opens a regular jEdit text buffer with the generated code. In principle, the simplifier trace works in the same way.</p>\n<p>Does that sound reasonable?</p>\n<p>Cheers<br>\nLars</p>",
        "id": 294633172,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661159099
    },
    {
        "content": "<p>From: Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt;<br>\nYes, something like that has been in the pipeline for a long time.  Maybe <br>\nI first mentioned it in winter 2012 when visiting TUM.</p>\n<p>There are just the usual reasons why it is not done yet:</p>\n<p>* Relatively low priority -- practical relevance is not exceedingly<br>\n     high.</p>\n<p>* Just too many historical problems and confusions in the department of<br>\n     file input or output management with the document model, in contrast<br>\n     to TTY mode behaviour.</p>\n<p>Since TTY mode no longer exists after Isabelle2014, improvements are more <br>\nlikely to happen eventually.</p>\n<p>Makarius</p>",
        "id": 294633217,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661159115
    }
]