[
    {
        "content": "<p>From: Lutz Schroeder &lt;<a href=\"mailto:Lutz.Schroeder@dfki.de\">Lutz.Schroeder@dfki.de</a>&gt;<br>\n[I would be grateful for further distribution of the job advertisement <br>\nbelow]  </p>\n<p>In the newly founded Theoretical Computer Science group (Chair 8) at the <br>\nUniversity of Erlangen-Nürnberg, several research positions are <br>\navailable that can be filled at the doctoral or post-doctoral level. <br>\nThese include project positions of up to two years, in the TV-L E13 or <br>\nE14 pay scale depending on qualification of the applicant; project <br>\ntopics include</p>\n<p>- coalgebraic logic<br>\n    - probabilistic description logic<br>\n    - formal methods in mechanical engineering.</p>\n<p>Additionally, at least one position is available that is not tied to a <br>\nspecific research project but does carry a teaching obligation of 5h per <br>\nweek; in this case, research work can be positioned in any of the core <br>\nfields of the group including</p>\n<p>- modal logic<br>\n    - knowledge representation<br>\n    - coalgebra<br>\n    - formal methods<br>\n    - program semantics<br>\n    - applications of semantic technologies</p>\n<p>Such positions can be filled at TV-L E13 for an initial appointment of <br>\nthree years, with a possibility of extension for another three years <br>\nsubject to provisions by German laws on temporal employment in academia; <br>\npostdoctoral applicants from EU countries can be appointed at the A13 <br>\npayscale (\"akademischer Rat\") (which pays better and has better <br>\nbenefits) for two periods of three years, with a possible extension of <br>\ntwo periods of two years at the A14 payscale (\"akademischer Oberrat\") <br>\nfor candidates who successfully complete a habilitation during the first <br>\nsix years.</p>\n<p>Please send applications consisting of a cover letter, resume, and <br>\ncontact details of three references by email to <br>\n<a href=\"mailto:lutz.schroeder@cs.fau.de\">lutz.schroeder@cs.fau.de</a>. There is no particular application deadline; <br>\npositions will be filled when suitable candidates are found.</p>\n<p>Best regards,</p>\n<p>Lutz</p>",
        "id": 294154312,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660850567
    }
]