[
    {
        "content": "<p>From: \"Klein, Gerwin (Data61, Kensington NSW)\" &lt;<a href=\"mailto:Gerwin.Klein@data61.csiro.au\">Gerwin.Klein@data61.csiro.au</a>&gt;<br>\nGiven the increased demand for working at home, I thought I’d check if I’m still current with the state of the art on making use of fast machines at work when you are on a smaller machine at home.</p>\n<p>Is it still correct that VNC/rdesktop is the best method to work remotely with an Isabelle session? (assuming a fast connection).</p>\n<p>Looking back a few years in the archives, there were some discussions about potentially running the PIDE protocol for jEdit or VSCode remotely between two machines, but I don’t think we got to that point yet. Is this correct?</p>\n<p>I also remember hearing about the isabelle remote_build tool. Any experiences with that one?</p>\n<p>Any other creative solutions that people have come up with?</p>\n<p>Cheers,<br>\nGerwin</p>",
        "id": 294825830,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661244362
    },
    {
        "content": "<p>From: <a href=\"mailto:buday.gergely@uni-eszterhazy.hu\">buday.gergely@uni-eszterhazy.hu</a><br>\nI used Isabelle/JEdit remotely through X recently. It was between two campuses<br>\nin two cities, not sure if it would work via a broadband personal connection.<br>\nSomebody stated that X is oldschool but it did the trick.</p>",
        "id": 294825875,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661244381
    },
    {
        "content": "<p>From: Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt;<br>\nThere is still a lot of work ahead to get it eventually. We have already<br>\n\"isabelle server\", but it still needs a wrapper for SSH and some support to<br>\nmake it stay resident like the good old \"GNU screen\" tool.</p>\n<p>On top of that one could imagine some \"isabelle remote_build\" tool that<br>\n<em>interacts</em> with remotely running builds: automatically synchronizing sources,<br>\nreplacing changed jobs that are still running, but retaining unrelated jobs.</p>\n<p>All that should be integrated into Isabelle/jEdit, which runs locally as<br>\nbefore. Download of resulting images could be an optional add-on.</p>\n<p>Note that VScode is not really on the critical path: for my taste it is moving<br>\na bit too fast in no particular direction. Instead of using VSCode directly,<br>\nmy current attitude is to re-implement some of its best ideas in Isabelle/jEdit.</p>\n<p>I am particularly thinking of fully integrated editing / versioning / building<br>\nall in Isabelle/jEdit.</p>\n<p>Makarius</p>",
        "id": 294826586,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661244730
    }
]