[
    {
        "content": "<p>From: Gopalan Nadathur &lt;<a href=\"mailto:gopalan@cs.umn.edu\">gopalan@cs.umn.edu</a>&gt;<br>\nCall for Papers<br>\nSpecial Issue of Mathematical Structures in Computer Science<br>\nin Celebration of the Sixtieth Birthday of Dale Miller</p>\n<p>Papers are invited to a special issue of Mathematical Structures in<br>\nComputer Science, a journal published by Cambridge University Press. This<br>\nspecial issue is being collated in celebration of the sixtieth birthday of<br>\nProfessor Dale Miller. To be appropriate for this collection, papers must<br>\nbe broadly related to one or more of the areas that have been spanned by<br>\nthe work of Professor Miller to-date. These areas include structural proof<br>\ntheory, proof search and computation, foundations of logic programming,<br>\nhigher-order unification, reasoning about relational specifications and<br>\ncertification of proofs. This list is meant to be illustrative and is not<br>\nexhaustive; if you are interested in submitting a paper and would like to<br>\nascertain its relevance to the theme of the special issue, please feel free<br>\nto contact the editors of the issue.</p>\n<p>Papers that are submitted for consideration of publication must be prepared<br>\nin LaTeX and should use the MSCS style file that can be downloaded from<br>\n<a href=\"http://ftp.cup.cam.ac.uk\">ftp.cup.cam.ac.uk</a>.<br>\nPlease also follow the layout and other manuscript format related<br>\ninstructions with the exception of double spacing that you will find  at<br>\n<a href=\"http://z.umn.edu/mscsformat\">http://z.umn.edu/mscsformat</a>.<br>\nManuscripts should also be limited to about 25 pages. While this is not a<br>\nhard constraint, the reason why a paper exceeds this limit must be apparent<br>\nto the editors from an inspection of its content, else it may be declined<br>\nwithout review.</p>\n<p>To ensure timeliness of publication, strict deadlines and an expedited<br>\nreviewing process will be followed in the preparation of this special<br>\nissue. To be considered for publication, manuscripts must be submitted by<br>\nMay 31, 2017. The first round of reviews will be completed by July 31,<br>\n2017. Revised versions of manuscripts that are deemed to be of acceptable<br>\nquality will be due by August 21, 2017 and final acceptance decisions will<br>\nbe made by September 11, 2017.</p>\n<p>To submit a manuscript to the special issue, please use the ScholarOne site<br>\nfor MSCS at<br>\n<a href=\"https://mc.manuscriptcentral.com/mscs\">https://mc.manuscriptcentral.com/mscs</a>.<br>\nOnce you are at this site, you will need to create an account if you do not<br>\nhave one already. Once you are logged in, select the \"Author\" tab and<br>\nfollow the instructions. At the end of the page, under the \"Special Issue\"<br>\nheading, select \"Miller Festschrift\" prior to submission. Please note that<br>\nat this stage we will need only a PDF file prepared as indicated above. The<br>\nLaTeX source will be required after the manuscript has been accepted.</p>\n<p>Regards,<br>\nDavid Baelde           (<a href=\"mailto:david.baelde@lsv.ens-cachan.fr\">david.baelde@lsv.ens-cachan.fr</a>)<br>\nAmy Felty               (<a href=\"mailto:afelty@eecs.uottawa.ca\">afelty@eecs.uottawa.ca</a>)<br>\nGopalan Nadathur    (<a href=\"mailto:gopalan@cs.umn.edu\">gopalan@cs.umn.edu</a>)<br>\nAlexis Saurin           (<a href=\"mailto:alexis.saurin@irif.fr\">alexis.saurin@irif.fr</a>)</p>",
        "id": 294710363,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661181972
    }
]