[
    {
        "content": "<p>From: \"Sanan Baena David Miguel (Dr)\" &lt;<a href=\"mailto:sanan@ntu.edu.sg\">sanan@ntu.edu.sg</a>&gt;<br>\n[I apologize for multiple copies]</p>\n<p>Postdoc Position on Formal Verification on Security<br>\nNanyang Technological University/<br>\nProf. Liu Yang</p>\n<p>Highly motivated applicants are being sought to work on developing and applying<br>\nverification techniques for infinite state systems in the project \"Securify:<br>\nA Compositional Approach of Building Security Verified System\".<br>\nThe position aims to carry out cyber-security research on micro-kernel verification targetting a<br>\nmulticore processor architecture.</p>\n<p>The group is working on:<br>\n  -Formalization of a high level specification of a multi-core separation micro-kernel.<br>\n  -Verification of functional and security properties on the high level specification.<br>\n  -Development of semantic models and tools to obtain formal models from a real micro-kernel source code.<br>\n  -Development of a framework in Isabelle/HOL for refinement verification of concurrent specifications.<br>\n  -Development of tools in ML to automate refinement between machine code and source code models.</p>\n<p>The applicant will contribute to the project working on any of the tasks described above.</p>\n<p>Candidates must be experienced on one or more of the following areas:</p>\n<p>- Formal methods, theorem proving.<br>\n      - Temporal logics, Higher order logic.<br>\n      - Functional programming.</p>\n<p>Experience on operating systems will be appreciated</p>\n<p>Apart from specific requirements to the topic a general candidate should have:</p>\n<ul>\n<li>A PhD in Computer Science or related areas is required.</li>\n<li>An established research record.</li>\n</ul>\n<p>The postdoc will work with the software engineering and formal<br>\nmethods group at Nanyang Technological University using theorem proving technologies.</p>\n<p>The position involves conducting basic research, developing tools,  working<br>\nas part of a research team, travelling, and giving presentations. The<br>\nworking language is English.</p>\n<p>Attractive Salary. Starting as soon as possible.<br>\nDuration is of 1 year extensible to 3 years maximum.</p>\n<p>Interested applicants should send their CV to<br>\nProf. Liu Yang at yangliu AT <a href=\"http://ntu.edu.sg\">ntu.edu.sg</a></p>\n<hr>\n<p>CONFIDENTIALITY: This email is intended solely for the person(s) named and may be confidential and/or privileged. If you are not the intended recipient, please delete it, notify us and do not copy, use, or disclose its contents.<br>\nTowards a sustainable earth: Print only when necessary. Thank you.</p>",
        "id": 294675983,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661174960
    }
]