[
    {
        "content": "<p>From: \"Yannick Duchêne (Hibou57 )\" &lt;<a href=\"mailto:yannick_duchene@yahoo.fr\">yannick_duchene@yahoo.fr</a>&gt;<br>\nI think this simple pattern can fulfil the needs:</p>\n<p>local L‑n context L‑n<br>\n       (* Isar samples goes here *)<br>\n     end</p>\n<p>Just have to not forget to properly manage all the “‑n” everywhere.</p>",
        "id": 294232735,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660903284
    },
    {
        "content": "<p>From: \"Yannick Duchêne (Hibou57 )\" &lt;<a href=\"mailto:yannick_duchene@yahoo.fr\">yannick_duchene@yahoo.fr</a>&gt;<br>\nSorry, typo. Add “begin”:</p>\n<p>local L‑n context L‑n begin<br>\n       (* Isar samples goes here *)<br>\n     end</p>",
        "id": 294232745,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660903290
    },
    {
        "content": "<p>From: \"Yannick Duchêne (Hibou57 )\" &lt;<a href=\"mailto:yannick_duchene@yahoo.fr\">yannick_duchene@yahoo.fr</a>&gt;<br>\nHi people,</p>\n<p>My question is not about a normal usage issue, but rather a trick I would  <br>\nenjoy, if ever there is one. If not, then I won't bother that much (as  <br>\nthat's not about normal Isar usage, that would be OK).</p>\n<p>Some months ago, for my personal use, I started to edit a theory file  <br>\nwhich is a summary of all Isar constructs, followed by minimalist example  <br>\ninstance and comments (comments like how does it relate to another  <br>\nconstructs, alternative constructs, and so on). Diving back to Isabelle, I  <br>\nwanted to resume with this, and was reminded of issues I encountered at  <br>\nthat time.</p>\n<p>I have issues with interfering constructs. Using “notepad” or “locale” is  <br>\nnot always OK, as some constructs are not allowed inside of a “notepad” or  <br>\n“locale”. So in the theory file, all constructs appears at the same level,  <br>\nand declarations interferes. I may use more complex names to avoid it, but  <br>\nI quickly figured it's not readable and easily maintainable.</p>\n<p>Please, any one know a trick to have something like multiple isolated  <br>\ntheories inside a single theory file?</p>\n<p>I may use multiple files instead of a single, but I use anchors, and as  <br>\nknow near to nothing about TeX, I'm afraid of cross‑linking between  <br>\nmultiple documents and then publish the whole as a single PDF.</p>",
        "id": 294235129,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660904417
    }
]