[
    {
        "content": "<p>From: Timothy McKenzie &lt;<a href=\"mailto:tjm1983@gmail.com\">tjm1983@gmail.com</a>&gt;<br>\nOn Wed, 30 Mar 2011 21:55:34 Johannes Hölzl wrote:</p>\n<blockquote>\n<p>Did you try Isabelle2011? Of course the type real ^ 'n was not<br>\nremoved, but for most lemmas the constant names changed.</p>\n</blockquote>\n<p>No, I haven't tried it yet.  I keep changing my mind about how <br>\nmuch work it might require to make my project work with <br>\nIsabelle2011.  Perhaps I should just try it.</p>\n<blockquote>\n<p>Either you rewrite your terms (which is mostly Search &amp;<br>\nReplace) or you try to stay with the \"real ^ 'n\" constants and<br>\nuse the simplifier to rewrite them at each proof (but I'm not<br>\nsure how well this approach works).</p>\n<p>Alternatively we could try to add the real^'n version of all<br>\nchanged lemmas back (by specialising the lemmas about<br>\neuclidean spaces).</p>\n</blockquote>\n<p>I often think my work would have been simpler if Isabelle2011 <br>\nexisted when I started (in early 2009).  As well as the recent <br>\nintroduction of euclidean_space, the quotient types introduced in <br>\nIsabelle2009-2 might have helped if they had existed earlier.  But <br>\nIsabelle is still improving, so I'll just have to be glad that <br>\nthese features are available now, for future work.</p>\n<blockquote>\n<p>When we introduced this changes I were not aware of any<br>\nexisting work using Multivariate_Analysis. Hence we did not<br>\ncare about backwards compatibility. But we can try to add<br>\ncompatibility lemmas so you can port your work to the next<br>\nIsabelle release. Is your work available anywhere? Is it<br>\npossible to take a look at it?</p>\n</blockquote>\n<p>My work is still a work in progress (for a Master's thesis), but <br>\nif you want, I could send you off-list the current files, or <br>\nperhaps I could try to figure out how to give you at least read-<br>\nonly access to my subversion repository.</p>\n<blockquote>\n<p>Greetings,<br>\n  Johannes</p>\n</blockquote>\n<p>Thanks for your help.</p>\n<p>Tim<br>\n&lt;&gt;&lt;<br>\n<a href=\"/user_uploads/14278/_85rEH1ttEViP3hekVI1sk_V/signature.asc\">signature.asc</a></p>",
        "id": 294133793,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660843709
    }
]