[
    {
        "content": "<p>From: Tobias Nipkow &lt;<a href=\"mailto:nipkow@in.tum.de\">nipkow@in.tum.de</a>&gt;<br>\nA research assistant position is available in connection with<br>\na project funded by the German research Council (DFG).</p>\n<p>Project title: Computer-supported verification of automata constructions</p>\n<p>Principal Investigators: Javier Esparza, Tobias Nipkow, and Jan-Georg Smaus</p>\n<p>Duration: 36 months</p>\n<p>Start date: as soon as possible but not later than June 2011.</p>\n<p>Remuneration: German scale 13 TV-L (38k-54k EUR according to age,<br>\nexperience, family status)</p>\n<p>Background: Diploma or Master in Computer Science or Mathematics.<br>\nSome previous experience in theorem proving, automata theory, or model<br>\nchecking.</p>\n<p>Location: Faculty of Computer Science, Technical University of Munich<br>\n(TUM). TUM is an equal opportunities employer.</p>\n<p>Applications should be sent by E-Mail to Erika Leber<br>\n<a href=\"mailto:leber@in.tum.de\">leber@in.tum.de</a> as a single PDF file containing in particular a CV<br>\nand the names of two potential referees. There is<br>\nno deadline. Applications will be assessed on an on-going basis until<br>\nthe position is filled.</p>\n<p>Questions about the position can be directed to Javier Esparza<br>\n(<a href=\"mailto:esparza@in.tum.de\">esparza@in.tum.de</a>)</p>\n<p>Project description:</p>\n<p>The goal of the project is to produce a library of mechanically verified<br>\nmodel-checking algorithms. The project focuses on the automata-theoretic<br>\napproach to model-checking, and so achieving the goal also comprises the<br>\nformalization of standard constructions of automata theory<br>\nusing interactive theorem proving.</p>\n<hr>\n<p>Prof.Dr. Javier Esparza<br>\nInstitut fuer Informatik (I7)<br>\nTechnische Universitaet Muenchen<br>\nBoltzmannstr. 3<br>\nD-85748 Garching bei Muenchen<br>\nGermany</p>\n<p>Phone: +49 (89) 289-17204<br>\nFax:   +49 (89) 289-17207</p>",
        "id": 294121779,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660840078
    }
]