[
    {
        "content": "<p>From: Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt;<br>\nLogical Frameworks and Meta-Languages: Theory and Practice<br>\nThursday, 23 June 2016<br>\nAffiliated with FSCD<br>\nPorto, Portugal<br>\n<a href=\"http://dlicata.web.wesleyan.edu/events/lfmtp2016/\">http://dlicata.web.wesleyan.edu/events/lfmtp2016/</a></p>\n<p>Logical frameworks and meta-languages form a common substrate for<br>\nrepresenting, implementing, and reasoning about a wide variety of deductive<br>\nsystems of interest in logic and computer science. Their design and<br>\nimplementation and their use in reasoning tasks ranging from the correctness<br>\nof software to the properties of formal computational systems have been the<br>\nfocus of considerable research over the last two decades. This workshop will<br>\nbring together designers, implementors, and practitioners to discuss various<br>\naspects impinging on the structure and utility of logical frameworks,<br>\nincluding the treatment of variable binding, inductive and co-inductive<br>\nreasoning techniques and the expressiveness and lucidity of the reasoning<br>\nprocess.</p>\n<p>LFMTP 2016 will provide researchers a forum to present state-of-the-art<br>\ntechniques and discuss progress in areas such as the following:</p>\n<ul>\n<li>\n<p>Encoding and reasoning about the meta-theory of programming languages and<br>\n   related formally specified systems.</p>\n</li>\n<li>\n<p>Theoretical and practical issues concerning the treatment of variable<br>\n   binding, especially the representation of, and reasoning about,<br>\n   datatypes defined from binding signatures.</p>\n</li>\n<li>\n<p>Logical treatments of inductive and co-inductive definitions and<br>\n   associated reasoning techniques.</p>\n</li>\n<li>\n<p>New theory contributions: canonical and substructural frameworks,<br>\n   contextual frameworks, proof-theoretic foundations supporting binders,<br>\n   functional programming over logical frameworks, homotopy type theory.</p>\n</li>\n<li>\n<p>Applications of logical frameworks, e.g., in proof-carrying<br>\n   architectures such as proof-carrying authorization.</p>\n</li>\n<li>\n<p>Techniques for programming with binders in functional programming<br>\n   languages such as Haskell, OCaml, or Agda and logic programming languages<br>\n   such as lambda Prolog or Alpha-Prolog.</p>\n</li>\n</ul>\n<p>== Important Dates ==</p>\n<p>Friday, April 8th: Abstract deadline<br>\nWednesday, April 13th: Submission deadline<br>\nFriday, May 13th: Notification to authors<br>\nFriday, May 27th: Final version due<br>\nThursday, June 23rd: Workshop date</p>\n<p>== Submission ==</p>\n<p>In addition to regular papers, we also solicit \"work in progress\"<br>\nreports, in a broad sense.  Those do not need to report fully polished<br>\nresearch results, but should be interesting for the community at large.</p>\n<p>Submitted papers should be in PDF, formatted using the ACM sigplanconf<br>\nstyle files. The length is restricted to 10 pages for regular papers and<br>\n7 pages for \"Work in Progress\" papers.</p>\n<p>Accepted regular papers will be included in the proceedings, which will be<br>\npublished in ACM digital library in its International Proceedings series.</p>\n<p>== Program Committee ==</p>\n<ul>\n<li>Edwin Brady</li>\n<li>Gilles Dowek, co-chair</li>\n<li>Marcelo Fiore</li>\n<li>Andrew Gacek</li>\n<li>Olivier Hermant</li>\n<li>Chantal Keller</li>\n<li>Dan Licata, co-chair</li>\n<li>Bernardo Toninho</li>\n<li>Makarius Wenzel</li>\n</ul>",
        "id": 294669327,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661172911
    },
    {
        "content": "<p>From: Claudio Sacerdoti Coen &lt;<a href=\"mailto:claudio.sacerdoticoen@unibo.it\">claudio.sacerdoticoen@unibo.it</a>&gt;<br>\nLogical Frameworks and Meta-Languages: Theory and Practice<br>\nLFMTP 2020</p>\n<p>Paris, France<br>\n29 June 2020</p>\n<p>Affiliated with FSCD 2020 and IJCAR 2020</p>\n<p><a href=\"https://lfmtp.org/workshops/2020/\">https://lfmtp.org/workshops/2020/</a></p>\n<p>Abstract submission deadline: 5 April 2020<br>\nPaper submission deadline:   11 April 2020</p>\n<p>SPECIAL SESSION IN HONOUR OF Frank Pfenning</p>\n<p>To celebrate the 60th birthday of Frank Pfenning and his great many<br>\ncontributions to the topics of LFMTP, one session will be devoted to<br>\ntalks by collaborators and friends of Frank.</p>\n<p>ABOUT LFMTP</p>\n<p>Logical frameworks and meta-languages form a common substrate for<br>\nrepresenting, implementing and reasoning about a wide variety of<br>\ndeductive systems of interest in logic and computer science. Their<br>\ndesign, implementation and their use in reasoning tasks, ranging from<br>\nthe correctness of software to the properties of formal systems, have<br>\nbeen the focus of considerable research over the last two decades. This<br>\nworkshop will bring together designers, implementors and practitioners<br>\nto discuss various aspects impinging on the structure and utility of<br>\nlogical frameworks, including the treatment of variable binding,<br>\ninductive and co-inductive reasoning techniques and the expressiveness<br>\nand lucidity of the reasoning process.</p>\n<p>LFMTP 2020 will provide researchers a forum to present state-of-the-art <br>\ntechniques and discuss progress in areas such as the following:</p>\n<ul>\n<li>\n<p>Encoding and reasoning about the meta-theory of programming<br>\nlanguages, process calculi and related formally specified systems.</p>\n</li>\n<li>\n<p>Formalisation of model-theoretic and proof-theoretic semantics of<br>\nlogics.</p>\n</li>\n<li>\n<p>Theoretical and practical issues concerning the treatment of variable<br>\nbinding, especially the representation of, and reasoning about,<br>\ndatatypes defined from binding signatures.</p>\n</li>\n<li>\n<p>Design and implementation of systems and tools related to meta-<br>\nlanguages and logical frameworks</p>\n</li>\n</ul>\n<p>IMPORTANT DATES</p>\n<p>All deadlines are established as the end of day (23:59) AoE.</p>\n<ul>\n<li>Abstract submission deadline:  5 April 2020</li>\n<li>Submission deadline:          11 April 2020</li>\n<li>Notification to authors:      13 May   2020</li>\n<li>Final version due:            22 May   2020</li>\n<li>Workshop:                     29 June  2020</li>\n</ul>\n<p>SUBMISSION INFORMATION</p>\n<p>In addition to regular papers, we accept the submission of \"work in<br>\nprogress\" reports, in a broad sense. Those do not need to report fully<br>\npolished research results, but should be of interest for the community<br>\nat large.</p>\n<p>Submitted papers should be in PDF, formatted using the EPTCS LaTeX<br>\nstyle. The length is restricted to 15 pages for regular papers and 8<br>\npages for \"Work in Progress\" papers.</p>\n<p>Submission is via EasyChair:<br>\n<a href=\"https://easychair.org/my/conference?conf=lfmtp2020\">https://easychair.org/my/conference?conf=lfmtp2020</a></p>\n<p>All submissions will be peer-reviewed and the authors of those accepted<br>\nwill be invited to present their papers at the workshop.</p>\n<p>POST-PROCEEDINGS</p>\n<p>After the workshop we will publish post-proceedings in the Electronic<br>\nProceedings in Theoretical Computer Science (EPTCS) series.</p>\n<p>Accepted regular papers will be published in the post-proceedings.</p>\n<p>Authors of selected work-in-progress papers will be invited to submit<br>\nthe full versions of their papers for publication in the post-<br>\nproceedings, subject to another round of review.</p>\n<p>PROGRAM COMMITTEE</p>\n<p>David Baelde, LSV, ENS Paris-Saclay &amp; Inria Paris<br>\nFrédéric Blanqui, INRIA<br>\nAlberto Ciaffaglione, University of Udine<br>\nDennis Müller, Friedrich-Alexander-University Erlangen-Nürnberg<br>\nMichael Norrish, Data61<br>\nCarlos Olarte, Universidade Federal do Rio Grande do Norde<br>\nClaudio Sacerdoti Coen, University of Bologna (PC Co-Chair)<br>\nUlrich Schöpp, fortiss GmbH<br>\nAlwen Tiu, Australian National University (PC Co-Chair)<br>\nTjark Weber, Uppsala University</p>",
        "id": 294822403,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661242800
    }
]