[
    {
        "content": "<p>From: Lunjin Lu &lt;<a href=\"mailto:l2lu@oakland.edu\">l2lu@oakland.edu</a>&gt;<br>\nACM 2007 Symposium on Applied Computing, March 11-15, 2007, Seoul,</p>\n<p>Korea <a href=\"http://www.acm.org/conferences/sac/sac2007\">http://www.acm.org/conferences/sac/sac2007</a></p>\n<p>Technical Track on Software Verification</p>\n<p><a href=\"http://www.cs.wmich.edu/~zijiang/sac2007\">http://www.cs.wmich.edu/~zijiang/sac2007</a></p>\n<ol>\n<li>SAC 2007 </li>\n</ol>\n<p>For the past twenty-one years, the ACM Symposium on Applied Computing has<br>\nbeen a primary gathering forum for applied computer scientists, computer<br>\nengineers, software engineers, and application developers from around the<br>\nworld. SAC 2007 is sponsored by the ACM Special Interest Group on Applied<br>\nComputing (SIGAPP), and is hosted by Seoul National University in Seoul and<br>\nThe Suwon University in Gyeonggi-do.</p>\n<ol start=\"2\">\n<li>Technical track on software verification</li>\n</ol>\n<p>In the next decade the software industry will have to face its</p>\n<p>responsibility imposed by a computer-dependent society. Since software</p>\n<p>is increasing deployed in safety critical applications, correctness</p>\n<p>and reliability are becoming issues of utmost importance. Consequently,<br>\nsoftware verification will be a grand challenge for both academic world and<br>\ncomputer industry.  The track will focus on theoretical foundations,<br>\npractical methods as well as case studies for verification of conventional<br>\nand embedded software. We welcome papers that describe work on combinations<br>\nof formal verification and program analysis techniques. Tool papers and case<br>\nstudies which report on advances in verifying large software systems are<br>\nparticularly sought. The list of topics includes but not limited to</p>\n<p>o    Tools, and case studies for large scale software verification</p>\n<p>o    Static analysis/Abstract interpretation for verification </p>\n<p>o    Model checking and deductive techniques for software verification</p>\n<p>o    Role of declarative programming languages (such as Prolog) for infinite<br>\nstate software verification. </p>\n<p>o    Proof techniques for verifying specific classes of software (such as<br>\nobject-oriented programs) </p>\n<p>o    Integration of testing and run-time monitoring with formal techniques</p>\n<p>o    Validation of UML diagrams, and/or requirement specifications</p>\n<p>o    Software certification and proof carrying code</p>\n<p>o    Integration of formal verification into software development projects</p>\n<ol start=\"3\">\n<li>Guidelines for paper submission</li>\n</ol>\n<p>Each paper must not exceed 4,000 words and should not be more than 15</p>\n<p>pages long using 11 point font and 1 inch margins on all four sides on</p>\n<p>letter size paper. Papers that fail to comply with length limitations</p>\n<p>risk rejection. Each submitted paper will be fully referenced and</p>\n<p>undergo a blind review process. Author(s) must not be identified in</p>\n<p>the submissions, either explicitly or by implication.  Before</p>\n<p>submitting paper, author(s) should submit a separate cover page that</p>\n<p>includes title, abstract, list of keywords, and list of authors with</p>\n<p>full names and postal addresses, telephone numbers, fax numbers, and</p>\n<p>e-mail addresses. One of the authors must be designated as the primary</p>\n<p>contact person. Please upload the cover page via conference website. A</p>\n<p>confirmation email with further instructions on paper submission will</p>\n<p>be sent to the contact author. Please contact track chairs for any</p>\n<p>problems with submission.  Authors of accepted papers must submit an</p>\n<p>editorial revision of their papers that must fit within five</p>\n<p>two-column pages following the ACM proceedings format (an extra three</p>\n<p>extra pages may be available at additional cost to the authors). At</p>\n<p>least one of the authors of an accepted paper must register for the</p>\n<p>conference and present the paper. Accepted papers will be published in</p>\n<p>the ACM SAC 2006 proceedings.</p>\n<ol start=\"4\">\n<li>Program Committee</li>\n</ol>\n<p>Chandrasekhar Boyapati, University of Michigan, USA</p>\n<p>Samir Genaim, Universidad Politecnica de Madrid, Spain</p>\n<p>Francesco Loggozzo, Ecole Polytechnique, France</p>\n<p>Lunjin Lu (Track Co-Chair), Oakland Univ. ,USA</p>\n<p>Iman Poernomo, King's College of London, UK</p>\n<p>Eric Poll, Radboud Universiteit Nijmegen, The Netherlands</p>\n<p>Jan-Georg Smaus, Albert-Ludwigs-Universitaet Freiburg, Germany </p>\n<p>Fausto Spoto (Track Co-Chair), Universit¨¤ di Verona, Italy</p>\n<p>Chao Wang, NEC Laboratories America, Inc, USA</p>\n<p>Ping Yang, Binghamton University, USA</p>\n<p>Zijiang Yang(Track Co-Chair), Western Michigan Univ., USA</p>\n<p>Tian Zhao, University of Wisconsin-Milwaukee , USA</p>\n<ol start=\"5\">\n<li>Important dates<p>Electronic submission of full papers: September 8, 2006</p>\n<p>Notification of paper acceptance: October 16, 2006</p>\n<p>Camera-ready copy of accepted paper due: October 30, 2006</p>\n</li>\n</ol>",
        "id": 294039995,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660814824
    }
]