[
    {
        "content": "<p>From: Artur Gomes &lt;<a href=\"mailto:gomesa@tcd.ie\">gomesa@tcd.ie</a>&gt;<br>\nHi there,</p>\n<p>After making a few steps forward from my last email yesterday, with help of<br>\nMakarius, I got no more error messages of exception size raised. Now I'm<br>\nusing<br>\nthe 2016-1 version with Isabelle/ML 64bit version.</p>\n<p>Now I'm bringing a new question hoping for some feedback, as what I'm doing<br>\nright now is new for me and I'm still learning.</p>\n<p>I'm using haskabelle to translate some haskell code and what I have so far<br>\nis<br>\na bunch of datatypes, written in overall 280 lines, and as an example, the<br>\nmost complicated bit of formal spec, obtained through haskabelle is<br>\nsomething<br>\nlike the following function definition that involves four or five other<br>\nfunctions, in a total of 95 lines.</p>\n<p>function  fun1 :: \"some -&gt; inputs -&gt; and -&gt; outputs\"<br>\n               and  fun2 :: \"some -&gt; inputs -&gt; and -&gt; outputs\" and<br>\n               and  fun3 :: \"some -&gt; inputs -&gt; and -&gt; outputs\" and<br>\n               and  fun4 :: \"some -&gt; inputs -&gt; and -&gt; outputs\" and<br>\nwhere<br>\n\"they call each other in some parts\"<br>\n| \"fun1 calls fun2\"<br>\n| \"fun2 calls fun3\"<br>\n| \"fun3 calls fun4\"<br>\n| \"fun4 calls fun1\"</p>\n<p>I know that as they call each other they can't be declared one after each<br>\nother. So, my question is.. Is there any way of splitting those function<br>\ndefinitions? Basically, this is what is taking most of the time, like<br>\nseveral<br>\nminutes with the pieces in pink/purple, and high speed fan working in my<br>\nlaptop. I presume that even if I use the cloud service from college, it<br>\nwould<br>\nstill be a hard work.</p>\n<p>I tried to shrink a bit the datatypes and reduce the amount of cases for<br>\ntesting purposes, but still, it is being really hard to get feedback from<br>\nIsabelle.</p>\n<p>Is there something else I could do that would help me with this?</p>\n<p>Many thanks.</p>\n<p>Regards,</p>",
        "id": 294701849,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661179419
    }
]