[
    {
        "content": "<p>From: <a href=\"mailto:geoff@cs.miami.edu\">geoff@cs.miami.edu</a><br>\nCSL 2010<br>\nFirst Call for Papers<br>\nThe Annual Conference of the European Association for Computer Science Logic</p>\n<p>August 23-27, 2010, Brno, Czech Republic</p>\n<p><a href=\"http://www.mat.uc.pt/~csl/\">http://www.mat.uc.pt/~csl/</a></p>\n<p>Submission (title &amp; abstract):  March 26, 2010<br>\nNotification:                   May 17, 2010<br>\nSubmission (full paper):        April 2, 2010<br>\nFinal papers:                   June 6, 2010</p>\n<p>Computer Science Logic (CSL) is the annual conference of the European<br>\nAssociation for Computer Science Logic (EACSL). The conference is intended<br>\nfor computer scientists whose research activities involve logic, as well as<br>\nfor logicians working on issues significant for computer science. The 19th<br>\nEACSL Annual Conference on Computer Science Logic (CSL 2010) and the 35th<br>\nInternational Symposium on Mathematical Foundations of Computer Science<br>\n(MFCS 2010) are federated and organized in parallel at the same place. The<br>\nfederated MFCS &amp; CSL 2010 conference has common plenary sessions and social<br>\nevents for all participants. The technical program and proceedings of MFCS <br>\n2010 and CSL 2010 are prepared independently. The MFCS &amp; CSL 2010 conference <br>\nis accompanied by satellite workshops on more specialized topics.</p>\n<p>Suggested topics of interest include (but are not limited to) automated<br>\ndeduction and interactive theorem proving, constructive mathematics and type<br>\ntheory, equational logic and term rewriting, automata and games, modal and <br>\ntemporal logic, model checking, decision procedures, logical aspects of <br>\ncomputational complexity, finite model theory, computational proof theory, <br>\nlogic programming and constraints, lambda calculus and combinatory logic, <br>\ncategorical logic and topological semantics, domain theory, database theory, <br>\nspecification, extraction and transformation of programs, logical foundations <br>\nof programming paradigms, verification and program analysis, linear logic, <br>\nhigher-order logic, nonmonotonic reasoning.</p>\n<p>Proceedings will be published in the Advanced Research in Computing and <br>\nSoftware Science (ARCoSS) subline of the LNCS series. Each paper accepted <br>\nby the Programme Committee must be presented at the conference by one of <br>\nthe authors, and a final copy must be prepared according to Springer's <br>\nguidelines. Submitted papers must be in Springer's LNCS style and of no more <br>\nthan 15 pages, presenting work not previously published. They must not be <br>\nsubmitted concurrently to another conference with refereed proceedings. The <br>\nPC chairs should be informed of closely related work submitted to a <br>\nconference or journal by March 19, 2010. Papers authored or coauthored by <br>\nmembers of the Programme Committee are not allowed.</p>\n<p>Papers will be submitted through the conference website. Submitted papers <br>\nmust be in English and provide sufficient detail to allow the Programme <br>\nCommittee to assess the merits of the papers. Full proofs may appear in a <br>\ntechnical appendix which will be read at the reviewers' discretion. Authors <br>\nare strongly encouraged to include a well written introduction which is <br>\ndirected at all members of the program committee.</p>\n<p>The Ackermann Award for 2010 will be presented to the recipients at CSL'10.</p>\n<p>*** Programme Committee</p>\n<p>Armin Biere (Linz)<br>\nLars Birkedal (ITU, Denmark)<br>\nNikolaj Bjorner (Redmond)<br>\nManuel Bodirsky (Paris)<br>\nMikolaj Bojanczyk (Warsaw)<br>\nIliano Cervesato (Doha)<br>\nKrishnendu Chatterjee (Klosterneuburg)<br>\nAgata Ciabattoni (Vienna)<br>\nAnuj Dawar (Cambridge, co-chair)<br>\nAzadeh Farzan (Toronto)<br>\nGeorg Gottlob (Oxford)<br>\nMartin Hofmann (Munich)<br>\nOrna Kupferman (Jerusalem)<br>\nChristof Loeding (Aachen)<br>\nJoao Marques-Silva (Dublin)<br>\nTobias Nipkow (Munich)<br>\nPrakash Panangaden (Montreal)<br>\nR. Ramanujam (Chennai)<br>\nSimona Ronchi della Rocca (Torino)<br>\nAlex Simpson (Edinburgh)<br>\nPascal Tesson (Quebec)<br>\nHelmut Veith (Vienna, co-chair)<br>\nYde Venema (Amsterdam)</p>\n<p>*** CSL/MFCS Plenary Speakers</p>\n<p>David Basin (Zurich)<br>\nHerbert Edelsbrunner (Klosterneuburg)<br>\nErich Gradel (Aachen)<br>\nJoseph Sifakis (Gieres)</p>\n<p>*** CSL Invited Speakers</p>\n<p>Peter O'Hearn (London)<br>\nJan Krajicek (Prague)<br>\nAndrei Krokhin (Durham)<br>\nAndrey Rybalchenko (Munich)<br>\nViktor Kuncak (Lausanne)</p>\n<p>*** Organizing Committee</p>\n<p>Jan Bouda (Brno, chair)</p>\n<p>*** Conference address</p>\n<p>MFCSL 2010<br>\nFaculty of Informatics<br>\nMasaryk University,<br>\nBotanicka 68a, 60200 Brno<br>\nCzech Republic</p>\n<p><a href=\"mailto:mfcsl2010@fi.muni.cz\">mfcsl2010@fi.muni.cz</a></p>",
        "id": 294099080,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660833209
    }
]