[
    {
        "content": "<p>From: Andreas Lochbihler &lt;<a href=\"mailto:andreas.lochbihler@inf.ethz.ch\">andreas.lochbihler@inf.ethz.ch</a>&gt;<br>\nDear BNF experts,</p>\n<p>In the attached theory, the primcorec definition of a function does not terminate (tested <br>\nwith both Isabelle2014 and Isabelle2015-RC0). Is is because my definition is erroneous or <br>\na shortcoming of the primcorec implementation?</p>\n<p>Best,<br>\nAndreas<br>\n<a href=\"/user_uploads/14278/ztcy7x5fSljfGVJAF-6sRNTq/Scratch.thy\">Scratch.thy</a></p>",
        "id": 294634480,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661159581
    },
    {
        "content": "<p>From: Dmitriy Traytel &lt;<a href=\"mailto:traytel@in.tum.de\">traytel@in.tum.de</a>&gt;<br>\nHi Andreas,</p>\n<p>in any case primcorec should always terminate. Here, you definition <br>\nlooks fine to me. It seems that one of the primcorec tactics is <br>\nspinning. I guess we'll need Jasmin's expertise here when he is back <br>\nfrom vacation.</p>\n<p>Temporarily, you can use quick_and_dirty to get this definition through.</p>\n<p>Best wishes,<br>\nDmitriy</p>",
        "id": 294634563,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661159612
    },
    {
        "content": "<p>From: Andreas Lochbihler &lt;<a href=\"mailto:andreas.lochbihler@inf.ethz.ch\">andreas.lochbihler@inf.ethz.ch</a>&gt;<br>\nHi Dmitriy,</p>\n<p>Thanks for the hint with quick_and_dirty. Now I can continue my work without having to <br>\ndefine the function manually.</p>\n<p>Best,<br>\nAndreas</p>",
        "id": 294634723,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661159667
    },
    {
        "content": "<p>From: Jasmin Blanchette &lt;<a href=\"mailto:jasmin.blanchette@inria.fr\">jasmin.blanchette@inria.fr</a>&gt;<br>\nHi Andreas,</p>\n<blockquote>\n<p>In the attached theory, the primcorec definition of a function does not terminate (tested with both Isabelle2014 and Isabelle2015-RC0). Is is because my definition is erroneous or a shortcoming of the primcorec implementation?</p>\n</blockquote>\n<p>It is, indeed, a shortcoming of the selector-theorem generating tactic — I think it might eventually have terminated, given enough resources.</p>\n<p>The tactic doesn’t look easy to fix. I’ll need to dig into it more deeply, which is unlikely to happen in the very near future. However, an easy workaround is to add an explicit case</p>\n<p>| LCons (Inr x) xs’ =&gt; Nil_call)”</p>\n<p>to deal with the missing unspecified case. (Otherwise, “primcorec” expands the resulting implicit “undefined” into a trivial “case”, which complicates the destructor view — cf. our ITP 2014 paper.)</p>\n<p>I’ll let you know if and when I improved the tactic.</p>\n<p>Jasmin</p>",
        "id": 294635350,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661159906
    },
    {
        "content": "<p>From: Andreas Lochbihler &lt;<a href=\"mailto:andreas.lochbihler@inf.ethz.ch\">andreas.lochbihler@inf.ethz.ch</a>&gt;<br>\nHi Jasmin,</p>\n<p>Thanks for the hint of fully specifying the function. This is certainly better than taking <br>\nthe quick_and_dirty road.</p>\n<p>When I use primcorec, I usually either define it using the destructor view (and then <br>\nmanually derive a suitable code view -- the automatically generated one is usually not <br>\nidiomatic) or specify the code view with cases (from which I derive pattern-matching <br>\nequations using simps_of_case) and then manually derive the destructor rules, as the <br>\ngenerated theorems use cases rather than selectors and discriminators. So I am not so <br>\nworried about these generated theorems becoming more complex (although undefined indeed <br>\ndoes add some problems, but I am not planning to call my function on arguments that result <br>\nin undefined.</p>\n<p>Best,<br>\nAndreas</p>",
        "id": 294635430,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661159949
    },
    {
        "content": "<p>From: Jasmin Blanchette &lt;<a href=\"mailto:jasmin.blanchette@inria.fr\">jasmin.blanchette@inria.fr</a>&gt;</p>\n<blockquote>\n<p>When I use primcorec, I usually either define it using the destructor view (and then manually derive a suitable code view -- the automatically generated one is usually not idiomatic) or specify the code view with cases (from which I derive pattern-matching equations using simps_of_case) and then manually derive the destructor rules, as the generated theorems use cases rather than selectors and discriminators.</p>\n</blockquote>\n<p>Using selectors and discriminators for these is also on my TODO list.</p>\n<p>Jasmin</p>",
        "id": 294635449,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661159955
    }
]