[
    {
        "content": "<p>From: Alex Meyer &lt;<a href=\"mailto:alex153@outlook.lv\">alex153@outlook.lv</a>&gt;<br>\nI am trying use Isabelle/HOL as logic framework - e.g. to define syntax and proof rules as a Isabelle/HOL theory and try to use this theory as theorem prover for this logic. There are several works for mechanizing linear logic in Isabelle/HOL and I would like to follow them.</p>\n<p>Is such embedding a standard procedure? E.g. logics usually have standard representations - syntax, proof rules. Is there procedure how to encode this representation into Isabelle/HOL? I have skimmed through lot of tutorials and articles but I have not found tutorial like \"how to take custome logic, embedd it into Isabelle/HOL and generate theorem prover for this logic\".</p>\n<p>Why there is no such tutorial? I guess because there is no such prescribed procedore or why else?</p>\n<p>In <a href=\"http://homepages.inf.ed.ac.uk/ldixon/papers/infrep-06-planill.pdf\">http://homepages.inf.ed.ac.uk/ldixon/papers/infrep-06-planill.pdf</a> it was said:</p>\n<p>\"We have formalised ILL (intuitionistic linear logic) as an embedding in Isabelle/HOL where both terms and types are HOL datatypes and derivability in ILL is defined as membership of an inductively defined set.\" Can this be the universal method for embedding logic?</p>\n<p>If Isabelle/HOL is so versatile why scientists in field \"Universal Logic\" have not adopted Isabelle/HOL as a platform for managing and developing their zoo of logics?</p>\n<p>There is framework <a href=\"https://www.cl.cam.ac.uk/research/hvg/Isabelle/dist/library/Sequents/Sequents/Sequents.html\">https://www.cl.cam.ac.uk/research/hvg/Isabelle/dist/library/Sequents/Sequents/Sequents.html</a> that can be used for any logic that has sequent calculus. Is this framework useable today? Today Isabelle/HOL has Isar and there is not need for inner syntax portion of theories but Sequents.thy heavily depends on the inner syntax. What would be modern approach for making such framework today for sequent calculus?</p>\n<p>Theory Sequents (Isabelle2016-1: December 2016)&lt;<a href=\"https://www.cl.cam.ac.uk/research/hvg/Isabelle/dist/library/Sequents/Sequents/Sequents.html\">https://www.cl.cam.ac.uk/research/hvg/Isabelle/dist/library/Sequents/Sequents/Sequents.html</a>&gt;<br>\n<a href=\"http://www.cl.cam.ac.uk\">www.cl.cam.ac.uk</a><br>\n(* Title: Sequents/Sequents.thy Author: Lawrence C Paulson, Cambridge University Computer Laboratory Copyright 1993 University of Cambridge *) section ...</p>",
        "id": 294717734,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661183830
    },
    {
        "content": "<p>From: Nemouchi Yakoub &lt;<a href=\"mailto:y.nemouchi@gmail.com\">y.nemouchi@gmail.com</a>&gt;<br>\nHi,</p>\n<p>The first step of embedding any language, eg., your logic, in a meta<br>\nlanguage, eg., HOL, is the choice of the embedding level.</p>\n<p>As far as I know two embedding levels exist in literature: shallow<br>\nembedding and deep embedding.</p>\n<p>The choice the embedding level depends on what you want to do with your<br>\nlanguage.</p>\n<p>The best paper that I have for this topic is:<br>\n<a href=\"https://www.microsoft.com/en-us/research/wp-content/uploads/2016/11/EmbeddingPaper.pdf\">https://www.microsoft.com/en-us/research/wp-content/uploads/2016/11/EmbeddingPaper.pdf</a></p>\n<p>Once you choose your embedding level then you can use the different<br>\nIsabelle features to mechanize your logic.</p>\n<p>Best,</p>\n<p>Yakoub.</p>",
        "id": 294717804,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661183849
    }
]