[
    {
        "content": "<p>From: Christoph Benzmueller &lt;<a href=\"mailto:chris@ags.uni-sb.de\">chris@ags.uni-sb.de</a>&gt;</p>\n<hr>\n<p>Call for papers: ESHOL'08</p>\n<p>The workshop</p>\n<p><em>Evaluation of Systems for Higher Order Logic</em></p>\n<p>will be held as part of the 4th International Joint Conference on Automated<br>\nReasoning (IJCAR'08) in Sydney, Australia.</p>\n<p>Workshop website:     <a href=\"http://www.cs.miami.edu/~geoff/Conferences/ESHOL/\">http://www.cs.miami.edu/~geoff/Conferences/ESHOL/</a><br>\nWorkshop dates:       10/11 August 2008<br>\nSubsmission deadline: 19 May 2008 (abstract) / 26 May 2008 (full paper)</p>\n<hr>\n<p>This workshop brings together practitioners and researchers who are involved<br>\nin the development of reasoning systems based on higher-order logic. The<br>\nworkshop will stimulate and foster the build-up of an infrastructure that<br>\nsupports research, development, and deployment of higher-order reasoning<br>\nsystems. A particular focus is on means to evaluate higher-order reasoning<br>\nsystems.  Advances in these aspects of reasoning in higher-order logic will<br>\nmake higher-order reasoning system easier to use in applications, e.g.,<br>\nhardware and software verification, knowledge based reasoning, and computer<br>\naided mathematics. The workshop's notion of higher-order includes, but is not<br>\nlimited to, ramified type theory, simple type theory, intuitionistic and<br>\nconstructive type theory, and logical frameworks. The workshop's notion of<br>\nreasoning systems includes automated and semi-automated provers, model<br>\ngenerators, as well as proof and model checkers. The workshop will have three<br>\nparts:</p>\n<p><em>Evaluation of Higher-Order Reasoning Systems</em><br>\n          o Frameworks and tools for evaluation<br>\n          o Collections of test problems<br>\n          o Problem representation languages<br>\n          o Evaluation of automated higher-order reasoning systems, in<br>\n            particular, higher-order theorem provers<br>\n          o Evaluation of interactive higher-order reasoning systems<br>\n          o Evaluation of systems working for different higher-order<br>\n            logics and varying semantics</p>\n<p><em>Descriptions of Successful Higher-Order Reasoning Systems</em><br>\n          o Logical frameworks<br>\n          o Higher-order automated theorem provers<br>\n          o Interactive proof assistants supporting the partial<br>\n            automation of higher-order logic<br>\n          o Higher-order model checkers and higher-order model generators<br>\n          o Systems that automate natural fragments of higher-order<br>\n            logic, such as monadic second-order logic<br>\n      Due to the evaluative character of the workshop, descriptions of both<br>\n      existing and novel systems are welcomed. Descriptions of existing<br>\n      systems should stress successful applications and evaluations.</p>\n<p><em>System Demonstration and System Competition</em><br>\n      The systems described in the second part will be demonstrated. Moreover,<br>\n      a first competition \"happening\" for automated theorem provers for simple<br>\n      type theory is planned. This competition will be similar to the CASC<br>\n      competition for first-order reasoning systems. It will exploit and test<br>\n      the TPTP problem representation language for simple type theory, which<br>\n      was recently developed by the organizers.</p>\n<p>We envision attendees that are interested in fostering the development and<br>\nvisibility of reasoning systems for higher-order logics, and the connection<br>\nbetween research on the various flavors of higher-order logic. We are<br>\nparticularly interested in comparisons of the practical strengths of higher-<br>\norder reasoning systems and in a discusssion on the development of a higher-<br>\norder version of the TPTP. Due to the intricate nature of higher-order logic,<br>\nwe are also interested in a discussion on what practical strength means in<br>\nthe context of higher-order logic and how it can be measured.</p>\n<p><em>Program Committee</em></p>\n<p>Peter Andrews   Andrea Asperti Michael Beeson Christoph Benzmuller (Co-Chair)<br>\n  Chad Brown      Gilles Dowek   Viktor Kuncak  Dale Miller<br>\n  Michael Norrish Larry Paulson  Florian Rabe (Co-Chair)<br>\n  Sandip Ray      Carsten Schurmann (Co-Chair)  Natarajan Shankar<br>\n  Geoff Sutcliffe (Co-Chair)     Josef Urban</p>\n<p><em>Submission</em></p>\n<p>Submission of papers for presentation at the workshop, and proposals for<br>\nsystem and application demonstrations at the workshop, are now invited.<br>\nSubmissions will be reviewed, and a balanced program of high-quality<br>\ncontributions will be selected. There is a 20 page limit. Long listings<br>\nof problems or computer output should be relegated to a referenced WWW site.</p>\n<p>Submission is via EasyChair (thanks to Andrei Voronkov). The selected<br>\ncontributions will be printed as workshop proceedings, and will also be<br>\npublished as CEUR Workshop Proceedings &lt;<a href=\"http://ceur-ws.org\">http://ceur-ws.org</a>&gt;.</p>\n<p><em>Important dates</em></p>\n<p>* Abstract submission deadline - 19th May<br>\n    * Submission deadline - 26rd May<br>\n    * Papers distributed to PC - 30th May<br>\n    * Reviews due in from PC - 23rd June<br>\n    * Notification of acceptance - 27th June<br>\n    * Final versions due - 14th July<br>\n    * Workshop - 10-11th August</p>\n<hr>",
        "id": 294058300,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660822484
    }
]