[
    {
        "content": "<p>From: Jeremy Avigad &lt;<a href=\"mailto:avigad@cmu.edu\">avigad@cmu.edu</a>&gt;<br>\nThe logic group in the Department of Philosophy at Carnegie Mellon<br>\nUniversity seeks a postdoctoral researcher for a project in formal<br>\nverification, dynamical systems, and constructive analysis, beginning<br>\nAugust 2018. There are no teaching duties, and the position is for one<br>\nacademic year with a possibility of renewal.</p>\n<p>Candidates should have a PhD and research experience in a related area, and<br>\na desire to collaborate with the existing research group, which consists of<br>\nseveral faculty members, postdocs, and graduate students. Background in<br>\ninteractive theorem proving or other uses of formal methods is desired.</p>\n<p>Questions about the position may be directed to Jeremy Avigad,<br>\n<a href=\"mailto:avigad@cmu.edu\">avigad@cmu.edu</a>.</p>\n<p>Candidates should submit a CV and a brief research statement to<br>\n<a href=\"mailto:CMUPhilosophy@andrew.cmu.edu\">CMUPhilosophy@andrew.cmu.edu</a>.</p>\n<hr>\n<p>More Information:<br>\nPlease visit “Why Carnegie Mellon” to learn more about becoming part of an<br>\ninstitution inspiring innovations that change the world.<br>\nA listing of employee benefits is available at:<br>\n<a href=\"http://www.cmu.edu/jobs/benefits-at-a-glance/index.html\">http://www.cmu.edu/jobs/benefits-at-a-glance/index.html</a><br>\nDepartment URL:  <a href=\"https://www.cmu.edu/dietrich/philosophy/\">https://www.cmu.edu/dietrich/philosophy/</a><br>\nPrimary Location:  United States-Pennsylvania-Pittsburgh<br>\nTime Type: Full Time<br>\nMinimum Education Level: Doctorate or equivalent<br>\nSalary: According to Experience</p>\n<hr>\n<p>Carnegie Mellon University does not discriminate in admission, employment,<br>\nor administration of its programs or activities on the basis of race,<br>\ncolor, national origin, sex, handicap or disability, age, sexual<br>\norientation, gender identity, religion, creed, ancestry, belief, veteran<br>\nstatus, or genetic information.  Furthermore, Carnegie Mellon University<br>\ndoes not discriminate and is required not to discriminate in violation of<br>\nfederal, state, or local laws or executive orders.</p>",
        "id": 294724194,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661185886
    }
]