[
    {
        "content": "<p>From: \"John F. Hughes\" &lt;<a href=\"mailto:jfh@cs.brown.edu\">jfh@cs.brown.edu</a>&gt;<br>\nTL;DR: Never give a multiple-choice quiz where there's only one answer.</p>\n<p>I partly agree with Peter and Eugene here (about the new fonts). I'm using<br>\na QHD-wide \"27 inch\" display, and the new fonts look blurry, and also look<br>\nas if they're mostly bold; almost all text resembles the old bolded-keyword<br>\nlook. Just to be sure it wasn't merely the display, I looked at the same<br>\nthing on my MacBook's 15\" display --- same results.) The new bold keywords<br>\nare even more bold, but appear blurrier to me (and my eyesight isn't that<br>\ngreat -- for someone with clear vision, I'd expect this to be even more of<br>\na problem). By contrast, the old ones look crisp (esp. for the material<br>\nwithin double-quotes). I far prefer them.</p>\n<p>I did a screen grab of the two, side-by-side, and dropped it here:<br>\n<a href=\"https://imgur.com/a/3htvAfu\">https://imgur.com/a/3htvAfu</a>; if you zoom in a bit and look at, for<br>\ninstance, 'a, you'll see that the quote mark is far more blurry; look at<br>\nthe \"n\" in \"fun\" and notice the blurry right-hand side. That certainly<br>\nexplains what I was seeing/feeling. I love me some antialiasing, but ...<br>\nsometimes the results are unsatisfactory.</p>\n<p>Is this a drop-dead issue for me the way it is for Eugene? Probably not.<br>\nBut I think you should consider what Eugene and Peter say, not spend time<br>\nexplaining why the technology is the way it is. (FYA, see<br>\n<a href=\"https://www.youtube.com/watch?v=dEP7aEyTOf0\">https://www.youtube.com/watch?v=dEP7aEyTOf0</a>, 0:34 - 0:55).</p>\n<div class=\"youtube-video message_inline_image\"><a data-id=\"dEP7aEyTOf0\" href=\"https://www.youtube.com/watch?v=dEP7aEyTOf0\"><img src=\"https://uploads.zulipusercontent.net/5e34db9b7334254df011d3f13cdb59c671848320/68747470733a2f2f692e7974696d672e636f6d2f76692f64455037614579544f66302f64656661756c742e6a7067\"></a></div><p>As for \"old technology\", if you go look for monitors on Amazon or similar<br>\nplaces, you'll find that most high-end screens are about 100 DPI which, for<br>\ndisplays at comparable distances, is really the relevant measure. My \"27<br>\ninch\" display (23 inches wide) is 2560 pixels; the top-rated UHD display on<br>\nAmazon is about 33 inches wide and 3340 pixels. (To be fair, also top-rated<br>\nis a 25 inch display with 3340 pixels -- about 5/4 the DPI of my display.)<br>\nSo what Eugene is describing is hardly old-school in terms of actual size<br>\nof pixels-at-the-cornea (assuming that like most folks I know, Eugene has<br>\nthe display about 24-30\" inches away, and has had it that way through<br>\nmultiple generations of resolution-improvement).</p>\n<p>The sidekick is an interesting case; I can't figure out how to make the<br>\nfont larger in I2018, so it's not a fair comparison, but with the default<br>\ninstall of I2019 on my Mac, the wide-bold does lead to some serious<br>\nugliness. Look at the space between \"<em>theory</em>\" and \"Seq\": in the old<br>\nsidekick, it's clearly a blank space. In the new one, it's much narrower<br>\nand harder to recognize. It's also not clear why, among the main-text<br>\npanel, the upper sidekick panel, and the lower sidekick panel, this one<br>\nalone has a non-fixed-width font.</p>\n<p>There's one place where I feel the new is a definite improvement on the<br>\nold: opening and closing parentheses. You can see this in the comment in<br>\nthe first two lines. The old one looks threadbare, while the new appears<br>\nmore like a uniform-thickness stroke.</p>\n<p>If your chosen font/renderer makes things appear ugly to folks, and they<br>\ntell you so, then your pre-release testing is a <em>success</em>: you're getting<br>\nuseful feedback (which is a precious resource). As someone with a bit of<br>\nexperience in graphics and UIs, I'd advise you to not ignore or dismiss it<br>\n<em>if</em> you care about the graphics and UI. Feel free, of course, to ignore<br>\nme. I suspect that this is not your top concern in an otherwise very<br>\nimpressive project.</p>\n<p>--John</p>",
        "id": 294754552,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661196841
    },
    {
        "content": "<p>From: Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt;<br>\nThe \"your\" cannot mean me, because I am neither responsible for the Java<br>\nfont-renderer nor for the DejaVu fonts.</p>\n<p>I am merely responsible for selecting the best non-legacy technologies<br>\nthat I could find. If there are even better ones, I will pick them.</p>\n<p>Makarius</p>",
        "id": 294754600,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661196846
    },
    {
        "content": "<p>From: Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt;<br>\nThese obersvations are explained in Isabelle2019-RC0/NEWS as follows:</p>\n<p>\"\"\"</p>\n<ul>\n<li>The font collection \"Isabelle DejaVu\" is systematically derived from<br>\nthe existing \"DejaVu\" fonts ...<br>\nThe line metrics and overall rendering quality is closer to original DejaVu.<br>\n\"\"\"</li>\n</ul>\n<p>The old Java renderer produced fonts that were too thin, with the<br>\nnotable exception for 18px. The new one is much better in that respect:<br>\neven 12, 14, 16 etc. come out as intended by the DejaVu designers.</p>\n<p>Makarius</p>",
        "id": 294754611,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661196852
    }
]