[
    {
        "content": "<p>From: Ken Kubota &lt;<a href=\"mailto:mail@kenkubota.de\">mail@kenkubota.de</a>&gt;<br>\nDear Gottfried Barrow and List Members,</p>\n<p>Thank you for your comment at<br>\n<a href=\"https://lists.cam.ac.uk/pipermail/cl-isabelle-users/2015-December/msg00023.html\">https://lists.cam.ac.uk/pipermail/cl-isabelle-users/2015-December/msg00023.html</a></p>\n<p>concerning my note available at<br>\n<a href=\"https://lists.cam.ac.uk/pipermail/cl-isabelle-users/2015-December/msg00018.html\">https://lists.cam.ac.uk/pipermail/cl-isabelle-users/2015-December/msg00018.html</a></p>\n<p>Let me respond to the last three paragraphs of your comment quoted below which <br>\nsummarize the most important questions.</p>\n<ol>\n<li>There is no relation between a simple minimum core logic and the <br>\nexpressiveness of the formal language. A modular software design guarantees a <br>\nclear separation of functionality such that the logic is concentrated in the <br>\nlogical core and no enhancements of other software layers (i.e., user <br>\ninterface, proof tactics) will have an effect on the correctness of the logic. <br>\nThis concept is, according to Andrei Popescu, shared by all implementations in <br>\ndiscussion here: \"A small logic kernel is an implementation-independent virtue <br>\nof Isabelle/HOL as well as of all the Gordon-HOL systems.\"</li>\n</ol>\n<p>\"It is the logical reliability due to reduction that builds the core of the <br>\nLCF-approach to theorem proving (or LCF-style full expansiveness [cf. Gordon, <br>\n2000, p. 178]): 'All proofs are ultimately performed in terms of a small set of <br>\nprimitive inferences, so provided this small logical kernel is correct the <br>\nresults should be reliable.' [Harrison, 2009, p. 60]\" [Kubota, 2015a, pp. 12 f.]</p>\n<p>The idea behind the LCF-approach appealing also to those who do not share <br>\nmetatheoretical concepts such as the semantic approach (model theory) is to <br>\nreduce the set of rules and elements, such that the logical core is minimized <br>\nwithout loss of expressiveness. I called it the \"The Principle of Reductionism\" <br>\n[Kubota, 2015a, p. 11].</p>\n<p>In Peter B. Andrews' logic Q0 this principle is - by the use of syntactical <br>\nmeans only - consequently carried out, such that the basic means of the <br>\nlanguage are reduced without loss of expressiveness to</p>\n<ul>\n<li>a single rule of inference,</li>\n<li>a single variable binder,</li>\n<li>only two constants and</li>\n<li>only two types,<br>\nobtaining \"definability of all of the propositional connectives, as well as all <br>\nof the quantifiers (universal, existential and uniqueness quantifier)\" and <br>\nderivability of all other rules including the rule of modus ponens as mentioned <br>\nearlier at<br>\n<a href=\"https://lists.cam.ac.uk/pipermail/cl-isabelle-users/2015-July/msg00147.html\">https://lists.cam.ac.uk/pipermail/cl-isabelle-users/2015-July/msg00147.html</a></li>\n</ul>\n<p>In other words, with this simple minimum core logic of Q0 all of formal logic <br>\nand large parts of mathematics, and with type variables (polymorphic type <br>\ntheory) and the binding of type variables with lambda (dependent type theory), <br>\npresumably all of mathematics can be construed, expressed and proved purely <br>\nsyntactically. Due to its simplicity, the logical kernel becomes extremely <br>\nsmall and logically robust, i.e., mathematically safe.</p>\n<p>In the R0 implementation, the propositional connectives therefore are not part <br>\nof the logical core, but their definitions are \"outsourced\" into a file and, <br>\nfor example, the rule of modus ponens into a separate proof template file. In <br>\nfact, the expressiveness of R0 as a logistic system is stronger than that of <br>\nIsabelle/HOL. Isabelle/HOL allows for type variables and therefore has the <br>\nexpressiveness of polymorphic type theory, but only R0 allows, in addition to <br>\nthat, the binding of type variables with lambda as abstraction operator and <br>\ntherefore enables the construction of types required for dependent type theory.</p>\n<ol start=\"2\">\n<li>Any axiom schema requires a meta-level for instantiation. Since my <br>\nphilosophical background rejects any sort of metatheories (I prefer to speak of <br>\narithmetization of mathematics instead of metamathematics, refuting any <br>\nfoundational or legitimating role of metatheories), an axiom schema - like any <br>\nother meta-construction - always reveals a deficit. Whereas Andrews' logic Q0 <br>\nrequires an \"Axiom Schema 3\" [Andrews, 2002, p. 213] (with \"syntactical <br>\nvariables ranging over type symbols\" [Andrews, 2002, p. 210]) for the Axiom of <br>\nExtensionality, R0 uses regular type variables for this axiom [cf. Kubota, <br>\n2015a, pp. 39, 351], which were not available in Q0 being a simple type theory, <br>\ni.e., without type variables.</li>\n</ol>\n<p>Moreover, axiomatic set theory as a whole is subject to critique: \"Axiomatic <br>\nset theory uses axioms to justify the existence of certain sets. Unless the <br>\nproof of existence from these axioms is provided, any construction cannot be <br>\nintroduced into the domain of discourse. This approach, however, is not <br>\nsystematic and subject to arbitrary conditions. For example, the most common <br>\nformulation, the Zermelo-Fraenkel set theory with the Axiom of Choice (ZFC), <br>\ncomprises axioms for the empty set, union, one-element sets, power sets etc., <br>\ntrying to cover the standard sets used in mathematics. But there always remain <br>\nlegitimate sets not contained by these axioms; for example it is well known <br>\nthat large cardinal numbers and certain universes cannot be treated within ZFC <br>\n(without assuming additional axioms), although from a purely logical point of <br>\nview there is no difference between the mathematical objects covered by ZFC and <br>\nthose not covered.</p>\n<p>This problem has its origin in the approach itself, as axiomatic set theory <br>\nmakes use of non-logical axioms to establish sets, thus trying to avoid <br>\nparadoxes via content restrictions instead of the proper specification of the <br>\nformal language. Opting this method, axiomatic set theory including ZFC is <br>\nbound to remain a preliminary and auxiliary approach, but not the foundation of <br>\nmathematics.\" [Kubota, 2015a, p. 18].</p>\n<ol start=\"3\">\n<li>Russell's paradox (\"the set of all sets that are not members of themselves\", <br>\nor originally: \"Let w be the predicate: to be a predicate that cannot be <br>\npredicated of itself. [...] Likewise there is no class (as a totality) of those <br>\nclasses which, each taken as a totality, do not belong to themselves.\" <br>\n[Russell, 1902, p. 125]) with the two constitutive properties of antinomies, <br>\nself-reference and negativity (negation), ruled out Cantor's naive set theory <br>\nas a foundation of mathematics. If Goedel's construction of a proposition <br>\ninvolving self-referencing negativity (\"I am not provable\", or originally: \"We <br>\ntherefore have before us a proposition that says about itself that it is not <br>\nprovable\" [Gödel, 1931, p. 598]) has to be considered as an antinomy, further <br>\nresearch will have to find out whether it rules out natural deduction <br>\n(including sequent calculus) for the foundation of mathematics as a whole or <br>\nwhether a clear distinction of the object language and the meta-language can be <br>\nintroduced into natural deduction.</li>\n</ol>\n<p>The strict distinction of the object language and the meta-language was so <br>\nimportant to Church that he emphasized it a second time in his article: \"We <br>\nmust, of course, distinguish between formal theorems, or theorems of the <br>\nsystem, and syntactical theorems, or theorems about the system, this and <br>\nrelated distinctions being a necessary part of the process of using a known <br>\nlanguage (English) to set up another (more exact) language.\" [Church, 1940, p. <br>\n61]</p>\n<p>In natural deduction, as for example in Isabelle, metatheorems (in terms of <br>\nHilbert-style systems) become part of the formal language (the object language) <br>\nitself. So from the point of view of axiomatic (Hilbert-style) deductive <br>\nsystems, the expressiveness in natural deduction is shifted towards the <br>\nmeta-level, possibly at the cost of expressiveness at the object level. This <br>\ncaused me to introduce an own terminology with the notions of \"object logic\" <br>\nand \"meta-logic\" in my second publication on Goedel [cf. Kubota, 2015] until <br>\nrealizing that the definitional line between \"object logic\" and \"meta-logic\" is <br>\nidentical with that between axiomatic (Hilbert-style) deductive systems and <br>\nnatural deduction, having found the number of allowed occurrences of the <br>\ndeduction symbol (turnstile) in a theorem as a formal criterion. The <br>\ntranslation mechanism from a theorem to the existence of its proof (or vice <br>\nversa) in Goedel's First Incompleteness Theorem is in Paulson's presentation <br>\nhis theorem 'proved_iff_proved_PfP' - called (P) in my article -, in Andrews' <br>\npresentation the implicit rule used for step 7101.4. Whereas in Andrews' system <br>\nthis implicit rule immediately results in inconsistency [cf. Kubota, 2015, pp. <br>\n10 f.], I am not sure whether this applies to natural deduction, too. Because <br>\nof a limited expressiveness at the object level, the antinomy might be <br>\nconstrued without causing an openly visible inconsistency in the formal <br>\nlanguage, since \"the two occurrences of the deduction symbol [...] remain an <br>\nobstacle for obtaining a paradox [i.e., an inconsistency] in the metalogic <br>\n[i.e., in natural deduction]\" [Kubota, 2015, p. 14]. Then, \"Gödel's first <br>\nincompleteness theorem: If consistent, our theory is incomplete.\" (Paulson) is <br>\nrendered from a hypothetical judgement to a trivial tautology in the form of a <br>\nconclusio ex falso, since the theory under consideration is actually <br>\ninconsistent. However, an antinomy (paradox) should not be expressible at all <br>\n(in formal logic and mathematics).</p>\n<p>If natural deduction is ruled out for the foundation of mathematics, there <br>\nwould be no other \"fix\" for Isabelle than switching to an axiomatic <br>\n(Hilbert-style) deductive system. Then, if one does not want to downgrade from <br>\nhigher-order logic (which would artificially limit the expressiveness of the <br>\nlanguage) and prefers to remain in the realm of Russell's invention, namely <br>\ntype theory [cf. Russell, 1908], basically three options would be left:<br>\na) Church's Hilbert-style system of 1940 [cf. Church, 1940] (simple type <br>\ntheory, i.e., without type variables)<br>\nb) Andrews' logic Q0 [cf. Andrews, 2002, pp. 210-215], an improved formulation <br>\nwith identity (equality) as the main notion (also simple type theory, i.e., <br>\nwithout type variables), first published in 1963 as a simplification of <br>\nHenkin's variant of Church's formulation [cf. Andrews, 1963, pp. 345 f., 350<br>\n[message truncated]</p>",
        "id": 294660708,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661169809
    },
    {
        "content": "<p>From: Gottfried Barrow &lt;<a href=\"mailto:igbi@gmx.com\">igbi@gmx.com</a>&gt;<br>\nKen,</p>\n<p>I am addressing you some, but not soley. I think I've said enough to <br>\nmake it clear that I'm not a representative, in any way, of the <br>\nprofessional community that surrounds Isabelle.</p>\n<p>It is my goal to follow through and not have my name end up here much, <br>\nbut everyone serves their purpose, and there are things of value I can <br>\nbring attention to, even if it's mixed in with a lot of noise. The <br>\nexistence of a meta-logic and object-logic in Isabelle is an endless <br>\nsource of confusion for newcomers, and a few basics can clear that up. <br>\nMy last email served to bring attention to that once again, along with <br>\nthe reference to \"Logic and Computation\", by Paulson.</p>\n<p>Here is the thesis of this email: proof assistants are a game-changer. I <br>\nwill try to bring my points back around to that.</p>\n<p>Ken, please don't miss the part below, in my lecture on etiquette,where <br>\nI say this:</p>\n<p>If, in a reply to me, you add emails to people who weren't party to the <br>\ndiscussion, you are a gross violator of decent etiquette.</p>\n<p><em>2ND THING 1ST, PUT UP OR...</em></p>\n<p>The last email, I thought that I bordered on being rude, relative to the <br>\nnormal professionalism here, but it didn't get through to you.</p>\n<p>With proof assistants, for formal logic it now becomes \"deeds not <br>\nwords\". I say that as a buffer to the rude form: \"put up or shut up\". It <br>\ncould be my \"put up or shut up\" theme doesn't deserve to get through to <br>\nthe mailing list.</p>\n<p>When we criticize someone's software, there's a simple comeback for the <br>\nauthor, which is some variation of \"If you're so smart, then why don't <br>\nyou go ahead and fix it?\"</p>\n<p>If you're so bold as to say that the logic of Isabelle may be <br>\ninconsistent, then why don't you \"put up\" by showing that it's <br>\ninconsistent. Otherwise, \"shut up\" about it. Deeds not words.</p>\n<p>Meta-think is obviously needed to set up or analyze an object language <br>\nor an object-logic (and even a meta-logic).  Consequently, it may appear <br>\nthat the domain of the meta-think remains domain of the human mind.</p>\n<p>Not at all. (I'm polluting my point somehow. Semantics anyone? But for <br>\nmeta-thinkers only. Syntax is sufficient for object-think.) Any smart <br>\nmeta-thinker who can program should be able to code up the meta-ideas, <br>\nand proof assistants move the expectations to \"You're boring me with <br>\nyour talk. Code it up, so we have something fixed to talk about\".</p>\n<p>If you're so bold as to claim that Isabelle is imperfect, then \"put up\" <br>\nand implement the perfect logic. Well, you appear to have coded up the <br>\nbasics of something. And the world now is supposed to stop and jump on <br>\nyour logic wagon?</p>\n<p>The problem with \"put up\" is that it's subjective. I'll state my <br>\nopinion. You haven't. I'll leave the \"shut up\" as implied.\n*\n1ST THING 2ND, LEARN SOME DECENT ETIQUETTE*</p>\n<p>What I say now is at least as important as what I just said.</p>\n<p>I myself abuse etiquette, but I don't add email addresses in a reply to <br>\npeople who haven't been party to a thread.</p>\n<p>Your first email was to 6 people plus the user list. I responded back <br>\nonly to the user list address. That was a very intentional act on my part.</p>\n<p>You could have at least addressed it to \"Dear List Members and Gottfried <br>\nBarrow\".</p>\n<p>I am not in the same class as \"List Members\". List members in general <br>\nmost likely have a PhD and are qualified, or more qualified than me to <br>\nbe meta-thinkers. I have a B.S. in math and am qualified to potentially <br>\nbe a respectable object-thinker.</p>\n<p>We're all a team, and we don't even have to like each other. It's <br>\nobject-think-users who are needed here, not meta-thinkers.</p>\n<p>But even object-thinkers can recognize basic mistakes in thinking, like <br>\na person making a big deal about a theorem holding under one set of <br>\naxioms, but not under another set of axioms, where I'm assuming I don't <br>\nhave a total misunderstanding of what you've said.</p>\n<p>There is no need for me to be a meta-thinker. I want to do math, not <br>\nforever be bogged down in foundations. First-order logic comes for free <br>\nwith HOL. With functional-prog-logic, I'm way ahead of the Z-Crowd <br>\nalready, with their 5 millimeters. I need true, false, and the Law of <br>\nExcluded Middle. The Axiom of Choice? Of course. But your stuff? I need it?</p>\n<p>Don't diss the team, dude, and don't spam the team leaders, or those <br>\nexternal, while also making me a part of it.But don't worry, I'm a <br>\nnobody. Nothing will be lost by not including me with all the other people.</p>\n<p>If, in a reply to me, you add emails to people who weren't party to the <br>\ndiscussion, you are a gross violator of decent etiquette. (I heavily <br>\nwatered that sentence down, to also try and respect the professionals here.)</p>\n<p><em>QUOTE? LINKS INSTEAD, CONCERNING PURITY</em></p>\n<p>I guess I had a point to make. I'll go ahead and pull a quote of yours, <br>\nafter all:</p>\n<p>\"Since my philosophical background rejects any sort of metatheories... \"</p>\n<p>Hmm. Sounds like a heavy burden to carry. My philosophical background is <br>\nthe extent to which I've spoken philosophically, and I only require that <br>\nto the extent I've said stupid things, I don't say them again.</p>\n<p>So you're talking about purity. I guess I don't care here, so I don't <br>\nneed to speak for Larry Paulson, and say whether he is or isn't a purist.</p>\n<p>I do know he takes practical things into consideration, as demonstrated <br>\nby a recent comment he made on the FOM mailing list, which I link to below.</p>\n<p>Where is there room here for me to speak of the <br>\n\"all-or-nothing-requirement\", for people more picky than me, about what <br>\nthey need to get them to abandon their 5 millimeter mechanical pencils? <br>\nIt all has to be good.</p>\n<p>For mechanized proof, where math is literature, a great logic is useless <br>\nwithout the-rest-of-it, which you ain't got.</p>\n<p>If you want purity, in the way you want purity, code it up, and suffer <br>\nthe impracticalities of your own product. But syntactically, how can <br>\nanything be pure, when programming languages have to be used, with the <br>\nthousands of details involved? The absence of details is actually part <br>\nof the current illusion-of-elegance for traditional logics, as if <br>\nthere's more than one in force.</p>\n<p>Anyway,</p>\n<p><a href=\"http://www.cs.nyu.edu/pipermail/fom/2015-October/019312.html\">http://www.cs.nyu.edu/pipermail/fom/2015-October/019312.html</a><br>\n<a href=\"http://www.cs.nyu.edu/pipermail/fom/2015-October/019282.html\">http://www.cs.nyu.edu/pipermail/fom/2015-October/019282.html</a><br>\n<a href=\"http://www.cs.nyu.edu/pipermail/fom/2015-October/date.html\">http://www.cs.nyu.edu/pipermail/fom/2015-October/date.html</a><br>\n<a href=\"http://www.cs.nyu.edu/pipermail/fom/2015-September/date.html\">http://www.cs.nyu.edu/pipermail/fom/2015-September/date.html</a></p>\n<p>Pay attention, or not, to Larry Paulson:</p>\n<p>It looks like I need to clarify my remark about “imposing unreasonable costs”.<br>\n   Under this I do not include the difficulty of implementing a proof assistant,<br>\n   because our job is to build things and let the computer do the work. The costs<br>\n   rather are those imposed on users who have to work within the free logic. I<br>\n   often compare theorem proving in a formal logic to building a ship in a bottle,<br>\n   and nobody wants to make the bottle any smaller, or the ship any bigger. To be<br>\n   more precise, I have seen proof-theoretic work showing that very small changes<br>\n   to a proof calculus can increase the length of a formal proof, in the worst case,<br>\n   by a non-elementary factor. It isn’t obvious that the use of a free logic would<br>\n   be as costly as that, but I get the impression that users who have tried such<br>\n   systems have not been happy with the effort involved. I don’t believe that good<br>\n   automation could entirely eliminate this effort.</p>\n<p>*PAYING HOMAGE TO A MATHEMATICIAN WHO CARED\n*\nI forgot how I was supposed to use this, but it's about Robert M. Solovay.</p>\n<p>Steven Obua published \"Partizan Games in Isabelle/HOLZF\":</p>\n<p><a href=\"https://mediatum.ub.tum.de/doc/1094432/1094432.pdf\">https://mediatum.ub.tum.de/doc/1094432/1094432.pdf</a></p>\n<p>In it, he references Robert Solovay as saying that axioms added to <br>\nIsabelle/HOL will be consistent. That gave me enough confidence to <br>\nconsider it wouldn't be a waste of my time to mess around with adding <br>\nthe axioms, similar to how Obua does it.</p>\n<p>Initially, I couldn't find the reference, then one day, I searched <br>\nagain, and it came up:</p>\n<p><a href=\"https://groups.google.com/forum/#!msg/fa.isabelle/fKOEdb7uqJk/qYY1-MNxwSsJ\">https://groups.google.com/forum/#!msg/fa.isabelle/fKOEdb7uqJk/qYY1-MNxwSsJ</a></p>\n<p>Solovay writes:</p>\n<p>This alternative is certainly possible, but [if I understand it <br>\ncorrectly]<br>\n   is not what I'm interested in.</p>\n<p>Your version: [HOL in ZFC] has the same consistency strength as ZFC.</p>\n<p>My version [ZFC in HOL] would have consistency strength considerably<br>\n   greater than ZFC [just a shade less than Zermolo + Choice + \"There is an<br>\n   inacessible cardinal].</p>\n<p>How can I tie this into you, Ken?</p>\n<p>You think you're the only one with ideas? Ideas are a dime a dozen. <br>\nIdeas aren't a problem. Time is a problem, with the upper limit of <br>\nmortality being the ultimate arbiter of time.</p>\n<p>In overstating things, I said no one cares about a raw logic. I can also <br>\nsay that I'm interested in everything, but have time for nothing.</p>\n<p><em>THE NEW GAME</em></p>\n<p>The new game for logic will be proof assistants. The game will not be <br>\nplayed in full force until people can get educated in the rules of the <br>\ngame, in a reasonable amount of time.</p>\n<p>When the game is in full force, cheap talk won't be tolerated much, but <br>\nthen, the idea of wanting to engage in cheap talk will be foreign to the <br>\nvast number of people who want to play the game of logic.</p>\n<p>These days, find a bunch of programmers, doing meta-talk. In general, <br>\nthey're doers. They all write programs. They talk about what others have <br>\ndone, or what they've done. Talk and do. They do them both.</p>\n<p>That'll be the future of the game of mathematics. Whether low or high, <br>\nthere will be no place for cheap and undeserved glory.</p>\n<p><em>DISCO, TRUST ME ON THIS ONE</em></p>\n<p>I hate giving away my potential secrets to success, but I'm a benevolent <br>\nperson.</p>\n<p>Logic? Meta-think? Definitely crowded games to play, since the last mods <br>\nfor fixing naive sets was, when? Yea, not recent.</p>\n<p>Hopeless situation? No, not with the trifecta-of-potential-success for <br>\nTrue Artistes: dance, trance, and disco.</p>\n<p>That's not to say that some things don't stay the same.</p>\n<p>For example, you never want show up on the dance floor and start dissin' <br>\nJohn Travolta, and not have, at least, disco <br>\n[message truncated]</p>",
        "id": 294660896,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661169857
    }
]