[
    {
        "content": "<p>From: Robin Green &lt;<a href=\"mailto:greenrd@greenrd.org\">greenrd@greenrd.org</a>&gt;<br>\nA question about transforming Isabelle proofs into really elementary, <br>\nlong-winded form:</p>\n<p>I have not used Isabelle yet, but I have read in three places that <br>\nIsabelle is designed to support many different logics and theories by <br>\nhaving a relatively simple core language upon which everything else is <br>\nimplemented. It should, therefore, be possible to get Isabelle to output <br>\na proof _entirely_ in this core language (i.e. so that it uses only the <br>\nvery primitive notation from this core language, and only the most <br>\nelementary possible inferences are used, and no other files are referred <br>\nto), so that it can be independently verified by a very small, <br>\neasy-to-reason-about proof verifier. (Of course that still leaves the <br>\nquestion of whether the translation is correct, but let's ignore that <br>\nfor now.)</p>\n<p>When I talk about \"the most elementary possible inferences\", I am <br>\nthinking of something like Metamath[1], which is apparently based <br>\nentirely on simple substitution rules. In other words, emphatically not <br>\n(non-trivial) tactics.</p>\n<p>In [2], I found a tantalising hint which suggests that this feature <br>\nbecame available in Isabelle 99:</p>\n<p>\"The Isabelle 98 version is used in this thesis, although a later <br>\nversion (Isabelle99) has since been released. These recent versions<br>\nof Isabelle support the construction and export of proof derivations, a <br>\nfeature that was not available in early versions of Isabelle.\"</p>\n<p>However, I've been unable to ascertain, by browsing the documentation, <br>\nwhere this export feature that Watson refers to, is. Is it there but <br>\nundocumented, have I missed it, or have I misunderstood what it is? Or <br>\nis it simply not there?</p>",
        "id": 293899561,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660743934
    },
    {
        "content": "<p>From: Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt;<br>\nOn Thu, 12 Jan 2006, Robin Green wrote:</p>\n<blockquote>\n<p>A question about transforming Isabelle proofs into really elementary, <br>\nlong-winded form:</p>\n</blockquote>\n<blockquote>\n<p>In [2], I found a tantalising hint which suggests that this feature <br>\nbecame available in Isabelle 99:</p>\n</blockquote>\n<p>See Stefan Berghofer's thesis for a slightly more up-to-date report on <br>\nproof terms (based on lambda calculus) for Isabelle/Pure. The Introduction <br>\nand chapter 2 should give you some idea how this looks like.</p>\n<p>Stefan Berghofer. Proofs, Programs and Executable Specifications in<br>\n   Higher Order Logic. Ph.D. thesis, Institut für Informatik, Technische<br>\n   Universität München, 2003.<br>\n<a href=\"http://www4.in.tum.de/~berghofe/papers/phd.pdf\">http://www4.in.tum.de/~berghofe/papers/phd.pdf</a></p>\n<blockquote>\n<p>When I talk about \"the most elementary possible inferences\", I am <br>\nthinking of something like Metamath[1], which is apparently based <br>\nentirely on simple substitution rules. In other words, emphatically not <br>\n(non-trivial) tactics.</p>\n</blockquote>\n<p>I would consider the Metamath format slightly low-level, with adhoc <br>\nhandling of bound variable scopes; lambda calculus provides a more <br>\nabstract and clean notion of variable binding and substitution.</p>\n<p>Also note that the actual primary proof format for Isabelle is that of the <br>\nIsar proof language, which admits writing proofs in a human-readable <br>\nfashion.  Needless to say, everything will end up as a primitive internal <br>\nproof object eventually, but normally these are getting too large to <br>\ninspect them directly.  This is why humans would normally stay at the <br>\nlevel of Isabelle/Isar proof documents -- printed in LaTeX/PDF.</p>\n<p>Makarius</p>",
        "id": 293899576,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660743937
    },
    {
        "content": "<p>From: Robin Green &lt;<a href=\"mailto:greenrd@greenrd.org\">greenrd@greenrd.org</a>&gt;<br>\nReplying to my own post -</p>\n<p>My apologies. I read the paragraph I quoted too hastily and <br>\nmisunderstood it! Dr. Watson has informed me that the export of proof <br>\nderivations _was_ supported in Isabelle 98 (not Isabelle 99 as I misread <br>\nit) - and is covered in his thesis, from which that quotation was taken.</p>\n<p>(Any further information not covered in that thesis would of course be <br>\nappreciated.)</p>",
        "id": 293899580,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660743938
    }
]