[
    {
        "content": "<p>From: June Andronick &lt;<a href=\"mailto:June.Andronick@nicta.com.au\">June.Andronick@nicta.com.au</a>&gt;<br>\n[on behalf of Boris Koepf]</p>\n<p>===================================================<br>\nCSF 2016 Call for Papers<br>\n29th IEEE Computer Security Foundations Symposium</p>\n<p><a href=\"http://csf2016.tecnico.ulisboa.pt/\">http://csf2016.tecnico.ulisboa.pt/</a><br>\nJune 28-July 1, 2016<br>\nLisbon, Portugal</p>\n<p>The Computer Security Foundations Symposium is an annual conference<br>\nfor researchers in computer security. CSF seeks papers on foundational<br>\naspects of computer security, such as formal security models,<br>\nrelationships between security properties and defenses, principled<br>\ntechniques and tools for design and analysis of security mechanisms,<br>\nas well as their application to practice. While CSF welcomes<br>\nsubmissions beyond the topics listed below, the main focus of CSF is<br>\nfoundational security: submissions that lack foundational aspects risk<br>\nrejection.</p>\n<p>This year, CSF will use a light form of double blind reviewing; see<br>\nbelow.</p>\n<p>Topics</p>\n<hr>\n<p>New results in computer security are welcome. We also encourage<br>\nchallenge/vision papers, which may describe open questions and raise<br>\nfundamental concerns about security. Possible topics for all papers<br>\ninclude, but are not limited to: access control, accountability,<br>\nanonymity and privacy, authentication, computer-aided cryptography,<br>\ndata and system integrity, database security, decidability and<br>\ncomplexity, distributed systems security, electronic voting, formal<br>\nmethods and verification, decision theory, hardware-based security,<br>\ninformation flow, intrusion detection, language-based security,<br>\nnetwork security, data provenance, mobile security, security metrics,<br>\nsecurity protocols, software security, socio-technical security, trust<br>\nmanagement, usable security, web security.</p>\n<p>Special Sessions</p>\n<hr>\n<p>This year, we strongly encourage papers in two foundational areas of<br>\nresearch we would like to promote at CSF:</p>\n<p>PRIVACY (Chair: Daniel Kifer). CSF 2016 will include a special<br>\n  session on privacy foundations and invites submissions on<br>\n  innovations in practice, as well as definitions, models, and<br>\n  frameworks for communication and data privacy, principled analysis<br>\n  of deployed or proposed privacy protection mechanisms, and<br>\n  foundational aspects of practical privacy technologies. We<br>\n  especially encourage submissions aiming at connecting the computer<br>\n  science point of view on privacy with that of other disciplines<br>\n  (law, economics, sociology, statistics...)</p>\n<p>SECURITY ECONOMICS (Chair: Jens Grossklags). There is an interplay<br>\n  between important system properties including privacy, security,<br>\n  efficiency, flexibility, and usability. Diverse systems balance<br>\n  these properties differently, and as such provide varied benefits<br>\n  (for users) for different costs (for builders and attackers). In<br>\n  short, securing systems is ultimately an economic question. CSF 2016<br>\n  will include a special session on security economics, where we<br>\n  invite submissions on foundational work in this area. Topics<br>\n  include, but are not limited to, risk management and<br>\n  cyber-insurance, investments in information security, security<br>\n  metrics, decision and game theory for security, and<br>\n  cryptocurrencies.</p>\n<p>These papers will be reviewed under the supervision of the special<br>\nsession chairs. They will be presented at the conference, and will<br>\nappear in the CSF proceedings, without any distinction from the other<br>\npapers.</p>\n<p>Proceedings, published by the IEEE Computer Society Press (pending<br>\napproval), will be available at the symposium, and selected papers<br>\nwill be invited for submission to the Journal of Computer Security.</p>\n<hr>\n<p>IMPORTANT DATES</p>\n<p>Papers due:             February 12, 2016<br>\nAuthor response period: March 24-25, 2016<br>\nNotification:           April 8, 2016<br>\nCamera ready:           May 6, 2016<br>\nSymposium:              June 28-July 1, 2016</p>\n<hr>\n<p>PROGRAM COMMITTEE</p>\n<p>June Andronick, NICTA and UNSW<br>\nAslan Askarov, Aarhus University<br>\nManuel Barbosa, University of Porto<br>\nLujo Bauer, Carnegie Mellon University<br>\nKarthikeyan Bhargavan, INRIA<br>\nAnna Lisa Ferrara, University of Surrey<br>\nMatt Frederikson, Carnegie Mellon University<br>\nJens Grossklags, Penn State (Area Chair on Security Economics)<br>\nMike Hicks, University of Maryland (Program Co-Chair)<br>\nCatalin Hritcu, INRIA<br>\nDaniel Kifer, Penn State (Area Chair on Privacy)<br>\nJong Kim, Pohang University of Science and Technology<br>\nBoris Koepf, IMDEA Software Institute (Program Co-Chair)<br>\nSteve Kremer, INRIA<br>\nPeeter Laud, Cybernetica<br>\nMatteo Maffei, Saarland University<br>\nStephen Magill, Galois<br>\nSebastian Moedersheim, Technical University of Denmark<br>\nGreg Morrisett, Cornell University<br>\nAndrei Sabelfeld, Chalmers University of Technology<br>\nGeoffrey Smith, Florida International University<br>\nMichael Carl Tschantz, ICSI Berkeley<br>\nBogdan Warinschi, University of Bristol<br>\nNicola Zannone, Eindhoven University of Technology<br>\nSteve Zdancewic, University of Pennsylvania</p>\n<hr>\n<p>PAPER SUBMISSION INSTRUCTIONS</p>\n<p>Submitted papers must not substantially overlap with papers that have<br>\nbeen published or that are simultaneously submitted to a journal or a<br>\nconference with published proceedings.</p>\n<p>Papers must be submitted using the two-column IEEE Proceedings style<br>\navailable for various document preparation systems at the IEEE<br>\nConference Publishing Services page. All papers should be at most 12<br>\npages long, not counting bibliography and well-marked appendices.<br>\nCommittee members are not required to read appendices, and so the<br>\npaper must be intelligible without them.</p>\n<p>Following the recent history of other top-quality conferences and<br>\nsymposia in security, CSF'16 will employ a light form of double-blind<br>\nreviewing. To facilitate this, submitted papers must (a) omit any<br>\nreference to the authors' names or the names of their institutions,<br>\nand (b) reference the authors' own related work in the third person<br>\n(e.g., not \"We build on our previous work ...\" but rather \"We build on<br>\nthe work of ...\"). Nothing should be done in the name of anonymity<br>\nthat weakens the submission or makes the job of reviewing the paper<br>\nmore difficult (e.g., important background references should not be<br>\nomitted or anonymized). Please see the conference site for answers to<br>\nfrequently asked questions (FAQ) that address many common<br>\nconcerns. When in doubt, contact the program chairs.</p>\n<p>Papers failing to adhere to any of the instructions above will be<br>\nrejected without consideration of their merits.</p>\n<p>Papers intended for one of the special sessions should select the<br>\n\"Privacy\" or \"Security Economics\" option, as appropriate.</p>\n<p>At least one coauthor of each accepted paper is required to attend CSF<br>\nto present the paper.</p>\n<hr>\n<p>PC Chairs<br>\nMichael Hicks, University of Maryland<br>\nBoris Koepf, IMDEA Software Institute</p>\n<p>General Chair<br>\nPedro Adao, University of Lisbon</p>\n<p>Publications Chair<br>\nDeepak Garg, Max Planck Institute for Software Systems</p>\n<p>Publicity Chair<br>\nMatteo Maffei, CISPA, Saarland University</p>\n<hr>\n<p>The information in this e-mail may be confidential and subject to legal professional privilege and/or copyright. National ICT Australia Limited accepts no liability for any damage caused by this email or its attachments.</p>",
        "id": 294658281,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661168942
    }
]