[
    {
        "content": "<p>From: \"W. Douglas Maurer\" &lt;<a href=\"mailto:maurer@gwu.edu\">maurer@gwu.edu</a>&gt;<br>\nI have a write-up in which I am trying to teach my students how to <br>\nuse Auto solve_direct, using as simple an example as I can come up <br>\nwith. The example I chose was: If x is a multiple of 4, then so is <br>\nx^2. So I started my .thy file by writing<br>\nlemma fixes x::int assumes \"4 dvd x\" shows \"4 dvd x*x\"<br>\nand I immediately got an output message saying<br>\nAuto solve_direct: The current goal can be solved directly with<br>\nRings.comm_semiring_1_class.dvd_mult: ?a dvd ?c ==&gt; ?a dvd ?b * ?c<br>\nRings.comm_semiring_1_class.dvd_mult2: ?a dvd ?b ==&gt; ?a dvd ?b * ?c<br>\nI want to teach the students that, when they get a message saying <br>\nthat the current goal can be solved directly with alpha, they should <br>\nfinish the proof by writing<br>\nby (rule alpha)<br>\nBut in this case, when I tried to finish the proof by writing<br>\nby (rule Rings.comm_semiring_1_class.dvd_mult)<br>\nit didn't go through.<br>\nAs it so happens, if I precede this with<br>\nusing assms<br>\nit does go through, but now it doesn't need anything from theory <br>\nRings; it can be proved by simp, which spoils the example of how to <br>\nuse Auto solve_direct. So I guess my questions are:<br>\nWhy does Auto solve_direct tell me that a goal can be solved directly <br>\nwith some rule alpha, when this is actually not the case without <br>\nadding using assms?<br>\nAnd if Auto solve_direct assumes that I'm going to try using assms, <br>\nwhy doesn't it then tell me that the current goal can be solved by <br>\nsimp, instead of pulling something out of theory Rings? Thanks! <br>\n-WDMaurer</p>",
        "id": 294646589,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661164341
    },
    {
        "content": "<p>From: Larry Paulson &lt;<a href=\"mailto:lp15@cam.ac.uk\">lp15@cam.ac.uk</a>&gt;<br>\nThe assumptions are part of the theorem. After all, nobody would state Fermat’s Last Theorem as </p>\n<p>x^n + y^n ~= z^m, </p>\n<p>without the preconditions on x, y, z and n.</p>\n<p>Regarding your other question: many facts can be proved by simp alone, but here the point is to alert you that your proposed theorem has already been proved in essentially the same form.</p>\n<p>Larry Paulson</p>",
        "id": 294646604,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661164346
    }
]