[
    {
        "content": "<p>From: Gudmund Grov &lt;<a href=\"mailto:gudmundgrov@gmail.com\">gudmundgrov@gmail.com</a>&gt;<br>\nPost-doc position in Tactics for Program Verifiers</p>\n<p>The Research Associate will work on the EPSRC project \"DTacs - Program<br>\nVerifier Tactics : Reducing the Development Time for Program Verifiers<br>\nwith Re-usable Verification Strategies\".  This project  addresses a<br>\nnew method for proof automation for the Dafny program verifier by<br>\ndeveloping support for user-provided and re-usable proof patterns. The<br>\nend goal is to liberate users from low-level and repetitive search<br>\ntasks by replacing these with higher-level underlying patterns that<br>\ncan be reused for similar tasks; increasing automation and reducing<br>\ndevelopment time and cost.</p>\n<p>The work is inspired by proof tactics used to encode reasoning<br>\npatterns for interactive theorem provers. The novelty of the `Dafny<br>\ntactics' we seek to develop is that proof patterns will be encoded as<br>\nspecial Dafny methods within the program text, making them accessible<br>\nto a wider group of users. We are therefore seeking a candidate with<br>\nexpertise in tactic languages (for interactive theorem provers) and/or<br>\nexpertise with program verifiers. The successful candidate will work<br>\nclosely with the investigator in developing the concept of Dafny<br>\ntactics, and will therefore be integral in shaping this new and<br>\nexciting research area. Project collaborators include Microsoft<br>\nResearch (Redmond, USA) and NUI Maynooth (Ireland), and the successful<br>\ncandidate will have the opportunity to make research visits to these<br>\nsites. The work will involve analysis of existing Dafny case studies,<br>\nas well as developing new examples from scratch.  It is therefore<br>\ndesirable to have experience with formal development of software. A<br>\nkey outcome of the project will be a prototype implementation of Dafny<br>\ntactics. Good programming skills are therefore essential, and<br>\nfamiliarity with C# and Visual Studio are desirable.  The successful<br>\ncandidate should also be able to communicate effectively with people<br>\nfrom other disciplines, and will be expected to:</p>\n<ul>\n<li>Contribute to conference papers and journal articles</li>\n<li>Present research outputs at project meetings and international conferences</li>\n<li>Communicate and collaborate with project partners</li>\n<li>Demonstrate good time management skills</li>\n</ul>\n<p>The post is available for twelve months. Candidates should have, or be<br>\nnear to completing, a PhD in formal methods or automated reasoning, or<br>\na similar area. Experience with formal verification is essential, and<br>\nexperience with program verification, in particular Dafny, and<br>\ninteractive theorem proving and collaborative research is also<br>\ndesirable. Candidates should have good programming and software<br>\ndevelopment skills, be comfortable working to tight deadlines, working<br>\nwith other people, and be able to communicate complex ideas<br>\neffectively in person and in writing.</p>\n<p>Informal enquiries should be made to Gudmund Grov:<br>\n<a href=\"mailto:G.Grov@hw.ac.uk\">G.Grov@hw.ac.uk</a></p>\n<p>Details about how to apply can be found at:<br>\n<a href=\"http://www.hw.ac.uk/about/careers/job-opportunities/research-associate-in-tactics-for-program.htm\">http://www.hw.ac.uk/about/careers/job-opportunities/research-associate-in-tactics-for-program.htm</a></p>\n<p>Closing date: 25 May.</p>",
        "id": 294640560,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661161920
    }
]