[
    {
        "content": "<p>From: Peter Lammich &lt;<a href=\"mailto:peter.lammich@uni-muenster.de\">peter.lammich@uni-muenster.de</a>&gt;<br>\nHI all,</p>\n<p>I have a problem with the following function definition:</p>\n<p>fun balance:: \"'a tree =&gt; 'a tree\" where<br>\n    \"balance (T B (T R (T R a x b) y c) z d) = T R (T B a x b) y (T B c<br>\nz d)\" |<br>\n    \"balance (T B (T R a x (T R b y c)) z d) = T R (T B a x b) y (T B c<br>\nz d)\" |<br>\n    \"balance (T B a x (T R (T R b y c) z d)) = T R (T B a x b) y (T B c<br>\nz d)\" |<br>\n    \"balance (T B a x (T R b y (T R c z d))) = T R (T B a x b) y (T B c<br>\nz d)\" |<br>\n    \"balance t = t\"</p>\n<p>isabelle seems to need really long to process this command, I have<br>\nwaited for several minutes and finally had to kill isabelle because it<br>\nused 1.5GB of memory and my computer started getting unusable due to<br>\nvery high response times.<br>\nIs their any standard approach how speed this command up ?</p>\n<p>Best regards,<br>\n  Peter</p>",
        "id": 294070203,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660826888
    },
    {
        "content": "<p>From: Alexander Krauss &lt;<a href=\"mailto:krauss@in.tum.de\">krauss@in.tum.de</a>&gt;<br>\nHi Peter,</p>\n<p>Eating 1,5G of memory sounds a bit too much (64 bit? proof terms?), but <br>\nin general, it is perfectly normal that the balance function blows up <br>\nthe function package: Isabelle tries to make the patterns <br>\nnon-overlapping (this is necessary, because they are not valid as they <br>\nare written), which leads to an exponential explosion of cases. The rest <br>\nof the package again has an n^2 complexity in the number of equations...</p>\n<p>Note that there is already a formalization of red-black trees in <br>\nHOL/Library/RBT.thy. Maybe that can save you some work... In that <br>\nformalization, the definition of balance is slow, but works.</p>\n<p>There is no general way of fixing this explosion. You can only try to <br>\navoid such evil pattern matching. If you really really need it, good old <br>\nrecdef may be faster, since it has a less general handling of pattern <br>\nmatching.</p>\n<p>Actually, this particular function was the reason for me to investigate <br>\nhow the problem can be avoided. Short answer: It can't. Long answer:<br>\n<a href=\"http://www4.in.tum.de/~krauss/patterns/\">http://www4.in.tum.de/~krauss/patterns/</a></p>\n<p>Alex</p>",
        "id": 294070216,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660826892
    }
]