[
    {
        "content": "<p>From: Markus Roggenbach &lt;<a href=\"mailto:M.Roggenbach@swansea.ac.uk\">M.Roggenbach@swansea.ac.uk</a>&gt;<br>\nCALL FOR PAPERS</p>\n<p>FM-RAIL-BOK WORKSHOP 2013 </p>\n<p>-- Workshop on a <br>\n  -- Formal Methods Body of Knowledge for <br>\n  -- Railway Control and Safety Systems</p>\n<p>23-24 September 2013, 2013, Madrid, Spain<br>\n<a href=\"http://ssfmgroup.wordpress.com\">http://ssfmgroup.wordpress.com</a></p>\n<p>A workshop in SEFM'13<br>\n  September 25-27, 2013, Madrid, Spain<br>\n<a href=\"http://antares.sip.ucm.es/sefm2013/\">http://antares.sip.ucm.es/sefm2013/</a></p>\n<p>MOTIVATION AND SCIENCE-PHILOSOPHICAL BACKGROUND</p>\n<p>Formal methods in software science and software engineering have<br>\n  existed at least as long as the term “software engineering” (NATO<br>\n  Science Conference, Garmisch, 1968) itself. In many<br>\n  engineering-based application areas, such as in the railway domain,<br>\n  formal methods have reached a level of maturity that already enables<br>\n  the compilation of a so-called body of knowledge (abbreviated as<br>\n  “BOK”). Its various methods and techniques include algebraic<br>\n  specification, process-algebraic modelling and verification, Petri<br>\n  nets, fuzzy logics, etc. For example, the B-method has been used<br>\n  successfully to verify the most relevant parts of a model of the<br>\n  Metro underground railway system of the city of Paris<br>\n  (France). Software tool support is already available for a number of<br>\n  those formal methods; for example in the form of various model<br>\n  checker or SAT solver programs.</p>\n<p>In this context, our workshop shall bring together scientists,<br>\n  researchers and practitioners, from academia, the industry,<br>\n  professional guildes and engineering associations, national or<br>\n  international standardisation committees, as well as governmental or<br>\n  administrative regulators to re-collect and discuss the “state of<br>\n  the art” in the application of formal methods within the railway<br>\n  domain (including inner-city tram lines, urban mono-rail systems,<br>\n  etc., too). Thereby we shall adopt a methodological viewpoint based<br>\n  on Vincenti’s book \"What Engineers know and how they know it:<br>\n  Analytical Studies from Aeronautical History, John Hopkins<br>\n  University Press, 1990\". This book contains a science-historical and<br>\n  science-philosophical analysis of what it is that constitutes<br>\n  engineering knowledge (and the related practice) specifically, in<br>\n  other words: an epistemology of engineering. The development of the<br>\n  above-mentioned handbooks as an explicit recording of such knowledge<br>\n  is part of Vincenti’s epistemology.</p>\n<p>SUBMISSION</p>\n<p>Our workshop calls for short position papers with strong emphasis on<br>\n  methodologically sound “BOK” contents and case-based “best practice”<br>\n  knowledge in the spirit of classical engineering handbooks.</p>\n<p>Such papers, which will be reviewed and moderated by the workshop’s<br>\n  programme committee, must not exceed 6 pages in the IEEE<br>\n  double-column conference format</p>\n<p><a href=\"http://www.ieee.org/conferences_events/conferences/publishing/templates.html\">http://www.ieee.org/conferences_events/conferences/publishing/templates.html</a></p>\n<p>and must be submitted via our EasyChair Submission Website</p>\n<p><a href=\"http://www.easychair.org/account/signin.cgi?conf=fmrailbok2013\">http://www.easychair.org/account/signin.cgi?conf=fmrailbok2013</a></p>\n<p>no later than the stipulated submission deadline.  Submissions which<br>\n  do not meet these requirements will be rejected without review.</p>\n<p>IMPORTANT DATES:</p>\n<p>Paper submission deadline: 14 June 2013  <br>\n  Author notification: 5 July 2013<br>\n  Re-submission of revised accepted papers: 16 August 2013<br>\n  Distribution of revised papers amongst registered participants: 2 September 2013<br>\n  Workshop in Madrid: 23-24 September 2013<br>\n  Thereafter: post-discussions and further work towards the planned book release</p>\n<p>WORKSHOP CO-CHAIRS</p>\n<p>Anne Haxthausen, Technical University of Denmark <br>\n  Markus Roggenbach, University of Swansea, Great Britain<br>\n  Stefan Gruner, University of Pretoria, South Africa<br>\n  Tom Maibaum, McMaster University, Canada</p>\n<p>PROGRAMME COMMITTEE (confirmation status: 21 March 2013)</p>\n<p>Martin Brennan, British Rail Safety Standards Board<br>\n  Simon Chadwick, Invensys Rail, Great Britain<br>\n  Lars-Henrik Eriksson, Uppsala University, Sweden<br>\n  Alessandro Fantechi, University of Firenze, Italy<br>\n  Michaela Huhn, Technical University of Clausthal, Germany<br>\n  Hoang Nga Nguyen, University of Swansea, Great Britain<br>\n  Jan Peleska, University of Bremen, Germany<br>\n  Holger Schlingloff, Humboldt-University of Berlin, Germany<br>\n  Kenji Taguchi, AIST, Japan<br>\n  Helen Treharne, University of Surrey, Great Britain<br>\n  Laurent Voisin, Systerel, France<br>\n  Kirsten Winter, University of Queensland, Australia</p>\n<p>WORKSHOP FORMAT</p>\n<p>Our workshop is planned as a workshop in the proper sense of the<br>\n  word, i.e.: it will be work-oriented, not<br>\n  presentation-oriented. During the workshop, smaller sub-groups will<br>\n  work on various sub-topics, whereas plenum sessions will bring the<br>\n  sub-groups and their sub-results together again.</p>\n<p>For the sake of effective working during the event, all accepted<br>\n  papers will be distributed amongst the registered participants<br>\n  already before the event. Participants are expected to study these<br>\n  papers before the workshop, such that the discussions and sub-groups<br>\n  can commence effectively from the first hour of the meeting onwards.</p>\n<p>Soon after the workshop, its work results (proceedings) shall be<br>\n  published first in the form of an institutional technical<br>\n  report. Thereafter the technical report shall be further “polished”<br>\n  and consolidated, with the goal of publishing an authoritative BOK<br>\n  book on the chosen topic, with a reputable publisher, in the<br>\n  not-too-far future.</p>\n<p>In case of good success, similar BOK preparation workshops are<br>\n  planned for the future on other (yet similar) topics, for example:<br>\n  formal methods for aviation software, or formal methods for<br>\n  automobile applications, etc. In the long term, this could lead to a<br>\n  multi-volume series of such BOK books on various topics.</p>\n<p>PUBLICATION</p>\n<p>According to our workshop’s goal and format we follow a 3-phase<br>\n  publication plan with informal distribution of accepted papers<br>\n  amongst registered workshop participants before the workshop,<br>\n  official release of an institutional technical report soon after the<br>\n  workshop, publication of a refined and consolidated BOK book in the<br>\n  not-too-far future, after the technical report, with a reputable<br>\n  scientific publisher.</p>",
        "id": 294237738,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660905515
    }
]