[
    {
        "content": "<p>From: Vincenzo De Florio &lt;<a href=\"mailto:enzodeflorio@virgilio.it\">enzodeflorio@virgilio.it</a>&gt;<br>\nDear Sirs, dear Madams,<br>\nplease consider submitting papers to ANTIFRAGILE 2016!</p>\n<p>ＡＮＴＩＦＲＡＧＩＬＥ 2016 - the 3rd International Workshop on Computational Antifragility and Antifragile Engineering<br>\nin the framework of the 7th International Conference on Ambient Systems, Networks and Technologies (ANT-2016),<br>\nMay 23-26, 2016, Universidad Politécnica de Madrid in Madrid, Spain<br>\n<a href=\"https://sites.google.com/site/antifragile2016/\">https://sites.google.com/site/antifragile2016/</a></p>\n<p>The engineering of antifragile computer-based systems is a challenge that, once met, would allow systems and ambients to self-evolve and self-improve by learning from accidents and mistakes in a way not dissimilar to that of human beings. Learning how to design and craft antifragile systems is an extraordinary challenge whose tackling is likely to reverberate on many a computer engineering field. New methods, programming languages, even custom platforms will have to be designed. The expected returns are extraordinary as well: antifragile computer engineering promises to enable realizing truly autonomic systems and ambients able to meta-adapt to changing circumstances; to self-adjust to dynamically changing environments and ambients; to self-organize so as to track dynamically and proactively optimal strategies to sustain scalability, high-performance, and energy efficiency; to personalize their aspects and behaviors after each and every user. And to learn how to get better while doing it.</p>\n<p>Building on top of the very positive responses of last two years, enriched by the participation of Professor N. N. Taleb and Dr. Kenny H. Jones from NASA who kindly provided their keynote speeches, this third edition of ANTIFRAGILE aims to further enhance the awareness of the challenges of antifragile engineering and to continue the initiated discussion on how computer and software engineering may address them. As a design aspect cross-cutting through all system and communication layers, antifragile engineering calls for multi-disciplinary visions and approaches able to bridge the gaps between “distant” research communities so as to</p>\n<p>-propose novel solutions to design, develop, and evaluate antifragile systems and ambients;<br>\n-devise computational models and paradigms for antifragile engineering;<br>\n-provide analytical and simulation models and tools to measure a system's ability to withstand faults, adjust to new environments, and enhance their identity and resilience in the process;<br>\n-foster the exchange of ideas and promote discussions able to steer future research and development efforts in the area of computational antifragility.</p>\n<p>The main topics of the workshop include, but are not limited to:<br>\n-Proof systems for computational antifragility<br>\n-Conceptual frameworks for antifragile systems, ambients, and behaviours;<br>\n-Dependability, resilience, and antifragile requirements and open issues;<br>\n-Design principles, models, and techniques for realizing antifragile systems and behaviours;<br>\n-Frameworks and techniques enabling resilient and antifragile applications;<br>\n-Discussion and analysis if antifragile applications;<br>\n-Antifragile human-machine interaction;<br>\n-End-to-end approaches towards antifragile services;<br>\n-Autonomic antifragile behaviours;<br>\n-Middleware architectures and mechanisms for resilience and antifragility;<br>\n-Theoretical foundation of resilient and antifragile behaviours;<br>\n-Formal modeling of resilience and antifragility;<br>\n-Programming language support for resilience and antifragility;<br>\n-Machine learning as a foundation of resilient and antifragile architectures;<br>\n-Antifragility and resiliency against malicious attacks;<br>\n-Antifragility and the Cloud;<br>\n-Service Level Agreements for Antifragility;<br>\n-Verification and validation of resilience and antifragility;<br>\n-Antifragile and resilient services;<br>\n-Safety and security issues with reference to systems able to self-evolve their identity.</p>\n<p>All accepted papers of the previous editions of the workshop are freely available (see <a href=\"https://sites.google.com/site/antifragile2016/\">https://sites.google.com/site/antifragile2016/</a>). A description of two of the papers of the first edition of the workshop, as well as their presentations, are available through the referenced page. For more information about computational antifragility, please consider visiting also the LinkedIn group on Computational Antifragility: <a href=\"http://goo.gl/BBSNvj\">http://goo.gl/BBSNvj</a></p>\n<p>ANTIFRAGILE is this year co-located with the 7th International Conference on Ambient Systems, Networks and Technologies, May 23-26, 2016, the Universidad Politécnica de Madrid in Madrid, Spain. ANTIFRAGILE is likely to take place on May 24 (though this has not been confirmed yet.)</p>",
        "id": 294657069,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661168477
    }
]