[
    {
        "content": "<p>From: Gottfried Barrow &lt;<a href=\"mailto:gottfried.barrow@gmx.com\">gottfried.barrow@gmx.com</a>&gt;<br>\nChristian,</p>\n<p>I'm now ready to remain skeptical even though I'm safely assuming that <br>\nyou're right when you say that free variables are quantified with the <br>\n\"!!\" operator. And somehow, my skepticism here is not the same thing as <br>\ncognitive dissonance.</p>\n<p>If you can tell me the ML file (or ML file folder) where \"!!\" is used to <br>\nquantify the free variables, that would definitively put all this to <br>\nrest, I think.</p>\n<p>So, you would be at least the third person who has told me that free <br>\nvariables are implicitly quantified. I'm happy to take lessons in basic <br>\nlogic, but I think part of what's been leading me astray here is that <br>\nwith the examples I've been looking at, I logically get the same results <br>\nby assuming that free variables aren't implicitly quantified. At the <br>\nvery least here, I could just switch all this to a question, \"Do I get <br>\nthe same results if I assume free variables aren't quantified?\" It might <br>\nbe a trivial question, with a trivial result. I don't know.</p>\n<p>Here, I give two lemmas, one conjecture, and two axioms, which I think <br>\nare representative of what I'm doing in my THY, and which ties into your <br>\nreply.</p>\n<p>Lemma1: (!q. P q) --&gt; (P q)<br>\nLemma2: (P q) --&gt; (!q. P q)</p>\n<p>Conjecture1: (!q. P q) &lt;-&gt; (P q)</p>\n<p>Axiom1: (!q. P q)<br>\nAxiom2: (P q)</p>\n<p>Essentially, I can get similar results as you describe below without <br>\nassuming that free variables get quantified by \"!!\".</p>\n<p>Prior to Axiom1 and Axiom2 being given, Lemma1 is trivially true, and <br>\nLemma2 is obviously false, so Conjecture 1 is obviously false.</p>\n<p>(In this case, if I explicitly quantify Lemma1 and Lemma2 using (!q. <br>\n(!q. P q) --&gt; (P q)) and (!q. (P q) --&gt; (!q. P q)), I get the same <br>\nresults, so it doesn't tell me I'm misguided.)</p>\n<p>This result would be similar to my counterexample in my THY. I didn't <br>\nactually substitute the values that Nitpick gave me into my formula. If <br>\nI did the brainwork, it might show me that it would have to be the case <br>\nthat \"!!\" is quantifying the free variables.</p>\n<p>Assume Axiom1. Lemma1 doesn't need Axiom1 to be true. For Lemma2, <br>\nbecause of Axiom1, the right-hand side of Lemma2 is always true, thus <br>\nLemma2 is true. This result represents the result of using my first locale.</p>\n<p>Assume Axiom2. Again, Lemma1 doesn't need it. For Lemma2, we would have <br>\nthe equivalent formula (True --&gt; (!q. True)), which is true. This result <br>\nrepresents my result of using my second locale.</p>\n<p>Okay, I could be saying the most stupidest of things here. Once I miss <br>\nformally learning certain basics, it's hard to find time to go back and <br>\nlearn what I don't have to know.</p>\n<p>It makes sense that free variables would be quantified by the software. <br>\nOn the other hand, when no one will point me to a formal document <br>\ntelling me that, I keep open the option that something different could <br>\nbe going on. \"Makes sense\" doesn't serve me well sometimes.</p>\n<p><em>NOISE AND CLUTTER</em></p>\n<p>Now on to your complaint about my creating noise and clutter in my THY.</p>\n<p>Working on trying to better reduce noise and clutter is half of what I <br>\ngot out of sending off this email. The other half is learning about the <br>\nusefulness of locales to do some preliminary proofs without globally <br>\ninjecting all the overhead into the THY.</p>\n<p>Back to noise and clutter, the challenge is to find a way to mark up <br>\nTHYs in a way that is reasonably readable, and which can also be <br>\nprocessed with scripts to generate other THY and TEX files to give <br>\npeople options on how they want to absorb the information.</p>\n<p>For mathematical writing, I think there are four main components,</p>\n<p>1) Section headings<br>\n2) Text/discussion<br>\n3) Statement of theorems, definitions, axioms, etc.<br>\n4) Proofs</p>\n<p>A big part of LaTeX is the newtheorem environment:</p>\n<p>ftp://ftp.ams.org/pub/tex/doc/amscls/amsthdoc.pdf</p>\n<p>I'm trying to duplicate a decent imitation of the newtheorem environment <br>\nin the THY file, without creating too much clutter and noise, and not <br>\nfall prey to the \"gaudy web page syndrome\".</p>\n<p>It's not obvious how to use a limited set of tools to get something <br>\nbetter than the traditional way of doing things.</p>\n<p>Sometimes you don't get something better. There was Xerox. And there was <br>\nApple. It's the story of Apple taking new ideas and refining the new <br>\nideas in significant ways, and doing it with hardware limitations.</p>\n<p><a href=\"http://www.folklore.org/index.py\">http://www.folklore.org/index.py</a></p>\n<p>I attach my newest attempt to edit my THY so that I can convert my cheap <br>\nnewtheorem imitations into the real thing with a script, among other <br>\nprocessing. The source code of a marked up language isn't meant for <br>\npublic consumption, but if the public can consume the source code, <br>\nthat's a good thing, because then it means you can probably read your <br>\nown source code.</p>\n<p>Christian, thanks for the help.</p>\n<p>Regards,<br>\nGB<br>\n<a href=\"/user_uploads/14278/59cS98rr7NPiGHD40Pcokdsg/a_sTs01_121027.thy\">a_sTs01_121027.thy</a></p>",
        "id": 294224318,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660899174
    },
    {
        "content": "<p>From: Christian Sternagel &lt;<a href=\"mailto:c-sterna@jaist.ac.jp\">c-sterna@jaist.ac.jp</a>&gt;<br>\nDear Gottfried,</p>\n<p>I wrote too much in my last email and thereby missed to convey my main <br>\npoint. Consider the following:</p>\n<p>definition P :: \"'a =&gt; bool\" where<br>\n     \"P x == undefined\" -- \"the exact definition of P doesn't matter\"</p>\n<p>axiomatization where<br>\n     Axiom2: \"P x\" and<br>\n     Axiom2': \"!!x::'a. P x\"<br>\n   thm Axiom2 Axiom2' -- \"this shows that for Isabelle both axioms are <br>\nthe same\"</p>\n<p>I.e., the resulting theorem that is stored in the theorem database of <br>\nIsabelle is exactly the same for Axiom2 and Axiom2', i.e., \"P ?x\" (where <br>\na schematic variable, the one with the question mark in front, is used <br>\nto represent all-quantification, in the sense that we may substitute any <br>\nterm having the correct type for ?x).</p>\n<p>By that reasoning, your Axiom2 is the same as my Axiom2'. Then in order <br>\nto get a correct counterexample you would have to disprove</p>\n<p>-- \"here is a proof that your Axiom1 is equivalent to your Axiom2\"<br>\n   lemma Conjecture: \"Trueprop (ALL x::'a. P x) == (!!x::'a. P x)\"<br>\n   proof<br>\n     fix x::'a assume \"ALL x::'a. P x\" then show \"P x\" ..<br>\n   next<br>\n     assume \"!!x::'a. P x\" then show \"ALL x::'a. P x\" ..<br>\n   qed<br>\n   thm Conjecture</p>\n<p>But that is not possible, since it is a theorem. Moreover consider</p>\n<p>lemma Conjecture1: \"(ALL x::'a. P x) &lt;-&gt; P x\" sorry<br>\n   lemma Conjecture1': \"!! x. (ALL x::'a. P x) &lt;-&gt; P x\" sorry<br>\n   thm Conjecture1 Conjecture1'</p>\n<p>which are two equivalent statements of your Conjecture1. This states <br>\nsomething different from my Conjecture (just have a look at the result <br>\nof the thm command).</p>\n<p>So, everything else I said aside, your counterexample does not show what <br>\nyou think it does. That's my main point. Also you do not have to look <br>\ninto any ML code, just observe the results of the thm command ;)</p>\n<p>cheers</p>\n<p>chris</p>",
        "id": 294224403,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660899222
    },
    {
        "content": "<p>From: Christian Sternagel &lt;<a href=\"mailto:c-sterna@jaist.ac.jp\">c-sterna@jaist.ac.jp</a>&gt;<br>\nDear Gottfried,</p>\n<p>My point here is that you are investing a lot of time to reinvent the <br>\nwheel (moreover a somewhat square wheel that people won't put on their <br>\nown cars; sorry for that ;)).</p>\n<p>My suggestion (just my personal opinion): Keep the actual THY-file as <br>\nclean and simple as possible.</p>\n<p>For a proper presentation of theories there is already Isabelle's <br>\ndocument preparation system which works very well for LaTeX. No need to <br>\ncook up your own variant. (What people often do when they want to <br>\npublish some Isabelle formalization is to start another theory that <br>\nimports the actual formalization and write their paper/article in this <br>\nnew theory, referencing facts from the previous formalization. Of course <br>\nit depends on the audience, what the best solution is. E.g., for <br>\nmathematicians I would mostly hide Isabelle related stuff and instead of <br>\npresenting the sourcecode of the actual formalization, just reference <br>\nfacts - using Isabelle's antiquotations - and give textual overviews of <br>\nthe formalized proofs which convey the main ideas.)</p>\n<p>Concerning your markups in order to process THY files with scripts. In <br>\nyour example THY file I do not see what additional possibility your <br>\nmarkups give, since they always accompany existing commands like <br>\n\"section\", \"subsection\", \"definition\", ... which could as easily be <br>\nrecognized my scripts.</p>\n<p>The most important question: What is your actual application anyway?</p>\n<p>Maybe there is already existing infrastructure which could achieve the <br>\nsame goal more easily.</p>\n<p>cheers</p>\n<p>chris</p>",
        "id": 294224415,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660899228
    },
    {
        "content": "<p>From: Gottfried Barrow &lt;<a href=\"mailto:gottfried.barrow@gmx.com\">gottfried.barrow@gmx.com</a>&gt;<br>\nChristian,</p>\n<p>You say, \"I wrote too much in my last email and thereby missed to convey <br>\nmy main point\".</p>\n<p>I've understood the point all along about implicit quantification, which <br>\nLarry called \"universal closure\", and I knew that if that it was true, <br>\nthat I couldn't explicitly state certain formulas like I was trying to <br>\ndo. But you're the first one who explicitly told me that \"!!\" is where <br>\nthe quantification is occurring.</p>\n<p>It is true that I forgot about the implicit quantification... Actually, <br>\nit's becoming too much work to remember what it is I understood or <br>\ndidn't understand, or forgot once I went off on a tangent by treating <br>\nthings as unquantified propositions.</p>\n<p>Fortunately, you thought I missed your point and went the extra step of <br>\ngiving me enough details to take everything from the abstract to the <br>\nconcrete.</p>\n<p>You showed things several ways, but this is a very straightforward <br>\ndemonstration of the quantification that's occurring:</p>\n<p>lemma Conjecture1: \"(ALL x::'a. P x) &lt;-&gt; P x\" sorry<br>\n    lemma Conjecture1': \"!! x. (ALL x::'a. P x) &lt;-&gt; P x\" sorry</p>\n<p>It seems to me that the documentation should point this out. A person <br>\ncan say that standard logic principles cover this, but it doesn't, <br>\nbecause Isabelle/HOL is not standard logic.</p>\n<p>Magical software is mysterious. Unless told otherwise (and <br>\nsubstantiated), a person might be assuming the truth of \"(ALL x::'a. P <br>\nx) &lt;-&gt; P x\" is being determined with a huge truth table retrieved from <br>\nGoogle, which would allow the formula to be used in other formulas <br>\nwithout quantification being forced on it like it is now.</p>\n<p>This implicit quantification is all tied into schematic variables, so it <br>\nappears it's not an easy subject to broach:</p>\n<p><a href=\"http://article.gmane.org/gmane.science.mathematics.logic.isabelle.user/5396\">http://article.gmane.org/gmane.science.mathematics.logic.isabelle.user/5396</a></p>\n<p>At the top is where Lars told me about the implicit quantification, and <br>\nthen Makarius says:</p>\n<p>But when you state lemma \"!!x y. A x ==&gt;  B y\" your result is schematic \"A ?x ==&gt;  B ?y\".</p>\n<p>Your proof, using \"==\", shows you (probably) have to resort to <br>\nmeta-logic to be able to prove the equivalency without first assuming <br>\neither Axiom1 or Axiom2.</p>\n<p>Will I do that? No. For my current application, I'll stay away from the <br>\nexplicit use of meta-logic, if I can. Why? I don't explain that. All <br>\nthat would do is make this email longer.</p>\n<p>Christian, thanks for the proof and documenting what's going on.</p>\n<p>Regards,<br>\nGB</p>",
        "id": 294224503,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660899253
    },
    {
        "content": "<p>From: Gottfried Barrow &lt;<a href=\"mailto:gottfried.barrow@gmx.com\">gottfried.barrow@gmx.com</a>&gt;<br>\nOn 10/28/2012 11:58 PM, Christian Sternagel wrote:</p>\n<p>Christian,</p>\n<blockquote>\n<p>The most important question: What is your actual application anyway?</p>\n</blockquote>\n<p>This was your second to the last question. You say it's the most <br>\nimportant, so I move it up here, since I get wordy below.</p>\n<p>The application is implementing certain mathematical textbooks in <br>\nIsabelle, until I get to a level to where I use Isabelle to implement <br>\noriginal research.</p>\n<p>The style is educational, textbook writing. Discussion, example, <br>\ntheorem, proof, exercise, repeat. The original research part will be the <br>\nhardest part to achieve, especially because it will be so time consuming <br>\nto build up to that level. I at least try to end up having made an <br>\neducational contribution.</p>\n<p>\"Hypothetical application\" would be a better phrase to use. Applications <br>\nrequire work, and I don't get paid for this. Financial incentive is one <br>\nof the best motivators for working, where there would be two halves to <br>\n\"financial incentive\", the reward of income for producing, and the fear <br>\nof the loss of income for not producing. I have neither to motivate me.</p>\n<blockquote>\n<p>My point here is that you are investing a lot of time to reinvent the <br>\nwheel (moreover a somewhat square wheel that people won't put on their <br>\nown cars; sorry for that ;)).</p>\n</blockquote>\n<p>The wheel has largely been invented, but the wheel has been optimized <br>\nfor those who invented the wheel, and for those who have made <br>\nsignificant technical contributions towards getting the wheel rolling.</p>\n<p>Let us call this group of people Professional Software Developers (PGD). <br>\nGiven limited resources, we can say that the choices made so far by the <br>\nPGD in optimizing the wheel have been the best choices made, seeing that <br>\nthe PGD are currently the primary users.</p>\n<p>Myself, I'm not a PGD, so the wheel is not completely optimized for my <br>\nneeds. As to users, at times, I prioritize myself as the most important <br>\nuser.</p>\n<blockquote>\n<p>My suggestion (just my personal opinion): Keep the actual THY-file as <br>\nclean and simple as possible.</p>\n</blockquote>\n<p>Well, it's not possible to tap into the power of LaTeX, or something <br>\nsimilar, and have a primary source code file that's super clean.</p>\n<p>You can achieve clean, but then there's cryptic, where, in my opinion, <br>\n\"cryptic\" would currently describe almost all of the Isabelle/HOL <br>\ndistribution source, and the source on the <a href=\"http://afp.sourceforge.net/\">http://afp.sourceforge.net/</a>. <br>\nI'm not complaining here. I'm just talking.</p>\n<p>However, as I said, I'm out to cater to the market. For you, in the <br>\nfuture I will easily be able to give you a THY which is nothing but <br>\ntheorem code, proof code, theorem code, proof code, with some of my <br>\ncomments in the proofs. Will it turn out that you're annoyed by my <br>\ncomments? Not a problem. I'll strip them out and give it to you as <br>\ncryptic as you want, or someone like you.</p>\n<p>It's best not to annoy people who help me out.</p>\n<blockquote>\n<p>For a proper presentation of theories there is already Isabelle's <br>\ndocument preparation system which works very well for LaTeX. No need <br>\nto cook up your own variant. (What people often do when they want to <br>\npublish some Isabelle formalization is to start another theory that <br>\nimports the actual formalization and write their paper/article in this <br>\nnew theory, referencing facts from the previous formalization. Of <br>\ncourse it depends on the audience, what the best solution is. E.g., <br>\nfor mathematicians I would mostly hide Isabelle related stuff and <br>\ninstead of presenting the sourcecode of the actual formalization, just <br>\nreference facts - using Isabelle's antiquotations - and give textual <br>\noverviews of the formalized proofs which convey the main ideas.)</p>\n</blockquote>\n<p>Last year I worked for a month on trying to switch over to Isabelle <br>\ndocument processing. It didn't work out. I didn't figure out a way to <br>\nput all THY Isar code in a verbatim environment. I don't explain why <br>\nhere why I want to do that.</p>\n<p>It's my intent to make mathematicians my primary audience, but on your <br>\npoint of hiding things, my conclusion is the opposite of yours here. <br>\n(With all this, opinion heavily comes into play, and my opinions are <br>\nsubject change, so feel to disregard anything I say here.)</p>\n<p>Actually, what I say here is based on my own preferences, where I've <br>\nbeen greatly influenced by the culture of mathematicians.</p>\n<p>Proofs are everything, and as a symbol of rigor, a certain amount of <br>\ndetailed proofs are expected, and they're expected to be written in such <br>\na way that they can be read, where \"be read\" will vary with the <br>\naudience, such as from 1st year university level to Ph.D.</p>\n<p>If I'm hiding the details of all the proofs, then why am I even <br>\npresenting the math by means of Isabelle? Why not just do things the <br>\ntraditional way? You may say, \"Because if you prove something in <br>\nIsabelle, it shows them it's legitimate for sure.\" But no. It'll prove <br>\nnothing to them. What is not presented to mathematicians as literature <br>\nwith proofs that they can read, they will not be interested in.</p>\n<p>Paul Erdos, <a href=\"https://en.wikipedia.org/wiki/Paul_Erd%C5%91s\">https://en.wikipedia.org/wiki/Paul_Erd%C5%91s</a>, had no <br>\ninterest in the proof of the Four Color <br>\nTheorem:<a href=\"https://en.wikipedia.org/wiki/Four_color_theorem\">https://en.wikipedia.org/wiki/Four_color_theorem</a></p>\n<blockquote>\n<p>Concerning your markups in order to process THY files with scripts. In <br>\nyour example THY file I do not see what additional possibility your <br>\nmarkups give, since they always accompany existing commands like <br>\n\"section\", \"subsection\", \"definition\", ... which could as easily be <br>\nrecognized my scripts.</p>\n</blockquote>\n<p>When scrolling through a long document, for the major textual items, I <br>\nwant to answer 4 questions fast: What is it? What's it going to tell me? <br>\nWhere does it start? Where does it end?</p>\n<p>With the Latex theorem environment, you can create your \"Definition\", <br>\n\"Theorem\", \"Postulate\", etc, and the environment formatting helps <br>\nseparate things. Unlike with a Latex theorem environment, In the midst <br>\nof lots of other Isar keywords, a Isar keyword like \"theorem\" doesn't <br>\nstand out that well, and it doesn't always describe how it's being used.</p>\n<p>(Yes, \"theorem\" could be used for a theorem, but where are keywords like <br>\n\"example\", \"exercise\", \"remark\", \"postulate\". And you wouldn't want all <br>\nthose keywords in Isar. I made a very weak attempt to ask Makarius to <br>\nallow us to define our own outer-syntax keywords in Isar. I decided that <br>\nwould be a bad idea. It's the limited number of keywords that <br>\nstandardize the language.)</p>\n<p>Consider my COUNTERX. My COUNTERX is a conjecture for which I've found a <br>\ncounterexample. The keyword \"theorem\" doesn't accurately describe how <br>\nI'm using \"theorem\". So suppose I say, \"Okay, I have that counterexample <br>\nabove, and I need to scroll up and look at it again.\" Also suppose I <br>\nhave 8 theorems up above. Well, the keyword \"theorem\" does nothing to <br>\nhelp me quickly locate my counterexample.</p>\n<p>Suppose I have 4 counterexamples. The Isar keywords alone don't help me <br>\ndistinguish between them. Even a named theorem doesn't always tell me <br>\nquickly what a theorem does. With the following, I get 4 pieces of <br>\ninformation in the first two lines:</p>\n<p>COUNTERX (Shows P is false with input z and y.)<br>\ntheorem false_p:<br>\n   \"a big long hard to read formula that would take me a long time to <br>\nknow what it's about\"<br>\n   --\"Nitpick counterexamples that make it false\"<br>\n   oops</p>\n<p>The capital bold COUNTERX helps me skip a whole lot of other stuff fast, <br>\nlike definitions, axioms, theorems, lemmas, etc.</p>\n<p>The short description gives me a quick summary of what to expect.</p>\n<p>Descriptive theorem names are desirable, but not if they're 10 words <br>\nlong, so I don't want:</p>\n<p>theorem shows_P_is_false_with_input_z_and_y.</p>\n<p>That's hard to read and would be even worse to reference in some other <br>\ncommand.</p>\n<p>All this is personal. If you work different, then you'll consider my <br>\ntweaking a waste of time.</p>\n<blockquote>\n<p>Maybe there is already existing infrastructure which could achieve the <br>\nsame goal more easily.</p>\n</blockquote>\n<p>Sometimes, though, I just do what I've been doing, after making some <br>\ninitial attempt to make a change that didn't work out.</p>\n<p>I know that there's a lot of power in Isabelle's document processing, <br>\nbut I consider it to be less risky to continue down my own non-standard <br>\nroute.</p>\n<p>Thanks again for that proof, and documenting the low-level <br>\nquantification that's occurring.</p>\n<p>Regards,<br>\nGB</p>\n<blockquote>\n<p>cheers</p>\n<p>chris</p>\n<p>On 10/28/2012 05:46 PM, Gottfried Barrow wrote:</p>\n<blockquote>\n<p><em>NOISE AND CLUTTER</em></p>\n<p>Now on to your complaint about my creating noise and clutter in my THY.</p>\n<p>Working on trying to better reduce noise and clutter is half of what I<br>\ngot out of sending off this email. The other half is learning about the<br>\nusefulness of locales to do some preliminary proofs without globally<br>\ninjecting all the overhead into the THY.</p>\n<p>Back to noise and clutter, the challenge is to find a way to mark up<br>\nTHYs in a way that is reasonably readable, and which can also be<br>\nprocessed with scripts to generate other THY and TEX files to give<br>\npeople options on how they want to absorb the information.</p>\n<p>For mathematical writing, I think there are four main components,</p>\n<p>1) Section headings<br>\n2) Text/discussion<br>\n3) Statement of theorems, definitions, axioms, etc.<br>\n4) Proofs</p>\n<p>A big part of LaTeX is the newtheorem environment:</p>\n<p>ftp://ftp.ams.org/pub/tex/doc/amscls/amsthdoc.pdf</p>\n<p>I'm trying to duplicate a decent imitation of the newtheorem environment<br>\nin the THY file, without creating too much clutter and noise, and not<br>\nfall prey to the \"gaudy web page syndrome\".</p>\n<p>It's not obvious how to use a limited set of tools to get something<br>\nbetter than the traditional way of doing things.</p>\n<p>Sometimes you don't get something better. There was Xerox. And there was<br>\nApple. It's the story of Apple taking new ideas and refining the new<br>\nideas in significant ways, and doing it with hardware limitations.</p>\n<p><a href=\"http://www.folklore.org/index.py\">http://www.folklore.org/index.py</a></p>\n<p>I attach my newest attempt to edit my THY so that I can convert my cheap<br>\nnewtheorem imitations into the real thing with a s<br>\n[message truncated]</p>\n</blockquote>\n</blockquote>",
        "id": 294224529,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660899272
    },
    {
        "content": "<p>From: Christian Sternagel &lt;<a href=\"mailto:c-sterna@jaist.ac.jp\">c-sterna@jaist.ac.jp</a>&gt;<br>\nI tried to achieve something very similar in my PhD-thesis (the content <br>\nis not really textbook-like, but the presentation was intended for <br>\npeople that do not know Isabelle/HOL). Just ignoring the content you <br>\ncould have a look whether this way of presentation could be used in your <br>\ncase.</p>\n<p><a href=\"http://www.jaist.ac.jp/~c-sterna/publications/PhD-thesis.pdf\">http://www.jaist.ac.jp/~c-sterna/publications/PhD-thesis.pdf</a></p>\n<p>However, it was a huge overhead over the actual formalization to present <br>\nit this way ;). (And I found it necessary to explain at least a bit <br>\nabout Isabelle in the beginning.)</p>\n<p>If you (or anyone else) are interested I can send you the sources later.</p>\n<p>cheers</p>\n<p>chris</p>",
        "id": 294224537,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660899277
    },
    {
        "content": "<p>From: Gottfried Barrow &lt;<a href=\"mailto:gottfried.barrow@gmx.com\">gottfried.barrow@gmx.com</a>&gt;<br>\nOn 10/29/2012 8:21 PM, Christian Sternagel wrote:</p>\n<blockquote>\n<p>On 10/30/2012 03:51 AM, Gottfried Barrow wrote:</p>\n<blockquote>\n<p>...I at least try to end up having made an educational contribution.<br>\nI tried to achieve something very similar in my PhD-thesis (the <br>\ncontent is not really textbook-like, but the presentation was intended <br>\nfor people that do not know Isabelle/HOL). Just ignoring the content <br>\nyou could have a look whether this way of presentation could be used <br>\nin your case.</p>\n</blockquote>\n<p><a href=\"http://www.jaist.ac.jp/~c-sterna/publications/PhD-thesis.pdf\">http://www.jaist.ac.jp/~c-sterna/publications/PhD-thesis.pdf</a></p>\n</blockquote>\n<p>Okay, this ends up being a perfect example to tie into things I said, or <br>\ncould have said, and the essence of your complaint about noise and clutter.</p>\n<p>You give me a document that you spent a lot of time on to make it a <br>\nprofessional grade document, and you offer to give me the TEX source (or <br>\nTHY with a lot of LaTeX in it).</p>\n<p>I open the PDF, and I think something that I don't plan on saying at the <br>\ntime, like, \"Well, TEX files and TEX content are a dime a dozen on the <br>\nweb, and I've already made many of my LaTeX design decisions. Your blue <br>\ntext boxes look good, but I ruled out using colored boxes some time ago, <br>\nthough seeing how you do it might get me to think about it again.\"</p>\n<p>You tell me to ignore the content, but then when I get to your Chapter <br>\n2, I say, \"Alright, another one of these PhD theses which provides a <br>\nshort tutorial on Isabelle. I need to read this Chapter 2.\"</p>\n<p>In fact, your PhD thesis has been setting on my hard drive with <br>\ndocuments from 13 other people, most of who I found on the TUM web site, <br>\nand all of whose articles I ripped off of their sites. Those along with <br>\nmost if not all documents off of Wenzel's, Nipkow's, and Paulson's web <br>\npages.</p>\n<p>As it turns out, I'm not interested in your source, I'm interested in <br>\nyour content. I gave you a THY, and you weren't interested in my <br>\ninvolved system, you just wanted to see the pertinent content, which was <br>\nobscured.</p>\n<p>I think this describes most of us. We want to know what a person has to <br>\nsay, or what their code says. We're not normally interested in people's <br>\nlow-level methods of creating source code.</p>\n<p>And now that my attention is brought to your tree in the forest, I see <br>\nthat on page 13 and 19, you say that implicit quantification is <br>\nhappening at the meta-logic level. Without the examples you gave me, it <br>\nwouldn't have the same meaning that it does now.</p>\n<blockquote>\n<p>However, it was a huge overhead over the actual formalization to <br>\npresent it this way ;). (And I found it necessary to explain at least <br>\na bit about Isabelle in the beginning.)</p>\n</blockquote>\n<p>This brings up how we work with THY and TEX files. We read the PDF for <br>\nthe discussion of concepts, and we read the THY (if we have to, or to <br>\nedit it) for the non-text{<em>...</em>} code.</p>\n<p>I'm trying to get away from this two-document editing process. It's a <br>\npain. Edit, then compile to be able to read it and make sure it <br>\ncompiles. Do that again forever, hitting the compile button multiple <br>\ntimes on many loops because of a LaTeX error.</p>\n<p>REMARK: The continuous prover mode of jEdit makes errors immediate, <br>\nwhich helps to get away from a \"compile to make sure it compiles\" type <br>\nprocess of editing code. Thanks Makarius.</p>\n<p>You talked about me reinventing the wheel. This huge overhead you talk <br>\nabout is something I want to do once, and then benefit from easily and <br>\nrepeatedly.</p>\n<p>First, I do a lot of work to set up a THY document style that can be <br>\nprocessed by a script, and I write a bunch of jEdit macros for text entry.</p>\n<p>After that, I'm in \"cheap imitation WYSIWYG word processor mode\". I <br>\ncompile to PDF, not to see if it compiles (unless I had to resort to <br>\nLaTeX), and not to read what I wrote, but to create a professional <br>\nlooking document to give to other people. The script also creates a <br>\nbare-bones THY to give to other people like you who don't want any <br>\nverbosity, or help from me to know what the code means. And the code <br>\nthat's in the bare-bones THY? It's also in a verbatim environment in the <br>\nTEX file that gets compiled. (Any of this is subject to change.)</p>\n<blockquote>\n<p>If you (or anyone else) are interested I can send you the sources later.</p>\n</blockquote>\n<p>TEX sources? A dime a dozen. Pertinent, good instructional content on <br>\nIsabelle that's generated from LaTeX, like your Chapter 2? A very, very <br>\nsmall percentage of the content that is generated from the millions of <br>\nlines of LaTeX in the world.</p>\n<p>Thanks for bringing attention to your thesis.</p>\n<p>Regards,<br>\nGB</p>",
        "id": 294224551,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660899284
    },
    {
        "content": "<p>From: Christian Sternagel &lt;<a href=\"mailto:c-sterna@jaist.ac.jp\">c-sterna@jaist.ac.jp</a>&gt;<br>\nDear Gottfried,</p>\n<p>On 10/30/2012 01:21 PM, Gottfried Barrow wrote:</p>\n<blockquote>\n<p>Okay, this ends up being a perfect example to tie into things I said, or<br>\ncould have said, and the essence of your complaint about noise and clutter.</p>\n<p>You give me a document that you spent a lot of time on to make it a<br>\nprofessional grade document, and you offer to give me the TEX source (or<br>\nTHY with a lot of LaTeX in it).<br>\nI see your point ;) ... but still: a difference to your approach is that <br>\nI have clean THY files for my main formalization separate from my <br>\npresentation THY files and only reference those in my presentation THY <br>\nas needed.</p>\n</blockquote>\n<blockquote>\n<p>I open the PDF, and I think something that I don't plan on saying at the<br>\ntime, like, \"Well, TEX files and TEX content are a dime a dozen on the<br>\nweb, and I've already made many of my LaTeX design decisions. Your blue<br>\ntext boxes look good, but I ruled out using colored boxes some time ago,<br>\nthough seeing how you do it might get me to think about it again.\"<br>\nI did not want to advertise my design (such choices are just too <br>\nsubjective and maybe I do not even like my design anymore ;)). I was <br>\nrather talking about the way of presenting formalized Isabelle/HOL <br>\ntheories safely (as in everything is still checked by Isabelle) as a <br>\nreadable PDF in principle. (The design can be arbitrarily chosen <br>\nafterwards via your usual LaTeX setup.)</p>\n</blockquote>\n<blockquote>\n<blockquote>\n<p>However, it was a huge overhead over the actual formalization to<br>\npresent it this way ;). (And I found it necessary to explain at least<br>\na bit about Isabelle in the beginning.)</p>\n</blockquote>\n<p>This brings up how we work with THY and TEX files. We read the PDF for<br>\nthe discussion of concepts, and we read the THY (if we have to, or to<br>\nedit it) for the non-text{<em>...</em>} code.<br>\nConcerning my thesis, you do not have to do that, as it directly <br>\nincludes Isabelle proofs (only somewhat pepped up to look more familiar <br>\nto non-Isabelle users) in the PDF. My goal was to have a PDF that <br>\nincludes all the content but was readable for non-Isabelle users (and <br>\nIsar does help greatly here). So it should not be necessary to have a <br>\nlook at the THY files (but maybe someone who knows Isabelle, would <br>\nprefer it and still can, without the THY file being cluttered by my <br>\npresentation, since - as mentioned above - I use a separate THY file <br>\ncontaining all the LaTeX stuff and so on).</p>\n</blockquote>\n<p>Of course, I'm not saying that this is the best solution (or even a good <br>\none, I was more or less experimenting) ... just one that I found useful <br>\nsome time ago. And sure, it would be nice to do something similar but <br>\nwith much less effort for the author.</p>\n<blockquote>\n<p>You talked about me reinventing the wheel. This huge overhead you talk<br>\nabout is something I want to do once, and then benefit from easily and<br>\nrepeatedly.<br>\nI agree. I also think such an effort could (and maybe should) be <br>\nintegrated into Isabelle itself where we have much more control than <br>\nwith external scripts.</p>\n</blockquote>\n<p>Currently Isabelle document preparation \"just\" supports PDF (and to some <br>\nextend HTML?) but I don't think that it is in principle restricted to it.</p>\n<p>I'm sure that many people, especially on this list, have thoughts about <br>\nhow to properly present a formalization to non-experts. It would be nice <br>\nto hear those ideas (also if its just a vision for the future).</p>\n<blockquote>\n<blockquote>\n<p>If you (or anyone else) are interested I can send you the sources later.</p>\n</blockquote>\n<p>TEX sources? A dime a dozen. Pertinent, good instructional content on<br>\nIsabelle that's generated from LaTeX, like your Chapter 2? A very, very<br>\nsmall percentage of the content that is generated from the millions of<br>\nlines of LaTeX in the world.<br>\nI was not so much talking about TeX sources, but rather the theory file <br>\nthat in the end generates the TeX sources and then the PDF file (there <br>\nis still another wrapper of TeX around the generated TeX sources, but <br>\nthat is just for the usual LaTeX setup you would do anyway when writing <br>\na paper).</p>\n</blockquote>\n<p>But thanks to our discussion I see that the subject is (as usual) more <br>\nintricate than expected.</p>\n<p>cheers</p>\n<p>chris</p>\n<p>@all: Having had a look at my thesis sources again after a long while, I <br>\nnoticed that most (if not all) of my \"huge overhead\" could have been <br>\navoided when syntax that was introduced with the notation command (or <br>\nsimilarly) would also apply to the PDF representation of proofs <br>\nthemselves. The same issue has already been talked about here</p>\n<p><a href=\"https://lists.cam.ac.uk/mailman/htdig/cl-isabelle-users/2010-January/msg00037.html\">https://lists.cam.ac.uk/mailman/htdig/cl-isabelle-users/2010-January/msg00037.html</a></p>\n<p>Maybe in the meanwhile there are more thoughts about it?</p>",
        "id": 294224568,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660899298
    },
    {
        "content": "<p>From: Gottfried Barrow &lt;<a href=\"mailto:gottfried.barrow@gmx.com\">gottfried.barrow@gmx.com</a>&gt;<br>\nChristian,</p>\n<p>Send me sources, please. As I mention below, it's hard to get excited <br>\nabout an offer when there's still work required by me, but I should at <br>\nleast look at what you got if you offer it to me, plus I might as well <br>\nhave it to be able to open up the THY to see the actual code. There's <br>\nalways something to be learned by looking at the actual code, rather <br>\nthan just the PDF.</p>\n<p>On 10/30/2012 3:31 AM, Christian Sternagel wrote:</p>\n<blockquote>\n<p>I see your point ;) ... but still: a difference to your approach is <br>\nthat I have clean THY files for my main formalization separate from my <br>\npresentation THY files and only reference those in my presentation THY <br>\nas needed.</p>\n</blockquote>\n<p>It becomes a matter of personal preference. I'm trying to figure out a <br>\nway to format things so that I can read a THY like I read a PDF.</p>\n<p>My willingness to get verbose in my THYs, rather than cryptic/clean, is <br>\nfor me. I need to explain concepts to myself, and explain in plain <br>\nlanguage to myself the steps of my proofs, especially so I can go back <br>\nmonths later and know what it is that I'm doing in a proof.</p>\n<blockquote>\n<p>I did not want to advertise my design (such choices are just too <br>\nsubjective and maybe I do not even like my design anymore ;)). I was <br>\nrather talking about the way of presenting formalized Isabelle/HOL <br>\ntheories safely (as in everything is still checked by Isabelle) as a <br>\nreadable PDF in principle. (The design can be arbitrarily chosen <br>\nafterwards via your usual LaTeX setup.)</p>\n</blockquote>\n<p>So partly, we're talking past each other, or talking about different <br>\nthings.</p>\n<p>Partly, it's that to get someone really excited about what you offer <br>\nthem, it has to work by magic, and sometimes it helps if you're in their <br>\noffice, and they show you what they're talking about.</p>\n<blockquote>\n<blockquote>\n<p>You talked about me reinventing the wheel. This huge overhead you talk<br>\nabout is something I want to do once, and then benefit from easily and<br>\nrepeatedly.<br>\nI agree. I also think such an effort could (and maybe should) be <br>\nintegrated into Isabelle itself where we have much more control than <br>\nwith external scripts.</p>\n</blockquote>\n</blockquote>\n<p>I completely agree, but I'm pretty much through asking for anything <br>\nrelated to the interface. We talk. Makarius listens sometimes. He <br>\nalready has lots of ideas. We might give him some new ideas.</p>\n<p>What do we really want? I don't know. Like Mathematica? I don't think <br>\nso. Like <a href=\"http://lyx.org\">http://lyx.org</a>? Sounds nice, but that would be a very different <br>\nroad. Using something like that in practice might be terrible, even <br>\nthough I've messed around with it.</p>\n<p>Change is risky.</p>\n<blockquote>\n<p>Currently Isabelle document preparation \"just\" supports PDF (and to <br>\nsome extend HTML?) but I don't think that it is in principle <br>\nrestricted to it.</p>\n<p>I'm sure that many people, especially on this list, have thoughts <br>\nabout how to properly present a formalization to non-experts. It would <br>\nbe nice to hear those ideas (also if its just a vision for the future).</p>\n</blockquote>\n<p>Again, I guess we've talking about different things. I'm not trying to <br>\ndepart radically from the current end result. I think the best way to <br>\npresent theories to people, whether experts or beginners, is the current <br>\nway. You give them a THY that they can load or import, and for reading <br>\nif they want, and you give them a PDF to provide them a more polished <br>\ndocument that's meant to be read like a book.</p>\n<p>I'm just trying to make my working THYs so that they're also meant for <br>\nreading, even when they're loaded up with a ton of verbosity.</p>\n<blockquote>\n<p>But thanks to our discussion I see that the subject is (as usual) more <br>\nintricate than expected.</p>\n</blockquote>\n<p>Giving you what I attach is premature, but I do it. If it could be <br>\nmonths before my next question, that would be good, and maybe I'll have <br>\nmy scripts going by that time.</p>\n<p>Like I said, I think the end result as it is now is good. For a theory, <br>\npeople get a THY and a PDF. That I'm doing something non-standard to <br>\nproduce the THY and the PDF is just a result of things evolving into <br>\nsomething different for me. If there are any good ideas in it, that's <br>\ngood, but I'm not trying to change anything outside of what I'm doing.</p>\n<p>I was taking notes on a tutorial, and the attached pimGreI.pdf was my <br>\nexperimenting at the time.</p>\n<p>I was working through prog-tut.pdf, and the attached i12prI2_D.pdf was <br>\ngetting produced at the time.</p>\n<p>You don't want to take either too seriously, but the content and layout <br>\nis a consequence of certain key ideas of mine. Even then, a key idea of <br>\nmine was that some people, like you, would want things uncluttered and <br>\nfree of the clutter that I put in for myself.</p>\n<p>Regards,<br>\nGB<br>\n<a href=\"/user_uploads/14278/WP8f0V4600p6-sM7k8HNa8el/i12prI2_D.pdf\">i12prI2_D.pdf</a><br>\n<a href=\"/user_uploads/14278/LCqsxSUZjPlyI4ygriZ0XqqB/pimGreI.pdf\">pimGreI.pdf</a></p>",
        "id": 294224583,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660899305
    },
    {
        "content": "<p>From: Christian Sternagel &lt;<a href=\"mailto:c-sterna@jaist.ac.jp\">c-sterna@jaist.ac.jp</a>&gt;<br>\nI put an archive of the sources here:</p>\n<p><a href=\"http://www.jaist.ac.jp/~c-sterna/phdthesis.zip\">http://www.jaist.ac.jp/~c-sterna/phdthesis.zip</a></p>\n<p>Note the sources were created for Isabelle2009-2 (see also COMPATIBILITY).</p>\n<p>cheers</p>\n<p>chris</p>",
        "id": 294224606,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660899315
    },
    {
        "content": "<p>From: Gottfried Barrow &lt;<a href=\"mailto:gottfried.barrow@gmx.com\">gottfried.barrow@gmx.com</a>&gt;<br>\nChristian,</p>\n<p>Alright. Thanks for putting it up. This will come in useful.</p>\n<p>Regards,<br>\nGB</p>",
        "id": 294224633,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660899327
    },
    {
        "content": "<p>From: Gottfried Barrow &lt;<a href=\"mailto:gottfried.barrow@gmx.com\">gottfried.barrow@gmx.com</a>&gt;<br>\nHi,</p>\n<p>There may not be much to say about this. I'm looking for subtleties that <br>\nI may not understand, about what the prover engine is doing with the <br>\nfree variables when I axiomatize a formula that contains free variables.</p>\n<p>I attach the THY and a PDF printout of the THY. The PDF is about 1 and a <br>\n1/2 pages long.</p>\n<p>I have two formulas:</p>\n<p>!q1.!q2.(!x. x ∈ q1 ⟷ x ∈q2) ⟷ (q1 = q2), and<br>\n(!x. x ∈ q1 ⟷ x ∈q2) ⟷ (q1 = q2).</p>\n<p>First, I show they're not equivalent with a counter example.</p>\n<p>Using locales, I then show that if I axiomatize either one of them, then <br>\nthey're equivalent.</p>\n<p>I then axiomatize both of them, and I explain why with my last sentence.</p>\n<p>If anyone cares to comment, please do.</p>\n<p>Thanks,<br>\nGB<br>\n<a href=\"/user_uploads/14278/oejr9Rajx73f0fXEEzj5VzMf/a_sTs01_121027.pdf\">a_sTs01_121027.pdf</a><br>\n<a href=\"/user_uploads/14278/1DM0ZVu40_OFwC9u1AOpeak2/a_sTs01_121027.thy\">a_sTs01_121027.thy</a></p>",
        "id": 294225805,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660899930
    },
    {
        "content": "<p>From: Christian Sternagel &lt;<a href=\"mailto:c-sterna@jaist.ac.jp\">c-sterna@jaist.ac.jp</a>&gt;<br>\nDear Gottfried,</p>\n<p>first of all, the way you are using symbols in comments is rather <br>\nnon-conventional and makes the THY file a bit cluttered with unnecessary <br>\nnoise. Since typical Isabelle users might prefer to consult the THY file <br>\nover the generated PDF file that is unfortunate.</p>\n<p>Concerning the counterexample: The theorem for which nitpick found a <br>\ncounterexample does not state equivalence of the two formulas.</p>\n<p>To see why, you have to know how Isabelle treats free variables: they <br>\nare implicitly all-quantified (using the all-quantifier of Pure, which <br>\nis !!). Let \"P(q1,q2)\" stand for the formula \"(!x. x : q1 &lt;-&gt; x : q2) <br>\n&lt;-&gt; (q1 = q2)\", then your first axiomatization is</p>\n<p>!q1. !q2. P(q1,q2)</p>\n<p>which stays as it is, since there are no free variables. The second one is</p>\n<p>P(q1,q2)</p>\n<p>and should be read as</p>\n<p>!!q1 q1. P(q1,q2)</p>\n<p>Now, if you write</p>\n<p>(!q1. !q2. P(q1, q2)) &lt;-&gt; P(q1,q2)</p>\n<p>the implicit Pure all-quantification is at the outermost position, i.e.,</p>\n<p>!!q1 q2. (!q1. !q2. P(q1, q2)) &lt;-&gt; P(q1, q2)</p>\n<p>For this formula nitpick found a counterexample. The think is, this <br>\nformula does not state equivalence between your two axioms (since the <br>\nquantifiers are at the \"wrong\" place).</p>\n<p>Now for your locales. Since for any Q, \"!x. Q x\" is logically equivalent <br>\nto \"!!x. Q x\" (in HOL) the locales are equivalent (and thus more or less <br>\nidentical for automated tools like blast, auto, metis).</p>\n<p>Moreover the proofs are both trivial. If we have \"!q1 q2. P(q1, q2)\" we <br>\ncan of course specialize this to arbitrary q1 and q2, i.e., \"P(q1, q2)\". <br>\nThe other direction of the biimplication, where we have \"P(q1, q2)\" for <br>\nsome arbitrary but fixed q1 and q2 and have to show \"!q1 q2. P(q1, q2)\" <br>\njust does not have to use the assumption at all, since the only axiom of <br>\nthe local is already what we have to prove.</p>\n<p>In short: both axioms are indeed equivalent and the counterexample does <br>\nnot apply since it was generated for a different statement.</p>\n<p>Take away: free variables in theorems are implicitly all-quantified.</p>\n<p>hope that helps</p>\n<p>chris</p>",
        "id": 294225811,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660899933
    }
]