[
    {
        "content": "<p>From: Ken Kubota &lt;<a href=\"mailto:mail@kenkubota.de\">mail@kenkubota.de</a>&gt;<br>\nIn this discussion on the Isabelle mailing list, I am missing the question<br>\nof the correctness of the small logical kernel that should guarantee<br>\nthe correctness of the whole system.</p>\n<p>Currently, the arguments presented so far seem to open up a false alternative<br>\nbetween logically correct (reliable) but small theorem provers (e.g., HOL Zero),<br>\nand large and practical but less reliable provers (e.g., Isabelle/HOL):</p>\n<blockquote>\n<p>The other big provers (e.g. Coq) are similar in this respect. […]<br>\nHOL-Zero is a notable exception in targeting a market of potentially<br>\nmalicious (ab-)users, but it is not a \"big prover\".<br>\nAccording to this idea, any reliable prover/checker must be small,<br>\nand any practical (and hence, large) prover isn't reliable.<br>\nBut the concept of a small logical kernel that guarantees<br>\nthe correctness of the whole system states exactly the opposite,<br>\ni.e., no matter how large and practical the software is, it remains reliable.</p>\n</blockquote>\n<p>This concept is given up in arguments like</p>\n<blockquote>\n<p>We do not have to work on the basis that \"X has been proved, therefore X is true\", but rather \"We have been given a proof of X; Is it credible?\" <br>\nwhich even seems to rhetorically downplay a desirable must-have (correctness)<br>\nas an annoying impediment to get rid of (\"do not have to work on the basis\").<br>\nIn particular, transferring the responsibility for providing reliability (correctness)<br>\nfrom (verifying) the small logical kernel to either examining specific parts of<br>\nthe formalized proof or estimating the credibility of the supplying person is questionable,<br>\nas even the best mathematicians from time to time fail at complex proofs:<br>\nThen we can look at any part of this proof where we have doubts. […]</p>\n</blockquote>\n<blockquote>\n<p>The effort we choose to invest in this would depend on how important X is and how much we distrust the person who supplied the proof.</p>\n</blockquote>\n<p>I do not see any alternative to providing a correct small logical kernel.</p>\n<p>Preserving logical dependencies is part of (has to be guaranteed by) the logical kernel.<br>\nFor this reason, I consider the following phenomenon as highly problematic<br>\n(and even as a failure of the logical kernel):</p>\n<blockquote>\n<blockquote>\n<p>found this originally, but you can hide the ‘taint’ of a theorem by<br>\ngoing through a type class instantiation:<br>\nIf a conditional can be stripped off so easily, it might be possible to obtain from<br>\ndifferent conditionals two contradictory theorems, and hence, an inconsistency.<br>\nIn a related discussion about this question on the Metamath mailing list I argued<br>\nin favor of introducing all non-logical axioms as conditionals (hence, Q0 and R0 have only five axioms)<br>\nin order to make the dependency explicit:<br>\nThird, the dependency is made explicit. If \"the software tracks<br>\naxiom usage, as Metamath does\", the task of tracking dependencies<br>\nis moved from the logic to the software, which I already, in another<br>\ncontext, criticized at Kunčar/Popescu's approach (which is<br>\nnevertheless legitimate as an auxiliary approach).<br>\n[…] Andrews' exercise X5308 […] stated and <br>\nformalized on pp. 151 ff. of<br>\n<a href=\"http://www.owlofminerva.net/files/formulae.pdf\">http://www.owlofminerva.net/files/formulae.pdf</a><br>\nis taken as an example where the dependency of the theorem<br>\nis make explicit, assuming the form<br>\n  AC =&gt; theorem<br>\nsince the (non-logical) Axiom of Choice was<br>\nintroduced as a conditional, not as an axiom.</p>\n</blockquote>\n</blockquote>\n<p><a href=\"https://groups.google.com/d/msg/metamath/WwKPkCGoZkg/VSAVebXPCQAJ\">https://groups.google.com/d/msg/metamath/WwKPkCGoZkg/VSAVebXPCQAJ</a><br>\nNorman Megill presented a similar example:</p>\n<blockquote>\n<p>It is certainly possible to prefix every theorem with \"ZFC -&gt;\"</p>\n</blockquote>\n<p><a href=\"https://groups.google.com/d/msg/metamath/WwKPkCGoZkg/nvmXHUffCQAJ\">https://groups.google.com/d/msg/metamath/WwKPkCGoZkg/nvmXHUffCQAJ</a><br>\nI agree with Norman Megill that in certain practical contexts constantly displaying<br>\nthe same conditional prefix may be redundant, but this is a question of the user interface<br>\n(which could, for example, replace the default prefix – e.g., \"ZFC -&gt;\" – by a star \"*\"), but not a<br>\nmatter relevant for the logical kernel, where this dependency should be made explicit.</p>\n<p>As mentioned earlier, the Isabelle concept of axiomatic type classes as described and discussed in <br>\n<a href=\"https://www4.in.tum.de/~wenzelm/papers/axclass-TPHOLs97.pdf\">https://www4.in.tum.de/~wenzelm/papers/axclass-TPHOLs97.pdf</a><br>\nand introduced in</p>\n<blockquote>\n<p>Prover-powered type classes were introduced by Nipkow and Snelting [28] in Isabelle/HOL<br>\nand by Sozeau and Oury [32] in Coq—they additionally feature verifiability<br>\nof the type-class conditions upon instantiation: a type T is accepted as a member<br>\nof the semigroup class only if associativity can be proved for its + operation.</p>\n</blockquote>\n<p><a href=\"http://www21.in.tum.de/~kuncar/documents/kuncar-popescu-itp2015.pdf\">http://www21.in.tum.de/~kuncar/documents/kuncar-popescu-itp2015.pdf</a> (p. 3)<br>\nis considered as a preliminary solution by me, since the same fact can be expressed <br>\nvery naturally with the means of type abstraction (as suggested by Mike Gordon, see first quote at<br>\n<a href=\"http://owlofminerva.net/kubota/software-implementation-of-the-mathematical-logic-r0-available-for-download/\">http://owlofminerva.net/kubota/software-implementation-of-the-mathematical-logic-r0-available-for-download/</a><br>\n) and as argued and demonstrated at pp. 12, 362, 420 of<br>\n<a href=\"http://www.owlofminerva.net/files/formulae.pdf\">http://www.owlofminerva.net/files/formulae.pdf</a><br>\nHere, the fact that (o,XOR) is a group, formalized as<br>\n    Grp o XOR<br>\n(p. 420) can be stated only after proving the three group axioms for (o,XOR),<br>\nand only after that, a general proof on groups (Uniqueness of the Group Identity Element, pp. 362 ff.) <br>\ncan be instantiated (transferred) to the specific XOR group without having to carry out the proof again<br>\n(Uniqueness of the Group Identity Element of the XOR Group, pp. 420 ff.).</p>\n<p>Coq is not suited for a comparison. It is very expressive (e.g., it has dependent types),<br>\nbut there is profound criticism raised by Freek Wiedijk and John Harrison (and Josef Urban),<br>\nsee section 3 of<br>\n<a href=\"http://doi.org/10.4444/100.111\">http://doi.org/10.4444/100.111</a><br>\nand for an example the rule on top of p. 54 at<br>\n<a href=\"http://www.cl.cam.ac.uk/~jrh13/papers/joerg.pdf\">http://www.cl.cam.ac.uk/~jrh13/papers/joerg.pdf</a><br>\nwhich is very far from a natural expression of formal logic and mathematics.</p>\n<p>The Isabelle documentation is discussed quite often.</p>\n<blockquote>\n<p>Extensive documentation is available.<br>\n<a href=\"http://www.cl.cam.ac.uk/~lp15/papers/Formath/Goedel-ar.pdf\">http://www.cl.cam.ac.uk/~lp15/papers/Formath/Goedel-ar.pdf</a> (p. 3)<br>\nThe problem remains open: How can true expertise about how Isabelle<br>\nreally works be reconstructed? We've seen a slow and steady decline in<br>\nthe past 10 years, and myself writing hundreds of pages of documentation<br>\nhelped only very little.</p>\n</blockquote>\n<p>It is always claimed that the Isabelle documentation is ample, but unfortunately,<br>\nit is not logically structured, which makes the extent of the documentation<br>\nrather a disadvantage than an advantage.<br>\nFor comparison, the HOL/HOL4 documentation provides a precise and quick introduction,<br>\nwhich allowed me to fully comprehend the logic, install the software and<br>\ncarry out proofs very quickly. It has, as one would expect, a separate logic part<br>\n(Part III: The HOL Logic [Gordon and Melham, 1993, pp. 191–232]), available online at<br>\n<a href=\"http://freefr.dl.sourceforge.net/project/hol/hol/kananaskis-11/kananaskis-11-logic.pdf\">http://freefr.dl.sourceforge.net/project/hol/hol/kananaskis-11/kananaskis-11-logic.pdf</a><br>\nand a very good guidebook which allows one to inspect the details of the system:<br>\n<a href=\"https://hol-theorem-prover.org/guidebook/\">https://hol-theorem-prover.org/guidebook/</a><br>\nI already made suggestions for improvements earlier:</p>\n<blockquote>\n<p>Although of course Isabelle/HOL is a very good piece of software, this precision is currently missing in my opinion.<br>\nThe extension from classical HOL to Gordon's HOL can be found in section 11.7 (p. 261), as well as the<br>\n(single) extension from Gordon's HOL to Isabelle/HOL (\"Isabelle/HOL goes beyond Gordon-style HOL<br>\nby admitting overloaded constant definitions\") within a document of 13 chapters and 330 pages,<br>\nwhich makes it practically impossible to identify and locate important features and extensions of the core logic<br>\nwithin a reasonable amount of time:<br>\n<a href=\"http://www.cl.cam.ac.uk/research/hvg/Isabelle/dist/Isabelle2016/doc/isar-ref.pdf\">http://www.cl.cam.ac.uk/research/hvg/Isabelle/dist/Isabelle2016/doc/isar-ref.pdf</a></p>\n</blockquote>\n<p><a href=\"https://lists.cam.ac.uk/pipermail/cl-isabelle-users/2016-October/msg00050.html\">https://lists.cam.ac.uk/pipermail/cl-isabelle-users/2016-October/msg00050.html</a><br>\nEssential information on the logic is hidden somewhere between many technical details,<br>\nand at the first glance I can't even see a reason for why the extension of the HOL logic is<br>\ndescribed in the Isar reference, and not in the Isabelle/HOL reference.<br>\nWith the HOL/HOL4 documentation, I was able to understand the logic and study<br>\nthe details of the proof technology within 24 hours (see example files attached),<br>\nbut with the Isabelle/HOL documentation, even after many months the details<br>\nare obscure. Moreover, the concept of a small logical kernel should be reflected<br>\nin the documentation by a separate logic part, as in the HOL/HOL4 documentation.<br>\nThe Isabelle/HOL documentation currently doesn't conform to this clear standard<br>\nestablished by the original HOL system.</p>\n<p>The emails quoted are attached below.<br>\nThe full discussion is available at<br>\n<a href=\"https://lists.cam.ac.uk/pipermail/cl-isabelle-users/2017-July/date.html\">https://lists.cam.ac.uk/pipermail/cl-isabelle-users/2017-July/date.html</a></p>\n<hr>\n<p>Ken Kubota<br>\n<a href=\"http://doi.org/10.4444/100\">http://doi.org/10.4444/100</a></p>\n<blockquote>\n<p>Am 08.07.2017 um 20:59 schrieb Lawrence Paulson &lt;<a href=\"mailto:lp15@cam.ac.uk\">lp15@cam.ac.uk</a>&gt;:</p>\n<p>To protect against malicious intentions would turn Isabelle into a form of security software. But the guarantees we get from the latter are quite different from what we get from a formal proof. Ultimately security claims depend upon trusting a lot of complicated mechanisms, such as certificate authorities and cryptosystems. We are not a lot better off than when a model checker comes back with nothing.</p>\n<p>However, we work with formal proofs, which can be examined, even interactively. We do not have to work on the basis that \"X has been proved, therefore X is true\", but rather \"We have been given a proof of X; Is it credible?\" Then we can look at any part of this proof where we have doubts. A devious user has many ways to try to fool us, but it's not so easy if he has to supply the full source code and we insist on legibility throughout. The effort we choose to invest in this would depend on how important X is and how much we distrust the person who supplied the proof.</p>\n<p>Larry Paulson</p>\n<p>On 8 Jul 2017, at 18:12, scott constable &lt;<a href=\"mailto:sdconsta@syr.edu\">sdconsta@syr.edu</a>&gt; wrote:</p>\n<blockquote>\n<p>Isabelle does not protect against malicious intentions. It would require<br>\na quite different system to do that, one that you won't like to <br>\n[message truncated]</p>\n</blockquote>\n</blockquote>",
        "id": 294713816,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661183076
    }
]