[
    {
        "content": "<p>From: \"Schmaltz, J.\" &lt;<a href=\"mailto:j.schmaltz@tue.nl\">j.schmaltz@tue.nl</a>&gt;<br>\n<strong>*</strong>* DATE 2018 — Call for Papers — Topic D4 Formal Methods and Verification <strong>*</strong>**</p>\n<p>Design Methods and Tools Track @ DATE 2018</p>\n<p>Dresden, Germany - March 19-23, 2018</p>\n<p>IMPORTANT DEADLINES</p>\n<ul>\n<li>Abstract  : Sunday, September 10, 2017 23:59:59 CET</li>\n<li>Full paper: Sunday, September 17, 2017 23:59:59 CET.</li>\n</ul>\n<p>The 21st DATE conference and exhibition is the main European event bringing together designers and design automation users, researchers and vendors,<br>\nas well as specialists in the hardware and software design, test and manufacturing of electronic circuits and systems.<br>\nDATE puts strong emphasis on both technology and systems, covering ICs/SoCs, reconfigurable hardware and embedded systems, and embedded software.</p>\n<p>The five-day event consists of a conference with plenary invited papers, regular papers, panels, hot-topic sessions, tutorials and workshops,<br>\ntwo special focus days and a track for executives. The scientific conference is complemented by a commercial exhibition showing the state-of-the-art<br>\nin design and test tools, methodologies, IP and design services, reconfigurable and other hardware platforms, embedded software, and (industrial) design experiences<br>\nfrom different application domains, e.g. automotive, wireless, telecom and multimedia applications. The organisation of user group meetings, fringe meetings,<br>\na university booth, a PhD forum, vendor presentations and social events offers a wide variety of extra opportunities to meet and exchange information on relevant issues<br>\nfor the design and test community. Special space will also be allocated for EU-funded projects to show their results.</p>\n<p>The conference addresses all aspects of research into technologies for electronic and (embedded) systems engineering.<br>\nIt covers the design process, test, and tools for design automation of electronic products ranging from integrated circuits to distributed large-scale systems.<br>\nThis includes both hardware and embedded software design issues. The conference scope also includes the elaboration of design requirements and new architectures<br>\nfor challenging application fields such as telecom, wireless communications, multimedia, healthcare and automotive systems.<br>\nPersons involved in innovative industrial designs are particularly encouraged to submit papers to foster the feedback from design to research.<br>\nPanels, hot-topic sessions and embedded tutorials highlight and inform about emerging topics.</p>\n<p>The Design Methods and Tools track addresses design automation, design tools and hardware architectures for electronic and embedded systems.<br>\nThe emphasis is on methods, algorithms, and tools related to the use of computers in designing complete systems.<br>\nThe track’s focus includes significant improvements on existing design methods and tools as well as forward-looking approaches to model<br>\nand design future system architectures, design flows, and environments.<br>\nThe Formal Methods and Verification topic (D4) is one of the fourteen topics foreseen in the Design Methods and Tools Track.</p>\n<p>TOPIC DESCRIPTION</p>\n<p>The Formal Methods and Verification topic (D4) is devoted to the presentation and discussion of state-of-the-art advances in the theory and practice of<br>\nformal verification methods. Topics of interest include, but are not limited to:</p>\n<ul>\n<li>\n<p>Formal verification and specification techniques, including equivalence checking, model checking, symbolic simulation, theorem proving,<br>\nabstraction and refinement techniques, decomposition techniques and compositional reasoning</p>\n</li>\n<li>\n<p>Core algorithmic technologies supporting formal verification such as SAT, BDD, and SMT techniques</p>\n</li>\n<li>Formal verification of hardware (including IPs, SoCs, and cores), software, hardware / software systems, timed and hybrid systems</li>\n<li>Semi-formal verification techniques</li>\n<li>Integration of verification into design flows</li>\n<li>Challenges of multi-cores, both as verification targets and as verification host platforms</li>\n<li>Formal synthesis</li>\n<li>Applications of formal and semi-formal techniques to asynchronous designs, analog and mixed-signal designs,<br>\n  power modelling and analysis, hardware and software security, etc.</li>\n</ul>\n<p>TOPIC TECHNICAL COMMITTEE</p>\n<p>Armin Biere, Universitaet Linz, AT (co-chair)<br>\nGianpiero Cabodi, Politecnico di Torino, IT<br>\nAlessandro Cimatti, Fondazione Bruno Kessler - Center for Information technology, IT,<br>\nJulien Schmaltz, Eindhoven University of Technology, NL<br>\nChristoph Scholl, University Freiburg, DE (chair)<br>\nDaryl Stewart, ARM, GB</p>\n<p>SUBMISSION INSTRUCTIONS</p>\n<p>Submission instructions can be found on the conference web page: <a href=\"http://www.date-conference.com\">www.date-conference.com</a></p>\n<p>Papers can be submitted either as Scientific Papers for Oral Presentation or as<br>\nScientific Papers for Interactive Presentation.</p>\n<p>Oral presentations require novel and complete research work supported by experimental results.<br>\nThey will be evaluated with regard to their suitability for the conference, originality, and technical soundness.<br>\nAccepted papers will be published in the conference proceedings (max six pages) and will be presented in<br>\neither 30-minute (\"long\") or 15-minute (\"short\") slots in the conference program in front of an audience.<br>\nThe Program Committee reserves the right to reorient Oral-Presentation papers to Interactive-Presentation, to obtain the most suitable presentation format.</p>\n<p>Interactive presentations are expected to articulate emerging and future design,<br>\nverification and test problems including work in progress and identify open problems that merit innovative future research.<br>\nAccepted papers will be published in the conference proceedings (max four pages) and will be presented in a face-to-face discussion area.<br>\nPresenters are required to prepare a poster (up to A0 format) to help the discussion.</p>\n<p>The accepted file format is PDF.<br>\nSubmissions should be formatted as close as possible to the final format:<br>\nA4 or letter pages, double column, single spaced, Times or equivalent font of minimum 10pt<br>\n(templates are available on the DATE Web site for your convenience).<br>\nTo permit blind review, manuscripts should not include the author names nor affiliations.<br>\nManuscripts not in line with the above rules might be discarded.</p>\n<p>Deadlines: The deadline to submit papers is Sunday, September 10, 2017 23:59:59 CET. For a paper to be considered a valid submission, at least a title, abstract,<br>\nand the complete list of authors (cannot be modified after Sunday, September 10, 2017 23:59:59 CET) should be submitted by this date.<br>\nThe full paper can be submitted at the same time or later, but must be uploaded at the latest by Sunday, September 17, 2017 23:59:59 CET.<br>\nOtherwise the initial submission will be automatically withdrawn. Please note that there will not be any additional deadline extensions beyond Sunday, September 17, 2017 23:59:59 CET.</p>",
        "id": 294714318,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661183259
    }
]