[
    {
        "content": "<p>From: Andrei Paskevich &lt;<a href=\"mailto:andrei.paskevich@lri.fr\">andrei.paskevich@lri.fr</a>&gt;<br>\nThe Fourth International Workshop on<br>\n            Proof eXchange for Theorem Proving (PxTP)</p>\n<p><a href=\"http://pxtp15.lri.fr/\">http://pxtp15.lri.fr/</a></p>\n<p>August 2-3, 2015, Berlin, Germany</p>\n<p>associated with CADE 2015</p>\n<p>Important dates</p>\n<p>* Abstract submission: Thu, May 7, 2015<br>\n  * Paper submission: Thu, May 14, 2015<br>\n  * Notification: Tue, June 16, 2015<br>\n  * Camera ready versions due: Thu, June 25, 2015<br>\n  * Workshop: August 2-3, 2015</p>\n<p>Background</p>\n<p>The PxTP workshop brings together researchers working on various aspects<br>\n  of communication, integration, and cooperation between reasoning systems<br>\n  and formalisms.</p>\n<p>The progress in computer-aided reasoning, both automated and interactive,<br>\n  during the past decades, made it possible to build deduction tools that<br>\n  are increasingly more applicable to a wider range of problems and are<br>\n  able to tackle larger problems progressively faster. In recent years,<br>\n  cooperation of such tools in larger verification environments has<br>\n  demonstrated the potential to reduce the amount of manual intervention.<br>\n  Examples include the Sledgehammer tool providing an interface between<br>\n  Isabelle and (untrusted) automated provers, and also collaboration of<br>\n  the HOL Light and Isabelle systems in the formal proof of the Kepler<br>\n  conjecture.</p>\n<p>Cooperation between reasoning systems relies on availability of<br>\n  theoretical formalisms and practical tools to exchange problems,<br>\n  proofs, and models. The PxTP workshop strives to encourage such<br>\n  cooperation by inviting contributions on suitable integration,<br>\n  translation and communication methods, standards, protocols,<br>\n  and programming interfaces. The workshop welcomes the interested<br>\n  developers of automated and interactive theorem proving tools,<br>\n  developers of combined systems, developers and users of translation<br>\n  tools and interfaces, and producers of standards and protocols.<br>\n  We are interested both in success stories and in descriptions<br>\n  of the current bottlenecks and proposals for improvement.</p>\n<p>Topics</p>\n<p>Topics of interest for this workshop include all aspects of<br>\n  cooperation between reasoning tools, whether automatic or<br>\n  interactive. More specifically, some suggested topics are:</p>\n<p>* applications that integrate reasoning tools (ideally<br>\n    with certification of the result);</p>\n<p>* translations between logics, proof systems, models;</p>\n<p>* distribution of proof obligations among heterogeneous<br>\n    reasoning tools;</p>\n<p>* algorithms and tools for checking and importing (replaying,<br>\n    reconstructing) proofs;</p>\n<p>* proposed formats for expressing problems and solutions for<br>\n    different classes of logic solvers (SAT, SMT, QBF, first-order<br>\n    logic, higher-order logic, typed logic, rewriting, etc.);</p>\n<p>* meta-languages, logical frameworks, communication methods,<br>\n    standards, protocols, and APIs connected to problems, proofs,<br>\n    and models;</p>\n<p>* comparison, refactoring, and optimization of proofs;</p>\n<p>* practical experiences, case studies, feasibility studies;</p>\n<p>* applications relying on importing proofs from automatic theorem<br>\n    provers, such as certified static analysis, proof-carrying code,<br>\n    or certified compilation;</p>\n<p>* data structures and algorithms for improved proof production in<br>\n    solvers (e.g., efficient proof representations).</p>\n<p>Submissions</p>\n<p>Researchers interested in participating are invited to submit either<br>\n  an extended abstract (up to 8 pages) or a regular paper (up to 15<br>\n  pages). Submissions will be refereed by the program committee, which<br>\n  will select a balanced program of high-quality contributions. Short<br>\n  submissions that could stimulate fruitful discussion at the workshop<br>\n  are particularly welcome. We expect that one author of every accepted<br>\n  paper will present their work at the workshop.</p>\n<p>Submitted papers should describe previously unpublished work, and must<br>\n  be prepared using the LaTeX EPTCS class (<a href=\"http://style.eptcs.org/\">http://style.eptcs.org/</a>).<br>\n  Papers will be submitted via EasyChair, at the PxTP'2015 workshop page<br>\n  (<a href=\"http://www.easychair.org/conferences/?conf=pxtp2015\">http://www.easychair.org/conferences/?conf=pxtp2015</a>). Accepted full<br>\n  papers will appear in an EPTCS volume.</p>\n<p>Invited speakers (joint with the AMI'2015 workshop)</p>\n<p>* Georges Gonthier (Microsoft Research)<br>\n  * Bart Jacobs (KU Leuven)</p>\n<p>Program committee</p>\n<p>* Jesse Alama (Vienna University of Technology)<br>\n  * Peter Baumgartner (NICTA)<br>\n  * Jasmin Blanchette (TU München)<br>\n  * Guillaume Burel (CÉDRIC, ENSIIE)<br>\n  * Évelyne Contejean (LRI, CNRS, Université Paris Sud)<br>\n  * Cezary Kaliszyk (University of Innsbruck), co-chair<br>\n  * Ramana Kumar (University of Cambridge)<br>\n  * Dale Miller (Inria / LIX, École polytechnique)<br>\n  * Bruno Woltzenlogel Paleo (Vienna University of Technology)<br>\n  * Andrei Paskevich (LRI, Université Paris Sud), co-chair<br>\n  * Damien Pous (LIP, CNRS, ENS Lyon)<br>\n  * Geoff Sutcliffe (University of Miami)<br>\n  * Laurent Théry (Inria)<br>\n  * Cesare Tinelli (University of Iowa)<br>\n  * Josef Urban (Radboud University Nijmegen)</p>",
        "id": 294638672,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661161210
    }
]