[
    {
        "content": "<p>From: \"CRACIUN F.\" &lt;<a href=\"mailto:florin.craciun@durham.ac.uk\">florin.craciun@durham.ac.uk</a>&gt;</p>\n<hr>\n<ul>\n<li>\n<p>A 3.5year Ph.D Position and a Postdoc Position </p>\n</li>\n<li>\n<p>available in the area of Program Analysis and Verification</p>\n</li>\n<li>\n<p>funded by the EPSRC project entitled \"Inference Mechanisms </p>\n</li>\n<li>\n<p>for a Separation and Numerical Domain\"</p>\n</li>\n<li>\n<p>in Department Of Computer Science, Durham University, UK</p>\n</li>\n</ul>\n<hr>\n<p>Applications are invited for a Ph.D. student and a Postdoctoral Research Associate to work on an EPSRC funded project entitled \"Inference Mechanisms for a Separation and Numerical Domain\" in the group led by Dr. Shengchao Qin in the Department of Computer Science. The aim of the project is to develop advanced static analysis techniques based on separation logic for automated verification of memory safety as well as functional correctness of substantial heap-manipulating imperative programs. The key objective is to develop advanced inference/abstraction mechanisms in the combined separation and numerical domain with user-defined inductive predicates, so that loop invariants and method pre/post-conditions can be automatically synthesised, where possible.</p>\n<p>About the Ph.D Position:</p>\n<p>=========================</p>\n<p>Prospective Ph.D candidates must have (or expect to have) a good honours (or equivalent) degree in Computer Science or other relevant subjects. The studentship requires good background knowledge in most of the following areas: logic and discrete mathematics related to computer science, computer-aided verification, compilers, and program analysis. Strong programming skills will also be essential for the studentship.</p>\n<p>This fully funded studentship provides a tax-free living allowance at the standard EPSRC rate (GBP 13,290 p.a. for 09/10) and student tuition fees at the UK/EU student rate (non-EU students will require supplementary funding). The successful candidate is expected to start on 1st September 2009.</p>\n<p>Closing date (the Ph.D Position): 15 May 2009</p>\n<p>Applications (such as CV, references, a transcript and a statement of research interests) should be sent to Dr Shengchao Qin, Computer Science Department, Durham University, Science Labs, South Road, Durham, DH1 3LE, United Kingdom. Applicants are also required to register their interest of pursuing a Ph.D in Durham at <a href=\"https://bannerss.dur.ac.uk/blive_ssb/bwskalog.P_DispLoginNon\">https://bannerss.dur.ac.uk/blive_ssb/bwskalog.P_DispLoginNon</a></p>\n<p>About the Postdoc Position:</p>\n<p>===========================</p>\n<p>The successful applicant should have received (or expect to receive) a Ph.D in Computer Science or a closely related subject.  Suitable candidates should be able to demonstrate research skills or potential at an international level in the field of program analysis and computer-aided verification.</p>\n<p>Key responsibilities: the Postdoctoral Research Associate(PDRA) is expected to conduct research in program analysis and verification using separation logic.  Working closely with the team leader, the PDRA is expected to develop advanced inference/abstraction mechanisms in an abstract domain combined with separation and numerical information and in the presence of user-specified inductive predicates and lemmas. More specifically, the PDRA is expected to make significant contributions in (1) automatic inference/analysis  of loop invariants and method pre/post-specifications in the combined domain, (2) the construction of an analysis/verification tool and the integration of the developed tool with the verification tool HIP/SLEEK developed in National University of Singapore, and (3) the application of the tool to verify memory safety of substantial system software such as the Linux distribution.  The RA is expected to write and publish research papers in good quality conferences and journals every year. </p>\n<p>Closing date (the Postdoc postioin): 31 May 2009</p>\n<p>Details about this position including the application procedure can be found at</p>\n<p><a href=\"https://jobs.dur.ac.uk/jobdtls.asp?Session_in=&amp;Uid=&amp;vref=3164\">https://jobs.dur.ac.uk/jobdtls.asp?Session_in=&amp;Uid=&amp;vref=3164</a></p>\n<p>More project information can be obtained by contacting Dr Shengchao Qin at <a href=\"mailto:shengchao.qin@durham.ac.uk\">shengchao.qin@durham.ac.uk</a>, or by visiting <a href=\"http://www.dur.ac.uk/shengchao.qin\">http://www.dur.ac.uk/shengchao.qin</a></p>",
        "id": 294076800,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660829212
    }
]