[
    {
        "content": "<p>From: Maria Spichkova &lt;<a href=\"mailto:maria.spichkova@rmit.edu.au\">maria.spichkova@rmit.edu.au</a>&gt;<br>\n[Apologies if you receive multiple copies of this message]</p>\n<p><em>CALL FOR PAPERS</em></p>\n<p>*HOFM 2015: 2nd Human-Oriented Formal Methods Workshop *\n<a href=\"http://hofm2015.wordpress.com\">http://hofm2015.wordpress.com</a></p>\n<p><em>co-located to SEFM</em>, 13th International Conference on Software Engineering<br>\nand Formal Methods, <a href=\"http://www.cs.york.ac.uk/sefm2015\">http://www.cs.york.ac.uk/sefm2015</a> (York, UK)</p>\n<p><strong>Important Dates</strong></p>\n<p>Deadline for paper submission: June 3, 2015<br>\nNotification: June 19, 2015<br>\nWorkshop will take place on Monday, September 7, 2015.</p>\n<p><em>Aims:</em></p>\n<p>While designing and applying formal methods, computer scientists have<br>\ndominantly focused on two factors, only: firstly, the method must be<br>\nprecise and sound and secondly, it must be mathematically concise and<br>\naesthetic. Other important characteristics such as simplicity,<br>\nlearnability, readability, memorability, ease of use and communication or,<br>\neven support for integrating tools into larger development tool chains are<br>\nignored too often. These nonfunctional properties, however, are key<br>\nattributes of usability and user satisfaction. If usability is compromised,<br>\nmethods are not fit for the purpose of documenting, reproducing and<br>\ncommunicating key design and realization decisions, or analysis results,<br>\nespecially when these need to communicate or mediate between expertise in<br>\ndifferent disciplines, different tool chains or across technological or<br>\norganizational boundaries. For these reasons, many engineers and<br>\npractitioners largely reject formal methods and formal specification<br>\nlanguages as “too hard to understand and use in practice” while admitting<br>\nthat they are powerful and precise.</p>\n<p>With increasing computing power and its consequent automation capabilities,<br>\nthe research and development community however is slowly but definitely<br>\nfocusing on usability in combination with automation. Moreover<br>\npractitioners across numerous domains are increasingly interested in formal<br>\ndomain-specific modelling, simulation and validation, whether in<br>\napplication areas of energy, robotics, health, biology, climate and<br>\nsustainable development, or, for specific technologies of importance such<br>\nas data analytics and user interface specification for an exponentially<br>\ngrowing number of hand-held or wearable devices.</p>\n<p>While there are many applications of formal methods to analyze<br>\nhuman-machine interaction and to construct user interfaces, the field of<br>\napplication of human factors to the analysis and to the optimization of<br>\nformal methods area is almost unexplored.</p>\n<p>This workshop aims to bring together researchers, engineers and<br>\npractitioners from academia and industry to baseline the state of the art<br>\nin this increasingly important domain. It also aims to develop a future<br>\nvision and roadmap of usability and automation, focusing especially on<br>\nreadability and ease of use.</p>\n<p><em>Areas of interest include but are not limited to:</em></p>\n<ul>\n<li>\n<p>Integration of formal methods in the industrial development life<br>\ncycle , application of Formal Methods to real-world problems especially in<br>\ndomains listed below</p>\n</li>\n<li>\n<p>Optimization of the development tools based on formal models</p>\n</li>\n<li>Specification/modeling notations and tools for human readability</li>\n<li>Human factors of/for formal methods</li>\n<li>Formal methods and design for usability</li>\n<li>Usability and scalability of formal methods tools</li>\n<li>Human error and human factors in software/systems dependability</li>\n<li>Interface design, formal specification and human factors</li>\n<li>Cross-disciplinary automation and hybrid formal methods</li>\n<li>Verification/testing automation</li>\n<li>Usability evaluation in automated verification and testing</li>\n<li>Visualisation of/in formal methods and tools</li>\n<li>Domain-specific languages for verification and validation</li>\n<li>Crowd-enabling and gamification for human-centred verification</li>\n<li>Domain-specific formal methods for real-world problems</li>\n<li>Teaching of Formal Methods, especially wrt. human factors</li>\n</ul>\n<p><em>Formatting and Submission Guidelines:</em></p>\n<p>All accepted papers will be published as part of the Lecture Notes in<br>\nComputer Science (LNCS) proceedings volume organized by SEFM.<br>\nPDF versions of papers should be submitted trough EasyChair submission<br>\nsystem.<br>\nThe maximum size is 15 pages using the LNCS Formatting Guidelines.<br>\nIf you submit a paper and it gets accepted, at least one of the<br>\n(co)author(s) is expected to be present at the workshop to present the<br>\npaper. All papers submitted to the workshop must be unpublished original<br>\nwork and should not be under review or submitted elsewhere while being<br>\nunder consideration.</p>\n<p>We invite submissions in three categories:<br>\n• Research papers reporting innovative and original research in the field.<br>\n• Work-in-Progress/vision describing ongoing research, emerging results and<br>\nfuture ideas&amp;trends.<br>\n• Tool papers describing operational tool and its contributions.</p>\n<p>Submitted papers will be reviewed by 3 members of Program/Organizing<br>\nCommittee (or their sub-reviewers) and selection of accepted papers will<br>\nbased on relevance, quality and originality of the submitted papers.</p>\n<p><em>Program Committee:</em></p>\n<p>Katherine Blashki, Noroff University College, Norway<br>\nManfred Broy, Technical University München, Germany<br>\nPedro Isaías, Universidade Aberta, Portugal<br>\nLalchandani Jayprakash, IIIT Bangalore, India<br>\nPeter Herrmann, NTNU Trondheim, Norway<br>\nTim Miller, The University of Melbourne, Australia<br>\nSrini Ramaswamy, ABB, USA<br>\nDaniel Ratiu, Siemens AG, Germany<br>\nGuillermo Rodriguez-Navas, Maelardalen University, Sweden<br>\nBernhard Rumpe, RWTH Aachen, Germany<br>\nBernhard Schätz, fortiss GmbH, Germany<br>\nHeinz Schmidt, RMIT University, Australia – chair<br>\nGuillermo Rodriguez-Navas, Maelardalen University, Sweden<br>\nRuimin Shen, Shanghai Jiao Tong University, China<br>\nMaria Spichkova, RMIT University, Australia – chair<br>\nJudith Stafford, University of Colorado, USA</p>\n<p><em>Workshop Organizers:</em><br>\nMaria Spichkova, AICAUSE, RMIT University, Australia (contact organizer)<br>\nHeinz Schmidt, AICAUSE, RMIT University, Australia</p>\n<hr>\n<p>Dr. Maria Spichkova<br>\nResearch Fellow, RMIT University<br>\nSchool of Computer Science and Information Technology<br>\nAustralia-India Research Centre for Automation Software Engineering</p>\n<p>Building 96, Level 01<br>\n17-23 Lygon Street CARLTON VIC 3053<br>\nPh:  03 9925 0452<br>\nFax: 03 9925 0399<br>\nEmail: <a href=\"mailto:maria.spichkova@rmit.edu.au\">maria.spichkova@rmit.edu.au</a></p>",
        "id": 294636075,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661160190
    }
]