[
    {
        "content": "<p>From: Eva Navarro Lopez &lt;<a href=\"mailto:eva.navarro@cs.man.ac.uk\">eva.navarro@cs.man.ac.uk</a>&gt;<br>\nSubject: Research Associate. DYVERSE: A New Kind of Control for Hybrid Systems</p>\n<p>School of Computer Science, University of Manchester, UK.<br>\nStart date: March/April 2011.<br>\nContract: Fixed Term Contract (12 months) <br>\nSalary: £29,853 p.a. <br>\nClosing date for applications: 31st October 2010.</p>\n<p>We are seeking a Post-Doctoral Research Associate to join our enthusiastic, energetic and dynamic team. The post is available from March/April 2011 for a period of 12 months and is associated with the multi-disciplinary EPSRC-funded project 'DYVERSE: A New Kind of Control for Hybrid Systems' led by Eva Navarro-López from the School of Computer Science at Manchester (UK). The project is in collaboration with the University of Cambridge and Universidad Politécnica de Madrid. There will be collaborations with other UK and overseas institutions. </p>\n<p>DYVERSE is a novel computational-dynamical framework for the modelling, analysis and control of hybrid dynamical systems. DYVERSE stands for the DYnamical-driven VERification of Systems with Energy considerations. Its goal is to ensure good performance and quality in the design of complex engineering systems, which are safety critical, continually changing and may exhibit harmful dynamics that degrade performance. In particular, this project is focused on discontinuous and switched control systems under the hybrid systems framework. DYVERSE new theoretical results will be experimentally validated in an already-built mechanical prototype with impacts and friction. The research is highly multi-disciplinary, mixing theory and practice and crossing different application domains. DYVERSE is to be combined with the work in automated formal verification headed by Prof. Lawrence Paulson from the University of Cambridge in the project 'Automatic Proof Procedures for Polynomials and Special Functions' (<a href=\"http://www.cl.cam.ac.uk/~lp15/Grants/AutoPolyFun/\">http://www.cl.cam.ac.uk/~lp15/Grants/AutoPolyFun/</a>). </p>\n<p>We are seeking candidates who have or are about to obtain a PhD in computer science or automatic control, with excellent knowledge of formal verification techniques, logics, and automated reasoning, as well as programming. Experience in automata, formal languages, and physical/dynamical systems is desirable. Applicants with multi-disciplinary backgrounds are especially welcome. </p>\n<p>Applications should be sent to the Human Resources Section at the University of Manchester, as explained in 'Further particulars' at:</p>\n<p><a href=\"http://www.staffnet.manchester.ac.uk/employment/jobs/research/vacancy/index.htm?ref=177520\">http://www.staffnet.manchester.ac.uk/employment/jobs/research/vacancy/index.htm?ref=177520</a></p>\n<p>Applications should include:</p>\n<ul>\n<li>Curriculum Vitae,</li>\n<li>a brief letter explaining what you can contribute to the project.</li>\n<li>a completed application form </li>\n</ul>\n<p>Start date: March/April 2011.<br>\nClosing date for applications: 31st October 2010.</p>\n<p>For additional information, please visit our project website:</p>\n<p><a href=\"http://www.cs.man.ac.uk/~navarroe/research/dyverse/\">http://www.cs.man.ac.uk/~navarroe/research/dyverse/</a></p>\n<p>Please, forward this email to anyone who you think might be interested.</p>\n<p>Kind regards,<br>\nEva Navarro.</p>\n<hr>\n<p>Eva M. Navarro-López<br>\nLecturer/RCUK Academic Fellow<br>\n<a href=\"http://www.cs.man.ac.uk/~navarroe/\">http://www.cs.man.ac.uk/~navarroe/</a></p>\n<p>University of Manchester<br>\nSchool of Computer Science<br>\nRoom 2.103, Kilburn Building<br>\nOxford Road<br>\nManchester, M13 9PL, United Kingdom<br>\nPhone: +44 (0)161 275 6209<br>\nFax:   +44 (0)161 275 6204<br>\nE-mail: <a href=\"mailto:eva.navarro@cs.man.ac.uk\">eva.navarro@cs.man.ac.uk</a></p>",
        "id": 294118824,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660839147
    }
]