[
    {
        "content": "<p>From: Yakoub Nemouchi &lt;<a href=\"mailto:y.nemouchi@gmail.com\">y.nemouchi@gmail.com</a>&gt;<br>\nDear list,</p>\n<p>I would like to have a nice setup for the syntax of our framework without<br>\ndestroying Isabelle features such as the ability of clicking on the syntax<br>\nto jump to the definition and the ability of hovering over the syntax to<br>\nsee the types. Namely syntax translation package is not what I really want.</p>\n<p>For example, in our framework we have an algebraic structure with some<br>\nalgebraic operators such as:</p>\n<p>\"X ;; Y\" the operator is \";;\"<br>\nNow if I have the following definition:</p>\n<p>FG X f =  \"f(X)\" (It is just a naive optimisation of the definition)</p>\n<p>I would like to have the following syntax for FG:</p>\n<p>\"X:[f]\"</p>\n<p>Also I would like to be able to write:</p>\n<p>\"X;;Y:[f]\"</p>\n<p>How could I do that in a way where I still be able to click and hover on<br>\n\";;\" and on \"..:[..]\". Namely, how could I do that without loosing syntax<br>\nhighlight offered by Isabelle.</p>\n<p>Best wishes,</p>\n<p>Yakoub.</p>",
        "id": 294761632,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661199873
    },
    {
        "content": "<p>From: Andreas Lochbihler &lt;<a href=\"mailto:mail@andreas-lochbihler.de\">mail@andreas-lochbihler.de</a>&gt;<br>\nDear Yakoub,</p>\n<p>Plain mixfix notation preserves the Ctrl-click behaviour. Your examples can for example be <br>\nencoded as follows:</p>\n<p>consts operator :: \"'a ⇒ 'a ⇒ 'a\" (infix \";;\" 100)</p>\n<p>consts FG :: \"'a ⇒ 'b ⇒ 'c\" (\"_:[_]\" [99,0] 99)</p>\n<p>term \"X ;; Y\"</p>\n<p>term \"X ;; Y :[f]\"</p>\n<p>You can put such mixifx syntax after the types of most definitional commands, not just <br>\n\"consts\". By changing the precedence numbers, you can control how strong the operators <br>\nbind. See the Isabelle/Isar reference manual for the details of \"mixifx syntax\".</p>\n<p>Best,<br>\nAndreas</p>",
        "id": 294761667,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661199891
    },
    {
        "content": "<p>From: Yakoub Nemouchi &lt;<a href=\"mailto:y.nemouchi@gmail.com\">y.nemouchi@gmail.com</a>&gt;<br>\nHi Andreas,</p>\n<p>Sorry for the delay, your email went to spam for some reason. I just read<br>\nit.<br>\nThank you for the tip. It looks like Mixfix is what I want.</p>\n<p>Do you think that there is a way to make other syntax translation work with<br>\nclicking.<br>\nFor example any chance to make something like the following clickable:</p>\n<p>f(x:=v1, y:=v2)<br>\nl[x:=v1, y:=v2]<br>\n{2,1,3,5}<br>\n[a,b ,c ,d]</p>\n<p>Best wishes,</p>\n<p>Yakoub.</p>",
        "id": 294761906,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661200014
    },
    {
        "content": "<p>From: Dominique Unruh &lt;<a href=\"mailto:unruh@ut.ee\">unruh@ut.ee</a>&gt;<br>\nHi,</p>\n<p>it seems that only syntax set up with the notation command (or its <br>\nderivatives such as the notation declaration in \"definition\" etc.) <br>\nbecomes clickable/annotated, but not syntax set up with \"syntax\".</p>\n<p>The best trick that I found to make things like ⟦x,y⟧ clickable is to <br>\ndefine dummy constants with appropriate notation, and then use those in <br>\nsyntax declarations (translations can be defined on these dummy <br>\nconstants, not just on syntactic constants). Then you can hover/click on <br>\nthe ⟦ part of the formula, and it leads you to the definition of the <br>\ndummy constant (and if you place that constant next to the actual <br>\nrelevant definition, it's almost as good as linking to the relevant <br>\ndefinition itself.)</p>\n<p>The attached theory file illustrates this.</p>\n<p>Unfortunately, this is a bit of a hack. I would be interested to know <br>\nwhether it is possible to do the same while using syntactic constants <br>\n(defined with the \"syntax\" command). It would be great if one could <br>\n\"link\" syntactic constants to an existing constant for the purposes of <br>\nhighlighting, for example.</p>\n<p>Best wishes,<br>\nDominique.<br>\n<a href=\"/user_uploads/14278/GDisc7E3cPhTUXoNJlK47fog/Scratch.thy\">Scratch.thy</a></p>",
        "id": 294761918,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661200021
    }
]