[
    {
        "content": "<p>From: Lutz Schroeder &lt;<a href=\"mailto:Lutz.Schroeder@dfki.de\">Lutz.Schroeder@dfki.de</a>&gt;<br>\n[Thanks for distributing the job advertisement below.]</p>\n<p>The German Research Center for Artificial Intelligence (DFKI GmbH) is<br>\nseeking a</p>\n<p>Postdoctoral Researcher</p>\n<p>for its Safe and Secure Cognitive Systems Lab in Bremen working in the<br>\narea of security policies within the DFG-project GenMod2, which will<br>\nstart in February 2010.</p>\n<p>The project GenMod2 (\"Generic Algorithms in Modal and Hybrid Logics\") is<br>\nconcerned with the further development of a coalgebraic generic<br>\nframework for automatic deduction in various extensions of modal logic,<br>\nincluding probabilistic, strategy-oriented, and non-monotonic logics.<br>\nApplications of such logics are found on the one hand in various areas<br>\nof knowledge representation, that is, in extensions of description<br>\nlogic, and on the other hand in the specification and verification of<br>\nreactive systems. One of the goals of the project is to increase the<br>\nscope and efficiency of the generic modal reasoner CoLoSS.</p>\n<p>We expect applicants to have experience in at least one of the following<br>\ntopics:</p>\n<p>Modal logic / description logic<br>\nAutomatic reasoning<br>\nCoalgebra</p>\n<p>In the field of innovative software technologies, the German Research<br>\nCenter for Artificial Intelligence (DFKI) is the leading research<br>\ninstitution in Germany, and in the international science community the<br>\nDFKI ranks among the most important “Centers of Excellence” worldwide.<br>\nThe position is at the postdoctoral level; however, candidates without a<br>\nPhD can be considered in case of exceptional qualification. In this<br>\ncase, the position offers the opportunity to work towards a PhD from the<br>\nUniversity of Bremen. The initial employment contract will run for two<br>\nyears. More information about the lab is available at<br>\n<a href=\"http://www.dfki.de/web/research/sks\">http://www.dfki.de/web/research/sks</a></p>\n<p>The DFKI is an equal opportunities employer. Women are especially<br>\nencouraged to apply.  Handicapped applicants with equal qualification<br>\nwill be given preferential treatment.</p>\n<p>Applications should be sent to PD Dr. Lutz Schröder, DFKI,<br>\nEnrique-Schmidt-Str. 5, 28359 Bremen, or via e-mail to<br>\n<a href=\"mailto:Lutz.Schroeder@dfki.de\">Lutz.Schroeder@dfki.de</a>.</p>",
        "id": 294124463,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660840861
    }
]