[
    {
        "content": "<p>From: Ken Kubota &lt;<a href=\"mailto:mail@kenkubota.de\">mail@kenkubota.de</a>&gt;<br>\nDear Members of the Research Community,</p>\n<p>Referring to publications by Alonzo Church, Peter B. Andrews and Lawrence C. <br>\nPaulson, please allow me to comment on some remarks by David Cock, Lawrence C. <br>\nPaulson, Markus Wenzel and Andrei Popescu, available at</p>\n<p><a href=\"https://lists.cam.ac.uk/pipermail/cl-isabelle-users/2015-October/msg00019.html\">https://lists.cam.ac.uk/pipermail/cl-isabelle-users/2015-October/msg00019.html</a><br>\n<a href=\"https://lists.cam.ac.uk/pipermail/cl-isabelle-users/2015-October/msg00029.html\">https://lists.cam.ac.uk/pipermail/cl-isabelle-users/2015-October/msg00029.html</a><br>\n<a href=\"https://lists.cam.ac.uk/pipermail/cl-isabelle-users/2015-October/msg00030.html\">https://lists.cam.ac.uk/pipermail/cl-isabelle-users/2015-October/msg00030.html</a><br>\n<a href=\"https://lists.cam.ac.uk/pipermail/cl-isabelle-users/2015-September/msg00176.html\">https://lists.cam.ac.uk/pipermail/cl-isabelle-users/2015-September/msg00176.html</a><br>\n<a href=\"https://lists.cam.ac.uk/pipermail/cl-isabelle-users/2015-September/msg00187.html\">https://lists.cam.ac.uk/pipermail/cl-isabelle-users/2015-September/msg00187.html</a></p>\n<p>The phenomenon of schematic variables in Isabelle, as addressed by David Cock, <br>\nseems to coincide with the concept of syntactical variables in the works of <br>\nAlonzo Church and Peter B. Andrews. The basic idea is that the same kind of <br>\nproof can be carried out with certain or all possible substitutions for the <br>\nschematic or syntactical variable, and due to its nature it must be a free <br>\n\"variable\".</p>\n<p>However, there also seems to be a difference in the way this idea is <br>\nformalized, leading to different results.</p>\n<p>In the works of Alonzo Church and Peter B. Andrews, syntactical variables <br>\nalways indicate a metatheorem of the meta-language: \"In making metamathematical <br>\n(syntactical) statements, we shall use bold capital letters as variables for <br>\nwell-formed formulas, and bold small letters as variables for variables [...].\" <br>\n[Church, 1940, p. 57] \"We shall prove theorems in both the object language and <br>\nthe meta-language. Indeed, in the meta-language we shall prove theorems about <br>\nthe theorems of the object language. For emphasis, we may call a theorem of the <br>\nmeta-language a metatheorem.\" [Andrews, 2002, p. 11] \"We shall now prove <br>\ncertain theorem schemata [...] of Q0.\" [Andrews, 2002, p. 215]</p>\n<p>So the object language and the meta-language are always clearly separated, as <br>\nthe meta-language is \"meta\", in other words \"above\" the object language, and <br>\ntherefore, strictly speaking, outside of the mathematical language.</p>\n<p>This is reflected by the fact that Andrews consequently distinguishes <br>\nmetatheorems from theorems of the object language by the use of bold letters <br>\nfor syntactical variables. (And, if I am not mistaken, only metatheorems employ <br>\ninformal words like \"if\" and \"then\" instead of logical symbols only [cf. <br>\nAndrews, 2002, p. 224 (5224 = Modus Ponens)]; only metatheorems use the set of <br>\nhypotheses [cf. ibid.]; and only metatheorems have restrictions, i.e., <br>\n\"provided that A is free for x in B\" [Andrews, 2002, p. 224 (5226)].)</p>\n<p>With his high accuracy, Andrews sets forth the path of Church's approach which <br>\nis known for its \"precise formulation of the syntax\" [Paulson, 1989, p. 5].</p>\n<p>It seems to me at the first glance that in Paulson's system Isabelle, in which <br>\na new kind of variable (schematic variables) is introduced, the separation of <br>\nthe object language and the meta-language is not as strict as in the works of <br>\nAlonzo Church and Peter B. Andrews. There are three reasons for this impression.</p>\n<p>First, it seems that metatheorems can be inferred directly in Isabelle and <br>\nlater instantiated for a concrete case by substitution, as indicated in the <br>\ne-mail by David Cock. But inference should not work with metatheorems, since <br>\nwith purely mathematical means (namely, those of the object language) this is <br>\nnot possible. For example, in my (still unpublished) system R0 described at</p>\n<p><a href=\"https://lists.cam.ac.uk/pipermail/cl-isabelle-users/2015-July/msg00170.html\">https://lists.cam.ac.uk/pipermail/cl-isabelle-users/2015-July/msg00170.html</a></p>\n<p>metatheorems are represented by files containing the proof templates, but for <br>\neach individual case the proof has to be carried out again (technically <br>\nimplemented through file inclusion). Of course, there are theorems about <br>\ngeneral properties that can be instantiated for concrete cases. For example, I <br>\nproved some property on groups in general and then transferred it to a concrete <br>\ngroup. But this does not work with metatheorems (without artificially enhancing <br>\nand, hence, violating the object language), because the mathematical language <br>\n(the object language) simply does not provide the means for proving <br>\nmetatheorems or transferring (instantiating) them to theorems of the object <br>\nlanguage.</p>\n<p>Second, the introduction of schematic variables only (without the introduction <br>\nof names for the symbols of the object language in the meta-language) in <br>\nIsabelle supposedly takes place in the same logical sphere (computational <br>\nnamespace) as the object language. In contrast, Church and Andrews emphasize <br>\nthat the names for the symbols of the object language in the meta-language are <br>\nonly the same for practical reasons, but logically belong to a different <br>\nsphere: \"Moreover we shall adopt the customary, self-explanatory, usage, <br>\naccording to which symbols belonging to the formal language serve in the syntax <br>\nlanguage (English) as names for themselves, and juxtaposition serves to denote <br>\njuxtaposition.\" [Church, 1940, pp. 57 f.] \"We shall use formulas of the object <br>\nlanguage as names for themselves in the meta-language.\" [Andrews, 2002, p. 11] <br>\nThus, carrying out a proof in the object language is something entirely <br>\ndifferent than expressing in the meta-language (i.e., by means of <br>\narithmetization of the object language) the fact that this proof can be carried <br>\nout. Hence, through metatheorems, additional knowledge is obtained, but <br>\nmetatheorems cannot replace the theorems of the object language nor otherwise <br>\ncan meta-language substitute the mathematical language (the object language) <br>\nitself.</p>\n<p>Third, the strict distinction of the object language and the meta-language does <br>\nnot seem to be a criterion for the development of Isabelle, as the term <br>\n\"meta-logic\" in the context of Isabelle is used for the _technical_ <br>\nmeta-language only, in which specific logics can be specified and implemented, <br>\nbut not in the sense of the _mathematical_ meta-language: \"A calculus of logics <br>\nis often called a logical framework; I prefer to speak of a meta-logic and its <br>\nobject-logics. Isabelle-86 required a precise meta-logic suited to its aims and <br>\nmethods. A fragment of higher-order logic (called M here for 'meta') now serves <br>\nthis purpose.\" [Paulson, 1988, p. 3]</p>\n<p>The lack of a strict distinction between object language and meta-language <br>\nseems inherent to natural deduction (and not only to Isabelle). Alonzo Church <br>\nand Peter B. Andrews use an axiomatic (Hilbert-style) deductive system, whereas <br>\nLawrence C. Paulson's Isabelle is clearly a natural deduction system, since it <br>\nallows the use of multiple deduction symbols (turnstiles) per line of a proof <br>\nor per theorem. In Andrews' Hilbert-style system Q0, each line or each theorem <br>\nhas exactly one occurrence of the deduction symbol.</p>\n<p>In both his 1988 and 1989 articles Lawrence C. Paulson explicitly refers to <br>\nPeter B. Andrews' logic Q0: \"Andrews [1] has written a book covering <br>\nhigher-order logic. Here is a brief sketch of a fragment called M, which will <br>\nbe our meta-logic.\" [Paulson, 1988, p. 4] \"Andrews [1] presents a formulation <br>\nbased on equality.\" [Paulson, 1989, p. 14]</p>\n<p>Nevertheless, in these articles no principle reasons are given for why Isabelle <br>\nwas implemented as a natural deduction system, but only a practical one: <br>\n\"Church's axiom system is now antiquated, largely dating back to Principia <br>\nMathematica. There are improved formulations but most use the Hilbert style. <br>\nNatural deduction is far superior for automated proof.\" [Paulson, 1989, p. 3]</p>\n<p>From the point of view of axiomatic (Hilbert-style) deductive systems, the <br>\ntheorems of the proofs of (historical) natural deduction were primarily <br>\nmetatheorems. For example, the classical rules and inferences given at</p>\n<p><a href=\"http://plato.stanford.edu/archives/win2014/entries/proof-theory-development/#NatDedSeqCal\">http://plato.stanford.edu/archives/win2014/entries/proof-theory-development/#NatDedSeqCal</a><br>\n<a href=\"http://plato.stanford.edu/archives/win2014/entries/reasoning-automated/#NatDed\">http://plato.stanford.edu/archives/win2014/entries/reasoning-automated/#NatDed</a></p>\n<p>are all metatheorems.</p>\n<p>But if principle questions about the expressiveness of the mathematical <br>\nlanguage are concerned, they have to prevail over practical (technical) <br>\nquestions.</p>\n<p>Maintaining the distinction between object language and meta-language, Goedel's <br>\nFirst Incompleteness Theorem (and hence, the Second) does not work in Peter B. <br>\nAndrews' logic Q0. Dealing with Goedel's First Incompleteness Theorem <br>\nseriously, one cannot simply ignore the fact that this proof fails in one of <br>\nthe most important mathematical systems currently available to the public. As <br>\nmentioned earlier at</p>\n<p><a href=\"https://lists.cam.ac.uk/pipermail/cl-isabelle-users/2015-July/msg00170.html\">https://lists.cam.ac.uk/pipermail/cl-isabelle-users/2015-July/msg00170.html</a></p>\n<p>step 7101.4 has no syntactic justification [cf. Andrews, 2002, p. 314 (7101)], <br>\nsince \"there is no rule of inference from a theorem to the existence of its <br>\nproof in the object language.\" [Kubota, 2013, p. 9] Neither the basic rules of <br>\ninference of Q0, R and R' [cf. Andrews, 2002, pp. 213 f.], nor any derived <br>\nrules can be used to infer 7101.4.</p>\n<p>In Paulson's proof, for this step (for which in Andrews' proof only some <br>\nimplicit rule is used) the theorem 'proved_iff_proved_PfP' - called (P) in my <br>\narticle - is required, which is the result of a long proof [cf. Kubota, 2015, <br>\npp. 8 f., 19]. I do not see any way of proving such a theorem in a <br>\nHilbert-style system.</p>\n<p>Independently, James R. Meyer has raised the same concern: \"[T]he result, as <br>\nfor Świerczkowski's proof, is an illogical confusion of meta-language and the <br>\nlanguage of HF. [...] Paulson does not include any computer code that proves <br>\nthat this cannot result in an illogical confusion of meta-language and <br>\nobject[ ]language.\" [Meyer, 2015, p. 11]</p>\n<p>If Professor Paulson decides to respond to this critique (possibly including <br>\nthose in section 3.8), I would be interested in the answer, too, as my <br>\ncommunication with him was dominated by misunderstandings obviously caused by <br>\ndifferent interpretations of the term \"meta-language\", as outlined above, such <br>\nthat the main question remained unan<br>\n[message truncated]</p>",
        "id": 294660268,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661169644
    },
    {
        "content": "<p>From: Gottfried Barrow &lt;<a href=\"mailto:igbi@gmx.com\">igbi@gmx.com</a>&gt;<br>\nGreetings,</p>\n<p>Adhering to good military protocol, I state that I don't fraternize with <br>\nthe troops, of whom I command none, so I fraternize with no one, and <br>\nprefer monologue to dialog.</p>\n<p>On 12/7/2015 10:35 AM, Ken Kubota wrote:</p>\n<blockquote>\n<p>Dear Members of the Research Community,</p>\n</blockquote>\n<p>I am a community-of-one, a mere observer who can type.</p>\n<blockquote>\n<p>If Professor Paulson decides to respond to this critique (possibly including<br>\nthose in section 3.8), I would be interested in the answer, too, as my<br>\ncommunication with him was dominated by misunderstandings obviously caused by<br>\ndifferent interpretations of the term \"meta-language\", as outlined above, such<br>\nthat the main question remained unanswered: \"3. Is the object language strictly<br>\nseparated from the meta-language [...], and how is this done?\" [Kubota, first<br>\ne-mail to Lawrence C. Paulson, May 22, 2015.] I had already previously written<br>\nIt seems to me at the first glance that in Paulson's system Isabelle, in which<br>\na new kind of variable (schematic variables) is introduced, the separation of<br>\nthe object language and the meta-language is not as strict as in the works of<br>\nAlonzo Church and Peter B. Andrews. There are three reasons for this impression.</p>\n</blockquote>\n<p>Central to your email is your emphasis on the traditional phrases of <br>\nlogic, \"object language\" and \"meta-language\". The problem I see with <br>\nthat is that though you use the phrases to try and frame the discussion <br>\nabout Isabelle, the phrases aren't used in the distribution <br>\ndocumentation, which is a major representation of how the primaries want <br>\nto frame the discussion.</p>\n<p>Definitions and axioms are everything. You shouldn't be arguing <br>\nsubtleties if there's no common agreement on the meaning of central <br>\nwords and phrases.</p>\n<p>In Logic and Computation, by Paulson, published 1987, Paulson was still <br>\nsticking with tradition, and wrote:</p>\n<p>To clear up the confusion we must distinguish the meta language from <br>\nthe object<br>\n   language. The formal language of terms and formulae is the object <br>\nlanguage. We<br>\n   make statements about the object language in the meta language.</p>\n<p>In 1988, only a year later, he switched to \"meta-logic\" and <br>\n\"object-logic\", as shown in the document you quote from, which I show <br>\nagain below.</p>\n<p>I've always been under the impression that Paulson did that to give <br>\nhimself new or relatively unused terminology, to define specifically <br>\nwhat he was doing, to separate his stuff from the crowd's stuff. In <br>\nfact, if you search on \"meta-logic\" and \"object-logic\", the two compound <br>\nwords don't show up much, unlike \"object language\" and \"metalanguage\".</p>\n<p>I'm actually a bit confused. I'm inclined to believe that Larry Paulson <br>\nis who introduced their use into the language of logic, or at least, <br>\nhe's who made their use \"popular\". I could ask him about the history of <br>\nthe words, but he's a member of the set of everyone, and not to be <br>\nfraternized with.</p>\n<p>Back to the documentation. If the authors, in the documentation, don't <br>\nuse the words \"object language\" and \"meta-language\", and they do use <br>\n\"meta-logic\" and \"object-logic\", doesn't that tell us there's a <br>\ndistinction they're trying to make?</p>\n<p>That your points may be valid for some kind of general critique, that <br>\nmay be true, but you can't attack a claim that a person hasn't made. You <br>\nwant to talk about \"object language\" and \"meta-language\", when I only <br>\nhear them talking about \"meta-logic\" and \"object-logic\".</p>\n<p>I think they are at fault at something. It's that they describe <br>\nIsabelle/HOL in terms of older logics, when, in my opinion, though it <br>\ndraws from far and wide, it is its own standard; it defines itself, in a <br>\nvery concrete way. There is something very specific to talk about.</p>\n<p>Because they describe it in terms of other logics, to give people an <br>\nidea of what it is, people then expect it to be what they want it to be, <br>\nwhich usually is what the people are familiar with.</p>\n<p>I did a search for \"language\", in PDF and DJVU verions of this book, <br>\n\"Isabelle - A Generic Theorem Prover\":</p>\n<p><a href=\"https://www.springer.com/us/book/9783540582441\">https://www.springer.com/us/book/9783540582441</a><br>\n<a href=\"https://isabelle.in.tum.de/download_past.html\">https://isabelle.in.tum.de/download_past.html</a><br>\n<a href=\"http://www.cl.cam.ac.uk/users/lcp/archive/Isabelle2002.tar.gz\">http://www.cl.cam.ac.uk/users/lcp/archive/Isabelle2002.tar.gz</a><br>\n<a href=\"http://isabelle.in.tum.de/website-Isabelle2008/index.html\">http://isabelle.in.tum.de/website-Isabelle2008/index.html</a></p>\n<p>That book is a big part of what's in the current documentation. It was <br>\nbasically intact, though split up, until at least 2008, in the docs <br>\nref.pdf, intro.pdf, logics.pdf, and logic-ZF.pdf.</p>\n<p>I didn't see one use of \"object language\" and \"meta-language\" in those <br>\ndocuments. I could have missed something.</p>\n<blockquote>\n<p>Third, the strict distinction of the object language and the meta-language does<br>\nnot seem to be a criterion for the development of Isabelle, as the term<br>\n\"meta-logic\" in the context of Isabelle is used for the _technical_<br>\nmeta-language only, in which specific logics can be specified and implemented,<br>\nbut not in the sense of the _mathematical_ meta-language: \"A calculus of logics<br>\nis often called a logical framework; I prefer to speak of a meta-logic and its<br>\nobject-logics. Isabelle-86 required a precise meta-logic suited to its aims and<br>\nmethods. A fragment of higher-order logic (called M here for 'meta') now serves<br>\nthis purpose.\" [Paulson, 1988, p. 3]</p>\n<p>The lack of a strict distinction between object language and meta-language<br>\nseems inherent to natural deduction (and not only to Isabelle). Alonzo Church</p>\n</blockquote>\n<p>You say, \"Third, the strict distinction of the object language and the meta-language does not seem to be a criterion for the development of Isabelle...\"</p>\n<p>Maybe so, or maybe not, or maybe it's a lot easier to just talk about\"meta-logic\" and \"object-logic\", since they're precisely defined by Isabelle/Pure, along with the primary object-logic, Isabelle/HOL.</p>\n<p>The beauty of proof assistants is that, unlike a logic like traditional <br>\nZFC, at build time, the heap for Isabelle/HOL is precisely and exactly <br>\ndefined. When I'm told that Isabelle/Pure is the meta-logic, I know <br>\nexactly what \"meta-logic\" is. In fact, my understanding of \"meta-logic\" <br>\nhas no bearing on what the meta-logic of Isabelle/Pure is. Per binary <br>\nfile, called the heap, it's locked in, assuming no randomness in the <br>\nphysics of it all.</p>\n<p>Compare that to abstract thoughts of the mind, where the outcome is <br>\ndependent on understanding.</p>\n<blockquote>\n<p>Maintaining the distinction between object language and meta-language, Goedel's<br>\nFirst Incompleteness Theorem (and hence, the Second) does not work in Peter B.<br>\nAndrews' logic Q0. Dealing with Goedel's First Incompleteness Theorem<br>\nseriously, one cannot simply ignore the fact that this proof fails in one of<br>\nthe most important mathematical systems currently available to the public. As<br>\nmentioned earlier at</p>\n<p><a href=\"https://lists.cam.ac.uk/pipermail/cl-isabelle-users/2015-July/msg00170.html\">https://lists.cam.ac.uk/pipermail/cl-isabelle-users/2015-July/msg00170.html</a></p>\n</blockquote>\n<p>I'm not out to critique anything that I don't understand. I'll interpret <br>\nthis sentence broadly: \"one cannot simply ignore the fact that this <br>\nproof fails in one of the most important mathematical systems currently <br>\navailable to the public\".</p>\n<p>I think, actually, most everything gets ignored, in the grand scheme of <br>\nthings. Larry Paulson put a lot of work into the ZF logic, but then it's <br>\nnot used. Google introduced Dart to try and replace Javascript, but it <br>\nhasn't. They tried to displace Facebook with something-or-another. They <br>\ndidn't. They're big, but not so big as to not get ignored in many of <br>\ntheir new ventures.</p>\n<p>What people care about with Isabelle is this: Isabelle/HOL. It's the <br>\nresult of a collective effort by many people, a product of 30 years or <br>\nso, with millions of dollars having been poured into it. Tobias Nipkow, <br>\nthe wizard of mysterious low-level, under appreciated, under-the-hood <br>\nmagic, teamed up with Larry Paulson and switched the emphasis to <br>\nIsabelle/HOL, which is based on the work of Mike Gordon. The large group <br>\nat TUM gave it the huge boost it needed to get to the point it is now.</p>\n<p>Nobody cares about a raw logic. Nobody cares about raw much-of-anything. <br>\nIf we work real hard, and give people a polished, or semi-polished <br>\nproduct, then they might care about something we have to give away, or <br>\nthey may not.</p>\n<blockquote>\n<p>A technical meta-logic as in the case of Isabelle or technical meta-languages<br>\nlike ML have the advantage of offering the easy implementation and comparison<br>\nof several logics. But this advantage is relevant for the experimental stage<br>\nonly. As for the final implementation of the particular preferred logic, I<br>\nwould advise against using some kind of meta-logic or meta-language, as<br>\nadditional features may weaken the rigor of (or even create an inconsistency<br>\nin) the logical kernel, but would suggest restricting oneself to the _direct_<br>\nencoding of the logic in order to preserve logical rigor or necessity. This<br>\nimplies the use of a purely imperative computer programming language without an<br>\nimplicit type system for the mathematical objects to be represented (i.e., C++).</p>\n</blockquote>\n<p>You're looking at things wrong. If the rigor of the logic of <br>\nIsabelle/HOL is weakened, and it's possibly inconsistent, then what is <br>\nthat? It's an opportunity for someone like you to get some bragging rights.</p>\n<p>What did we see recently? A major accumulation of bragging rights by 3 <br>\npeople, though I'm not completely clear on how the bragging rights <br>\ndeserve to be divvied out. There's the Czech. Will he just get a Ph.D? <br>\nNo. He also gets the summa cum laude of bragging rights, for showing a <br>\nlogic is inconsistent.</p>\n<p>Scary stuff, inconsistent logics. \"Falso, you stay from me! You scary <br>\nscary dude! You scare me, worse than a talking Barbie doll!!\"</p>\n<p>Really, what would be of more value? A generalized logic that stands the <br>\ntest of time, such as Isabelle/Pure and Isabelle/HOL, or a very narrow <br>\nlogic, such as what you advise?</p>\n<p>How are people supposed to test the generalized logic, over many years, <br>\nif the safer route is taken. And an inconsistent logic is not a crisis <br>\nanyway. An inconsistent logic that can't be fixed with \"don't do that\" <br>\nis <br>\n[message truncated]</p>",
        "id": 294660357,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661169679
    }
]