[
    {
        "content": "<p>From: Dale Miller &lt;<a href=\"mailto:dale@lix.polytechnique.fr\">dale@lix.polytechnique.fr</a>&gt;<br>\nOne or two postdoctoral positions are available within the Parsifal team, a<br>\njoint research team between INRIA Saclay and the Laboratoire d’Informatique<br>\n(LIX) on the campus of Ecole Polytechnique.</p>\n<p>Successful candidates will help with designing, implementing, and<br>\nexperimentally validating the design of proof certificates for a range of<br>\ntheorem provers in intuitionistic and classical logic and arithmetic.<br>\n These positions are for one year, with a second year extension possible.<br>\n Candidates should start in Fall 2013.</p>\n<p>These positions are funded by ProofCert, an ERC Advanced Grant with the<br>\ngoal of designing a format for proof certificates that can capture the<br>\nproof evidence within all major theorem provers while also being checkable<br>\nby a simple, declarative proof checker.  This format must allow treating<br>\nsome inference steps as (non-deterministic) computation as well as<br>\nsupporting (bounded) proof reconstruction.</p>\n<p>The ideal candidate should have strong backgrounds in</p>\n<ul>\n<li>\n<p>basic proof theory (in particular, the sequent calculus);</p>\n</li>\n<li>\n<p>various automated and interactive theorem proving systems (particularly<br>\nthose involving induction); and</p>\n</li>\n<li>\n<p>programming in logic programming (Prolog or lambda Prolog) as well as<br>\nother high-level programming languages (such as ML or Haskell).</p>\n</li>\n</ul>\n<p><em>Venue</em></p>\n<p>Employed postdocs will be members of the INRIA Parsifal team which is<br>\nlocated in the Laboratoire d’Informatique (LIX) on the campus of Ecole<br>\nPolytechnique.  This campus is situated to the south of Paris and is an<br>\neasy commute from Paris on the RER B regional train line.  French<br>\nproficiency is not a requirement.</p>\n<p><em>Application</em></p>\n<p>Candidates must have a Ph.D.; if the Ph.D. thesis is not yet defended when<br>\nthe application is made, the candidate should provide the planned defense<br>\ndate and the composition of the thesis committee.</p>\n<p>To apply, contact Dale Miller (<a href=\"mailto:dale.miller@inria.fr\">dale.miller@inria.fr</a>) and include a cover<br>\nletter and (links to) your CV and publication list.  Additional material,<br>\nsuch as letters of recommendation, will be requested if necessary.  Early<br>\nexpression of interest is encouraged.  We plan to make a decision on this<br>\nposition in mid-April 2013.</p>\n<p><em>More Information</em></p>\n<p>Further information regarding ProofCert and the Parsifal team can be found<br>\nat the following urls.</p>\n<ul>\n<li>The ERC Advanced Grant ProofCert: <a href=\"http://team.inria.fr/parsifal/proofcert/\">http://team.inria.fr/parsifal/proofcert/</a></li>\n<li>The INRIA Parsifal team: <a href=\"http://team.inria.fr/parsifal/\">http://team.inria.fr/parsifal/</a></li>\n<li>\n<p>Positions offered by Parsifal in 2013:<br>\n<a href=\"http://team.inria.fr/parsifal/positions/\">http://team.inria.fr/parsifal/positions/</a></p>\n</li>\n<li>\n<p>Miller's web page: <a href=\"http://www.lix.polytechnique.fr/Labo/Dale.Miller/\">http://www.lix.polytechnique.fr/Labo/Dale.Miller/</a></p>\n</li>\n</ul>",
        "id": 294238706,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660905985
    }
]