[
    {
        "content": "<p>From: Aleks Nanevski &lt;<a href=\"mailto:aleksn@microsoft.com\">aleksn@microsoft.com</a>&gt;<br>\nFourth Internation Workshop on<br>\n              Intuitionistic Modal Logic and Applications<br>\n                               (IMLA'08)</p>\n<p>(<a href=\"http://www.cs.bham.ac.uk/~vdp/IMLA08.html\">http://www.cs.bham.ac.uk/~vdp/IMLA08.html</a>)</p>\n<p>A LICS'08 affiliated workshop<br>\n                Pittsburgh, Pennsylvania, June 23, 2008</p>\n<p>Constructive modal logics and type theories are of increasing foundational and practical relevance in computer science. Applications are in type disciplines for programming languages, and meta-logics for reasoning about a variety of computational phenomena.</p>\n<p>Theoretical and methodological issues center around the question of how the proof-theoretic strengths of constructive logics can best be combined with the model-theoretic strengths of modal logics. Practical issues center around the question which modal connectives with associated laws or proof rules capture computational phenomena accurately and at the right level of abstraction.</p>\n<p>This workshop will bring together designers, implementers, and users to discuss all aspects of intuitionistic modal logics and type theories.  Topics include, but are not limited to:</p>\n<ul>\n<li>applications of intuitionistic necessity and possibility</li>\n<li>monads and strong monads</li>\n<li>constructive belief logics and type theories</li>\n<li>applications of constructive modal logic and modal type theory to formal verification, foundations of security, abstract interpretation, and program analysis and optimization</li>\n<li>modal types for integration of inductive and co-inductive types, higher-order abstract syntax, strong functional programming</li>\n<li>models of constructive modal logics such as algebraic, categorical, Kripke, topological, and realizability interpretations</li>\n<li>notions of proof for constructive modal logics</li>\n<li>extraction of constraints or programs from modal proofs</li>\n<li>proof search methods for constructive modal logics and their implementations</li>\n</ul>\n<p>The workshop continues a series of previous LICS-affiliated workshops, which were held as part of FLoC'99, Trento, Italy and of FLoC'02,<br>\nCopenhagen, Denmark.</p>\n<p>We solicit submissions on work in progress and on more mature results. Submissions should be extended abstracts of 5-10 pages sent in<br>\nPostScript or PDF format to the program co-chair at <a href=\"mailto:aleksn@microsoft.com\">aleksn@microsoft.com</a>.</p>\n<p>IMPORTANT DATES:</p>\n<p>Submission: April 25, 2008<br>\nNotification: May 23, 2008<br>\nFinal papers due: June 7, 2008<br>\nWorkshop Date: June 23, 2008</p>\n<p>It is planned to publish workshop proceedings as Electronic Notes in Theoretical Computer Science (ENTCS) or in CEURS, to be decided. Authors please use the generic ENTCS macro package at <a href=\"http://www.math.tulane.edu/~entcs\">http://www.math.tulane.edu/~entcs</a>.</p>\n<p>PROGRAM COMMITTEE:</p>\n<p>Gavin Bierman (Microsoft, UK)<br>\nValeria de Paiva (PARC, USA)<br>\nMichael Mendler (Bamberg, DE)<br>\nAleks Nanevski (Microsoft, UK)<br>\nBrigitte Pientka (McGill, CA)<br>\nEike Ritter (Birmingham, UK)</p>\n<p>INVITED SPEAKERS:</p>\n<p>Frank Pfenning (CMU, USA)<br>\nTorben Brauner (Roskilde, RK)</p>\n<p>CONTACTS</p>\n<p>Valeria de Paiva                 Aleks Nanevski<br>\nPARC, Palo Alto Research Center  Microsoft Research<br>\n<a href=\"mailto:paiva@parc.xeroc.com\">paiva@parc.xeroc.com</a>             <a href=\"mailto:aleksn@microsoft.com\">aleksn@microsoft.com</a></p>",
        "id": 294056165,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660821670
    }
]