[
    {
        "content": "<p>From: Josef Urban &lt;<a href=\"mailto:josef.urban@gmail.com\">josef.urban@gmail.com</a>&gt;<br>\nPhD student Computer Science (1,0 fte)<br>\n=================================</p>\n<p>Radboud University Nijmegen, Faculty of Science, Institute for<br>\nComputing and Information Sciences (iCIS), Intelligent Systems</p>\n<p>Maximum Salary: EUR 2,612 gross/month<br>\nVacancy number: 62.58.10<br>\nClosing date: 30 September 2010</p>\n<p>Job description<br>\n============</p>\n<p>You will be working on the NWO project Learning2Reason, which aims to<br>\nimprove computer-assisted reasoning technology using a machine<br>\nlearning approach. To derive new knowledge from corpora of formally<br>\nexpressed knowledge such as mathematical theorems and proofs, one uses<br>\ncomputer-assisted and automated reasoning methods. These symbolic (or<br>\ndeductive) approaches typically suffer from a fast-growing search<br>\nspace. Tailored machine learning approaches can help to control this<br>\nsearch space, e.g., by estimating the usefulness of existing lemmas<br>\nfor proving a new result. Within the project, you will focus on the<br>\nstate-of-the-art in machine learning, especially kernel-based methods<br>\nthat are ideally suited to take into account the structure of formulas<br>\nand proofs (given as graphs or trees). Your task as a PhD student will<br>\nbe to develop and further improve such machine learning techniques and<br>\napply and test these on existing formal libraries.</p>\n<p>Requirements<br>\n===========</p>\n<p>You should meet the following requirements:</p>\n<ul>\n<li>\n<p>A master's degree (or equivalent) in Computer Science, Mathematics<br>\n  or a related field, with a strong interest in machine learning<br>\n  and/or proof assistants;</p>\n</li>\n<li>\n<p>Commitment and a cooperative attitude;</p>\n</li>\n<li>Excellent proficiency in written and spoken English.</li>\n</ul>\n<p>Organization<br>\n==========</p>\n<p>The Radboud University Nijmegen is one of the leading academic<br>\ncommunities in the Netherlands. Renowned for its green campus, modern<br>\nbuildings, and state-of-the-art equipment, it has nine faculties and<br>\nenrolls over 17.500 students in approximately 90 study programs. The<br>\nuniversity is situated in the oldest Dutch city, close to the German<br>\nborder, on the banks of the river Waal (a branch of the Rhine). The<br>\ncity has a rich history and one of the liveliest city centres in the<br>\nNetherlands.  The section Intelligent Systems of the Institute for<br>\nComputing and Information Sciences (iCIS) at the Radboud University<br>\nNijmegen conducts research in both machine learning (subgroup headed<br>\nby Prof.dr. Tom Heskes) and proof assistants (subgroup headed by<br>\nProf.dr. Herman Geuvers). The current project is right at the<br>\ninterplay between these subgroups and combines the strengths of both<br>\nteams. iCIS in general and the section Intelligent Systems received<br>\nexcellent scores at the latest national research assessment.</p>\n<p>Website: <a href=\"http://www.ru.nl/is/\">http://www.ru.nl/is/</a></p>\n<p>Conditions of employment<br>\n=====================</p>\n<p>Employment: 1,0 fte<br>\nMaximum salary per month, based on a fulltime employment: € 2,612 gross/month<br>\nStarting at € 2,042 per month, the salary will increase to € 2,612 per<br>\nmonth in the fourth year.<br>\nPhD scale.</p>\n<p>Additional conditions of employment<br>\n==============================</p>\n<p>You will be appointed as a PhD student for a period of four<br>\nyears. Your performance will be evaluated after 18 months. If the<br>\nevaluation is positive, the contract will be extended by 2.5 years.</p>\n<p>Additional Information<br>\n==================</p>\n<p>Prof.dr. Tom Heskes                 Prof.dr. Herman Geuvers<br>\nTelephone: +31 24 36 52696      Telephone: +31 24 36 52603<br>\nE-mail: <a href=\"mailto:tomh@cs.ru.nl\">tomh@cs.ru.nl</a>           E-mail: <a href=\"mailto:herman@cs.ru.nl\">herman@cs.ru.nl</a></p>\n<p>Application<br>\n=========</p>\n<p>You can apply for the job (mention the vacancy number 62.58.10) before<br>\n30 September 2010 by sending your application -preferably by email-<br>\nto:</p>\n<p>RU Nijmegen, FNWI, P&amp;O, mrs. D. Reinders<br>\nP.O. Box 9010, 6500 GL Nijmegen, NL<br>\nTelephone: +31 24 3652027<br>\nE-mail: <a href=\"mailto:pz@science.ru.nl\">pz@science.ru.nl</a></p>",
        "id": 294112149,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660837183
    }
]