[
    {
        "content": "<p>From: Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt;<br>\nThe check box is still in the Theories panel as before.</p>\n<p>You can also use the Console/Scala plugin to query the information<br>\nunderlying the \"PIDE document node perspective\". E.g. like this:</p>\n<p>(1) jEdit information:</p>\n<p>JEdit_Lib.jedit_text_areas(view.getBuffer).foreach(println)</p>\n<p>(2) PIDE information:</p>\n<p>val view_ranges = GUI_Thread.future { val model =<br>\nDocument_Model.get(view.getBuffer).get;<br>\nmodel.document_view_ranges(model.snapshot()) }</p>\n<p>view_ranges<br>\nres2: isabelle.Future[List[isabelle.Text.Range]] = List([0..530],<br>\n[1363..1771])</p>\n<p>There needs to be some elapsed time between defining view_ranges and<br>\nprinting it once again on the toplevel.</p>\n<p>I have experimented with this and some plain view -- it looks fine so far.</p>\n<p>Also note that there is further complexity if you have \"auxiliary<br>\nfiles\", e.g. 'ML_file' commands in theories being edited.</p>\n<p>Makarius</p>",
        "id": 294733672,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661189003
    },
    {
        "content": "<p>From: \"Eugene W. Stark\" &lt;<a href=\"mailto:isabelle-users@starkeffect.com\">isabelle-users@starkeffect.com</a>&gt;<br>\nI am currently experiencing the following with Isabelle2018-RC0, but it has occurred<br>\nalso with previous versions.  The issue is that sometimes during a work session, JEdit<br>\nwill become quite sluggish in responding to my typein, which becomes tedious and forces<br>\nme to exit and restart.</p>\n<p>A possible explanation just occurred to me.  I sometimes open a new \"Plain View\"<br>\nto examine one part of the code while editing another in the main window.  If the<br>\nportion of the code shown in the new view is a bit beyond the portion being edited,<br>\nthen due to continuous checking changes made in the main window force the re-checking<br>\nof the code up through the portion shown in the new view.  This is to be expected.<br>\nHowever, I am wondering right now if somehow when I \"close\" the extra view and go<br>\nback to working only with the main window, it is somehow the case that the extra view<br>\nis not deleted, but just becomes invisible and its presence is still causing the<br>\nextra checking to be done.  If so, that would explain the sluggish behavior.</p>\n<p>I realized that I might be able to test this by turning off continuous checking to<br>\nsee if that relieved the sluggish behavior, but in Isabelle2018-RC0 the \"continuous'<br>\nchecking\" box is no longer where I remembered it to be and I don't know how to find<br>\nthis option setting quickly now.</p>",
        "id": 294736244,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661189899
    }
]