[
    {
        "content": "<p>From: Joe Hurd &lt;<a href=\"mailto:joe.hurd@comlab.ox.ac.uk\">joe.hurd@comlab.ox.ac.uk</a>&gt;<br>\nTPHOLs 2007</p>\n<p>CALL FOR BIDS</p>\n<p>It is a long-standing custom that the host (in year \"n\") of Theorem<br>\nProving in Higher Order Logics (TPHOLs) helps select the host of<br>\nTPHOLs for year \"n+1\". However, TPHOLs is merging with IJCAR in 2006,<br>\nand so it was decided at the business meeting of TPHOLs 2005 that the<br>\norganizers of TPHOLs 2005 would organize the bidding for TPHOLs 2007.<br>\nThere are two phases: solicitation of bids, and voting.</p>\n<p>This message concerns the first phase. Bids are sought to host TPHOLs<br>\nin 2007. Previous bids may be accessed through past TPHOLs webpages:<br>\nplease refer to the conference history section of this website.</p>\n<p>TPHOLs is not usually held on the same continent two years in a row.<br>\nAt the business meeting of TPHOLs 2005 it was decided that the merging<br>\nof TPHOLs with IJCAR in 2006 would count under this rule, and<br>\ntherefore no bids to host TPHOLs 2007 in North America will be<br>\naccepted. TPHOLs is traditionally held in August or September.</p>\n<p>Bids should be sent to <a href=\"mailto:tphols2005@comlab.ox.ac.uk\">tphols2005@comlab.ox.ac.uk</a> and should include<br>\nat least the following information:</p>\n<p>* name and email address of a contact person;<br>\n    * names of other people involved;<br>\n    * address of website for the bid;<br>\n    * approximate dates the conference will be held;<br>\n    * format of the conference; and<br>\n    * colocation details (if any).</p>\n<p>Deadline for all bids is 31 December 2005. Shortly after that, the<br>\nbids will be made public and the voting phase will take place. The<br>\npeople eligible to vote are those who are seriously thinking of<br>\nattending TPHOLs 2007, and the voting system used will be Single<br>\nTransferable Vote between all received bids.</p>",
        "id": 293896463,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660742858
    }
]