[
    {
        "content": "<p>From: Gottfried Barrow &lt;<a href=\"mailto:igbi@gmx.com\">igbi@gmx.com</a>&gt;<br>\nHello,</p>\n<p>For my use of technology, there's only one product, programming <br>\nlanguage, etc. which/I have to /stay connected to be able to get enough <br>\ninformation, and that's this product, Isabelle/HOL. I make vows to not <br>\npost here, but then, how many Windows users are here? If the next <br>\nWindows version has a big problem, should I not send in an email, to <br>\nstick with my vow? Then I've stuck with an old version, or have to <br>\nsuffer through 9 months to a year of a \"bug\". So, when I end up <br>\ncompromising, things like this end up getting posted.</p>\n<p>I'm not commenting here to get any response. I actually like the absence <br>\nof chatter here. I don't care to see traffic on the type of things I say <br>\nsometimes.</p>\n<p>Some time ago, someone suggested the use of Stackoverflow for Isabelle, <br>\nand now there's a tag for Isabelle. It gets promoted by its link on the <br>\nIsabelle web page, and it gets some support by some members of the Set <br>\nof Big Guns. If there's now a Stackoverflow tag, maybe there should be a <br>\nIsabelle reddit (though maybe not).</p>\n<p>First, I give an example of a Reddit site that appears to balance all <br>\nthe needs and problems that come with a discussion/question/answer forum <br>\nfor a technical/professional/academic/research product centered around <br>\nformal knowledge.</p>\n<p><a href=\"https://www.reddit.com/r/rust/new/\">https://www.reddit.com/r/rust/new/</a></p>\n<p>From here, being a True Analyst of Life and Society, I go through <br>\nproblems and advantages of the different forum formats. At the end, I'll <br>\nsay something like, \"Given the problems and advantages I've pointed out, <br>\nit might be that the best compromise is a reddit, as shown by the Rust <br>\nreddit site.\"</p>\n<p><em>--NEEDS:</em> /for a different format than this mailing list/</p>\n<p>In my opinion, there are three main advantages to the formats of <br>\nStackoverflow and <a href=\"http://reddit.com\">reddit.com</a>:</p>\n<p>(1) One web page that contains an question or remark, along with all <br>\nanswers and discussions, and the complete discussion that follows.</p>\n<p>(2) Decent verbatim formatting.</p>\n<p>(3) The result of (1) and (2), an involved question that no one has <br>\ntime to answer, has a better chance of eventually getting answered.</p>\n<p>I unsubscribe here at times, and then view the mailing list posts on the <br>\nWeb. However, this time, I subscribed back because the Web site doesn't <br>\ndisplay some of the graphical characters correctly.</p>\n<p>Even subscribing, there's not a complete, good solution for submitting <br>\nsource to be viewed by others. A little HTML formatting can go a long <br>\nway towards making things readable.</p>\n<p>I can either insert source in the email body, with no guarantees to what <br>\nothers will see, or I can attach a THY.</p>\n<p>At Stackoverflow, I don't have to attach anything, and it gives me basic <br>\nformatting. If it's a big, long THY, I can put it in, and it'll truncate <br>\nthe view and provide a scroll bar. (I know reddit has code formatting, <br>\nbut I don't know what else).\n*\n--PROBLEM: */Stackoverflow suppresses involved discussion/</p>\n<p>I ultimately don't care whether there's ever an Isabelle reddit, because <br>\nI'm not in charge, but I think the Stackoverflow format suppresses <br>\ndiscussion too much.</p>\n<p>Because mathematics and logic in Isabelle/HOL gets complex, and because <br>\nnovices and experts have to co-exist, lengthy discussion needs to be an <br>\nacceptable, and technology-enabled, part of the Isabelle etiquette.</p>\n<p><em>--PROBLEM:</em> /Stackoverflow empasizes voting too much/</p>\n<p>As to crowd sites that actually provide good information, and voting, I <br>\nhave a very schizophrenic psychology about that, and I'll suppress most <br>\nall of my opinions  on that.</p>\n<p>In the context of Isabelle, voting to establish credibility, and voting <br>\nto establish the value of a question or answer, how is that applicable here?</p>\n<p>I'll guess that 99% of those subscribed to this mailing list have a PhD, <br>\nwhere I have one of the minimum qualifications needed to possibly <br>\nsucceed with Isabelle/HOL, a B.S. in math.</p>\n<p>When Larry Paulson had 1 point on Stackoverflow, as opposed to his <br>\ncurrent giganormous 181 points, what bearing did that and does that have <br>\non anything?</p>\n<p>*--PROBLEM: */democracies and voting aren't the magic wand/</p>\n<p>This is already becoming too long, so I'll turn my opinion here into a <br>\ncomplement.</p>\n<p>One thing I respect about this mailing list is that those in charge rule <br>\nwith a light hand. Compare that to a certain mailing list on <br>\nfoundational mathematics. It it tells me that I have to subscribe, and <br>\nthen the moderator will reply back if accepted. No thanks. I already <br>\nknow I'm unacceptable, and thank you for saving me time from writing <br>\nemails like this one. To be fair, some topics may require a heavy hand, <br>\nfrom experience.</p>\n<p>The quality of a democracy is dependent on the quality of voters, and <br>\npeople voting on what they don't understand is ridiculous.</p>\n<p>Additionally, if the crowd self-regulates, like here, except for me <br>\noccasionally, there's no need for voting. In fact, for a forum to <br>\ndiscuss Isabelle, I say you don't want a democracy.</p>\n<p>I say, here, you want about 3 leaders in charge, along with some core <br>\ngroup of professional who also provide some leadership. You then want <br>\nthat group to monitor the place with a light hand, giving people <br>\nfreedom, until it's obvious that a person has abused the freedom given, <br>\nat which time a heavier hand is applied.</p>\n<p>If that's what's needed here, then it seems to me that's more of what <br>\nyou need other places. It appears to me, just by reading the Rust reddit <br>\nrules in the sidebar, what I described about here is sort of how the <br>\nRust professionals work it there.</p>\n<p><em>--PROBLEM:</em> dilution of knowledge over too many sites</p>\n<p>I decided that's not a problem for adding a Isabelle reddit. I think <br>\nit's a fact, the vast majority of people who subscribe to this mailing <br>\nlist would be more likely to be willing to participate in an Isabelle <br>\nreddit, than participate on Stackoverflow. I'll give some opinions about <br>\nwhy below.</p>\n<p><em>--PROBLEM:</em> having to sign up for accounts, and getting notified of new <br>\npost</p>\n<p>People may not want to create an account for a particular web site. <br>\nCompanies try to force us to do that. I don't like it, but <a href=\"http://reddit.com\">reddit.com</a> <br>\nmay not be too bad. I don't have an account.</p>\n<p>Everyone has email, so everyone can get mailing list emails. I subscribe <br>\nto tags and users by RSS for Stackoverflow, but I don't see the reddit <br>\nprovides RSS, and some people aren't set up with a RSS reader anyway.</p>\n<p><em>--EXIT</em></p>\n<p>Well, initially, I had an outline in my mind about comparing problems <br>\nand disadvantages about different types of forums, but at the point I <br>\nstart needing to make sure I implement ancient Greek principles of <br>\nrhetoric, to get my point through, I know an email is becoming more than <br>\nwhat it should be.</p>\n<p>One last point is that initially, I couldn't make any sense of the <br>\nStackoverflow way of organizing question. Primarily, it's just a <br>\nsequential list of questions, displayed by time, though it can be <br>\nfiltered by tags.</p>\n<p>I've decided that's the best way to do things, because there's no good <br>\nway to organize anything when questions keep streaming in, and where if <br>\na question doesn't get attention fairly fast, it most likely won't get <br>\nattention. There are current questions,  the search box to look for <br>\nwhat's in the past, and pages for particular people. There's just too <br>\nmuch knowledge to try and cleanly organize it all.</p>\n<p>That point is related to what I care about in all of this. If I ask an <br>\ninvolved question here, is it going to get answered? Probably not, at <br>\nleast, not very fast.</p>\n<p>If it doesn't get answered heere very fast, what's the result? It gets <br>\nburied, because emails keep coming in, and the newest emails are what <br>\nget the attention.</p>\n<p>If I spend 4 hours working up a question on reddit, then it can just set <br>\nthere. It will get forgotten, but it's not the same thing as getting <br>\nburied in time here. All I have to do to try and resurrect it is provide <br>\nthe link to someone.</p>\n<p>If a professional has 5 minutes to throw out a quick paragraph, does <br>\nStackoverflow facilitate that very good? No. It emphasizes the giving of <br>\ngood, well thought out answers.</p>\n<p><em>--EXIT 2</em></p>\n<p>That reminded me of my outline. Does an expert want to submit what they <br>\nsay to a novice, a novice who has absolutely no ability to judge the <br>\ntechnical value of what the expert says? No, of course not.</p>\n<p>I tell you how it works sometimes, when it comes to voting. A person <br>\ndoesn't have the ability to determine whether someone has given them <br>\ngood information or bad information. They only know that they feel bad, <br>\nabout something. Well, that's so wrong, so they click an icon to show <br>\ntheir displeasure.</p>\n<p>In that part of the outline, I would have also made comparisons about <br>\nproblems with expert sites on <a href=\"http://stackexchange.com\">stackexchange.com</a>. Here, novices have to <br>\nmix with experts, so there has to be a greater level of tolerance by <br>\nnovices for experts, and experts for novices. It seems to me, I see that <br>\nkind of philosophy in the rules of the Rust reddit.</p>\n<p>--Regards,<br>\nGB</p>",
        "id": 294329374,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660929716
    },
    {
        "content": "<p>From: Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt;<br>\nI usually treat the history of pending threads on this mailing list with <br>\nspecial care: anything that looks like I should comment on, but is not <br>\nimmediately clear, is marked as important in my mail folder.</p>\n<p>At the end of a month, I look through all pending messages of 1 month, <br>\nsometimes of 2 or 3 months.</p>\n<p>Before a release I look through all pending messages back to the last <br>\nrelease.</p>\n<p>Makarius</p>",
        "id": 294329508,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660929753
    }
]