[
    {
        "content": "<p>From: Denis Butin &lt;<a href=\"mailto:denis.butin@gmail.com\">denis.butin@gmail.com</a>&gt;<br>\nHi all,</p>\n<p>I want to model blind signatures using the security protocol framework<br>\nfrom HOL/Auth.</p>\n<p>In Message.thy, I added a component to the msg datatype (Blind key<br>\nmsg), and made the following changes to the inductive sets parts,<br>\nanalz and synth:</p>\n<p>In parts:<br>\n | Blinded:     \"Blind K X \\&lt;in&gt; parts H ==&gt; X \\&lt;in&gt; parts H\"<br>\n | Blinded2:    \"Crypt T (Blind K X) \\&lt;in&gt; parts H ==&gt; Crypt T X \\&lt;in&gt; parts H\"</p>\n<p>In analz:<br>\n | Unblind [dest]:   \"[|Blind K X \\&lt;in&gt; analz H; Key(K) \\&lt;in&gt; analz<br>\nH|] ==&gt; X \\&lt;in&gt; analz H\"<br>\n | Unblind2 [dest]: \"[|Crypt T (Blind K X) \\&lt;in&gt; analz H; Key(K) \\&lt;in&gt;<br>\nanalz H|]  ==&gt; Crypt T X \\&lt;in&gt; analz H\"</p>\n<p>In synth:<br>\n| Blind [intro]:  \"[|X \\&lt;in&gt; synth H;  Key(K) \\&lt;in&gt; H|] ==&gt; Blind K X<br>\n\\&lt;in&gt; synth H\"</p>\n<p>The important rule is Unblind2, others are there for consistency.</p>\n<p>Now, using this, I can't prove parts_synth [simp]: \"parts (synth H) =<br>\nparts H \\&lt;union&gt; synth H\", and I strongly suspect it doesn't hold.<br>\nThis is problematic, because lemmas about the Spy's behaviour use<br>\nthis.</p>\n<p>Investigating what is used in the proof, it turns out the problem<br>\ncomes directly from the interplay between Blinded2 and synth. However,<br>\nremoving Blinded2 breaks analz_subset_parts.</p>\n<p>I tried formulating Unblind2 as a synth rule, but I wasn't able to<br>\nprove it either, plus it will probably break lemmas related to Fake.</p>\n<p>I then tried \"externalising\" Unblind2 as an axiom. After giving it<br>\nsome thought, it seems like a really bad idea.</p>\n<p>I've been stuck on this for a couple of days, and would be grateful<br>\nfor any help or ideas.</p>\n<p>Regards,<br>\nDenis</p>",
        "id": 294133462,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660843617
    },
    {
        "content": "<p>From: Jean Martina &lt;<a href=\"mailto:Jean.Martina@cl.cam.ac.uk\">Jean.Martina@cl.cam.ac.uk</a>&gt;<br>\nHi Denis,</p>\n<p>Looks like your problem is the synth without explicitly saying that T in H. Have you tried to write a rule for synth that creates Crypt T (Blind K X) for any T in H? Even though you are assuming that Crypt will come out of the Crypt rule, this specific case will not be yielded with certainty to assert parts_synth. </p>\n<p>I had similar issued extending the Inductive Method for secret sharing. I think you need \"Blind2 [intro]:  \"[|X \\&lt;in&gt; synth H;  Key(K) \\&lt;in&gt; H; Key(T) \\&lt;in&gt; H|] ==&gt; Crypt T (Blind K X) \\&lt;in&gt; synth H\". I think this will make things easier for you.</p>\n<p>In fact, implementation of new cryptographic primitives support has been on the raise. It would be nice if someone could just absorb them all assembling and bring it to the standard Isabelle distribution.</p>\n<p>Jean</p>",
        "id": 294133491,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660843627
    }
]