[
    {
        "content": "<p>From: Matthew Fernandez &lt;<a href=\"mailto:matthew.fernandez@nicta.com.au\">matthew.fernandez@nicta.com.au</a>&gt;<br>\nHi all,</p>\n<p>I've noticed after enabling auto-Sledgehammer that it (and friends like Nitpick) run on all the<br>\nlemmas in any file you open. So, for example, when you open a previously worked on theory,<br>\nSledgehammer starts attacking lemmas that already have completed proofs. This isn't a large<br>\nimpediment, but I just wanted to suggest that perhaps this behaviour could be improved on in future<br>\nby noticing the completed proof.</p>\n<p>If there's a way to alter this behaviour that I have overlooked, please let me know and apologies<br>\nfor the noise.</p>\n<p>Thanks,<br>\nMatt</p>\n<hr>\n<p>The information in this e-mail may be confidential and subject to legal professional privilege and/or copyright. National ICT Australia Limited accepts no liability for any damage caused by this email or its attachments.</p>",
        "id": 294646034,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661164107
    },
    {
        "content": "<p>From: Gerwin Klein &lt;<a href=\"mailto:Gerwin.Klein@nicta.com.au\">Gerwin.Klein@nicta.com.au</a>&gt;<br>\nThere is actually a good use for this in some cases: autosledgehammer is extremely good at pointing out redundant lemmas.</p>\n<p>Going through larger proof updates recently, I was able to remove quite a few proofs that were duplicates or close duplicates, which autosledgehammer had highlighted for me.</p>\n<p>So maybe this should be configurable, at least.</p>\n<p>Ideally autosledgehammer would recognise lemmas that are already solved by a one-liner and always skip those. And autosolve skip those that are already solved by a single rule application with one of the rules it is suggesting. But that’s probably a lot of proof text analysis for something that doesn’t really want to know about any of that.</p>\n<p>Cheers,<br>\nGerwin</p>\n<hr>\n<p>The information in this e-mail may be confidential and subject to legal professional privilege and/or copyright. National ICT Australia Limited accepts no liability for any damage caused by this email or its attachments.</p>",
        "id": 294646384,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661164242
    },
    {
        "content": "<p>From: Lars Noschinski &lt;<a href=\"mailto:noschinl@in.tum.de\">noschinl@in.tum.de</a>&gt;<br>\nI'd like autosolve to skip non-lemma proof-obligations (for example<br>\nthose of sublocale); at least if these have a successful proof.</p>\n<p>-- Lars</p>",
        "id": 294646422,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661164267
    }
]