[
    {
        "content": "<p>From: <a href=\"mailto:serge.autexier@dfki.de\">serge.autexier@dfki.de</a><br>\nCall for Papers<br>\n formal papers - informal papers - doctoral programme - workshops - tutorials</p>\n<p>11th Conference on Intelligent Computer Mathematics<br>\n                            - CICM 2018 - <br>\n                           August 13-17, 2018<br>\n                          RISC, Hagenberg, Austria<br>\n<a href=\"http://www.cicm-conference.org/2018\">http://www.cicm-conference.org/2018</a></p>\n<hr>\n<p>Digital and  computational solutions  are becoming the  prevalent means  for the<br>\ngeneration,  communication, processing,  storage  and  curation of  mathematical<br>\ninformation.</p>\n<p>CICM  brings  together  the  many   separate  communities  that  have  developed<br>\ntheoretical  and  practical  solutions  for mathematical  applications  such  as<br>\ncomputation, deduction, knowledge management, and  user interfaces.  It offers a<br>\nvenue for  discussing problems and  solutions in each  of these areas  and their<br>\nintegration.</p>\n<p>CICM 2018  invites submissions  in all topics  relating to  intelligent computer<br>\nmathematics, in particular but not limited to</p>\n<ul>\n<li>theorem proving and computer algebra</li>\n<li>mathematical knowledge management</li>\n<li>digital mathematical libraries</li>\n</ul>\n<p>CICM appreciates  the varying nature of  the relevant research in  this area and<br>\ninvites submissions of very different forms:</p>\n<p>1) Formal  submissions will be reviewed  rigorously and accepted papers  will be<br>\n   published in a volume of Springer LNAI:</p>\n<p>* regular papers (up to 15 pages) present novel research results</p>\n<p>* project and survey papers (up to 15 pages + bibliography) summarize<br>\n      existing results</p>\n<p>* system and dataset descriptions (up to 5 pages) present digital artifacts</p>\n<p>2) Informal submissions  will be reviewed with a positive  bias and selected for<br>\n   presentation based on their relevance for the community.</p>\n<p>* informal papers may present work-in-progress, project announcements, <br>\n     position statements, etc.</p>\n<p>* posters and system demos will be presented in parallel in special sessions</p>\n<p>3) The doctoral programme provides PhD students a forum to present early results<br>\n   receive constructive feedback and mentoring.</p>\n<p>4) Workshops allow smaller groups to self-organize focused discussions.</p>\n<p>5) Tutorials allow presenting a particular system in depth.</p>\n<ul>\n<li>Important Dates *</li>\n</ul>\n<p>Formal submissions</p>\n<p>- Abstract deadline:            April 15<br>\n  - Full paper deadline:          April 22<br>\n  - Reviews sent to authors:      May 21<br>\n  - Rebuttals due:                May 27<br>\n  - Notification of acceptance:   June 4<br>\n  - Camera-ready copies due:      June 8<br>\n  - Conference:                   August 13-17</p>\n<p>Informal submissions and doctoral programme</p>\n<p>Two separate submission rounds are offered so that some authors can make early<br>\n  travel plans while other authors submit spontaneously.</p>\n<p>- First round submission deadline:  April 22<br>\n  - Second round submission deadline: July  31         </p>\n<p>Workshop and Tutorial proposals</p>\n<p>- Submission deadline:          February 26</p>\n<p>All submissions should be made via easychair at <a href=\"https://easychair.org/conferences/?conf=cicm2018\">https://easychair.org/conferences/?conf=cicm2018</a></p>",
        "id": 294725180,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661186171
    }
]