[
    {
        "content": "<p>From: Matt Kaufmann &lt;<a href=\"mailto:kaufmann@cs.utexas.edu\">kaufmann@cs.utexas.edu</a>&gt;<br>\nBidding has now closed for ITP-2011, and the bids can be viewed at </p>\n<p><a href=\"http://www.cs.utexas.edu/users/kaufmann/itp-2011-bids.html\">http://www.cs.utexas.edu/users/kaufmann/itp-2011-bids.html</a></p>\n<p>Voting is now open to decide which bid should be adopted. If you are<br>\nseriously thinking of attending ITP-2011, then you may vote. Please<br>\nread the bids and judge them by the plans as a whole: are the<br>\nfacilities appropriate? Are the transportation links adequate? Do you<br>\nhave confidence in the organisers?</p>\n<p>TPHOLs had a tradition of alternating between Europe and North<br>\nAmerica, but bids were opened world-wide since the first call for bids<br>\nwas unsuccessful. It is up to you, the electorate, to decide which<br>\nlocation will be best for 2011.</p>\n<p>Voting will be by single transferable vote: each ballot will consist<br>\nof your preferences in decreasing order. Votes will be counted in a<br>\nseries of rounds until a candidate wins a majority. At each round, the<br>\nleast popular candidate will be eliminated. Your second choice vote<br>\nwill only be counted if your first choice candidate is eliminated, and<br>\nso forth. This system is known by many other names: instant run-off<br>\nvoting (IRV), alternative vote (AV), etc.</p>\n<p>To ensure that your ballot is counted, please adhere carefully to<br>\nfollowing formatting instructions.  List your choices from most to<br>\nleast preferable (any positive number of choices up to five is<br>\nacceptable).  For example, the following ballot (with fictitious<br>\nchoices) indicates a preference first for Alice, then for Bob, and so<br>\non.</p>\n<p>Alice<br>\nBob<br>\nFrank<br>\nMary</p>\n<p>Each choice should be one of the tags shown on the above web page:<br>\nChina, Netherlands, Spain, Denmark, or USA.</p>\n<p>Send your vote by March 1, by email to Matt Kaufmann,<br>\n<a href=\"mailto:kaufmann@cs.texas.edu\">kaufmann@cs.texas.edu</a>.</p>\n<p>Regards,<br>\nMatt Kaufmann and Larry Paulson (ITP-10 co-chairs)</p>",
        "id": 294101831,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660834007
    }
]