[
    {
        "content": "<p>From: Tobias Nipkow &lt;<a href=\"mailto:nipkow@in.tum.de\">nipkow@in.tum.de</a>&gt;<br>\nI have tried to make the inner syntax in the theory window bold (in jedit).<br>\nSetting Utilities &gt; Global Options &gt; Text area &gt; Text font &gt; bold makes the<br>\nouter syntax bold but not the inner. This may well be intentional, but I may<br>\njust not have found the right menu item. Which one is it?</p>\n<p>Thanks<br>\nTobias</p>",
        "id": 294248183,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660909747
    },
    {
        "content": "<p>From: Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt;<br>\nThis might be actually a general jEdit question (potentially for the jEdit <br>\nmailing list at sourceforge), but in Isabelle/jEdit I also modify the way <br>\nfonts and jEdit \"token markup\" works, so one needs to look carefully what <br>\nhappens where.</p>\n<p>It seems that the jEdit text area font (the \"view.font\") can have its own <br>\nstyle (bold, italics etc), but that only applies to its use within plain <br>\ntext, without any specific token markup (like quoted material or <br>\ncomments).  Only the font family is used to turn the view.font into token <br>\nstyles.  So the bold of the text area view.font is lost when it is turned <br>\ninto the font style for quoted material.</p>\n<p>One can see the effect when opening some .java file in plain jEdit, and <br>\nchanges the text area font: only the non-special text is changed.</p>\n<p>Actual token styles can be changed separately in the \"Syntax Highlighting\" <br>\nsection of jEdit global options.  Isabelle/jEdit has its own tokenizer for <br>\ntheory files that uses the following jEdit tokens: KEYWORD2, LITERAL1, <br>\nLITERAL2, COMMENT1, COMMENT3.</p>\n<p>For inner syntax it is LITERAL1 (for Isabelle \"string\" tokens) and <br>\nLITERAL2 (for Isabelle <code>altstring</code> tokens).</p>\n<p>Alternatively, there is \"Utilities / Quick settings / Edit syntax style of <br>\ntoken under caret\".  Then one does not need to know the token type in <br>\nadvance.  This menu item looks like a somewhat adhoc feature addition that <br>\nwas added for exactly this situation :-)</p>\n<p>Makarius</p>",
        "id": 294248230,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660909767
    }
]