[
    {
        "content": "<p>From: Michael Kohlhase &lt;<a href=\"mailto:m.kohlhase@iu-bremen.de\">m.kohlhase@iu-bremen.de</a>&gt;<br>\n[Apologies for double posing]</p>\n<p>8th OpenMath Meeting (joint with JEM)</p>\n<p><em>RISC, Schloss Hagenberg, University of Linz</em></p>\n<p><em>June 25-26th, 2007</em></p>\n<p>Details: <a href=\"http://www.openmath.org/meetings/linz2007/\">http://www.openmath.org/meetings/linz2007/</a></p>\n<p>The 8th OpenMath Workshop is a meeting place for developers and users of<br>\nthe OpenMath standard. The recent developments and applications of<br>\nOpenMath are presented at this yearly event. OpenMath is a standard for<br>\ncommunicating semantically-rich representations of mathematical objects<br>\nbetween all kinds of computer programs. The communication can take place<br>\nbetween software packages and on the World Wide Web. The associated<br>\ntools will permit the display, manipulation and access of mathematical<br>\ninformation stored electronically.</p>\n<p>Scope</p>\n<p>The main themes of this year's meeting will be the Alignment with<br>\nMathML3 and the use of OpenMath in Education. The program will consist<br>\nof tutorials and contributed talks, and will be organized into two<br>\none-day tracks.</p>\n<p>The W3C has chartered the Math Working Group with revising the MathML2<br>\nstandard until Spring 2008. In this endeavor, the Math working group is<br>\nrevising the content-MathML sublanguage to be isomorphic with OpenMath.<br>\nThis will greatly enhance interoperability of content communication for<br>\nmath software systems. We will start off the track by an OpenMath/MathML<br>\ntutorial, and a presentation of the current content MathML3 working<br>\ndraft. The main topic will be discussions on technical issues of the<br>\nalignment, possible changes to OpenMath, and perspectives for content<br>\nMathematics.</p>\n<p>The JEM, Joining Educational Mathematics, thematic network is promoting<br>\ncontributions that highlight new developments and use of semantic markup<br>\nin digital content designed for eLearning. The possibility to manipulate<br>\nand communicate mathematical objects without loss of information allows<br>\nfor rich, interactive materials that are ideal in education. New<br>\ntechnologies, software libraries and tools, case studies, comparative<br>\nsurveys, and success stories related to semantic markup such e.g.<br>\nOpenMath, Content MathML, MathBook-MathDox, OMDoc, MathQTI, PhysML, are<br>\nalso welcome.</p>\n<p>Related Events</p>\n<p>The workshop takes place as part of the RISC Summer 2007<br>\n&lt;<a href=\"http://www.risc.uni-linz.ac.at/about/conferences/summer2007/\">http://www.risc.uni-linz.ac.at/about/conferences/summer2007/</a>&gt;, directly<br>\nbefore the Workshop on Mathematical Interfaces (MathUI)<br>\n&lt;<a href=\"http://www.activemath.org/~paul/MathUI07/\">http://www.activemath.org/~paul/MathUI07/</a>&gt;, the 6th Conference on<br>\nMathematical Knowledge Management (MKM2007)<br>\n&lt;<a href=\"http://www.cs.bham.ac.uk/~mmk/events/MKM07/\">http://www.cs.bham.ac.uk/~mmk/events/MKM07/</a>&gt;, and the Calculemus<br>\nSymposium<br>\n&lt;<a href=\"http://www.risc.uni-linz.ac.at/about/conferences/Calculemus2007/\">http://www.risc.uni-linz.ac.at/about/conferences/Calculemus2007/</a>&gt;.</p>\n<p>Registration will be handled by the RISC summer.</p>\n<p>On June 25. 2007 the annual general meeting of the OpenMath Society will<br>\nbe held. More information will be posted as available on the OpenMath<br>\nSociety web pages.</p>\n<p>Call for contributions</p>\n<p>We are calling for contributed talks on these topics. Contributed Talks<br>\nshould be submitted by e-mail to the Organizers along with one-page<br>\nhtml-formatted abstract until June 1st 2007.</p>\n<p>Organizers</p>\n<p>* Olga Caprotti, Helsinki University: <a href=\"mailto:olga.caprotti@helsinki.fi\">olga.caprotti@helsinki.fi</a><br>\n     * Michael Kohlhase, Jacobs University Bremen:<a href=\"mailto:m.kohlhase@iu-bremen.de\">m.kohlhase@iu-bremen.de</a><br>\n     * Paul Libbrecht, DFKI  <a href=\"mailto:paul@activemath.org\">paul@activemath.org</a>.</p>",
        "id": 294048480,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660818327
    }
]