[
    {
        "content": "<p>From: Simon Foster via Cl-isabelle-users &lt;<a href=\"mailto:cl-isabelle-users@lists.cam.ac.uk\">cl-isabelle-users@lists.cam.ac.uk</a>&gt;<br>\nDear all,</p>\n<p>Applications are invited for a Research Associate to carry out research on<br>\napplication of formal verification technology to safety assurance of<br>\nautonomous robots. This position will be funded by the EPSRC for three<br>\nyears in the context of the recently awarded CyPhyAssure project.</p>\n<p>You will assist in the development of a computerised platform for arguing<br>\nthe safety of autonomous robots by application of multi-model based<br>\nassurance cases. We will build this platform within the Isabelle/HOL proof<br>\nassistant, and utilise the Structured Assurance Case Metamodel (SACM). The<br>\nplatform, as conceived, will support formal modelling of individual modular<br>\ncomponents of a robot and its environment, the combination of these models<br>\nto describe the overall system’s behaviour, the description of formal<br>\nrequirements of the overall system, and decomposition and apportionment of<br>\nthese requirements to the constituent models.</p>\n<p>You will liaise with academic and the industrial partners and participate<br>\nin the writing of research papers. You will have a PhD in the area of<br>\nformal methods, experience in modelling and formal refinement, and<br>\nunderstanding of hybrid and/or probabilistic systems. You will have<br>\nsubstantial experience in the application of the Isabelle/HOL theorem<br>\nprover. Experience in the areas of assurance cases, safety processes, and<br>\nrobotics are all highly desirable.</p>\n<p>For more information on this position, please visit <a href=\"https://jobs.york.ac.uk/\">https://jobs.york.ac.uk/</a><br>\nwd/plsql/wd_portal.show_job?p_web_site_id=3885&amp;p_web_page_<br>\nid=356469&amp;p_vacancy=research-associate-university-of-york</p>\n<p>Thanks,</p>\n<p>-Simon Foster.</p>",
        "id": 294736700,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661190048
    }
]