[
    {
        "content": "<p>From: Christian Sternagel &lt;<a href=\"mailto:c.sternagel@gmail.com\">c.sternagel@gmail.com</a>&gt;<br>\nDear all,</p>\n<p>in my opinion we have two distinct issues which got accidentally merged in</p>\n<p><a href=\"http://www.mail-archive.com/isabelle-dev@mailbroy.informatik.tu-muenchen.de/msg03860.html\">http://www.mail-archive.com/isabelle-dev@mailbroy.informatik.tu-muenchen.de/msg03860.html</a></p>\n<p>While I agree with Makarius on</p>\n<blockquote>\n<p>I am more concerned about this wiki here:<br>\n<a href=\"https://isabelle.in.tum.de/community\">https://isabelle.in.tum.de/community</a> since it is provided by one of the<br>\nestablished Isabelle sites.</p>\n<p>I would still like to see a genuine Isabelle community contributing here,<br>\nand doing serious maintenance.  Right now it is just a scribbling <br>\nboard for<br>\npeople who were discontent with some of the official READMEs or <br>\nmanuals, and<br>\neven that is often pointless already due to continuous updates of the<br>\nofficial versions.</p>\n</blockquote>\n<p>I don't see why isabelle user communication should change from the (in <br>\nmy opinion) very well working mailing lists to anywhere else. I did <br>\nnever use stackoverflow or stackexchange myself (i.e., have no account) <br>\nbut of course occasionally arrive there via web searches. Today I read <br>\ntheir \"about\" section and it seems to be mostly their goal that <br>\nquestions get professional answers fast. I would say that is exactly <br>\nwhat is currently happening on the mailing lists.</p>\n<p>Of course this is specific to Isabelle. And some of the suggestions in <br>\nearlier e-mails did more sound like building a more general community <br>\n(e.g., all users of any kind of proof assistant). In principle that <br>\nsounds good. A good thing about the current setting is that it is <br>\nfocused (I do not have enough reading capacity to go through answers <br>\nconcerning other proof assistants while being concerned with some <br>\nisabelle specific question). Of course if questions occurred (on one of <br>\nthe isabelle lists or any list of another proof assistant) that were not <br>\ntool specific, they could be forwarded to this overflow/exchange thingy <br>\n(after that was established).</p>\n<p>To summarize my opinion. There are the following different issues:</p>\n<p>1) Isabelle user communication, including Q&amp;A. (I think: well covered by <br>\nthe current lists.)</p>\n<p>2) Isabelle community content (potentially, tips and tricks, tutorials, <br>\nresources, ...) which is currently maintained in a wiki and could be <br>\nimproved.</p>\n<p>3) Building a more general community (not Isabelle specific).</p>\n<p>cheers</p>\n<p>chris</p>",
        "id": 294234912,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660904337
    },
    {
        "content": "<p>From: \"Yannick Duchêne (Hibou57 )\" &lt;<a href=\"mailto:yannick_duchene@yahoo.fr\">yannick_duchene@yahoo.fr</a>&gt;<br>\nTechnically speaking, I favour Usenet over mailing list, because I already  <br>\nfollow some other Usenet groups, and using the Isabelle mailing list  <br>\nthrough the Gmane interface, often present issues. A mailing list is not  <br>\nwhat's the more handy, and I personnaly would better enjoy a forum or a  <br>\nUsenet group (a real one, not Gname interfacing a mailing list to make it  <br>\nlook like a Usenet group).</p>\n<p>This is just a technical matter by the way, nothing wrong with people  <br>\nhere, who I enjoy a lot ;)</p>",
        "id": 294234960,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660904355
    },
    {
        "content": "<p>From: John Wickerson &lt;<a href=\"mailto:jpw48@cam.ac.uk\">jpw48@cam.ac.uk</a>&gt;<br>\nHi,</p>\n<p>Can I just add my two cents on the {mailing-list/stack-exchange/wiki}-issue?</p>\n<p>I have often thought that it would be quite nice to move Isabelle support <br>\nfrom the mailing-list to something like Stack Exchange (SE), so I am <br>\npleased to hear it being discussed as a possibility.</p>\n<ol>\n<li>\n<p>SE pages (e.g. [1]) are a pleasure to read (and I reckon that's a big <br>\nfactor behind the success of SE). In contrast, the Isabelle Wiki [2], to my <br>\nmind, looks out-of-date and unappealing. Also, compared to the <br>\nmailing-list, code snippets in SE can be formatted as code snippets, and <br>\nmath symbols can be formatted properly too.</p>\n</li>\n<li>\n<p>I think SE might be less intimidating to beginners. Maybe it's just me, <br>\nbut I think the idea of sending a newbie question to any mailing-list, <br>\nknowing that it will appear in hundreds of people's inboxes, is <br>\nsignificantly scarier than just posting it on a website (yes, even if those <br>\nsame people subscribe to the website's feed).</p>\n</li>\n<li>\n<p>The ability to edit questions and answers would be quite useful. Among <br>\nother benefits, questions can be later tagged with keywords, making them <br>\nmore likely to show up in Google searches.</p>\n</li>\n<li>\n<p>The reputation system might be quite fun.</p>\n</li>\n</ol>\n<p>As Gottfried has pointed out, the SE idea would only work if <em>all</em> the <br>\nsupport migrates over from the mailing-list. This would be quite a radical <br>\nchange, and as Chris says, the mailing-list does generally work very well.</p>\n<p>A lightweight way to implement this change would be just to start asking <br>\nand answering Isabelle questions on Stack Overflow, e.g. here: <br>\n<a href=\"http://stackoverflow.com/questions/tagged/isabelle\">http://stackoverflow.com/questions/tagged/isabelle</a></p>\n<p>Alternatively, one could propose a dedicated Isabelle SE site, e.g.:<br>\n<a href=\"http://isabelle.stackexchange.com/\">http://isabelle.stackexchange.com/</a></p>\n<p>cheers,<br>\nJohn</p>",
        "id": 294235134,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660904421
    },
    {
        "content": "<p>From: Gergely Buday &lt;<a href=\"mailto:gbuday@gmail.com\">gbuday@gmail.com</a>&gt;<br>\nJohn Wickerson wrote:</p>\n<blockquote>\n<p>As Gottfried has pointed out, the SE idea would only work if <em>all</em> the<br>\nsupport migrates over from the mailing-list. This would be quite a radical<br>\nchange, and as Chris says, the mailing-list does generally work very well.</p>\n</blockquote>\n<p>Isabelle-users is quite academic where a general knowledge of logic,<br>\nlambda calculus, rewriting and type systems is expected. A stack<br>\nexchange site would be the place where real newbies could pose their<br>\nquestions. Having the SE site need not empty the mailing list, only<br>\nshape it to have mostly power-user discussion. I guess.</p>\n<blockquote>\n<p>Alternatively, one could propose a dedicated Isabelle SE site, e.g.:<br>\n<a href=\"http://isabelle.stackexchange.com/\">http://isabelle.stackexchange.com/</a></p>\n</blockquote>\n<p>How about a computational logic site, for proof theory, model<br>\nchecking, theorem proving theory and actual systems question? Isabelle<br>\nis too narrow a topic for an SE site. There is a CS and a Theoretical<br>\nComputer Science section already:</p>\n<p><a href=\"http://cs.stackexchange.com/\">http://cs.stackexchange.com/</a></p>\n<p><a href=\"http://cstheory.stackexchange.com/\">http://cstheory.stackexchange.com/</a></p>\n<ul>\n<li>Gergely</li>\n</ul>",
        "id": 294235148,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660904432
    },
    {
        "content": "<p>From: Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt;<br>\nOn Tue, 26 Feb 2013, John Wickerson wrote:</p>\n<blockquote>\n<p>As Gottfried has pointed out, the SE idea would only work if <em>all</em> the <br>\nsupport migrates over from the mailing-list. This would be quite a <br>\nradical change, and as Chris says, the mailing-list does generally work <br>\nvery well.</p>\n</blockquote>\n<p>I did not fully understand that reasoning.  Gottfried's plan was for a <br>\nseparate SE site, and that requires substantial community behind it. <br>\nAlthough I like the idea of all prover people joining in one site, they <br>\nwill probably still be too small and insignificant, even if the <br>\nfragmentation is overcome.</p>\n<blockquote>\n<p>A lightweight way to implement this change would be just to start asking <br>\nand answering Isabelle questions on Stack Overflow, e.g. here: <br>\n<a href=\"http://stackoverflow.com/questions/tagged/isabelle\">http://stackoverflow.com/questions/tagged/isabelle</a></p>\n</blockquote>\n<p>Indeed, that is already there.  Some guys started asking questions and <br>\nsome other answered them.  I don't see any conflict with isabelle-users <br>\nhere.</p>\n<p>Makarius</p>",
        "id": 294235165,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660904445
    }
]