[
    {
        "content": "<p>From: Lutz Schroeder &lt;<a href=\"mailto:Lutz.Schroeder@dfki.de\">Lutz.Schroeder@dfki.de</a>&gt;<br>\n[Thanks for distributing the call for papers below]</p>\n<p>======= CfP========================================================<br>\n                                 FHES 2011<br>\n                     International Symposium on<br>\nFoundations of Health Information Engineering and Systems<br>\n               (<a href=\"http://www.iist.unu.edu/ICTAC/FHIES2011/\">http://www.iist.unu.edu/ICTAC/FHIES2011/</a>)<br>\n          27-29 August 2011 Mabalingwe Nature Reserve, South Africa<br>\n                  (Colocated with ICTAC 2011)</p>\n<p>Information and communication technology plays an increasingly enabling<br>\nrole in addressing the global challenges of healthcare, in both the<br>\ndeveloped and the developing world, that are the concern of the United<br>\nNations, its Peoples and Members States. The use of software in medical<br>\ndevices is already raising issues in relation to safety and efficacy for<br>\nmanufacturers and regulators. Health information systems raise issues of<br>\nboth privacy and confidentiality, on the one hand, and, increasingly,<br>\npatient safety on the other. Hospital and other information systems<br>\nraise important issues of efficacy and interoperability. However, to<br>\ncapitalize on the potential of this technology in reshaping healthcare<br>\ndemands focused research on sound and safe development techniques from<br>\nsoftware engineering, electronic engineering, computing science,<br>\ninformation science, mathematics, and industrial engineering.</p>\n<p>Aims<br>\n=====<br>\nThe purpose of the new symposium series on Foundations of Software<br>\nEngineering Health Informatics (FHIES) is to promote a nascent research<br>\narea that aims to develop and apply theories and techniques in computing<br>\nscience and software engineering to modelling, building and certifying<br>\nsoftware based systems in the application domain of healthcare. Many of<br>\nthese systems are already regulated in many jurisdictions and many more<br>\nof them will become regulated in the future.</p>\n<p>Research on theories, techniques and tools of software modelling,<br>\nverification and validation has been an important area of computer<br>\nscience and software engineering, known as Formal Methods. This research<br>\naddresses the challenging problem of design and certification of safety<br>\nor mission critical software systems through<br>\nabstraction and decomposition techniques based on the use of<br>\nmathematical modelling theories and sound engineering methods. Formal<br>\nmethods have primarily addressed the correctness of systems used in the<br>\nindustrial, financial, and defence applications. However, they have<br>\nrecently found application in modelling and analysis of complex systems<br>\nthat involve interacting behaviour of many kinds of objects and agents,<br>\nincluding software systems, physical objects and humans. The models of<br>\nthese systems have both discrete and continuous behaviour, and both<br>\nqualitative and quantitative (e.g., spatial timing and probabilistic)<br>\nproperties. It is believed that these methods can be used for modelling<br>\nproblems of health informatics, which presents the challenge of scalability.</p>\n<p>Software plays a critical role in sustainable health care, both as part<br>\nof the solution and as part of the problem. Software intensive<br>\ninformation systems are needed to support the collection and processing<br>\nof vast amounts of data via different devices, and allow policy makers<br>\nto access and share these data, and to support their decision making and<br>\nvalidation. Software systems can be developed for managing, controlling<br>\nand monitoring policies, processes and workflows in medical systems.<br>\nSoftware systems can be developed to help create the sophisticated<br>\nmedical devices that are simply impossible to build without the<br>\nsoftware. On the other hand, the application of software raises<br>\nchallenging issues in safety, security and privacy, and increases the<br>\ncomplexity of healthcare workflows and the need for new business policies.</p>\n<p>Paper Submissions<br>\n==============</p>\n<p>We solicit high quality submissions reporting on</p>\n<p>1. original research contributions (18 pages maximum in LNCS format)<br>\n   2. application experience, case studies and software prototypes<br>\n      (18 pages maximum in LNCS format)</p>\n<p>3. surveys, comparisons, and state-of-the-art reports<br>\n      (18 pages maximum in LNCS format)</p>\n<p>4. position papers that define research projects with identified<br>\n      challenges and milestones (10 pages maximum in LNCS format)</p>\n<p>5. proposals for panel discussions, with at least three named<br>\n      panellists, about a topical question (5 pages maximum in LNCS<br>\n      format).</p>\n<p>All submissions will be judged on the basis of originality, contribution<br>\nto the field, technical and presentation quality, and relevance to the<br>\nconference. Submissions should be in English, prepared in the LNCS<br>\nformat (see here for details). Submission constitutes a commitment to<br>\nattend and present a paper, if accepted.</p>\n<p>All accepted papers will be included in the pre-event proceedings of the<br>\nsymposium. It is the plan to publish the post event proceedings either<br>\nby ACM or Springer in the LNCS series, and it will include all the<br>\naccepted submissions, EXCEPT FOR the proposals for panel discussions.<br>\nThe post proceedings will include a brief summary of panel discussions.</p>\n<p>Important Dates<br>\n===========</p>\n<p>Abstract Submission             29    May 2011<br>\nPaper Submission            5     June 2011<br>\nNotification of acceptance  18    July 2011<br>\nFinal copy for proceedings  7     August 2011<br>\nFHIES 2011                  29-30 August 2011</p>\n<p>Organization<br>\n=========</p>\n<p>General Chairs</p>\n<p>* Peter Haddawy, UNU-IIST, Macao<br>\n    * Tom Maibaum, McMaster University, Canada</p>\n<p>Programme Chairs</p>\n<p>* Zhiming Liu, UNU-IIST, Macao<br>\n    * Alan Wassyng, McMaster University, Canada</p>\n<p>Organising Chair</p>\n<p>* Hao Wang, UNU-IIST, Macao</p>\n<p>Program Committee</p>\n<p>* Syed Mohamed Aljunid, UNU-IIGH<br>\n    * Sebastian Fischmeister, University of Waterloo, Canada<br>\n    * Peter Haddawy, UNU-IIST, Macao<br>\n    * Jozef Hooman, Embedded Systems Institute and Radboud University,<br>\n           Nijmegen, The Netherlands</p>\n<p>* Michaela Huhn, TU Clausthal, Germany<br>\n    * Mark Lawford, McMaster University, Canada<br>\n    * Insup Lee, University of Pennsylvania, USA<br>\n    * Martin Leucker, TU Munich, Germany<br>\n    * Wendy MacCaull, St. Francis Xavier University, Canada<br>\n    * Tom Maibaum, McMaster University, Canada<br>\n    * Dominique Mery, LORIA and Universite Henri Poincare Nancy 1,<br>\n           France</p>\n<p>* Jun Pang, University of Luxembourg, Luxembourg<br>\n    * David Robertson, University of Edinburgh, UK<br>\n    * Lutz Schröder, DFKI Bremen and University of Bremen, Germany<br>\n    * Jens H. Weber, University of Victoria, Canada<br>\n    * Liang Xiao, Hubei University of Technology, P.R.China</p>",
        "id": 294132405,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660843293
    }
]