[
    {
        "content": "<p>From: \"henning.seidler\" &lt;<a href=\"mailto:henning.seidler@mailbox.tu-berlin.de\">henning.seidler@mailbox.tu-berlin.de</a>&gt;<br>\nDear Isabelle list,</p>\n<p>Currently I am working quite a lot on low levels, so I wonder what is<br>\nthe best way to have theories like Inductive.thy \"linked\", that is, when<br>\nclicking on a lemma, I move to that spot?<br>\nI tried setting the base theory to Pure, but then a lot of errors occurred.</p>\n<p>Also, is there the possibility to fold exactly the proof of a lemma? In<br>\nmy current settings only the first line of the statement remains.</p>\n<p>On the other hand, regarding the content, I want to show something like</p>\n<p>lemma \"{ f::'a =&gt; 'b . True } \\subseteq (UNIV::('a \\times 'b ) set)\"</p>\n<p>I guess the solution uses curry or split in front of f, but I do not see<br>\nhow.</p>\n<p>Best regards,<br>\nHenning<br>\n<a href=\"/user_uploads/14278/R7Xzs1HcMPF9MRmtxEmIQJxC/signature.asc\">signature.asc</a></p>",
        "id": 294666870,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661172054
    },
    {
        "content": "<p>From: Lars Hupel &lt;<a href=\"mailto:hupel@in.tum.de\">hupel@in.tum.de</a>&gt;<br>\nDear Henning,</p>\n<blockquote>\n<p>Currently I am working quite a lot on low levels, so I wonder what is<br>\nthe best way to have theories like Inductive.thy \"linked\", that is, when<br>\nclicking on a lemma, I move to that spot?<br>\nI tried setting the base theory to Pure, but then a lot of errors occurred.</p>\n</blockquote>\n<p>you can start Isabelle/jEdit like this:</p>\n<p>isabelle jedit -l Pure</p>\n<p>or, as you probably did, change the image from \"HOL\" to \"Pure\" in the<br>\nTheories panel.</p>\n<p>If you then want to use HOL stuff, import from</p>\n<p>\"~~/src/HOL/Main\"</p>\n<p>Then jEdit will load all the theories from HOL for you and you can<br>\nCtrl-Click there as usual.</p>\n<blockquote>\n<p>On the other hand, regarding the content, I want to show something like</p>\n<p>lemma \"{ f::'a =&gt; 'b . True } \\subseteq (UNIV::('a \\times 'b ) set)\"</p>\n</blockquote>\n<p>This looks like a type error to me ... You are comparing a set of<br>\nfunctions to a set of tuples.</p>\n<p>In any case, your statement is trivial: Every set is a subset of UNIV<br>\n(see theorem \"Set.subset_UNIV\").</p>\n<p>Cheers<br>\nLars</p>",
        "id": 294666954,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661172085
    },
    {
        "content": "<p>From: Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt;<br>\nSince the name \"jEdit\" has been used in the wrong sense twice on this <br>\nthread, here is the relevant quote from the Isabelle/jEdit manual:</p>\n<p>➧[jEdit] is a sophisticated text editor⁋‹@{url<br>\n     \"http://www.jedit.org\"}› implemented in Java⁋‹@{url<br>\n     \"http://www.java.com\"}›. It is easily extensible by plugins written in<br>\n     any language that works on the JVM. In the context of Isabelle this is<br>\n     always Scala⁋‹@{url \"http://www.scala-lang.org\"}›.</p>\n<p>➧[Isabelle/jEdit] is the main application of the PIDE framework and<br>\n     the default user-interface for Isabelle. It targets both beginners and<br>\n     experts. Technically, Isabelle/jEdit consists of the original jEdit<br>\n     code base with minimal patches and a special plugin for Isabelle. This<br>\n     is integrated as a desktop application for the main operating system<br>\n     families: Linux, Windows, Mac OS X.</p>\n<p>End-users of Isabelle download and run a standalone application that<br>\n   exposes jEdit as a text editor on the surface. Thus there is<br>\n   occasionally a tendency to apply the name ``jEdit'' to any of the<br>\n   Isabelle Prover IDE aspects, without proper differentiation. When<br>\n   discussing these PIDE building blocks in public forums, mailing lists,<br>\n   or even scientific publications, it is particularly important to<br>\n   distinguish Isabelle/ML versus Standard ML, Isabelle/Scala versus Scala,<br>\n   Isabelle/jEdit versus jEdit.</p>\n<p>The situation in Isabelle is very complex, but by mixing up names, it <br>\nbecomes just one big bog that nobody understands anymore.</p>\n<p>Makarius</p>",
        "id": 294666962,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661172090
    },
    {
        "content": "<p>From: Jasmin Blanchette &lt;<a href=\"mailto:jasmin.blanchette@inria.fr\">jasmin.blanchette@inria.fr</a>&gt;<br>\nI would like to add my grain of salt. At first, I thought the distinction between jEdit and Isabelle/jEdit was somewhat pedantic, but after years of being at the receiving end of bug reports and other comments about \"metis\" and \"smt\", and as an originator of material about it, I found that many misunderstandings are just waiting to happen.</p>\n<p>To give one example: Metis (Joe Hurd's Metis ATP) is an automatic theorem prover for FOL that is designed to be sound and complete for that logic. \"metis\" is an Isabelle proof method that (1) translates HOL to FOL; (2) invokes Metis; (3) replays Metis inferences in Isabelle's kernel. Without appropriate context, statements like \"metis is first-order\" or \"metis is higher-order\" or \"metis is buggy\" are close to meaningless.</p>\n<p>This having been said, I notice that nobody ever confused Nitpick and its backend Kodkod. I'm grateful I didn't call the tool Isabelle/Kodkod. ;)</p>\n<p>Jasmin</p>",
        "id": 294666995,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661172101
    },
    {
        "content": "<p>From: Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt;<br>\nMaybe that is because Kodkod is sufficiently unknown outside its Isabelle <br>\ncontext -- or maybe this just proves my ignorance about Kodkod.</p>\n<p>The distinction of jEdit the text editor and Isabelle/jEdit the Prover IDE <br>\nis particularly important, because we need to do justice to both.</p>\n<p>jEdit has its own profile as high-end text-editor, although its best of <br>\ntime is probably over (after the founder left the project in 2006).</p>\n<p>Thus it is particularly important to strengthen what is left of the jEdit <br>\ncommunity, and not assimilate its name and declare it dead. It definitely <br>\nrequires patience to get important changes through the jEdit tracker <br>\nsystem, but it usually works. It is better to have approx. 5 people still <br>\nmaintaining jEdit on Sourceforge, instead of taking it over and doing it <br>\nby 1-2 people on the Isabelle side.</p>\n<p>People who want to be lazy and use a short word, may call all Isabelle <br>\ntools just \"Isabelle\" and it will be usually right. So instead of \"jEdit <br>\nchecks a proof document\", \"Isabelle checks a proof document\" will make <br>\nproper sense.</p>\n<p>Makarius</p>",
        "id": 294667014,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661172107
    }
]