[
    {
        "content": "<p>From: Georg Weissenbacher &lt;<a href=\"mailto:georg.weissenbacher@tuwien.ac.at\">georg.weissenbacher@tuwien.ac.at</a>&gt;<br>\nThe deadline for the FMCAD student forum has been<br>\nextended. The new deadline is July 09, 2015!!</p>\n<p>FMCAD 2015 STUDENT FORUM</p>\n<p>FMCAD 2015, the fifteenth conference on the theory and<br>\napplications of formal methods in hardware and system<br>\nverification, will host the</p>\n<p>3rd FMCAD Student Forum<br>\n               (September 28-30, 2015)</p>\n<p>providing a platform for graduate students at any career<br>\nstage to introduce their research to the wider Formal Methods<br>\ncommunity.</p>\n<p>IMPORTANT DATES</p>\n<p>Submission Deadline: July 09, 2015<br>\nAcceptance notification: July 19, 2015<br>\nForum date: September 28-30, 2015</p>\n<p>Details are provided on</p>\n<p><a href=\"http://www.cs.utexas.edu/users/hunt/FMCAD/FMCAD15/student-forum.shtml\">http://www.cs.utexas.edu/users/hunt/FMCAD/FMCAD15/student-forum.shtml</a></p>\n<p>Submissions for the event must be short reports describing<br>\nresearch ideas or ongoing work that the student is currently pursuing,<br>\nand must be within the  scope of FMCAD.  Work, part of which has been<br>\npreviously published, will be considered; the novel aspect to be<br>\naddressed in future work must be clearly described in such cases.  All<br>\nsubmissions will be reviewed by a select group of program committee<br>\nmembers.</p>\n<p>The event will consist of short presentations by the student<br>\nauthors of each accepted submission, and of a poster that<br>\nwill be on display throughout the duration of the<br>\nconference.  Accepted submissions will be listed, with title<br>\nand author name, in the event description in the conference<br>\nproceedings.  The authors will also have the option to<br>\nupload their poster and presentation to the FMCAD web site.<br>\nThe best contribution (determined by the committee based<br>\non the quality of the submission and the presentation)<br>\nwill be given public recognition and a certificate at the event.</p>\n<p>Limited funds will be available for travel assistance for<br>\nUS students with accepted contributions.</p>\n<p>We kindly ask faculty members to help us advertise the event<br>\nby displaying the posters available from the web-page in<br>\ntheir departments.</p>\n<p>If you have questions, please contact the forum chair<br>\nGeorg Weissenbacher (Vienna University of Technology, Austria).</p>\n<p>For more details visit</p>\n<p><a href=\"http://www.cs.utexas.edu/users/hunt/FMCAD/FMCAD15/index.shtml\">http://www.cs.utexas.edu/users/hunt/FMCAD/FMCAD15/index.shtml</a></p>",
        "id": 294644842,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661163623
    }
]