[
    {
        "content": "<p>From: <a href=\"mailto:Carlos.Areces@loria.fr\">Carlos.Areces@loria.fr</a><br>\n%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%</p>\n<p>22nd European Summer School in Logic, Language and Information</p>\n<p>ESSLLI 2010, 9-20 August, 2010, University of Copenhagen, Denmark</p>\n<p>%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%</p>\n<p>CALL FOR COURSE and WORKSHOP PROPOSALS</p>\n<p>The European Summer School in Logic, Language and Information (ESSLLI)  <br>\nis organized every year by the Association for Logic,<br>\nLanguage and Information (FoLLI, <a href=\"http://www.folli.org\">http://www.folli.org</a>) in different  <br>\nsites around Europe. The main focus of ESSLLI is on the interface<br>\nbetween linguistics, logic and computation. ESSLLI offers  <br>\nfoundational, introductory and advanced courses, as well as workshops,<br>\ncovering a wide variety of topics within the three areas of interest:  <br>\nLanguage and Computation, Language and Logic, and Logic and<br>\nComputation. Previous summer schools have been highly successful,  <br>\nattracting up to 500 students from Europe and elsewhere. The<br>\nschool has developed into an important meeting place and forum for  <br>\ndiscussion for students and researchers interested in the<br>\ninterdisciplinary study of Logic, Language and Information.<br>\nFor more information, visit the FoLLI website, as well as ESSLLI?2009  <br>\nwebsite: <a href=\"http://esslli2009.labri.fr/\">http://esslli2009.labri.fr/</a>.</p>\n<p>The ESSLLI 2010 Program Committee invites proposals for foundational,  <br>\nintroductory, and advanced courses, and for workshops for the<br>\n22nd annual Summer School on important topics of active research in  <br>\nthe broad interdisciplinary area connecting logic, linguistics,<br>\ncomputer science, and the cognitive sciences, structured within the 3  <br>\ntraditional ESSLLI streams:</p>\n<p>-Language and Computation<br>\n-Language and Logic<br>\n-Logic and Computation<br>\nWe also welcome proposals that do not exactly fit one of these categories.</p>\n<p>PROPOSAL SUBMISSION: All proposals should be submitted, using a  <br>\nprescribed form that will be available soon on the ESSLLI 2010<br>\nwebsite <a href=\"http://www.hum.ku.dk/esslli2010\">www.hum.ku.dk/esslli2010</a>, through EasyChair on  <br>\n<a href=\"http://www.easychair.org/conferences/?conf=esslli2010\">http://www.easychair.org/conferences/?conf=esslli2010</a>, not later than</p>\n<p><strong>*</strong><strong> Monday, September 7, 2009 </strong><strong>*</strong></p>\n<p>Proposers must hold PhD or equivalent degrees and should follow the  <br>\nguidelines below while preparing their submissions; proposals that<br>\ndo not conform with these guidelines may not be considered.</p>\n<p>GUIDELINES FOR COURSE AND WORKSHOP PROPOSALS:</p>\n<p>ALL COURSES: Courses are given over one week (Monday-Friday) and  <br>\nconsist of five 90 minutes sessions, one per day. Course<br>\nproposals should give a brief overview of the topic and a tentative  <br>\ncontent and structure of the course, as well as state the course?s<br>\nobjectives and clearly specify prerequisites, if any. Lecturers who  <br>\nwant to offer a long, two-week course, should submit two independent<br>\none-week courses (for example an introductory course in the first week  <br>\nof ESSLLI, and a more advanced course during the second). The<br>\nESSLLI program committee has the right to select only one of the two  <br>\nproposed courses.</p>\n<p>TIMETABLE FOR COURSE PROPOSAL SUBMISSION:</p>\n<p>Sep 7, 2009: Proposal Submission Deadline</p>\n<p>Oct 19, 2009: Notification Deadline</p>\n<p>Jun 30, 2010: Deadline for receipt of camera-ready course material  <br>\nby the ESSLLI?2010 local organizers</p>\n<p>FOUNDATIONAL COURSES: These are strictly elementary courses not  <br>\nassuming any background knowledge. They are intended for<br>\npeople who wish to get acquainted with the problems and techniques of  <br>\nareas new to them. Ideally, they should allow researchers from<br>\nother fields to acquire the key competencies of neighboring  <br>\ndisciplines, thus encouraging the development of a truly  <br>\ninterdisciplinary<br>\nresearch community. Foundational courses should require no special  <br>\nprerequisites, but may presuppose some experience with scientific<br>\nmethods and general appreciation of the field of the course.</p>\n<p>INTRODUCTORY COURSES: Introductory courses are central to the  <br>\nactivities of the Summer School. They are intended to provide an<br>\nintroduction to the (interdisciplinary) field for students, young  <br>\nresearchers, and other non-specialists, and to equip them with a good<br>\nunderstanding of the course field's basic methods and techniques. Such  <br>\ncourses should enable experienced researchers from other fields<br>\nto acquire the key competencies of neighboring disciplines, thus  <br>\nencouraging the development of a truly interdisciplinary research<br>\ncommunity. Introductory courses in, for instance, Language and  <br>\nComputation, can build on some knowledge of the component fields; e.g.,<br>\nan introductory course in computational linguistics should address an  <br>\naudience which is familiar with the basics of linguistics and<br>\ncomputation. Proposals for introductory courses should indicate the  <br>\nlevel of the course as compared to standard texts in the area (if any).</p>\n<p>ADVANCED COURSES: Advanced courses should be pitched at an audience of  <br>\nadvanced Masters or PhD students. Proposals for<br>\nadvanced courses should specify the prerequisites in detail.</p>\n<p>WORKSHOPS: Workshops run over one week and consist of five 90-minutes  <br>\nsessions, one per day. The aim of the workshops is to<br>\nprovide a forum for advanced Ph.D. students and other researchers to  <br>\npresent and discuss their work. Workshops should have a well<br>\ndefined theme, and workshop organizers should be specialists in the  <br>\ntheme of the workshop. The proposals for workshops should justify<br>\nthe choice of topic, give an estimate of the number of attendants and  <br>\nexpected submissions, and provide a list of at least 15 potential<br>\nsubmitters working in the field of the workshop. The organizers are  <br>\nrequired to give a general introduction to the theme during the first<br>\nsession of the workshop. They are also responsible for the  <br>\norganization and program of the workshop including inviting the  <br>\nsubmission of<br>\npapers, reviewing, expenses of invited speakers, etc. In particular,  <br>\neach workshop organizer will be responsible for sending out a Call for<br>\nPapers for the workshop and to organize the selection of the  <br>\nsubmissions by the deadlines specified below. The call for workshop<br>\nsubmissions must make it clear that the workshop is open to all  <br>\nmembers of the ESSLLI community and should indicate that all workshop<br>\ncontributors must register for the Summer School.</p>\n<p>TIMETABLE FOR WORKSHOP PROPOSAL SUBMISSIONS:</p>\n<p>Sep 7, 2009: Proposal Submission Deadline</p>\n<p>Oct 19, 2009: Notification Deadline</p>\n<p>Nov 02, 2009: Deadline for submission of the Calls for Papers to  <br>\nESSLLI?2010 PC chair</p>\n<p>Nov 09, 2009: Workshop organizers send out First Call for Papers</p>\n<p>Jan 25, 2010: Workshop organizers send out Second Call for Papers</p>\n<p>Mar 08, 2010: Workshop organizers send out Third Call for Papers</p>\n<p>Apr 12, 2010: Suggested deadline for submissions to the workshops</p>\n<p>May 24, 2010: Suggested deadline for notification of workshop contributors</p>\n<p>Jun 30, 2010: Deadline for submission of camera-ready copy of  <br>\nworkshop proceedings to the ESSLLI?2010 Local Organizers.</p>\n<p>Notice that workshop speakers will be required to register for the  <br>\nSummer School; however, they will be able to register at a reduced rate<br>\nto be determined by the Local Organizers.</p>\n<p>FORMAT FOR PROPOSALS: A form for submitting course and workshop  <br>\nproposals will be available soon on the ESSLLI 2010 website<br>\n<a href=\"http://www.hum.ku.dk/esslli2010\">www.hum.ku.dk/esslli2010</a>.</p>\n<p>The proposers are required to submit the following information:</p>\n<ul>\n<li>\n<p>Name(s) of proposing lecturer(s)/ workshop organizer(s), at most two  <br>\nper course or workshop</p>\n</li>\n<li>\n<p>Contact addresses, homepages, phones, and fax numbers (if  <br>\navailable), of proposing lecturer(s)/ workshop organizer(s);</p>\n</li>\n<li>\n<p>Title of proposed course/workshop;</p>\n</li>\n<li>Type (workshop, foundational, introductory, or advanced course)</li>\n<li>\n<p>Stream (one of: Language &amp; Computation, Language &amp; Logic, Logic &amp;  <br>\nComputation)</p>\n</li>\n<li>\n<p>Description (in at most 300 words, provide justification, relevance  <br>\nto ESSLLI, proposed contents and structure of the courses, resp.<br>\n   expected participation in the workshops)</p>\n</li>\n<li>\n<p>External funding (whether the proposers will be able to obtain  <br>\nexternal funding for travel and accommodation expenses)</p>\n</li>\n<li>\n<p>Further particulars (any further information that is required by the  <br>\nabove guidelines should be included here; in particular, course<br>\n   objectives and prerequisites, as well as the lecturers teaching  <br>\nexperience relevant to the proposed course, and generally in the<br>\n   interdisciplinary field scope of ESSLLI.)</p>\n</li>\n</ul>\n<p>FINANCIAL ASPECTS: Prospective lecturers and workshop organizers  <br>\nshould be aware that all teaching and organizing at the summer<br>\nschools is done on a voluntary basis in order to keep the participants  <br>\nfees as low as possible. Lecturers and organizers are not paid for<br>\ntheir contribution, but are reimbursed for travel and accommodation  <br>\n(up to fixed maximum amounts, that will be communicated to the<br>\nlecturers upon notification). It should be stressed that while  <br>\nproposals from all over the world are welcomed, the School cannot  <br>\nguarantee<br>\nfull reimbursement of travel costs, especially from destinations  <br>\noutside Europe. Please note that in case a course or workshop is to be<br>\ntaught/organized by two lecturers, a lump sum will be reimbursed to  <br>\ncover travel and accommodation expenses for one lecturer; the<br>\nsplitting of that sum is up to the lecturers.</p>\n<p>The local organizers would highly appreciate it if, whenever possible,  <br>\nlecturers and workshop organizers find alternative funding to cover<br>\ntravel and accommodation expenses, as that would help us keep the cost  <br>\nof attending ESSLLI?2010 lower.</p>\n<p>ESSLLI 2010 PROGRAM COMMITTEE:</p>\n<p>Chair: Valentin Goranko (Technical Univ. of Denmark)</p>\n<p>Area Specialists:</p>\n<p>Language and Computation:<br>\nWalter Daelemans (Univ. of Antwerp)<br>\nSabine Schulte im Walde (Univ. of Stuttgart)</p>\n<p>Language and Logic:<br>\nYoad Winter (Utrecht Univ.)<br>\nRaffaella Bernardi (Free Univ. of Bozen-Bolzano)</p>\n<p>Logic and Computation:<br>\nAnuj Dawar (Univ. of Cambridge)<br>\nKen Shan (State Univ. of New Jersey, Rutgers)</p>\n<p>ESSLLI 2010 Program Committee dedicated email account: <a href=\"mailto:esslli2010@gmail.com\">esslli2010@gmail.com</a></p>\n<p>ESSLLI 2010 ORGANIZING COMMITTEE:</p>\n<p>Chair: V<br>\n[message truncated]</p>",
        "id": 294080012,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660830335
    }
]