[
    {
        "content": "<p>From: Simone Cavalheiro &lt;<a href=\"mailto:simone.cavalheiro@gmail.com\">simone.cavalheiro@gmail.com</a>&gt;<br>\n[Apologies should you receive multiple copies of this<br>\ncall.]</p>\n<p>======== SBMF ======= SBMF ======= SBMF ======= SBMF =======</p>\n<p>CALL FOR PAPERS</p>\n<p>20th Brazilian Symposium on Formal Methods (SBMF)</p>\n<p><a href=\"http://sbmf2017.cin.ufpe.br/\">http://sbmf2017.cin.ufpe.br/</a></p>\n<p>27th of November to 1st of December, 2017<br>\n                                          Recife, Pernambuco, Brazil</p>\n<p>======== SBMF ======= SBMF ======= SBMF ======= SBMF =======</p>\n<p>IMPORTANT DATES</p>\n<p>Abstract Submission Deadline: <em>7th of July, 2017</em><br>\nPaper Submission Deadline: <em>14th of July, 2017</em><br>\nPaper Acceptance Notification: 1st of September, 2017<br>\nPaper Camera-ready Version: 8th of September, 2017</p>\n<p>INTRODUCTION</p>\n<p>SBMF 2017 is the twentieth of a series of events devoted to the<br>\ndevelopment, dissemination and use of formal methods for the construction<br>\nof high-quality computational systems. It is now a well-established event,<br>\nwith an international reputation.</p>\n<p>In 2017, SBMF will take place in Recife, the capital of the state<br>\nPernambuco, which is located in the northeast Brazil. It is the 9th city by<br>\npopulation in Brazil, with over 1.5 million inhabitants, and it receives<br>\nmore than 5 million tourists from Brazil and abroad per year.</p>\n<p>SCOPE AND TOPICS</p>\n<p>The aim of SBMF is to provide a venue for the presentation and discussion<br>\nof high-quality work in formal methods. The topics include, but are not<br>\nlimited to, the following:</p>\n<ul>\n<li>\n<p>techniques and methodologies, such as method integration; software and<br>\nhardware co-design; model-driven engineering; formal aspects of popular<br>\nmethodologies; formal design; development methodologies with formal<br>\nfoundations; software evolution based on formal methods;</p>\n</li>\n<li>\n<p>specification and modelling languages, such as well-founded specification<br>\nand design languages; formal aspects of popular languages; logics and<br>\nsemantics for programming and specification languages; code generation;<br>\nformal methods and models for objects, aspects, component-based, real-time,<br>\nhybrid, critical, and service-oriented systems;</p>\n</li>\n<li>\n<p>theoretical foundations, such as domain theory; type systems and category<br>\ntheory; computational complexity of methods and models; computational<br>\nmodels; term rewriting; models of concurrency, security and mobility;</p>\n</li>\n<li>\n<p>verification and validation, such as abstraction, modularisation and<br>\nrefinement techniques; program and test synthesis; correctness by<br>\nconstruction; model checking; theorem proving; static analysis; formal<br>\ntechniques for software testing; software certification; formal techniques<br>\nfor software inspection;</p>\n</li>\n<li>\n<p>education, such as teaching of, for and with formal methods;</p>\n</li>\n<li>\n<p>applications, such as experience reports on the use of formal methods;<br>\nindustrial case studies; tool support.</p>\n</li>\n</ul>\n<p>PAPER SUBMISSION</p>\n<p>Papers with a strong emphasis on Formal Methods, whether practical or<br>\ntheoretical, are invited for submission. They should present unpublished<br>\nand original work that has a clear contribution to the state of the art on<br>\nthe theory and practice of formal methods. They should not be<br>\nsimultaneously submitted elsewhere.</p>\n<p>Papers will be judged by at least three reviewers on the basis of<br>\noriginality, relevance, technical soundness and presentation quality and<br>\nshould contain sound theoretical or practical results. Industry papers<br>\nshould emphasize practical application of formal methods or report on open<br>\nchallenges.</p>\n<p>Contributions should be written in English and be prepared using Springer’s<br>\nLecture Notes in Computer Science (LNCS) format. Papers may not exceed 16<br>\npages (including figures, references and appendix). Accepted papers will be<br>\npublished, after the conference, in a volume of LNCS.  Also, a special<br>\nissue of Science of Computer Programming (Elsevier) is going to be<br>\npublished for the very best papers.</p>\n<p>Every accepted paper MUST have at least one author registered in the<br>\nsymposium by the time the camera-ready copy is submitted; the registered<br>\nauthor is also expected to  attend the symposium and present the paper.</p>\n<p>Papers can be submitted via the following link:<br>\n<a href=\"https://easychair.org/conferences/?conf=sbmf2017\">https://easychair.org/conferences/?conf=sbmf2017</a></p>\n<p>ABOUT RECIFE</p>\n<p>Recife stands out as a major tourist attraction, both for its beaches and<br>\nfor its historic sites, dating back to both the Portuguese and the Dutch<br>\ncolonisation of the region. The Boa Viagem beach is one of the most famous<br>\nurban beaches in Brazil. Visitors get enchanted by the sandy beaches with<br>\nwarm green waters, and also by the complete infrastructure of hotels,<br>\nrestaurants and services which surrounds it. The beach of Porto de<br>\nGalinhas, 60 kilometers south of Recife, has been repeatedly awarded the<br>\ntitle of best beach in Brazil. The historic centre of Olinda, 7 kilometers<br>\nnorth of Recife, was declared a UNESCO World Heritage site in 1982, and<br>\nboth cities’ Carnival are among the world's most famous.</p>\n<p>Recife is also considered the first gastronomic hub of the northeastern<br>\nregion, the second medical centre in Brazil, besides housing the greatest<br>\ntechnological park in the country, known as Porto Digital. In Recife, you<br>\nwill find culture, history, food and fun all in one place.</p>\n<p>KEYNOTE SPEAKERS</p>\n<p>To be announced</p>\n<p>PROGRAM COMMITTEE CHAIRS</p>\n<p>José Fiadeiro (Royal Holloway, University of London, UK)<br>\nSimone Cavalheiro (UFPel, Brazil)</p>\n<p>PROGRAM COMMITTEE</p>\n<p>Adenilso Simão (ICMC/USP, Brazil)<br>\nAlexandre Mota (UFPE, Brazil)<br>\nAline Andrade (UFBA. Brazil)<br>\nAlvaro Moreira (UFRGS, Brazil)<br>\nAna Cavalcanti (University of York, UK)<br>\nAndrea Corradini (Universita’ di Pisa, Italy)<br>\nAna de Melo (USP, Brazil)<br>\nAnamaria Moreira (UFRJ, Brazil)<br>\nArend Rensink, (University of Twente, Netherlands)<br>\nArnaldo Moura (UNICAMP, Brazil)<br>\nAugusto Sampaio (UFPE, Brazil)<br>\nChristiano Braga (UFF, Brazil)<br>\nClare Dixon (University of Liverpool, UK)<br>\nDavid Deharbe (ClearSy, France)<br>\nDavid Naumann (Stevens Institute of Technology, USA)<br>\nEwen Denney (RIACS/NASA, USA)<br>\nFernando Orejas (UPC, Spain)<br>\nJosé Fiadeiro (Royal Holloway, University of London, UK) - PC co-chair<br>\nJose Oliveira (Universidade do Minho, Portugal)<br>\nJim Davies (University of Oxford, UK)<br>\nJim Woodcock (University of York, UK)<br>\nJuliano Iyoda (UFPE, Brazil)<br>\nLeila Ribeiro (UFRGS, Brazil)<br>\nLeila Silva (UFS, Brazil)<br>\nLuciana Foss (UFPel, Brazil)<br>\nLuis Barbosa (Universidade do Minho, Portugal)<br>\nMarcel Oliveira (UFRN, Brazil)<br>\nMarcelo Maia (UFU, Brazil)<br>\nMárcio Cornelio (UFPE, Brazil)<br>\nMichael Butler (University of Southampton, UK)<br>\nMichael Leuschel (Universität Düsseldorf, Germany)<br>\nNarciso Marti-Olliet (Universidad Complutense de Madrid, Spain)<br>\nNeeraj Singh (McMaster University, Canada))<br>\nPatricia Machado (UFCG, Brazil)<br>\nRachid Echahed (CNRS at University of Grenoble, France)<br>\nReiko Heckel (University of Leicester, UK)<br>\nRodrigo Machado (UFRGS, Brazil)<br>\nRohit Gheyi (UFCG, Brazil)<br>\nRolf Hennicker (Ludwig-Maximilians-Universität München, Germany)<br>\nSergio Campos (UFMG, Brazil)<br>\nSimone Cavalheiro (UFPel, Brazil) - PC co-chair<br>\nSofiene Tahar (Concordia University, Canada)<br>\nStephan Hallerstade (Aarhus University, Denmark)<br>\nThierry Lecomte (ClearSy, France)<br>\nTiago Massoni (UFCG, Brazil)</p>\n<p>STEERING COMMITTEE</p>\n<p>Bill Roscoe (University of Oxford, UK)<br>\nChristiano Braga (UFF, Brazil)<br>\nLeila Ribeiro (UFRGS, Brazil)<br>\nMárcio Cornélio (UFPE, Brazil)<br>\nNarciso Martí-Oliet (Universidad Complutense de Madrid, Spain)<br>\nThierry Lecomte (ClearSy, France)</p>",
        "id": 294708664,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661181444
    }
]