[
    {
        "content": "<p>From: Peter Höfner &lt;<a href=\"mailto:Peter.Hoefner@nicta.com.au\">Peter.Hoefner@nicta.com.au</a>&gt;<br>\n[Apologies if you receive multiple copies of this announcement]</p>\n<p>%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%<br>\n                                CALL FOR PAPERS:</p>\n<p>ATX-2012<br>\n                  IJCAR Workshop on Automated Theory Exploration<br>\n                                (June 30-July 1)<br>\n<a href=\"http://dream.inf.ed.ac.uk/events/atx2012\">http://dream.inf.ed.ac.uk/events/atx2012</a></p>\n<p>GENERAL INFORMATION</p>\n<p>This Workshop on Automated Theory Exploration will be held in June/July in Manchester, UK.<br>\nIt is associated with the 6th International Conference on Automated Reasoning (IJCAR) and<br>\nfollows on from two series of workshops: Automated Theory Engineering and Automatheo.</p>\n<p>SCOPE</p>\n<p>Theory exploration means the development of mathematical axioms, definitions, conjectures,<br>\ntheorems, examples and inference procedures as needed to cover the essential concepts<br>\nand analysis tasks of mathematical and other application domains. The automation and<br>\nmechanisation of these capabilities are much sought after in areas such as software<br>\nverification, the analysis of computer systems, formalised mathematics and indeed<br>\nmathematical research.</p>\n<p>The aim of the workshop is to bring together researchers with interests in any aspects<br>\nof this area, including domain-specific formalisations, tool and theory development,<br>\nand general-purpose frameworks for the structuring of theories and their maintenance.</p>\n<p>TOPICS</p>\n<p>Theory exploration is relevant to the design of systems, programs, APIs, protocols,<br>\nalgorithms, design patterns, specification languages, programming languages and<br>\nbeyond. It involves technology such as ITP systems, ATP systems, SAT/SMT solvers,<br>\nmodel checkers and decision procedures.</p>\n<p>Specific topics of the workshop include, but are not limited to:</p>\n<p>o mechanised reasoning for modelling and analysis<br>\no automation applied to formal specification and verification<br>\no domain specific models, languages and solvers<br>\no theorem proving technology for theory exploration<br>\no integration of theories and tools<br>\no the formalisation and automation of mathematics<br>\no case studies/experiences<br>\no automated identification of key concepts and results<br>\no supporting collaborative theory exploration</p>\n<p>INVITED SPEAKERS</p>\n<p>o Robert L. Constable, Cornell University.<br>\no TBA</p>\n<p>SUBMISSIONS</p>\n<p>We invite submissions in 3 forms:</p>\n<p>o Research papers, up to 10 pages;<br>\no System/tool descriptions, up to 5 pages;<br>\no Extended abstracts, up to 3 pages.</p>\n<p>Research and tool papers must be unpublished and not submitted for publication<br>\nelsewhere. Extended abstracts are intended to discuss ideas and work in progress.<br>\nAll papers will be reviewed by the programme committee.</p>\n<p>Submissions must be in PDF using the LaTeX EasyChair-format<br>\n<a href=\"http://www.easychair.org/easychair.zip\">http://www.easychair.org/easychair.zip</a> . One author of each accepted submission<br>\nis expected to present the paper at the workshop. Associated systems demos are<br>\nencouraged, where appropriate.</p>\n<p>Accepted research and tool papers will be published as CEUR Workshop Proceedings.</p>\n<p>If quality and quantity of the submissions warrants this, we plan to publish a special issue<br>\nof a recognized journal on the topic of the workshop.</p>\n<p>IMPORTANT DATES:</p>\n<p>Submission: 3 April 2012<br>\nNotification: 8 May, 2012<br>\nFinal version: 5 June, 2012<br>\nWorkshop: 30 June &amp; 1 July, 2012</p>\n<p>PROGRAM COMMITTEE</p>\n<p>o Jacques Fleuriot (University of Edinburgh, UK)<br>\n o Timothy Griffin (University of Cambridge, UK)<br>\n o Peter Höfner (NICTA, Australia)<br>\n o Joe Hurd (Galois, USA)<br>\n o Temur Kutsia (RISC, Austria)<br>\n o Roy McCasland (University of Edinburgh, UK)<br>\n o Annabelle McIver (Macquarie University, Australia)<br>\n o Stephan Merz (INRIA, France)<br>\n o Petros Papapanagiotou (University of Edinburgh, UK)<br>\n o Alan Smaill (University of Edinburgh, UK)<br>\n o David Stanovsky (Charles University, Czech Republic)<br>\n o Georg Struth (University of Sheffield, UK)<br>\n o Josef Urban (Radboud University, Netherlands)</p>\n<p>WORKSHOP ORGANISERS</p>\n<p>o Alan Smaill<br>\n o Annabelle McIver<br>\n o Peter Höfner<br>\n o Jacques Fleuriot</p>\n<p>The information in this e-mail may be confidential and subject to legal professional privilege and/or copyright. National ICT Australia Limited accepts no liability for any damage caused by this email or its attachments.</p>",
        "id": 294151528,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660849475
    }
]