[
    {
        "content": "<p>From: Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt;<br>\nOn 02/08/18 17:50, Peter Lammich wrote:</p>\n<blockquote>\n<p>is there any particular reason why the \";\" method combinator and the<br>\nmore low-level THEN_ALL_NEW tactical process the new goals in a<br>\nbackward fashion (except that implementing the backwards direction is<br>\nslightly more convenient).</p>\n</blockquote>\n<p>That is the canonical order introduced by Larry Paulson about 3 decades<br>\nago. For uniformity, it is used in various combinators whenever multiple<br>\ngoals/premises need to be addressed.</p>\n<blockquote>\n<p>So what are the deeper reasons that we have a backward \";\" rather than<br>\na forward \";\", or why not simply have both?</p>\n</blockquote>\n<p>For simplicity and uniformity. Having two possibilities everywhere<br>\ncauses an exponential blowup. Having just one possibility avoids this.</p>\n<p>While Eisbach is close to a clone of Ltac in Coq, it is merely a<br>\nconvenience for plain and basic things. Isabelle/ML as the standard<br>\nimplementation language for proof tools is still there, without the<br>\ncomplexity of Coq \"plugins\".</p>\n<p>Makarius</p>",
        "id": 294741616,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661191755
    },
    {
        "content": "<p>From: Lawrence Paulson &lt;<a href=\"mailto:lp15@cam.ac.uk\">lp15@cam.ac.uk</a>&gt;<br>\nIt is difficult to remember, but I suspect that the point is to deliver stack-like behaviour with respect to the list of subgoals while avoiding the renumbering effects that would happen if low-numbered goals were processed first.<br>\nLarry</p>",
        "id": 294741668,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661191789
    },
    {
        "content": "<p>From: Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt;<br>\nHere is some text from the \"implementation\" manual, referring e.g. to<br>\nALLGOALS:</p>\n<p>\"\"\"<br>\nSuppose that the goal state has n ≥ 0 subgoals. Many of these tacticals<br>\naddress subgoal ranges counting downwards from n towards 1. This has the<br>\nfortunate effect that newly emerging subgoals are concatenated in the<br>\nresult, without interfering each other. Nonetheless, there might be<br>\nsituations where a different order is desired.<br>\n\"\"\"</p>\n<p>Similarly for MRS and OF.</p>\n<p>Makarius</p>",
        "id": 294742259,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661192016
    }
]