[
    {
        "content": "<p>From: Peter Achten &lt;<a href=\"mailto:P.Achten@cs.ru.nl\">P.Achten@cs.ru.nl</a>&gt;</p>\n<hr>\n<p>2ND C A L L   F O R   P A P E R S<br>\n                       ---------------------------------</p>\n<p>======== TFP 2014 ===========</p>\n<p>15th Symposium on Trends in Functional Programming<br>\nMay 26-28, 2014<br>\nUtrecht University<br>\nSoesterberg, The Netherlands<br>\n<a href=\"http://www.cs.uu.nl/wiki/TFP2014/WebHome\">http://www.cs.uu.nl/wiki/TFP2014/WebHome</a></p>\n<p>*** Submission for TFP 2014 is now open: please direct your browser to<br>\n*** <a href=\"http://www.cs.uu.nl/wiki/TFP2014/PaperSubmission\">http://www.cs.uu.nl/wiki/TFP2014/PaperSubmission</a></p>\n<p>The symposium on Trends in Functional Programming (TFP) is an international<br>\nforum for researchers with interests in all aspects of functional <br>\nprogramming,<br>\ntaking a broad view of current and future trends in the area. It aspires to<br>\nbe a lively environment for presenting the latest research results, and <br>\nother<br>\ncontributions (see below), described in draft papers submitted prior to the<br>\nsymposium. A formal post-symposium refereeing process then selects a subset<br>\nof the articles presented at the symposium and submitted for formal<br>\npublication.</p>\n<p>Selected revised papers will be published as a Springer Lecture Notes in<br>\nComputer Science (LNCS) volume.</p>\n<p>TFP 2014 will be the main event of a pair of functional programming events.<br>\nThe other is the International Workshop on Trends in Functional Programming<br>\nin Education (TFPIE). TFPIE will take place on May 25th. Its website is <br>\nlocated<br>\nat <a href=\"http://www.cs.uwyo.edu/~jlc/tfpie14/\">http://www.cs.uwyo.edu/~jlc/tfpie14/</a></p>\n<p>The TFP symposium is the heir of the successful series of Scottish <br>\nFunctional<br>\nProgramming Workshops. Previous TFP symposia were held in<br>\nEdinburgh (Scotland) in 2003, in Munich (Germany) in 2004,<br>\nin Tallinn (Estonia) in 2005, in Nottingham (UK) in 2006,<br>\nin New York (USA) in 2007, in Nijmegen (The Netherlands) in 2008,<br>\nin Komarno (Slovakia) in 2009, in Oklahoma (USA) in 2010, in Madrid <br>\n(Spain) in<br>\n2011, St. Andrews (UK) in 2012 and Provo (Utah, USA) in 2013.<br>\nFor further general information about TFP please see the TFP homepage.</p>\n<p>INVITED SPEAKERS</p>\n<p>TFP is pleased to announce talks by the following two invited speakers:</p>\n<p>John Hughes of Chalmers, Goteborg, Sweden, is well-known as author of<br>\nWhy Functional Programming Matters, and as one of the designers of <br>\nQuickCheck<br>\n(together with Koen Claessen); the paper on QuickCheck won the<br>\nICFP Most Influential Paper Award in 2010. Currently he divides his time <br>\nbetween<br>\nhis professorship and Quviq, a company that performs property-based <br>\ntesting of<br>\nsoftware with a tool implemented in Erlang.</p>\n<p>Dr. Geoffrey Mainland received his PhD from Harvard University where he was<br>\nadvised by Greg Morrisett and Matt Welsh. After a two year postdoc with the<br>\nProgramming Principles and Tools group at Microsoft Research Cambridge, <br>\nhe is<br>\nnow an assistant professor at Drexel University. His research focuses on<br>\nhigh-level programming language and runtime support for non-general purpose<br>\ncomputation.</p>\n<p>SCOPE</p>\n<p>The symposium recognizes that new trends may arise through various routes.<br>\nAs part of the Symposium's focus on trends we therefore identify the<br>\nfollowing five article categories. High-quality articles are solicited <br>\nin any<br>\nof these categories:</p>\n<p>Research Articles: leading-edge, previously unpublished research work<br>\n     Position Articles: on what new trends should or should not be<br>\n     Project Articles: descriptions of recently started new projects<br>\n     Evaluation Articles: what lessons can be drawn from a finished project<br>\n     Overview Articles: summarizing work with respect to a trendy subject</p>\n<p>Articles must be original and not submitted for simultaneous publication to<br>\nany other forum. They may consider any aspect of functional programming:<br>\ntheoretical, implementation-oriented, or more experience-oriented.<br>\nApplications of functional programming techniques to other languages are<br>\nalso within the scope of the symposium.</p>\n<p>Topics suitable for the symposium include:</p>\n<p>Functional programming and multicore/manycore computing<br>\n     Functional programming in the cloud<br>\n     High performance functional computing<br>\n     Extra-functional (behavioural) properties of functional programs<br>\n     Dependently typed functional programming<br>\n     Validation and verification of functional programs<br>\n     Using functional techniques to reason about <br>\nimperative/object-oriented programs<br>\n     Debugging for functional languages<br>\n     Functional programming in different application areas:<br>\n       security, mobility, telecommunications applications, embedded <br>\nsystems,<br>\n       global computing, grids, etc.<br>\n     Interoperability with imperative programming languages<br>\n     Novel memory management techniques<br>\n     Program analysis and transformation techniques<br>\n     Empirical performance studies<br>\n     Abstract/virtual machines and compilers for functional languages<br>\n     (Embedded) domain specific languages<br>\n     New implementation strategies<br>\n     Any new emerging trend in the functional programming area</p>\n<p>If you are in doubt on whether your article is within the scope of TFP,<br>\nplease contact the TFP 2014 program chair, Jurriaan Hage at <a href=\"mailto:J.Hage@uu.nl\">J.Hage@uu.nl</a>.</p>\n<p>BEST PAPER AWARDS</p>\n<p>To reward excellent contributions, TFP awards a prize for the best paper<br>\naccepted for the formal proceedings.</p>\n<p>TFP traditionally pays special attention to research students,<br>\nacknowledging that students are almost by definition part of new subject<br>\ntrends. A student paper is one for which the authors state that the paper<br>\nis mainly the work of students, the students are listed as first authors,<br>\nand a student would present the paper. A prize for the best student paper<br>\nis awarded each year.</p>\n<p>In both cases, it is the PC of TFP that awards the prize.<br>\nIn case the best paper happens to be a student paper, that paper will then<br>\nreceive both prizes.</p>\n<p>SPONSORS</p>\n<p>TFP is financially supported by NWO (Netherlands Organisation for <br>\nScientific<br>\nResearch), Well-Typed and Erlang Solutions.</p>\n<p>PAPER SUBMISSIONS</p>\n<p>Acceptance of articles for presentation at the symposium is based on a<br>\nlightweight peer review process of extended abstracts (4 to 10 pages in<br>\nlength) or full papers (16 pages). The submission must clearly indicate<br>\nwhich category it belongs to: research, position, project, evaluation,<br>\nor overview paper. It should also indicate whether the main author or<br>\nauthors are research students. In the case of a FULL STUDENT paper, the<br>\ndraft paper will receive additional feedback by one of the PC members <br>\nshortly<br>\nafter the symposium has taken place.</p>\n<p>We use EasyChair for the refereeing process.</p>\n<p>IMPORTANT DATES</p>\n<p>Submission of draft papers:    March 17,      2014<br>\nNotification:                  March 24,      2014<br>\nRegistration:                  April 7,       2014<br>\nTFP Symposium:                 May 26-28,     2014<br>\nStudent papers feedback:       June 9th,      2014<br>\nSubmission for formal review:  July 1st,      2014<br>\nNotification of acceptance:    September 8th, 2014<br>\nCamera ready paper:            October 8th,   2014</p>\n<p>PROGRAM COMMITTEE</p>\n<p>Peter Achten                    Radboud University Nijmegen<br>\nEmil Axelsson                    Chalmers<br>\nLucilia Camarao de Figueiredo  Universidade Federal de Ouro Preto<br>\nLaura Castro                    University of A Coruna<br>\nFrank Huch Christian-Albrechts-University of Kiel<br>\nMatthew Fluet                    Rochester Institute of Technology<br>\nJurriaan Hage (chair)           University of Utrecht<br>\nYukiyoshi Kameyama            University of Tsukuba<br>\nAndrew Kennedy                 Microsoft Research<br>\nTamas Kozsik                   Eotvos Lorand University<br>\nBen Lippmeier                    University of New South Wales<br>\nLuc Maranget                   INRIA<br>\nJay McCarthy (co-chair)        Brigham Young University<br>\nMarco T. Morazan               Seton Hall University<br>\nRicardo Pena                   Universidad Complutense de Madrid<br>\nAlexey Rodriguez               LiquidM<br>\nSven-Bodo Scholz               Heriot-Watt University<br>\nManuel Serrano                 INRIA Sophia Antipolis<br>\nSimon Thompson                 University of Kent<br>\nTarmo Uustalu                  Inst of Cybernetics<br>\nDavid Van Horn                 University of Maryland<br>\nJanis Voigtlaender             University of Bonn</p>",
        "id": 294264357,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660915566
    }
]