[
    {
        "content": "<p>From: \"Yannick Duchêne (Hibou57 )\" &lt;<a href=\"mailto:yannick_duchene@yahoo.fr\">yannick_duchene@yahoo.fr</a>&gt;<br>\nHi all,</p>\n<p>Please, someone can help to understand some words in<br>\n<a href=\"http://tumb1.biblio.tu-muenchen.de/publ/diss/in/2002/wenzel.pdf\">http://tumb1.biblio.tu-muenchen.de/publ/diss/in/2002/wenzel.pdf</a> ?</p>\n<p>Page 27 (printed 12), these words:</p>\n<p>“For example, existing formalizations of linear and modal<br>\n    logics simulate sequent-calculus rules within the pure<br>\n    natural deduction framework, which would result in slightly<br>\n    impractical Isar proof texts.”</p>\n<p>Well, I simply don't understand what I quoted above.</p>\n<p>What does it mean? An example?</p>\n<p>If I ever have other questions from the same document, I will post it in  <br>\nthis thread.</p>",
        "id": 294221810,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660897897
    },
    {
        "content": "<p>From: Elsa L Gunter &lt;<a href=\"mailto:egunter@illinois.edu\">egunter@illinois.edu</a>&gt;<br>\nIn Natural Deduction, one has a system of proof rules for constructing <br>\nproof trees for provable propositions.   These trees are associated with <br>\na \"discharge\" function labeling where in the proofs assumptions (open <br>\nleaves of the tree) are used.  The rule for implication introduction is <br>\nusually written</p>\n<p>A<br>\n        :<br>\n        :<br>\n       B<br>\n    -------<br>\n    A --&gt; B</p>\n<p>meaning that in the construction of the proof tree of B, there are zero <br>\nor more occurrences of the assumption A (as leaves of the tree) that may <br>\nbe assigned to be discharged at this node of the proof tree.<br>\nthe discharge function may only discharge in accordance with rules <br>\nallowing it.  Thus, among other things, an assumption can only be <br>\ndischarged at a node that has the assumption as the end of a branch from <br>\nthat node.    Assumptions</p>\n<p>The rules come in two forms: introduction and elimination.  The rule <br>\nabove is the introduction rule for implication.  The elimination rule <br>\nfor implication is</p>\n<p>Q<br>\n                       :<br>\n                       :<br>\n  P -&gt; Q    P    R</p>\n<hr>\n<p>R</p>\n<p>A proof tree is incomplete unless all assumptions are discharged <br>\nsomewhere in the tree.  For example, from these we may build the <br>\nfollowing (incomplete) proof tree:</p>\n<p>-------             ---<br>\nA --&gt; B       A      B<br>\n  --------------------(Imp elim, discharging B to prove B)<br>\n                 B<br>\n--------------------(Imp intro, discharging (A --&gt; B)<br>\n(     A --&gt; B)  --&gt; B</p>\n<p>This proof is incomplete because nowhere have we discharged A.  It can <br>\nbe understood as saying \"if we know A, then we know (A --&gt; B)  --&gt; B.  <br>\nIt can be completed as follows:</p>\n<p>-------    ---    ---<br>\nA --&gt; B       A      B<br>\n  --------------------(Imp elim, discharging B to prove B)<br>\n                 B<br>\n    ---------------(Imp intro, discharging (A --&gt; B)<br>\n     (A --&gt; B)  --&gt; B<br>\n---------------------(Imp intro, discharging A)<br>\nA --&gt; ((A --&gt; B) --&gt; B)</p>\n<p>A bit more infrastructure is needed to deal with variables if your logic <br>\nhas quantifiers.</p>\n<p>Sequent calculi are a different style of describing provability.  <br>\nInstead of proving propositions, one proves sequents.  A sequent is a <br>\npair of collections of propositions, and may be thought of a asserting <br>\n\"if everything on the right is true, then something on the left is true\".</p>\n<p>The rules for a sequent calculus usually include a collection of rules <br>\nfor introducing operations on the left collection, a set of rules for <br>\nintroducing operations on the right collection, a rule (often called <br>\naxiom) for introducing assumptions, and the \"cut\" rule.  The \"axiom\" rule is</p>\n<hr>\n<p>A  |- A</p>\n<p>The cut rule is frequently given as</p>\n<p>Gamma |-  Delta, A    Sigma, A |- D1, ..., Dj</p>\n<hr>\n<p>B1,..., Bm, C1, ..., Ca, Cb, ..., Ck  |- A1 ,...Aa, Ab,..., An, D1, <br>\n..., Dj</p>\n<p>Sample Left and RIght rules are</p>\n<p>Gamma |- A, Delta        Sigma, B, |- Pi<br>\n--------------------------------  (Left Implication)<br>\n  Gamma, Sigma, A --&gt; B |- Delta, Pi</p>\n<p>Gamma, A |- Delta, B<br>\n---------------------- (Right Implication)<br>\nGamma |- Delta, A --&gt; B</p>\n<p>In the above, A and B are propositions, while Gamma, Delta, Sigma, and <br>\nPi are collections of propositions.<br>\nVarious flavours arise depending upon whether the collection is a set, <br>\nlist or multiset.  For example, intuitionistic logic restricts the <br>\ncollection on the right to having just one element.  On can encode <br>\nsequent calculi in a natural deduction system by introducing an explicit <br>\npredicate \"provable\" taking a pair of collections, with an inductive <br>\nrelation definition following the sequent rules.</p>\n<p>Linear logic is a variant of logic having \"linear\" connectives, <br>\nrestricting the \"use\" of propositions in proofs (linear implication can <br>\nonly discharge a single instance of an assumption, for example).</p>\n<p>Modal logics introduce \"modality\" operators including Box and Diamond.  <br>\nBox may be read as \"it is necessarily the case that\" and Diamond may be <br>\nread as \"it is possible that\".   Temporal logics can by and large be <br>\nviewed as an outgrowth of modal logic.</p>\n<p>I hope this gives you a little better idea of what is being said in the <br>\nsection of Wenzel's thesis you were trying to read.  For a little more <br>\nin depth discussion, you might try the Wikipedia entries; they're not <br>\ntoo bad.<br>\n---Elsa<br>\nPS.  I apologize for any and all typos and other gaffs in the above <br>\ndescription.  I have not proofread it carefully.  If you find anything <br>\nconfusing, please ask for clarification.</p>",
        "id": 294221906,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660897932
    }
]