[
    {
        "content": "<p>From: Barbara Sprick &lt;<a href=\"mailto:sprick@mais.informatik.tu-darmstadt.de\">sprick@mais.informatik.tu-darmstadt.de</a>&gt;<br>\nVacancies for PhD and Post Doc Positions in Theoretical CS<br>\n======================================================================</p>\n<p>The Technische Universität Darmstadt is one of Germany's top technical<br>\nuniversities with an outstanding nation-wide and international<br>\nreputation in research and education.  The chair Modeling and Analysis<br>\nof Information Systems (brief: MAIS, chair holder: Prof. Dr. Heiko<br>\nMantel) was founded in 2007 as part of Theoretical Computer Science.<br>\nCurrently, the MAIS group is offering</p>\n<p>Positions for PhD-Students and Post Docs<br>\n            (Doktoranden- und PostDocstellen)</p>\n<p>Our goal is to make information systems more trustworthy (i.e., correct,<br>\nsafe, and secure) than they are today. As software engineering is a<br>\ncomplex and error-prone task, we see the need for applying formal<br>\nmethods for reasoning about information systems and critical system<br>\nproperties.<br>\nOur activities include the advancement of theoretical<br>\nfoundations, the development of methods and tools, and the application<br>\nof our ideas in practice. In this context, we are looking for applicants<br>\nwho are interested in formal approaches for information security, in<br>\nparticular in any of the following areas: information flow security,<br>\nstatic and dynamic program analysis and foundations of stepwise software<br>\nengineering.<br>\nAs a suitable candidate, you hold a Master's degree (or equivalent) in<br>\nComputer Science or Mathematics. For all our research topics, a solid<br>\nbackground in formal methods or logic is required.</p>\n<p>More information about the positions is available at<br>\n<a href=\"http://www.mais.informatik.tu-darmstadt.de/Positions.html\">http://www.mais.informatik.tu-darmstadt.de/Positions.html</a><br>\nIn case of further questions, please contact us by email:<br>\n&lt;<a href=\"mailto:mantel@mais.informatik.tu-darmstadt.de\">mantel@mais.informatik.tu-darmstadt.de</a>&gt;</p>\n<p>Deadline for applications is the 15th of April 2010. However, we will<br>\nconsider applications until the position is filled.</p>",
        "id": 294103592,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660834534
    }
]