[
    {
        "content": "<p>From: Herman Geuvers &lt;<a href=\"mailto:herman@cs.ru.nl\">herman@cs.ru.nl</a>&gt;<br>\nJob description<br>\nThe aim of the FORMATH project(<a href=\"http://www.formath.cs.ru.nl\">http://www.formath.cs.ru.nl</a>) is to<br>\ndevelop libraries of formalized mathematics concerning algebra, linear<br>\nalgebra, real number computation, and algebraic topology:<br>\nThese libraries will be structured as software components, relying on<br>\nSsreflect, which has proved its worth in the formal proof of the four<br>\ncolour theorem, and to address topics that were mostly left untouched<br>\nby previous research in formal proofs or formal methods.</p>\n<p>This work concerns formally proved algorithms for solving problems in<br>\nreal arithmetics, solving problems in ordinary differential equations,<br>\nor solving problems in algebraic topology.<br>\nOur methodology is a combination of theoretical research and<br>\ntechnological development. The main tools will be provided by the<br>\nMathematical Components project, for instance the Ssreflect library<br>\nfor Coq proof assistants.</p>\n<p>The four partners in the EU ForMath project are:</p>\n<ul>\n<li>Goteborg;</li>\n<li>INRIA;</li>\n<li>Nijmegen;</li>\n<li>La Roja.</li>\n</ul>\n<p>More specifically, as a PhD student at the Nijmegen location you will<br>\nwork on Work package 4;</p>\n<ul>\n<li>Real number computation and basic numerical analysis;</li>\n<li>The use of exact real number computation to prove inequalities.</li>\n</ul>\n<p>The objective is specification and implementation of a simple ODE<br>\nsolver. Potential fields of applications include robotics and hybrid<br>\nsystems.</p>\n<p>Requirements<br>\nYou should meet the following requirements:</p>\n<ul>\n<li>\n<p>A master's degree (or equivalent) in Computer Science, Mathematics<br>\nor a related field, with a strong interest in proof assistants, type<br>\ntheory, functional programming, constructive analysis and numerical<br>\nanalysis;</p>\n</li>\n<li>\n<p>Commitment and a cooperative attitude;</p>\n</li>\n<li>Excellent proficiency in written and spoken English.</li>\n</ul>\n<p>Organization<br>\nThe Radboud University Nijmegen is one of the leading academic<br>\ncommunities in the Netherlands. Renowned for its green campus, modern<br>\nbuildings, and state-of-the-art equipment, it has nine faculties and<br>\nenrols over 17.500 students in approximately 90 study programmes. The<br>\nuniversity is situated in the oldest Dutch city, close to the German<br>\nborder, on the banks of the river Waal (a branch of the Rhine). The<br>\ncity has a rich history and one of the liveliest city centres in the<br>\nNetherlands.<br>\nThe section Intelligent Systems of the Institute for Computing and<br>\nInformation Sciences (ICIS) at the Radboud University Nijmegen studies<br>\nmathematical theories concerned with computability, provability and<br>\ncomplexity. Notably, the group studies type theory, lambda calculus<br>\nand logic and also applies these theories in the area of theorem<br>\nproving and formalizing mathematics.<br>\nThe group has an excellent international reputation which was<br>\nsupported by the last national research assessment.<br>\nWebsite: <a href=\"http://www.cs.ru.nl\">http://www.cs.ru.nl</a></p>\n<p>Conditions of employment<br>\nEmployment: 1,0 fte<br>\nMaximum salary per month, based on a fulltime employment: € 2,612 gross/month<br>\nStarting at € 2,042 per month, the salary will increase to € 2,612 per<br>\nmonth in the fourth year.<br>\nPhD scale.</p>\n<p>Additional conditions of employment<br>\nYou will be appointed as a PhD student for a period of four years.<br>\nYour performance will be evaluated after 18 months. If the evaluation<br>\nis positive, the contract will be extended by 2.5 years.</p>\n<p>Additional Information<br>\nBas Spitters<br>\nTelephone: +31 24 3652611<br>\nE-mail: <a href=\"mailto:spitters@cs.ru.nl\">spitters@cs.ru.nl</a><br>\nTelephone: +31 24 3652104</p>\n<p>Application<br>\nYou can apply for the job (mention the vacancy number 62.52.09) before<br>\n1 February 2010 by sending your application -preferably by email- to:</p>\n<p>RU Nijmegen, FNWI, P&amp;O, mrs. D. Reinders<br>\nP.O. Box 9010, 6500 GL Nijmegen, NL<br>\nTelephone: +31 24 3652027<br>\nE-mail: <a href=\"mailto:pz@science.ru.nl\">pz@science.ru.nl</a><br>\n<a href=\"http://www.ru.nl/vacaturedetails?recid=497982\">http://www.ru.nl/vacaturedetails?recid=497982</a></p>",
        "id": 294097909,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660832882
    }
]