[
    {
        "content": "<p>From: Brian Huffman &lt;<a href=\"mailto:brianh@cs.pdx.edu\">brianh@cs.pdx.edu</a>&gt;<br>\nSometimes the simplifier produces a warning message that looks like this:</p>\n<h3>Simplifier: renamed bound variable \":000\" to \":000a\"</h3>\n<p>Should I care?</p>\n<p>If it is important, what does this message mean---does it indicate a problem?</p>\n<p>If it is <em>not</em> important, why is this message printed at all? (Or at<br>\nleast, why is it printed even when the debugging flag is not turned<br>\non?)</p>\n<ul>\n<li>Brian</li>\n</ul>",
        "id": 294101737,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660833976
    },
    {
        "content": "<p>From: Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt;<br>\nThis message indicates a situation where some Simplifier component <br>\n(simproc, looper, solver, or similar) does not observe the proof context.</p>\n<p>When simplifying abstractions, fresh variables need to be invented -- the <br>\n\"bounds\" part of the simpset records already used auxiliary variables. <br>\nSometimes this information is lost, because some tool restarts <br>\nsimplification in an empty context (in ancient days tools could work from <br>\nthe background theory alone). The Simplifier is smart enough to detect the <br>\nclash and tries to repair it, which appears to work in most situations.</p>\n<p>At some point I would like to see these remaining holes in existing proof <br>\ntools being filled.  Although there is no immediate problem, this is a bit <br>\nstrange -- just like plugging the power cord to switch off a computer <br>\ninstead of a clean shutdown.</p>\n<p>Makarius</p>",
        "id": 294101760,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660833982
    },
    {
        "content": "<p>From: Brian Huffman &lt;<a href=\"mailto:brianh@cs.pdx.edu\">brianh@cs.pdx.edu</a>&gt;<br>\nOn Wed, Feb 17, 2010 at 12:20 PM, Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt; wrote:</p>\n<blockquote>\n<p>On Wed, 17 Feb 2010, Brian Huffman wrote:</p>\n<blockquote>\n<p>Sometimes the simplifier produces a warning message that looks like this:</p>\n<h3>Simplifier: renamed bound variable \":000\" to \":000a\"</h3>\n<p>Should I care?</p>\n<p>If it is important, what does this message mean---does it indicate a<br>\nproblem?</p>\n<p>If it is <em>not</em> important, why is this message printed at all? (Or at<br>\nleast, why is it printed even when the debugging flag is not turned on?)</p>\n</blockquote>\n<p>This message indicates a situation where some Simplifier component (simproc,<br>\nlooper, solver, or similar) does not observe the proof context.<br>\n...<br>\nAt some point I would like to see these remaining holes in existing proof<br>\ntools being filled.  Although there is no immediate problem, this is a bit<br>\nstrange -- just like plugging the power cord to switch off a computer<br>\ninstead of a clean shutdown.</p>\n</blockquote>\n<p>If I understand you correctly, the \"renamed bound variable\" message<br>\nindicates a problem in the <em>implementation</em> of some part of the<br>\nsimplifier. So the message is only potentially useful to developers,<br>\nand not ordinary users.</p>\n<p>With this in mind, I ask again: Why is the message printed when the<br>\ndebugging flag is not set?</p>\n<p>Maybe this is better phrased as a feature request: I would like<br>\nIsabelle to refrain from printing warning messages unless they provide<br>\nmeaningful information that users can act upon. Either the \"renamed<br>\nbound variable\" warning should be suppressed, or else it should tell<br>\nusers where to send a bug report. Otherwise, it is just noise.</p>\n<ul>\n<li>Brian</li>\n</ul>",
        "id": 294101774,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660833988
    },
    {
        "content": "<p>From: Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt;<br>\nOn Wed, 17 Feb 2010, Brian Huffman wrote:</p>\n<blockquote>\n<p>If I understand you correctly, the \"renamed bound variable\" message <br>\nindicates a problem in the <em>implementation</em> of some part of the <br>\nsimplifier. So the message is only potentially useful to developers, and <br>\nnot ordinary users.</p>\n</blockquote>\n<p>No, it indicates that the Simplifier has just repaired a problem <br>\nintroduced in user space, notably one of these Simplifier plugins that can <br>\nbe defined in the library.  Since the main library in question is actually <br>\nmain HOL, one could nonetheless argue that it is somehow relevant to <br>\ndevelopers.</p>\n<blockquote>\n<p>I would like Isabelle to refrain from printing warning messages unless <br>\nthey provide meaningful information that users can act upon.</p>\n</blockquote>\n<p>I am usually trying hard to keep messages relevant, and fight spam <br>\nwherever possible, although this often seems futile.  As messages are <br>\ncleaned up here, new ones emerge there.</p>\n<p>Concerning this particular message, I would not just switch it of because <br>\nit is an important reminder that certain things in HOL still need to be <br>\nsorted out.  Maybe you can help looking through all the simprocs ...</p>\n<p>Makarius</p>",
        "id": 294101797,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660833994
    }
]