[
    {
        "content": "<p>From: Dominic Mulligan via Cl-isabelle-users &lt;<a href=\"mailto:cl-isabelle-users@lists.cam.ac.uk\">cl-isabelle-users@lists.cam.ac.uk</a>&gt;<br>\nHi,</p>\n<p>I'm trying to use some more of the remote provers with sledgehammer in<br>\nIsabelle2016-1, but seem to be having trouble getting sledgehammer to<br>\npay any attention to my changes in the Plugins&gt;Plugin<br>\noptions&gt;Isabelle&gt;General dialog box.</p>\n<p>In particular, it seems that the default value in the Sledgehammer<br>\nProvers field in that dialog box is hardcoded, in that any changes to<br>\nthe default value of \"cvc4 z3 spass e remote_vampire\" are ignored by<br>\nIsabelle.  Expanding this field to e.g. \"cvc4 z3 spass e<br>\nremote_vampire remote_e remote_waldmeister\" has no effect whatsoever<br>\non sledgehammer's execution.</p>\n<p>Note also, in normal operation, despite the default value of that<br>\nfield, sledgehammer never seems to invoke remote_vampire, instead only<br>\ninvoking cvc4, spass, e, and z3.</p>\n<p>Further, modifying the contents of<br>\n$ISABELLE_HOME/src/HOL/Tools/etc/options does seem to have an effect,<br>\nin that the tooltip you obtain when hovering over the Sledgehammer<br>\nProvers field reflects the contents of that file (the field itself<br>\ndoes not change), but again does not seem to have any effect on<br>\nsledgehammer's execution.</p>\n<p>Note that manually setting the sledgehammer prover options at the<br>\npoint of invocation does work, as in:</p>\n<p>sledgehammer[provers=\"cvc4 z3 spass e remote_vampire remote_e<br>\nremote_waldmeister remote_iprover remote_snark\"]</p>\n<p>correctly invokes all listed theorem provers on a problem.  However, I<br>\nwould like to be able to set this option globally, rather than having<br>\nto type out a massive string at every use of sledgehammer.</p>\n<p>Is there a way around this problem?  (I first noticed the problem in<br>\nIsabelle-2016, before trying to upgrade to Isabelle2016-1 this<br>\nmorning, where it persists).</p>\n<p>Thanks,<br>\nDominic</p>",
        "id": 294708112,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661181277
    }
]