[
    {
        "content": "<p>From: Klaus Schneider &lt;<a href=\"mailto:Klaus.Schneider@informatik.uni-kl.de\">Klaus.Schneider@informatik.uni-kl.de</a>&gt;<br>\n20th International Conference on Theorem Proving in Higher Order Logics<br>\nKaiserslautern, Germany, 11-13 September 2007<br>\n<a href=\"http://rsg.informatik.uni-kl.de/TPHOLs-2007\">http://rsg.informatik.uni-kl.de/TPHOLs-2007</a></p>\n<p>Call for Papers</p>\n<p>The 2007 International Conference on Theorem Proving in Higher Order<br>\nLogics will be the twentieth in a series that dates back to 1988. The<br>\nconference will be held in Kaiserslautern, Germany, on 11-13 September<br>\n2007.</p>\n<p>Topics</p>\n<p>The programme committee welcomes submissions on all aspects of theorem<br>\nproving in higher order logics, and on related topics in theorem proving<br>\nand verification. This includes, but is not limited to, the following<br>\ntopics:</p>\n<p>* Formal semantics of specification, modelling, and programming<br>\n    languages: formal synthesis, validated compilation, formal design<br>\n    flows.</p>\n<p>* Specification and verification of hardware: microprocessors, memory<br>\n    systems, buses, pipelines etc.</p>\n<p>* Specification and verification of software: program verification,<br>\n    refinement, and synthesis for functional, declarative and imperative<br>\n    languages; proof carrying code.</p>\n<p>* Formalisation of mathematical theories.<br>\n  * Advances in theorem prover technology: proof automation and decision<br>\n    procedures, induction, combination of deductive and algorithmic<br>\n    approaches, incorporation of theorem provers into larger systems,<br>\n    combination of theorem provers with other provers and tools.</p>\n<p>* Industrial application of theorem provers.<br>\n  * Proof Pearls: concise and elegant presentations of interesting<br>\n    examples.</p>\n<p>* Other topics, including: security algorithms, properties, and<br>\n    policies; specification and requirements analysis of systems; user<br>\n    interfaces for theorem provers; development and extension of higher<br>\n    order logics.</p>\n<p>Submission</p>\n<p>Submissions are invited in the following categories:</p>\n<p>* Category A: Full research paper<br>\n  * Category B: Emerging trends</p>\n<p>Submissions under category A will be fully refereed, and accepted papers<br>\nwill be published as a volume of Springer-Verlag's Lecture Notes in<br>\nComputer Science series, which will be available at the conference.<br>\nAuthors of accepted papers are expected to present their work at the<br>\nconference. Submissions should be no more than 16 pages in length and<br>\nshould be written using LaTeX2e and the LNCS style file.</p>\n<p>Submissions under category B will not be formally refereed, but their<br>\ncontent and relevance will be reviewed. Those submissions accepted will be<br>\npublished in a technical report of the University of Kaiserslautern, which<br>\nwill be available at the conference. Authors of accepted papers are<br>\nexpected to present a brief outline of their work at the conference and to<br>\nprepare a poster for display at the conference venue. Papers should be no<br>\nmore than 16 pages in length and should be written using LaTeX2e and the<br>\nLNCS style file. Unless otherwise requested, submissions rejected under<br>\ncategory A will also be considered for inclusion under category B.</p>\n<p>Important Dates</p>\n<p>Please note that the following deadlines are strict. Due to a tight<br>\nschedule, no further extension can be given.</p>\n<p>Category A</p>\n<p>* Submission deadline: 23 Mar 2007<br>\n  * Notification of acceptance: 25 May 2007<br>\n  * Camera-ready copy due: 08 Jun 2007</p>\n<p>Category B</p>\n<p>* Submission deadline: 18 May 2007<br>\n  * Notification of acceptance: 25 Jun 2007<br>\n  * Camera-ready copy due: 27 Jul 2007</p>",
        "id": 294046025,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660817312
    }
]