[
    {
        "content": "<p>From: Freek Wiedijk &lt;<a href=\"mailto:freek@cs.ru.nl\">freek@cs.ru.nl</a>&gt;<br>\n1 POSTDOC and 1 PHD POSITION in the MathWiki project</p>\n<p>at Radboud University Nijmegen (NL)</p>\n<p><a href=\"http://www.fnds.cs.ru.nl/fndswiki/Vacancies\">http://www.fnds.cs.ru.nl/fndswiki/Vacancies</a></p>\n<p>The Institute for Computing and Information Science of the Radboud  <br>\nUniversity Nijmegen (NL) is looking for 2 researchers to work on the NWO <br>\nproject \"MathWiki a Web-based Collaborative Authoring Environment for <br>\nFormal Proofs\".</p>\n<p>The vacancies are:</p>\n<ul>\n<li>\n<p>a POSTDOC for the period of 3 years<br>\nvacancy number: 62-16-09</p>\n</li>\n<li>\n<p>a PHD POSITION for the period of 4 years<br>\nvacancy number: 62-17-09</p>\n</li>\n</ul>\n<p>AIMS OF THE PROJECT<br>\n===================<br>\nThe aim of the MathWiki project is to open up to a wider community the <br>\nrich collections of knowledge stored in the repositories of proof <br>\nassistants.</p>\n<p>To this end we will build a web-based collaborative authoring <br>\nenvironment for formal mathematics, the MathWiki system. This system <br>\nwill provide interactive web access through a standardized interface to <br>\na number of proof assistants. The MathWiki system will also be a <br>\nplatform for the development of formal proofs within those proof <br>\nassistants and it will provide high level access (through Wikipedia-like <br>\nweb pages) to their repositories of formalised mathematics. These <br>\nrepositories will reside on the server.</p>\n<p>In the project we will study and further develop Wiki technology and <br>\nsemantic web technology, all in the context of proof assistant <br>\nrepositories of formalized mathematics. The project thus brings together <br>\nthe open nature of Wiki authoring with expertise in Proof Assistants and <br>\nSemantic Web technologies to build a new Wiki for mathematics, <br>\nsupporting content creation, search and retrieval.</p>\n<blockquote>\n<p>From the perspective of the ordinary user of mathematics, MathWiki will <br>\nbe important because it will provide high-level mathematical content on <br>\nthe web in a much more coherent and precise way than is available at <br>\npresent.</p>\n</blockquote>\n<blockquote>\n<p>From the proof assistant user perspective, MathWiki will be important <br>\nbecause it will provide an advanced environment for the collaborative <br>\nauthoring of verified mathematics, mediated simply by a web interface.</p>\n</blockquote>\n<p>The MathWiki system will be based on our existing experience with proof <br>\nassistant technology on the web, the \"ProofWeb\" systems, see <br>\nhttp:://prover.cs.ru.nl</p>\n<hr>\n<p>Requirements for the PhD student position:</p>\n<ul>\n<li>\n<p>A master's (or equivalent) degree in Computer Science, Mathematics or <br>\na related field, with a strong interest in proof assistants  and/or <br>\nsemantic web technology (preferably both)</p>\n</li>\n<li>\n<p>Commitment and a cooperative attitude.</p>\n</li>\n<li>Very good written and oral English skills.</li>\n</ul>\n<p>Requirements for the Postdoc position:</p>\n<ul>\n<li>\n<p>A PhD in Computer Science, Mathematics, or a related field with <br>\nexpertise in proof assistants and/or semantic web technology (preferably <br>\nboth).</p>\n</li>\n<li>\n<p>A strong publication record.</p>\n</li>\n<li>Commitment and a cooperative attitude.</li>\n<li>Very good written and oral English skills.</li>\n</ul>\n<hr>\n<p>Conditions of employment:</p>\n<p>The PhD students will be employed for a period of 4 years (40 hrs/week). <br>\nThe Postdocs will be employed for a period of 3 years (40 hrs/week). <br>\nSupervision for the projects will be done by Prof. Dr. Herman Geuvers <br>\nand Dr. F. Wiedijk</p>\n<p>Postdoc and PhD student will be appointed by the Radboud University <br>\nNijmegen. Both positions shall start before October 1 2009, but <br>\npreferably earlier.</p>\n<p>The salary for the PhD position starts at 2042 Euro per month, <br>\nincreasing to 2612 Euro per month in the fourth year.</p>\n<p>The maximum salary for the Postdoc is 3755 Euro per month (salary scale <br>\n10).</p>\n<hr>\n<p>Information:</p>\n<p>For more information, see <a href=\"http://www.fnds.cs.ru.nl/fndswiki/Vacancies\">http://www.fnds.cs.ru.nl/fndswiki/Vacancies</a>.<br>\nFor inquiries about the project and its positions, please contact the <br>\nproject leader Prof. Dr. Herman Geuvers (<a href=\"mailto:H.Geuvers@cs.ru.nl\">H.Geuvers@cs.ru.nl</a>, +31 <br>\n243652603). Interested candidates can ask the project leader for the <br>\ncomplete project application text.</p>\n<hr>\n<p>Application:</p>\n<p>Deadline for application is May 1, 2009.</p>\n<p>Send an application letter with CV and 3 references, mentioning the<br>\nvacancy number by e-mail to</p>\n<p>RU Nijmegen, FNWI, P&amp;O<br>\nmrs. D. Reinders<br>\nPostbus 9010<br>\n6500 GL Nijmegen<br>\nNetherlands</p>\n<p>e-mail: <a href=\"mailto:pz@science.ru.nl\">pz@science.ru.nl</a><br>\ntelephone: +31 243652764</p>",
        "id": 294073840,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660828122
    }
]