[
    {
        "content": "<p>From: Peter Lammich &lt;<a href=\"mailto:lammich@in.tum.de\">lammich@in.tum.de</a>&gt;<br>\nHi</p>\n<p>I have roughly 100 theory files loaded, <br>\nand the IDE grays out every minute or so.</p>\n<p>Are there some options to make the IDE more responsive on my machine<br>\n(8virtual cores, 16GiB RAM)? Or is the IDE just not suited for those<br>\n(medium size) developments? </p>\n<p>As a workaround, I could make an even more fine-rained image-hierarchy,<br>\nwith is cumbersome to work with, especially when doing maintenance or<br>\ncleanup tasks, moving lots of stuff around, mostly into library theories<br>\n(which would be in the image then)</p>",
        "id": 294640755,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661161991
    },
    {
        "content": "<p>From: Gerwin Klein &lt;<a href=\"mailto:Gerwin.Klein@nicta.com.au\">Gerwin.Klein@nicta.com.au</a>&gt;<br>\nMy settings are</p>\n<p>JEDIT_JAVA_OPTIONS=\"-Xms256m -Xmx4096m -Xss4m”</p>\n<p>and I’ve so far been able to work fairly nicely with that on &gt; 60 files, many of them large.</p>\n<p>Going from 1GB max heap size to 4GB made a huge difference for jEdit (I had forgotten to set the max heap size on my laptop before and had fairly frequent gray-outs which just turned out to be Java garbage collecting).</p>\n<p>Cheers,<br>\nGerwin</p>\n<hr>\n<p>The information in this e-mail may be confidential and subject to legal professional privilege and/or copyright. National ICT Australia Limited accepts no liability for any damage caused by this email or its attachments.</p>",
        "id": 294640799,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661162010
    },
    {
        "content": "<p>From: Peter Lammich &lt;<a href=\"mailto:lammich@in.tum.de\">lammich@in.tum.de</a>&gt;<br>\nAfter writing the mail, I tested</p>\n<p>JEDIT_JAVA_OPTIONS=\"-Xms2048m -Xmx8192m -Xss8m\"<br>\nML_OPTIONS=\"-H 4000 --gcthreads 2\"</p>\n<p>without really knowing what I am doing.</p>\n<p>And it just grayed out again on ~80 files, but recovered after 2<br>\nminutes ...</p>",
        "id": 294640811,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661162016
    },
    {
        "content": "<p>From: Peter Lammich &lt;<a href=\"mailto:lammich@in.tum.de\">lammich@in.tum.de</a>&gt;<br>\nI can almost reliably produce a grayout as follows:</p>\n<p>1) Load a theory that depends on (roughly) 80 other theories. <br>\n2) Check it in the theories buffer (Alternatively, have it open in<br>\nanother window).<br>\n3) Go back to one of the dependent theories, and edit something there.</p>\n<p>During editing in step 3, I will, almost surely, get a grayout after a<br>\nfew seconds ...</p>\n<p>I find this really annoying, since it interferes with two very important<br>\nuse-patterns of mine:<br>\n  1) Maintenance: Load some theories with some lib changed, and try to<br>\nfix the errors, while the rest is, of course, processed in the<br>\nbackground.</p>\n<p>2) Working with multiple windows. If one window happens to show an<br>\nancestor theory of what I am currently editing, chances for grayout<br>\nincrease ...</p>\n<p>-- Peter</p>\n<p>p.s.: Currentyl using </p>\n<p>JEDIT_JAVA_OPTIONS=\"-Xms512m -Xmx4096m -Xss8m\"<br>\nML_OPTIONS=\"-H 4096 --gcthreads 2\"</p>\n<p>and the grayouts that I get do not recover within 5 minutes ...</p>",
        "id": 294640825,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661162022
    },
    {
        "content": "<p>From: Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt;<br>\nYou have 4 real cores, so you should use them for GC as well.  Without <br>\nthe --gcthreads you should get that already by default, since David <br>\nMatthews counts the physical threads, not the logical hyperthreads.</p>\n<p>I guess that most of the greyout time is for ML memory management.  On the <br>\nisabelle-users thread \"run-away Isabelle process\" started by Elsa Gunter <br>\n03-May-2015 there should be more hints what can be done to improve the <br>\nsituation -- the hardware side-conditions seem to be rather similar.</p>\n<p>Makarius</p>",
        "id": 294640861,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661162041
    }
]