[
    {
        "content": "<p>From: \"W. Douglas Maurer\" &lt;<a href=\"mailto:maurer@gwu.edu\">maurer@gwu.edu</a>&gt;<br>\nThis is a follow-up to my earlier post to this list concerning <br>\ninduction starting from 1 and beyond. I received a very helpful reply <br>\nto that post from Joachim Breitner, with an example which included <br>\nthe use of case_names. I am having the same problem with this that I <br>\nhave had with several other features of Isar: Where is it defined? <br>\nIt's not in the Isabelle/Isar Reference Manual; it's not in <br>\nProgramming and Proving in Isabelle/HOL; it's not in A Tutorial <br>\nIntroduction to Structured Isar Proofs; it's not in the Concrete <br>\nSemantics book. There are 74 examples of case_names in the 1768-page <br>\ndocument, \"Isabelle/HOL -- Higher-Order Logic\"; but examples are not <br>\nthe same thing as a definition. What is the syntax of a case name? <br>\nCan it be a two-digit number like 10 (which is forbidden for labels)? <br>\nCan it be like an identifier except that it starts with a digit (like <br>\n4Runner)? Can it include special characters, and, if so, which ones? <br>\nAnd so on. And I'm not so much interested in answers to those <br>\nspecific questions as I am in finding a syntax definition for <br>\ncase_names, preferably a syntax diagram like the ones in the <br>\nIsabelle/Isar Reference Manual, which have been very useful to me. (I <br>\nwas taught very early on that induction from examples is never enough <br>\n-- I was told that this is like the boy who decided that all cows are <br>\nbrown, because he'd seen several dozen cows, all of which were brown, <br>\nand he'd never seen a black one.) -WDMaurer</p>",
        "id": 294331050,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660930255
    },
    {
        "content": "<p>From: Christian Sternagel &lt;<a href=\"mailto:c.sternagel@gmail.com\">c.sternagel@gmail.com</a>&gt;<br>\nThe attribute \"case_names\" is documented in the reference manual.</p>\n<p>$ isabelle doc isar-ref</p>\n<p>search for \"case_names\" and on page 134 you will find a (short) description.</p>\n<p>In essence the attribute just allows you to choose your own names for <br>\ncases (which will be used by the \"induct/induction\" and \"cases\" methods).</p>\n<p>cheers</p>\n<p>chris</p>",
        "id": 294331073,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660930263
    },
    {
        "content": "<p>From: \"W. Douglas Maurer\" &lt;<a href=\"mailto:maurer@gwu.edu\">maurer@gwu.edu</a>&gt;<br>\nOK. I see the problem now. The problem is that at one point I was <br>\ntold that, when searching Isabelle/Isar documentation for something <br>\nincluding an underscore, I have to substitute a hyphen. Now I find <br>\nthat this is sometimes true and sometimes not. For \"Isabelle/HOL -- <br>\nHigher-Order Logic,\" it is true; for \"Isabelle/Isar Reference <br>\nManual,\" it's apparently not true. I was searching for case-names <br>\nwhen I should have been searching for case_names.</p>",
        "id": 294331202,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660930316
    },
    {
        "content": "<p>From: Lars Noschinski &lt;<a href=\"mailto:noschinl@in.tum.de\">noschinl@in.tum.de</a>&gt;<br>\nWhen looking for commands and the like, I usually prefer to scroll<br>\nthrought the index. Search has (or had) problems with ligatures in at<br>\nleast some pdf viewers, so I found this the most reliable method for my<br>\npurposes.</p>",
        "id": 294331249,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660930323
    },
    {
        "content": "<p>From: Christian Sternagel &lt;<a href=\"mailto:c.sternagel@gmail.com\">c.sternagel@gmail.com</a>&gt;<br>\nIndeed. I think some while ago this advice was true for all docu PDFs, <br>\nbut (I guess due to the confusion this caused) this was changed in more <br>\nrecent releases. I guess \"tutorial\" is an exception since it is somewhat <br>\noutdated (style-wise) but still a source of many nice examples.</p>\n<p>But guessing aside ;), you can always try the index first.</p>\n<p>cheers</p>\n<p>chris</p>",
        "id": 294331271,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660930329
    },
    {
        "content": "<p>From: Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt;<br>\nPDF is electronic paper, with some uncertainty of real paper.  Some PDF <br>\nviewers also use OCR to find things, but you never know 100% what it is.</p>\n<p>To make really sure, you can always search the formal sources in <br>\n$ISABELLE_HOME/src/Doc/Isar_Ref/.</p>\n<p>Makarius</p>",
        "id": 294331283,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660930338
    },
    {
        "content": "<p>From: Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt;<br>\nNo.  Talking about source files I was referring to the default Isabelle <br>\nsource editor, which is Isabelle/jEdit.  The above <br>\n$ISABELLE_HOME/src/Doc/Isar_Ref works literally in its file-dialog, even <br>\non Windows.</p>\n<p>See also the Isabelle/jEdit manual that is accessible in the application <br>\nitself, in the prominent Documentation panel.</p>\n<p>Makarius</p>",
        "id": 294331382,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660930372
    }
]