[
    {
        "content": "<p>From: \"Jared C. Davis\" &lt;<a href=\"mailto:jared@cs.utexas.edu\">jared@cs.utexas.edu</a>&gt;<br>\nACL2 2013<br>\n          International Workshop on the ACL2 Theorem Prover<br>\n                         and its Applications</p>\n<p>May 30-31, 2013 in Laramie, Wyoming, USA</p>\n<p><a href=\"http://www.cs.uwyo.edu/~ruben/acl2-13\">http://www.cs.uwyo.edu/~ruben/acl2-13</a></p>\n<p>2nd  CALL FOR PAPERS</p>\n<p>IMPORTANT DATES</p>\n<p>Abstract submission:        February 8, 2013<br>\n    Paper submission:           February 15, 2013<br>\n    Acceptance Notification:    March 15, 2013<br>\n    Final Version Due:          April 15, 2013</p>\n<p>WORKSHOP SCOPE</p>\n<p>ACL2 2013 is the major technical forum for users of the ACL2 theorem<br>\nproving system to present research related to the ACL2 theorem prover<br>\nand its applications. ACL2 2013 is the eleventh in the series of ACL2<br>\nworkshops, which occur approximately every 18 months. ACL2 is an<br>\nindustrial-strength automated reasoning system, the latest in the<br>\nBoyer-Moore family of theorem provers. The 2005 ACM Software System<br>\nAward was awarded to Boyer, Kaufmann, and Moore for their work in ACL2<br>\nand the other theorem provers in the Boyer-Moore family.</p>\n<p>ACL2 2013 is a two-day workshop to be held in Laramie, WY, USA on May<br>\n30-31, 2013. The workshop will feature technical papers, invited<br>\ntalks, and rump sessions discussing ongoing research. We invite<br>\nsubmissions of papers on any topic related to ACL2 and its<br>\napplications, and we strongly encourage submissions related to other<br>\ntheorem provers or formal methods that are of interest to the ACL2<br>\ncommunity. Suggested topics include but are not limited to the<br>\nfollowing:</p>\n<p>* software or hardware verification with ACL2,<br>\n    * formalizations of mathematics in ACL2,<br>\n    * new libraries, tools, and interfaces for ACL2,<br>\n    * novel uses of ACL2,<br>\n    * experiences with ACL2 in the classroom,<br>\n    * reports of and proposals for improvements of ACL2,<br>\n    * comparisons with other theorem provers,<br>\n    * comparisons with other programming or specification languages,<br>\n    * challenge problems and their solutions,<br>\n    * foundational issues related to ACL2, and<br>\n    * implementations connecting ACL2 with other systems.</p>\n<p>PAPER SUBMISSIONS</p>\n<p>Submissions must be made electronically in PDF format, as directed in<br>\nthe ACL2 2013 website. Submissions should be prepared in the EPTCS<br>\ntemplates, available from <a href=\"http://style.eptcs.org\">http://style.eptcs.org</a>.</p>\n<p>The ACL2 Workshop accepts both long papers (up to sixteen pages) and<br>\nextended abstracts (up to two pages). Both categories of papers will<br>\nbe fully refereed, but only long papers will be included in the final<br>\nworkshop proceedings. At least one author of each accepted papers must<br>\nregister for the workshop and give a presentation summarizing the<br>\npaper's results. Authors of long papers will have more time to present<br>\ntheir work at the workshop. One of the main advantages of the ACL2<br>\nWorkshop is that attendees are already knowledgeable about ACL2, its<br>\nsyntax, its basic commands, and the art of writing models in it. So<br>\nauthors may assume that readers have this familiarity. The workshop<br>\nproceedings will be published as a volume of Electronic Proceedings in<br>\nTheoretical Computer Science (EPTCS).</p>\n<p>Many papers presented at the workshop will describe interactions with<br>\nthe theorem prover. We strongly encourage authors of such papers to<br>\nprovide ACL2 script files (aka \"books\") along with instructions for<br>\nusing these books in ACL2. Such supporting materials should follow the<br>\nguidelines at<br>\n<a href=\"http://www.cs.utexas.edu/users/moore/acl2/books/index.html\">http://www.cs.utexas.edu/users/moore/acl2/books/index.html</a>. For<br>\naccepted papers, these books will be mirrored on the ACL2 home page<br>\nand included in the ACL2 book repository.</p>\n<p>The workshop will also feature ``rump sessions'', in which<br>\nparticipants can describe ongoing research related to ACL2. Proposals<br>\nfor rump session presentations, including a title and short abstract,<br>\nwill be accepted until the workshop.</p>\n<p>ORGANIZATION</p>\n<p>Chairs</p>\n<p>* Ruben Gamboa, University of Wyoming, USA<br>\n        * Jared Davis, Centaur, USA</p>\n<p>Program Committee</p>\n<p>* Carl Eastlund, Northeastern University, USA<br>\n        * David Greve, Rockwell Collins, USA<br>\n        * Warren Hunt, University of Texas, USA<br>\n        * Matt Kaufmann, University of Texas, USA<br>\n        * Hanbing Liu, AMD, USA<br>\n        * Panagiotis Manolios, Northeastern University, USA<br>\n        * Magnus Myreen, University of Cambridge, UK<br>\n        * David Rager, Battelle Memorial Institute, USA<br>\n        * Sandip Ray, Intel, USA<br>\n        * Jose Luis Ruiz Reina, University of Seville, Spain<br>\n        * David Russinoff, Intel, USA<br>\n        * Jun Sawada, IBM, USA<br>\n        * Julien Schmaltz, Open University of the Netherlands, The<br>\nNetherlands</p>\n<p>* Konrad Slind, Rockwell Collins, USA<br>\n        * Sol Swords, Centaur, USA<br>\n        * Laurent Thery, INRIA, France</p>",
        "id": 294231087,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660902537
    }
]