[
    {
        "content": "<p>From: Hongjin Liang &lt;<a href=\"mailto:lianghongjin@gmail.com\">lianghongjin@gmail.com</a>&gt;<br>\nWorkshop on Proof Assistants in Formal Methods</p>\n<p>August 21, 2011. Suzhou, China</p>\n<p>The workshop is part of the 3rd Asian-Pacific Summer School on Formal<br>\nMethods, which will be held on August 13-21 in Suzhou, China (see<br>\n<a href=\"http://kyhcs.ustcsz.edu.cn/fmschool-2011\">http://kyhcs.ustcsz.edu.cn/fmschool-2011</a> ). It will be on the last day (Aug.<br>\n21) of the summer school.</p>\n<p>The goal of the workshop is to bring together researchers using mechanized<br>\nlogic and proof assistants (Coq, Isabelle, HOL, PVS, etc.) in formal<br>\nmethods. Topics for contributed talks include, but are not limited to, the<br>\nfollowing:</p>\n<p>- Verification of programs, algorithms or protocols;<br>\n   - Programming language semantics;<br>\n   - Formalization of logical systems or mathematical concepts in a<br>\n   mechanized logic;</p>\n<p>- Experiences on using proof assistants in education or research<br>\n   projects;</p>\n<p>- New development and contributions of proof assistants, including<br>\n   theories, tactics, libraries, interfacing different verification systems,<br>\n   etc.;</p>\n<p>This informal workshop aims at a high degree of useful interaction amongst<br>\nthe participants, welcoming proposals for talks on work in progress,<br>\noverviews of larger programs, position presentations and short tutorials as<br>\nwell as more traditional research talks describing new results. Talk<br>\nproposals can be submitted either in the forms of a short abstract or a<br>\nlonger (published or unpublished) paper. There will be NO official<br>\nproceedings published for the workshop.</p>\n<p>We will try to accommodate as many talks as possible, but, depending on the<br>\nnumber of submissions, there might be a selection process. Note that<br>\nparticipants of the workshop are not required to attend the summer school.<br>\nPresentations need to be given in English.</p>\n<p>Important Dates:</p>\n<p>- Submission deadline: July 10 (submissions should be sent to<br>\n<a href=\"mailto:kyhcs@ustc.edu.cn\">kyhcs@ustc.edu.cn</a> )</p>\n<p>- Author notification: July 15<br>\n   - Workshop: August 21</p>\n<p>For more information, please send emails to <a href=\"mailto:kyhcs@ustc.edu.cn\">kyhcs@ustc.edu.cn</a> .</p>",
        "id": 294140569,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660845680
    }
]