[
    {
        "content": "<p>From: Viorel Preoteasa &lt;<a href=\"mailto:viorel.preoteasa@abo.fi\">viorel.preoteasa@abo.fi</a>&gt;<br>\nIs the Windows version ready? I tried to run it on windows, but I was <br>\nnot able to<br>\nconfigure the Isabelle installation.</p>\n<p>Viorel</p>",
        "id": 294102336,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660834178
    },
    {
        "content": "<p>From: Jesus Aransay &lt;<a href=\"mailto:jesus-maria.aransay@unirioja.es\">jesus-maria.aransay@unirioja.es</a>&gt;<br>\nDear all,</p>\n<p>I've installed i3p and I've been using it for a few days, so it may be that<br>\nmy appreciations are not that accurate, but just a few comments:</p>\n<ol>\n<li>\n<p>First I would like to emphasize the ease of use of the tool. It<br>\ntook me no time to install it and in a couple of minutes I was already<br>\nwritting code (from any point of view much easier than learning emacs<br>\nor xemacs for a newbie), and I could install the Isabelle fonts just<br>\nfollowing the instructions.</p>\n</li>\n<li>\n<p>I think it is quite fast starting and loading theories and images.</p>\n</li>\n</ol>\n<p>There are also a few things that i did not get to work and I missed from xemacs:</p>\n<ol>\n<li>\n<p>I do not know how to switch between the different windows from the<br>\napplication. For instance, when I'm writting down a theory I would<br>\nlike to move from the file to the \"Result window\" to copy the goals or<br>\nsome of the premises and take them back to the \"thy\" file. I did not<br>\nmanage to do it. This feature would ease faster development.</p>\n</li>\n<li>\n<p>X-symbols are not displayed in my files (but they are in the<br>\n\"Result prover\" window). Whenever I write \"\\&lt;And&gt;\" or any other symbol<br>\ni3p does not automatically convert it into its X-symbol version. Can<br>\nthis option be turned on from any menu?</p>\n</li>\n<li>\n<p>There is not keyboard shortcut for the \"Isabelle\" menu. By means of<br>\n\"Alt + e\" or \"Alt + t\" one can move to the Edit or Tools menu, but<br>\nthere is no such option for the \"Isabelle\" menu.</p>\n</li>\n<li>\n<p>I could not find any mail address inside of the application to<br>\nwhich one could send any congratulations :-)) comments, questions or<br>\nsuggestions.</p>\n</li>\n</ol>\n<p>Alltogether, I found it really nice and very convenient for starters,<br>\nand with minor improvements better than the emacs or xemacs options.</p>\n<p>Congratulations to Holger,</p>\n<p>best wishes,</p>\n<p>Jesus</p>",
        "id": 294102490,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660834211
    },
    {
        "content": "<p>From: Holger Gast &lt;<a href=\"mailto:gast@informatik.uni-tuebingen.de\">gast@informatik.uni-tuebingen.de</a>&gt;<br>\nDear Isabelle users,</p>\n<p>It is my pleasure to announce the first public release<br>\nof I3P, an Interactive Interface for the Isabelle Prover.<br>\nIt is available from</p>\n<p><a href=\"http://www-pu.informatik.uni-tuebingen.de/i3p\">http://www-pu.informatik.uni-tuebingen.de/i3p</a></p>\n<p>The two goals of the I3P development are interactivity<br>\nand extensibility: users should be able to interact with<br>\nan interactive theorem prover in more ways than executing<br>\nand undoing commands, and they should be able to add<br>\nin well-defined ways specific user-interface functionality to<br>\nsupport them in their specific projects.</p>\n<p>Here are a few reasons why you might want to give I3P a try:</p>\n<ul>\n<li>\n<p>It offers the main functionality of the Emacs-based<br>\n  ProofGeneral: as the main difference, the keyboard shortcuts<br>\n  replace Ctrl-C by Ctrl-Shift.</p>\n</li>\n<li>\n<p>It builds on the Netbeans/Swing frameworks and thus offers<br>\n  standard UI features: your students might appreciate the<br>\n  well-known environment.</p>\n</li>\n<li>\n<p>It handles copy &amp; paste with XSymbols correctly.</p>\n</li>\n<li>\n<p>It is portable and has been used under Linux and MacOS.<br>\n  (Windows/Cygwin support will be added shortly.)</p>\n</li>\n<li>\n<p>It is fast: the design pays specific attention to handling<br>\n  large numbers of trace messages and large messages efficiently:<br>\n  there is no real need to wait while the UI is scanning your traces.</p>\n</li>\n<li>\n<p>It offers command-local tracing: several posts to this list<br>\n  have asked whether it is possible to turn on tracing for<br>\n  single commands. I3P offers this capability (command-local options)<br>\n  on the interface side, by having the prover driver issue option<br>\n  changes before and after command execution.</p>\n</li>\n<li>\n<p>It has small release cycles: due to test-driven development of<br>\n  the developed infrastructure layer (with the number of test<br>\n  cases approaching 400), I feel confident in releasing updates<br>\n  in short periods. An AutoUpdate-Service is included to inform<br>\n  you about new versions.</p>\n</li>\n<li>\n<p>It is extensible: the existing modules provide general<br>\n  and documented mechanisms for plugging in new views and<br>\n  commands.</p>\n</li>\n<li>\n<p>It provides a framework for driving Isabelle-2009/-1:<br>\n  several posts to this list have asked how to use Isabelle<br>\n  as a background prover. The test cases of the Isabelle<br>\n  driver of I3P show how to achieve this in a simple manner.</p>\n</li>\n<li>\n<p>The installation effort is minimal anyway: just download the<br>\n  binary, unzip, and start i3p/bin/i3p.</p>\n<p>At most, you may want to install the IsabelleMono.ttf from<br>\nIsabelle2009-1/lib/fonts on your system and choose it for the<br>\ndisplay under Tool/Options/Fonts.</p>\n</li>\n</ul>\n<p>I would also like to thank Makarius Wenzel, Burkhart Wolff,<br>\nand Achim Brucker for discussions about the requirements<br>\non user interfaces for Isabelle. Furthermore, they and<br>\nAlexander Krauss and Julia Trieflinger have courageously<br>\nagreed to act as beta-testers for I3P and have provided<br>\ninvaluable feedback on shortcomings and usability issues.</p>\n<p>I am very grateful for any feedback you might care to give.</p>\n<p>Enjoy,</p>\n<p>Holger</p>",
        "id": 294103479,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660834492
    },
    {
        "content": "<p>From: Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt;<br>\nI would like to encourage users to try it out and give some feedback, <br>\neither on this mailing list or directly to Holger.</p>\n<p>Makarius</p>",
        "id": 294104642,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660834828
    }
]