[
    {
        "content": "<p>From: Christian Sternagel &lt;<a href=\"mailto:c.sternagel@gmail.com\">c.sternagel@gmail.com</a>&gt;<br>\nDear all,</p>\n<p>I was wondering whether there was any official (and non-workaround) way<br>\nto find out the \"minimal\" session qualifier for an imported theory.</p>\n<p>For example:</p>\n<p>Say theory A is part of some huge Isabelle project that has a ROOT file<br>\n(in session directory $D) with many sessions (S1, ..., SN) and<br>\nfurthermore, A is not mentioned explicitly in the ROOT file but is just<br>\nsome implicit dependency of one of the sessions.</p>\n<p>Now I have a theory file B.thy containing:</p>\n<p>theory B<br>\n    imports \"$D/A\"<br>\n  begin<br>\n  end</p>\n<p>and would like to replace the import by a qualified one.</p>\n<p>However, as I said I do not (without spending some effort and lots of<br>\nbuild time) know which session A belongs to.</p>\n<p>Assuming SN is the final session in the hierarchy, I could probably just<br>\nbuild SN then \"imports A\" and afterwards Ctrl-Click on A to get the<br>\nqualifier (not sure whether this really works)?</p>\n<p>But is there an easy/fast way to find out which Si is the first one in<br>\nwhich A is present so that I end up with</p>\n<p>theory B<br>\n    imports Si.A<br>\n  begin<br>\n  end</p>\n<p>without actually building anything and without having to manually<br>\ninspect theory files?</p>\n<p>cheers</p>\n<p>chris</p>",
        "id": 294730870,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661187983
    },
    {
        "content": "<p>From: Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt;<br>\nWhen doing the conversion for Isabelle + AFP for the Isabelle2017<br>\nrelease, I used \"isabelle imports\" a lot, as sketched in NEWS and the<br>\n\"system\" manual.</p>\n<p>In the forthcoming Isabelle2018 release, the rules for qualified theory<br>\nnames are more strict: unqualified import from the parent session is no<br>\nlonger allowed. This could make the conversion more difficult -- or<br>\nsometimes easier, because there is only one way to do it.</p>\n<p>I am still not fully satisfied with the situation in Isabelle2018: maybe<br>\nthe import scheme needs to become even more strict, and insist that<br>\ntheory files reside exactly in the session directory (no<br>\nsub-directories, no outside directories). One could still allow for<br>\nexceptions that are specifies in the session ROOT entry of 'theories'.</p>\n<p>The latter scheme would also speed-up the inversion of file-names to<br>\nsession-qualified theory names in the Prover IDE: presently one can wait<br>\n0.5 .. 1.5 min for that (esp. for AFP).</p>\n<p>Makarius</p>",
        "id": 294737678,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661190371
    }
]