[
    {
        "content": "<p>From: Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt;<br>\nOn Wed, 15 Feb 2012, Jeremy Dawson wrote:</p>\n<blockquote>\n<p>Makarius is right in guessing that I'm referring to Isabelle2005 - it <br>\nwas when I started to convert all my proofs from Isabelle 2005 to 2007 I <br>\nseemed to be spending a lot of time on it when I would rather be doing <br>\nuseful work.</p>\n</blockquote>\n<p>The huge gap between Isabelle2005 and Isabelle2007 is in fact exceptional. <br>\nThere were 25 months between the two releases, and actually Isabelle2006 <br>\nmissing.  In 2007 it was still unclear if we would recover again to a sane <br>\nstate.</p>\n<p>The transition Isabelle2005 -&gt; Isabelle2007/2008 also marks the point <br>\nwhere really ancient customs from the late 1990-ies were finally given up, <br>\nwith a delay of 5-10 years.</p>\n<p>Taking both together, there has been definitely a loss of Isabelle <br>\napplications from the past, those that did not manage the jump into the <br>\ncurrent century.</p>\n<blockquote>\n<p>From Isabelle2007 on we have followed a more disciplined release schedule, <br>\nwith a limited amount of pain caused by incompatibilities, as before <br>\nIsabelle2005.  So applications that follow the stepping stones of each <br>\nofficial release now should be quite at easy to port.</p>\n</blockquote>\n<p>Here it greatly helps to sort out old/legacy things <em>before</em> making a <br>\nstep forwards, and not to make too many steps at the same time.</p>\n<blockquote>\n<p>I gather things have got worse since then, in terms of incompatibilities <br>\nbetween versions of Isabelle and therefore the prospects of users making <br>\nuse of other users' work</p>\n</blockquote>\n<p>Yes, by sticking to very old versions of Isabelle, other people will <br>\nhardly be able to re-use such work.  I reckon that the interval of <br>\nrelevant Isabelle releases consists of the 2-3 last ones.  It is also <br>\nimportant to refrain from offering things \"for the latest snapshot, which <br>\nis the one on my laptop\".  The probability that two people have the same <br>\n\"latest versions\" and can thus share some work is approximately 0.</p>\n<p>Here is an arbitrary example for a project that relates a range of <br>\nversions of both itself and Isabelle in a nice way:<br>\n<a href=\"http://staff.aist.go.jp/y-isobe/CSP-Prover/CSP-Prover.html\">http://staff.aist.go.jp/y-isobe/CSP-Prover/CSP-Prover.html</a></p>\n<p>Another way is to wrap things up as an article for AFP, following the <br>\nguidelines by its editors.  Porting is than mostly auto-magically.</p>\n<p>Makarius</p>",
        "id": 294152208,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660849720
    }
]