[
    {
        "content": "<p>From: Lars Hupel &lt;<a href=\"mailto:hupel@in.tum.de\">hupel@in.tum.de</a>&gt;<br>\nDear list,</p>\n<p>I stumbled over a funny thing today: Even if a value x is not of record<br>\ntype, record update syntax will still work. For example,</p>\n<p>x (| v := t |)</p>\n<p>works as long as a constant v_update with the appropriate type is in scope.</p>\n<p>Should the datatype command be extended to produce these constants? It<br>\nis quite convenient syntax (which can't be said of records in general).</p>\n<p>Cheers<br>\nLars</p>",
        "id": 294709071,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661181560
    },
    {
        "content": "<p>From: Lars Hupel &lt;<a href=\"mailto:hupel@in.tum.de\">hupel@in.tum.de</a>&gt;<br>\nHi,</p>\n<blockquote>\n<p>By default, I'd say clearly no. The (co)datatype package already<br>\ngenerates more than enough constants and theorems as it is.</p>\n</blockquote>\n<p>sure, that's true. If it were implemented I guess that'd go into a<br>\nplugin anyway. (I have many things that should go into a plugin at some<br>\npoint ...)</p>\n<blockquote>\n<p>I suggest we just keep this as an idiom. If more than one person ends<br>\nup using this, and the general parsing principle you describe is<br>\nconsidered a feature of the system and not a bug, we could add a<br>\nbrief section to the manual.</p>\n</blockquote>\n<p>Right. I know very little about the record package apart from that it is<br>\nnot localized and does not register itself as a BNF (for which there is<br>\n\"copy_bnf\" these days, luckily). I also don't know if someone still<br>\nfeels responsible for it.</p>\n<p>I should probably motivate why this came up: Lem (the specification<br>\nlanguage) is able to generate records in Isabelle. I had to change some<br>\nof them to datatypes and then realized that the syntax would still work.<br>\n(Lem does not use extensible records so they should probably generate<br>\ndatatypes directly.)</p>\n<p>But I'm happy to leave things as they are right now. Maybe somebody on<br>\nthis list has already done something like that.</p>\n<p>Cheers<br>\nLars</p>",
        "id": 294709110,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661181578
    },
    {
        "content": "<p>From: <a href=\"mailto:Thomas.Sewell@data61.csiro.au\">Thomas.Sewell@data61.csiro.au</a><br>\nNot directly relevant to this discussion, but:</p>\n<p>This additional faux record syntax is used in a number of developments.</p>\n<p>Cheers,<br>\n     Thomas.</p>",
        "id": 294709125,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661181585
    },
    {
        "content": "<p>From: Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt;<br>\nThis was done on purpose many years ago, when this notation was<br>\nintroduced. A bit later, the record package turned out the canonical<br>\nsource of such update functions, but there are (very few) other<br>\napplications found elsewhere.</p>\n<p>Makarius</p>",
        "id": 294709143,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661181590
    }
]