[
    {
        "content": "<p>From: Mario Alvarez &lt;<a href=\"mailto:mmalvare@eng.ucsd.edu\">mmalvare@eng.ucsd.edu</a>&gt;<br>\nDear Isabelle Users,</p>\n<p>I have another question about locales, mostly orthogonal to my last one.</p>\n<p>As part of a project on trying to describe semantics of certain kinds of<br>\nsyntax trees in a modular way, I am in a situation where I am trying to do<br>\na few nested levels of locale interpretation. Based on my understanding of<br>\nIsabelle locales, I think that I should be able to achieve this by simply<br>\nwriting an \"interpretation\" statement (interpreting an \"inner\" locale)<br>\ninside of a (\"outer\") locale body.</p>\n<p>What I expect to happen is that when I interpret the outer locale (say,<br>\ninto a theory) the definitions from the inner locale also get pulled in,<br>\nbecause they should have been included in the outer locale by virtue of the<br>\ninterpretation included in that locale's body definition.</p>\n<p>Specifically (making reference to the attached .thy file, which is very<br>\ncontrived but showcases the behavior that I find confusing)</p>\n<ul>\n<li>\n<p>I define a locale called Inner, which takes a function called denote,<br>\nwhich has type \" 'a =&gt; nat\"</p>\n</li>\n<li>\n<p>Inside inner, I define a function isGood, which sees of the denotation of<br>\na 'a is equal to 0</p>\n</li>\n<li>\n<p>After closing Inner, I define a locale called Outer, which is almost the<br>\nsame as Inner except that it takes as a parameter a function called<br>\ndenote2, which has type \" 'a =&gt; wrapnat\", where wrapnat is isomorphic to<br>\n(but distinct from) nat</p>\n</li>\n<li>\n<p>Inside of Outer, I define a function called denote' that runs denote2 and<br>\n\"unwraps\" the natural number it returns</p>\n</li>\n<li>\n<p>Finally, still in Outer, I define an interpretation of Inner, InnerInt1,<br>\npassing in denote' as the implementation of denote</p>\n</li>\n<li>\n<p>After closing Outer, I attempt to interpret Outer into the theory. The<br>\ncommand appears to succeed, but the constant OuterInt.InnerInt1.isGood does<br>\nnot seem to have been introduced into the theory. I would have expected it<br>\nto be, since I interpreted Outer into the theory, which in turn interpreted<br>\nInner into the theory, which contains isGood.</p>\n</li>\n</ul>\n<p>Intuitively I had expected that using interpretation inside a locale<br>\ncontext would achieve this, but it seems like there is something I don't<br>\nfully understand going on here. I have considered whether sublocales could<br>\nbe used for this purpose, but I am not sure they are what I want. I don't<br>\nwant to change the locale hierarchy, I just want to interpret the<br>\ndefinitions from one locale into another locale.</p>\n<p>I've included a very contrived example of the kind of behavior that I find<br>\nsurprising in the attached .thy file. (As with my last message, I wrote and<br>\nchecked this using Isabelle2018).</p>\n<p>Thanks again for your help!<br>\n--Mario<br>\n<a href=\"/user_uploads/14278/W4PAisw8zvs2rKpRGCWVxp05/Locale_Interp_Example.thy\">Locale_Interp_Example.thy</a></p>",
        "id": 294761587,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661199848
    },
    {
        "content": "<p>From: \"<a href=\"mailto:lammich@in.tum.de\">lammich@in.tum.de</a>\" &lt;<a href=\"mailto:lammich@in.tum.de\">lammich@in.tum.de</a>&gt;<br>\nHi  </p>\n<p>Try using the sublocale command, instead of interpretation.  </p>\n<p>Peter</p>",
        "id": 294761611,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661199861
    },
    {
        "content": "<p>From: Mario Alvarez &lt;<a href=\"mailto:mmalvare@eng.ucsd.edu\">mmalvare@eng.ucsd.edu</a>&gt;<br>\nHi Peter,</p>\n<p>Thanks for the tip. I think I misunderstood the purpose of sublocales, but<br>\nafter experimenting with them a bit earlier today I think I see how they<br>\ncan be used to do what I wanted to do.</p>\n<p>Best,<br>\nMario</p>",
        "id": 294761623,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661199867
    }
]