[
    {
        "content": "<p>From: Andrei Popescu &lt;<a href=\"mailto:uuomul@yahoo.com\">uuomul@yahoo.com</a>&gt;<br>\nSay I define a function F with fun in a certain way, and then I prove some facts <br>\nwhich are nicer simplification rules, and would like to use the name F.simps <br>\nfor these new facts.  In Isabelle 2005, I used to simply overwrite the name, but <br>\nin Isabelle 2008 I am not allowed to do this any longer.  It seems that now I <br>\nneed to first rename the old facts instead, but I do not know how.  </p>\n<p>Thank you in advance, <br>\n   Andrei Popescu</p>",
        "id": 294073652,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660828071
    },
    {
        "content": "<p>From: Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt;<br>\nWell, you just need to come up with a fresh name, such as \"F_simps\".  The <br>\noriginal \"F.simps\" as produced by the function package will stay for <br>\neternity (due to strict monotonicity of the theory context).  Once a <br>\nlogical entity is defined it cannot be changed.</p>\n<p>Makarius</p>",
        "id": 294073660,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660828075
    },
    {
        "content": "<p>From: Andrei Popescu &lt;<a href=\"mailto:uuomul@yahoo.com\">uuomul@yahoo.com</a>&gt;<br>\nThank you for your answer.  </p>\n<p>The desire to change the name of a proposition in order to make that name available for an other proposition is, in my opinion, more than just a whim. <br>\nComing up with a suggestive fresh name is of course not a problem. <br>\n But later in proofs, <br>\n when I may need to invoke several facts related to several concepts, I would rather not lookup theorems in the database, but count on the fact that a theorem like foo_def applies what I as a designer (and not I as an implementor) choose to be the most natural \"definition\".  (In particular, in Isabelle 2005, I used to set up the <br>\nnotations (and the simp database) in such a way that later I would not care <br>\nto remember whether I have defined a non-recursive function with \"fun\" or with \"constdefs\".)  </p>\n<p>Regards, <br>\n   Andrei </p>\n<p>Well, you just need to come up with a fresh name, such as \"F_simps\". <br>\nThe <br>\noriginal \"F.simps\" as produced by the function package will stay for <br>\neternity (due to strict monotonicity of the theory context).  Once a <br>\nlogical entity is defined it cannot be changed.</p>\n<p>Makarius</p>",
        "id": 294073684,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660828082
    }
]