[
    {
        "content": "<p>From: Jan Keller &lt;<a href=\"mailto:Jan@Familie-Keller.org\">Jan@Familie-Keller.org</a>&gt;<br>\nHello,<br>\nI am a student in the 6th semster on TU Darmstadt and writing on my <br>\nbachelor thesis about proof management for KeY <br>\n&lt;<a href=\"http://www.key-project.org/\">http://www.key-project.org/</a>&gt;. My mentor implemented the tool Visual <br>\nDbC. It visualize Java code with JML contracts in a diagram based on the <br>\nUML standard.</p>\n<p>I added associations for all dependencies of prooves, identify changes <br>\nin the Java code and JML contracts and compute wether a proof is <br>\ndeprecated or still valid.</p>\n<p>I have a few Qestions for my related work section:</p>\n<p>How do you do the management  of proofs in Isabelle? Are there any tools?<br>\nAre there technics to react on changes of potential dependencies of <br>\nproof? Could you detect wether a proof is still valid or deprecated?<br>\nAre there tools for the dependencies of proofs? How are the dependencies <br>\nvisualized? I saw something like a dependency graph in JEdit. Is that <br>\ncorrect?<br>\nHave you tools to refractor proofs or requirements?</p>\n<p>Thank you for taking the time to answer my questions. I look forward to <br>\nyour response.</p>\n<p>Jan Keller<br>\n<a href=\"/user_uploads/14278/m2nv-czQrOT2Hm9p_Oz8Gt9Z/smime.p7s\">smime.p7s</a></p>",
        "id": 294221256,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660897613
    },
    {
        "content": "<p>From: Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt;<br>\nOn Wed, 29 Aug 2012, Jan Keller wrote:</p>\n<blockquote>\n<p>How do you do the management of proofs in Isabelle? Are there any tools? <br>\nAre there technics to react on changes of potential dependencies of <br>\nproof? Could you detect wether a proof is still valid or deprecated?</p>\n</blockquote>\n<p>This is mainly part of the implicit \"document model\" of the prover, which <br>\nis then connected to jEdit via conventional text editing operations <br>\n(insert/remove intervals of text).  The document model is declarative in <br>\nthe sense that it reacts on changes in a (hopefully) sensible way.  The <br>\nhard work of managing dependencies is in the core implementation, both <br>\nsrc/Pure/PIDE/document.ML and document.scala.</p>\n<p>The main result of document processing is a markup tree that is associated <br>\nwith the original source text.  By querying that information (via a <br>\ndocument \"snapshot\") one can get some dependency-like information, say <br>\nwhere formal entities are defined and references.  This is how hyperlinks <br>\nwork in Isabelle/jEdit.</p>\n<blockquote>\n<p>Are there tools for the dependencies of proofs? How are the dependencies <br>\nvisualized? I saw something like a dependency graph in JEdit. Is that <br>\ncorrect? Have you tools to refractor proofs or requirements?</p>\n</blockquote>\n<p>Most of that is still missing.  I am already glad to have most of the <br>\nascyncronous editing model running after several years of working on the <br>\nconcepts and implementation.</p>\n<p>What is coming in the next release is some offline dependency management <br>\nas part of Isabelle/Scala, to figure out which source files contribute to <br>\nan Isabelle \"session\" (say HOL or an application of it), and to figure out <br>\nchanges here wrt. a persistent state in the file-system.</p>\n<p>Makarius</p>",
        "id": 294223603,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660898787
    }
]