[
    {
        "content": "<p>From: Paul Curzon &lt;<a href=\"mailto:pc@dcs.qmul.ac.uk\">pc@dcs.qmul.ac.uk</a>&gt;<br>\nEXTENDED DEADLINE<br>\nCall for Papers: FMIS 2007<br>\n2nd International Workshop on Formal Methods for Interactive Systems<br>\nA Satellite Workshop of HCI 2007<br>\nLancaster, UK - 4th September, 2007</p>\n<p><a href=\"http://www.dcs.qmul.ac.uk/research/imc/hum/fmis2007/\">http://www.dcs.qmul.ac.uk/research/imc/hum/fmis2007/</a></p>\n<p>Important Dates<br>\n            Submission deadline: 1 July 2007<br>\n            Acceptance notification: 27 July, 2007<br>\n            Workshop: 4th September, 2007</p>\n<p>Background and Objectives</p>\n<p>Reducing the likelihood of human error in the use of interactive systems<br>\nis increasingly important: the use of such systems is becoming<br>\nwidespread in applications that demand high reliability due to safety,<br>\nsecurity, financial or similar considerations. Interactive systems are<br>\nalso becoming increasingly ubiquitous and being used in new and more<br>\ncomplex situations. Consequently, the use of formal methods in verifying<br>\nthe correctness of interactive systems should also include analysis of<br>\nhuman behaviour in interacting with the interface and with the wider<br>\nsocio-technical system.</p>\n<p>The aim of this workshop is to bring together researchers in computer<br>\nscience, cognitive psychology, and other areas of HCI, from both<br>\nacademia and industry, who are interested in both formal methods and<br>\ninteractive system design.</p>\n<p>Submitted papers should address issues of how formal methods can be<br>\napplied to interactive system design. Topics of interest include, for<br>\nexample, the development of formal tools, techniques and methodologies<br>\nbased on cognitive psychology results, the development and use of formal<br>\nuser models, case studies applying formal methods to interface design,<br>\nand formal analysis of the design of the wider socio-technical systems.<br>\nThe scope of HCI issues covered extends to all aspects of applying<br>\nformal methods to interactive systems, including usability, user<br>\nexperience, human error, etc. We also welcome papers with a focus on<br>\ntheory provided a link to interactive systems is argued.</p>\n<p>Application areas considered include but are not limited to:  mobile<br>\ndevices, embedded systems, safety-critical systems,  high-reliability<br>\nsystems,  shared control systems, digital libraries, eGovernment,<br>\npervasive systems,  augmented reality,  ubiquitous computing, and<br>\ncomputer security applications.</p>\n<p>Related Conferences</p>\n<p>The workshop will be held in conjunction with HCI 2007<br>\n(<a href=\"http://www.bcs-hci.org.uk/hci2007/\">www.bcs-hci.org.uk/hci2007/</a>)  and prior to SEFM 2007: the 5th IEEE<br>\nInternational Conference on Software Engineering and Formal Methods<br>\n(<a href=\"http://www.iist.unu.edu/SEFM07/\">www.iist.unu.edu/SEFM07/</a>) which will be held in London the following<br>\nweek. Participants interested in  the themes of FMIS: HCI and formal<br>\nmethods may therefore wish to attend both  conferences following the<br>\nworkshop.</p>\n<p>Submission</p>\n<p>Submissions to the workshop must not have been published or be<br>\nconcurrently considered for publication elsewhere. All submissions will<br>\nbe peer-reviewed and judged on the basis of originality, contribution to<br>\nthe field, technical and presentation quality, and relevance to the<br>\nworkshop. Papers should be written in English and not exceed 16 pages.<br>\nPapers may be accepted either for full presentation or short<br>\npresentation at the workshop.</p>\n<p>Negotiations are in progress to have the proceedings published  by<br>\nElsevier in the series Electronic Notes in Theoretical Computer Science<br>\n(ENTCS) as for FMIS 2006. Papers accepted as short presentations will be<br>\npublished in the participants proceedings at the workshop only, not the<br>\nfull published post-proceedings.</p>\n<p>Publication of a selection of the papers in a journal special issue is<br>\nalso under consideration.</p>\n<p>Detailed information on the submission procedure and formats required<br>\nwill be made available on the workshop website.</p>\n<p>Queries to: <a href=\"mailto:fmis2007@dcs.qmul.ac.uk\">fmis2007@dcs.qmul.ac.uk</a></p>\n<p>Organisers<br>\n           Paul Curzon, Queen Mary, University of London, UK<br>\n           Antonio Cerone, UNU-IIST, Macau SAR China</p>\n<p>Programme Committee<br>\n           Bernhard Beckert, Germany;<br>\n           Ann Blandford, England;<br>\n           Judy Bowen, New Zealand;<br>\n           Paul Cairns, England;<br>\n           Antonio Cerone, Macau SAR China;<br>\n           Jose Creissac Campos, Portugal;<br>\n           Paul Curzon, England;<br>\n           Alan Dix, England;<br>\n           Gavin Doherty, Ireland;<br>\n           Michael Harrison, England;<br>\n           C. Michael Holloway, USA;<br>\n           Chris Johnson, Scotland;<br>\n           Peter Lindsay, Australia;<br>\n           Philippe Palanque, France;<br>\n           Fabio Paterno, Italy,<br>\n           Chris Roast, England,<br>\n           Rimvydas Ruksenas, England;<br>\n           Siraj Shaikh, Macau SAR China;<br>\n           Daniel Sinnig, Canada;<br>\n           Harold Thimbleby, Wales</p>\n<p>FMIS is organised in conjunction with the EPSRC funded Human Error<br>\nModelling Project  on research grants GR/S67494 and GR/S67500</p>",
        "id": 294049744,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660818908
    }
]