[
    {
        "content": "<p>From: Daniel Le Métayer &lt;<a href=\"mailto:daniel.le-metayer@inria.fr\">daniel.le-metayer@inria.fr</a>&gt;<br>\nPostdoc Position at INRIA: Formal model for privacy as control </p>\n<p>Rather than the “right to be let alone”, as originally defined by Samuel Warren and Louis Brandeis, privacy is increasingly seen in the digital society as the ability for individuals to control their personal data. The current trend is also to recommend the integration of privacy requirements in the earliest stages of the design of a product, following the “privacy by design” approach. However, even if the notions of “privacy as control” and “privacy by design” are predominant in the privacy literature, clear definitions of their meanings are still missing. As a result, they can be interpreted in different ways and it is difficult to make their implementation systematic and measurable. </p>\n<p>As a first step to address this issue, the goal of the postdoctoral project is to study the notion of “control over personal data”, analyze its similarities and differences with existing notions such as “access control” or “usage control” and, based on previous work in these areas, propose a formal model for “control over personal data”. This formal model could serve as a basis for implementations including a combination of a priori controls (static or dynamic, through monitoring) and a posteriori controls. </p>\n<p>Skills : Minimal knowledge and motivation for formal in the general sense (formal specification, verification, software design, model design, etc.) and their application to concrete problems. Some knowledge in security or privacy would also be appreciated but is not a pre-requisite for the position. </p>\n<p>Location: The internship will take place in Lyon, within the new research group PRIVATICS of the Inria Rhône-Alpes research unit and the Inria project Lab CAPPRIS. Lyon is the second urban area in France. It is close to the French Alps and two hours or less (in TGV) from Paris, Geneva, Turin and the Mediterranean coast. The city is known for its rich cultural life, its historical and architectural landmarks and is a UNESCO World Heritage Site. </p>\n<p><a href=\"https://cappris.inria.fr/\">https://cappris.inria.fr/</a> </p>\n<p><a href=\"http://www.onlylyon.org/onlylyon-org/live-in-lyon/live-in-lyon-38-2.html\">http://www.onlylyon.org/onlylyon-org/live-in-lyon/live-in-lyon-38-2.html</a> </p>\n<p><a href=\"http://www.lyon.fr/page/websites-in-english-about-lyon-france.html\">http://www.lyon.fr/page/websites-in-english-about-lyon-france.html</a> </p>\n<p>Duration: The position is initially offered for a period of one or two years. Applications will be accepted until the position has been filled. </p>\n<p>Applications have to be sent to : daniel.le-metayer at <a href=\"http://inria.fr\">inria.fr</a>.</p>",
        "id": 294328733,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660929499
    }
]