[
    {
        "content": "<p>From: Leonor Prensa &lt;<a href=\"mailto:leonor.prensa@loria.fr\">leonor.prensa@loria.fr</a>&gt;<br>\n**</p>\n<p>Research team: MOSEL team at INRIA Lorraine, LORIA (<a href=\"http://www.loria.fr/\">http://www.loria.fr/</a>)<br>\n/<br>\nINRIA proposes post-doctoral positions for young graduates to a maximum <br>\nof two years.<br>\nThe salary is 2,320€ gross per month.<br>\n/<br>\nResearch subject: Proof traces and proof reconstruction for automatic <br>\nand interactive provers</p>\n<p>Research context :</p>\n<p>The objective of our work is the construction of a verification <br>\nenvironment that combines specialized automated reasoners within an <br>\ninteractive reasoning framework. We intend to demonstrate that one can <br>\nin this way significantly raise the degree of automation for the <br>\nverification of complex systems and thus contribute to make deductive <br>\nverification techniques economically viable. In order to ensure the <br>\noverall correctness of a proof, the automated reasoning tools produce <br>\njustifications that are certified by the interactive proof assistant. In <br>\nthis way, both the result of the external reasoner and the translations <br>\nbetween the different syntactic representations are verified. Contrary <br>\nto proof search, proof checking is of low polynomial complexity. We have <br>\nvalidated this approach by combining Isabelle with SAT solvers and with <br>\nthe SMT solver haRVey for fragments of first-order logic, including <br>\nequality reasoning. The goal of the post-doctoral research proposed here <br>\nis to extend the approach, to make it more robust, and to improve the <br>\nefficiency.</p>\n<p>Description of the activity of the post-doc :</p>\n<p>The post-doctoral researcher will investigate techniques for<br>\n• improving our existing combination techniques. Some care will be <br>\ndirected to efficiency for the certification of large proofs: proof <br>\nobligations arising from verification problems can be large, and <br>\ninteractive proof assistants are typically not optimized for <br>\nrepresenting large formulas. A promising approach may be to use <br>\nreflection techniques to produce a verified certification tool.<br>\n• extending the combination techniques beyond the fragments of <br>\nfirst-order logic that are currently handled, and in particular to take <br>\ninto account decidable fragments of arithmetic reasoning.<br>\nIn order to obtain a comprehensive framework, the exchange of proofs <br>\nshould be based on a general-purpose format for representing formal <br>\nproofs; we are involved in an international standardization effort in <br>\nwhich the post-doc will naturally participate.<br>\nThe developed techniques will be evaluated by applying them on theories <br>\nthat are already supported by haRVey or for which support is currently <br>\nbeing implemented – with a particular interest for arithmetics – but <br>\nalso by using them for the integration of generic first-order logic <br>\nautomatic provers such as Spass or the E-prover. We mainly think of <br>\nIsabelle as the targeted proof assistant, but application to other <br>\ninteractive frameworks, such as Coq, would be useful, also as a means to <br>\ndemonstrate that the technique is independent of a specific proof assistant.<br>\nFinally, it will be important to measure the improvement brought by the <br>\ncombination of deductive tools on real case studies; our main interest <br>\nis in the verification of distributed algorithms, including <br>\ncommunication protocols for embedded systems such as FlexRay.<br>\nThe research directions mentioned above are indicative of our interests <br>\nin this field; the precise subjects of research will be determined <br>\njointly with the candidate. Part of this work will be carried out in <br>\nclose contact with the Isabelle group in Munich and with other <br>\ninternational research teams.</p>\n<p>Competences and profile :</p>\n<p>The candidate should have experience in interactive and, if possible, <br>\nautomatic theorem proving, and should be interested in combining <br>\nfoundational research on calculi and logics with hands-on <br>\nimplementation. The main languages of implementation are C and ML.<br>\nThe candidates must have defended their doctoral thesis between May 2006 <br>\nand end of 2007.</p>\n<p>Contact :</p>\n<p>Candidates should send a resume to</p>\n<p>Pascal Fontaine: +33 354 95 84 78, <a href=\"mailto:Pascal.Fontaine@loria.fr\">Pascal.Fontaine@loria.fr</a><br>\nLeonor Prensa Nieto: +33 383 59 30 75, <a href=\"mailto:Leonor.Prensa@loria.fr\">Leonor.Prensa@loria.fr</a></p>",
        "id": 294047541,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660817943
    }
]