[
    {
        "content": "<p>From: Christoph Weidenbach &lt;<a href=\"mailto:weidenbach@mpi-inf.mpg.de\">weidenbach@mpi-inf.mpg.de</a>&gt;<br>\nApologies for multiple copies </p>\n<hr>\n<p>The Max Planck Institute for Informatics offers a</p>\n<p>PhD Student/Project Position</p>\n<p>in the area of security analysis and verification. The goal of the<br>\nproject is to improve automation for the formal verification of<br>\ninformation flow analysis. The approach is a tight integration<br>\nof automated (SPASS) and interactive (Isabelle) theorem proving.<br>\nThe position is located in the Automation of Logic Group directed <br>\nby Christoph Weidenbach.  The project is carried out in close <br>\ncooperation with the group of Tobias Nipkow in Munich.</p>\n<p>The Max Planck Institute for Informatics is located on the campus of <br>\nSaarland University, Saarbr端cken, Germany. Currently, 14 researchers <br>\nfrom several nationalities work in the Automation of Logic Group. Our <br>\nworking language is English. The group collaborates with several of <br>\nthe major research institutions in Europe and the U.S. and has high <br>\ninternational visibility. There is generous travel support available <br>\nfor all group members. The position is about 2,000 Euros per month, <br>\nafter taxes. </p>\n<p>Applications from disabled applicants are appreciated. Our institute <br>\nsupports the principle of equal opportunity for men and women, and is <br>\ntherefore interested in applications from women. </p>\n<p>All applications should include curriculum vitae and names of references <br>\nwith their e-mail addresses. Please send your application in <br>\nPDF format by email to Jennifer M端ller (<a href=\"mailto:jmueller@mpi-inf.mpg.de\">jmueller@mpi-inf.mpg.de</a>) by <br>\nNovember 30, 2010. In addition, written applications may be sent to: </p>\n<p>Max-Planck-Institut f端r Informatik <br>\nChristoph Weidenbach <br>\nCampus E1 4 <br>\nD-66123 Saarbr端cken <br>\nGermany</p>",
        "id": 294121009,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660839823
    }
]