[
    {
        "content": "<p>From: Holden Lee &lt;<a href=\"mailto:hl422@cam.ac.uk\">hl422@cam.ac.uk</a>&gt;<br>\nI've finished a formalisation of some basic linear algebra <em>using locales</em>,<br>\navailable here:<br>\n<a href=\"https://dl.dropboxusercontent.com/u/27883775/work/Isabelle/LinearAlgebra.zip\">https://dl.dropboxusercontent.com/u/27883775/work/Isabelle/LinearAlgebra.zip</a>.</p>\n<p>It includes (note that some concepts are actually written in module as they<br>\nalso apply there)</p>\n<p>- basic definitions: linear combinations, span, linear independence<br>\n   - linear transformations<br>\n   - direct sum of vector spaces, sum of subspaces<br>\n   - the replacement theorem<br>\n   - existence of bases in finite-dimensional vector spaces<br>\n   - rank-nullity theorem</p>\n<p>In the process, I also proved some basic facts about rings, modules, and<br>\nfields that seem to be missing, as well as finite sums in monoids/modules.</p>\n<p>Note that infinite-dimensional vector spaces are supported, but \"dim\" is<br>\nonly supported for finite-dimensional vector spaces.</p>\n<p>As I alluded to in my previous email, I had trouble getting the<br>\nautomation/simplification to work in my favor, so some of the writeups are<br>\nhacky/inconsistent.</p>\n<p>[One \"hack\" I discovered near the end was: to prevent an infinite loop of<br>\nsimplification from expanding \"-&gt;\" (Pi_I') and trying to show (a x \\in<br>\ncarrier K) by showing it is the image of something in A-&gt;B, create a \"dummy<br>\ndefinition\" Pi2 == Pi, and add simplification rules Pi_simp whose premises<br>\ninvolve Pi2 rather than Pi, and then do:<br>\napply(drule Pi_implies_Pi2)+ (*\"flags\" all the assumptions piped in so they<br>\naren't expanded.*)<br>\napply(simp add: Pi_simp)<br>\nI would hope there is some way to do this more \"natively.\"]</p>\n<p>Any comments are appreciated, especially in streamlining the proofs.<br>\nEventually I would like these developments to be integrated into the<br>\nIsabelle algebra library, so let me know about the protocol for this.</p>\n<p>Cheers,<br>\nHolden</p>",
        "id": 294287891,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660922459
    }
]