[
    {
        "content": "<p>From: Peter Höfner &lt;<a href=\"mailto:Peter.Hoefner@nicta.com.au\">Peter.Hoefner@nicta.com.au</a>&gt;<br>\n=======================================================<br>\nSorry for possible multiple copies of this announcement.<br>\n=======================================================</p>\n<p>FIRST CALL FOR PAPERS</p>\n<p>ATE-2011<br>\n                       CADE23 Workshop on<br>\n                 Automated Theory Engineering<br>\n                             (31. July 2011)</p>\n<p>Deadline: 29 April 2011<br>\n<a href=\"http://www.nicta.com.au/ate2011/\">http://www.nicta.com.au/ate2011/</a></p>\n<p>GENERAL INFORMATION<br>\n   The first Workshop on Automated Theory Engineering will<br>\n   be held in July 2011 in Wroclaw. It is associated  with<br>\n   the 23th International Conference on Automated Deduction<br>\n   (CADE23).</p>\n<p>SCOPE<br>\n   Theory engineering  means the development and mechanisation<br>\n   of mathematical axioms, definitions, theorems and inference<br>\n   procedures as needed to cover the essential concepts and<br>\n   analysis tasks of an application domain. It is essential for<br>\n   the  qualitative and quantitative modelling and  analysis of<br>\n   computing systems. The aim of the workshop is to present users<br>\n   with lightweight domain specific modelling languages, and to<br>\n   devolve the technical intricacies of analysis tasks as far as<br>\n   possible to tools that provide heavyweight automation.</p>\n<p>The workshop brings together tool and theory developers with<br>\n   industrial engineers to exchange  experiences and ideas that<br>\n   stimulate further tool developments and theory designs. A main<br>\n   goal is the creation of a repository of case studies that<br>\n   allows developers to test and improve their theories and tools.</p>\n<p>TOPICS<br>\n   Theory engineering is relevant to the design of systems, programs,<br>\n   APIs, protocols, algorithms, design patterns, specification<br>\n   languages, programming languages and beyond.  It involves technology<br>\n   such as  ITP systems, ATP systems, SAT/SMT solvers, model checkers<br>\n   and decision procedures. Specific topics of the workshop include,<br>\n   but are not limited to:<br>\n     o  qualitative and quantitative modelling and  analysis<br>\n     o  formal specification and verification<br>\n     o  domain specific models, languages and solvers<br>\n     o  theorem proving technology for theory engineering<br>\n     o  integration of theories and tools<br>\n     o  applications of mechanised reasoning to formal modelling<br>\n     o  industrial case studies/experiences</p>\n<p>We especially invite industrial contributions from the areas of<br>\n   network protocols and concurrent systems, but any submission on<br>\n   the topics outlined  is very welcome.</p>\n<p>INVITED SPEAKER<br>\n   o  Timothy Griffin, University of Cambridge, UK<br>\n   o  TBA</p>\n<p>SUBMISSIONS<br>\n   Submission of papers for presentation at the workshop are now<br>\n   invited. Submissions are limited to 10 pages,  but shorter extended<br>\n   abstracts are welcome. All papers will be reviewed by the programme<br>\n   committee, and a balanced programme will be selected based on<br>\n   relevance and technical soundness. Submissions must  be in PDF<br>\n   using the LaTeX EasyChair-format <a href=\"http://www.easychair.org/easychair.zip\">http://www.easychair.org/easychair.zip</a><br>\n.<br>\n   Accepted papers will be published as CEUR Workshop Proceedings.</p>\n<p>If quality and quantity of the submissions warrants this, we<br>\n   plan to publish a special issue of a recognized journal on the<br>\n   topic of the workshop.</p>\n<p>IMPORTANT DATES:<br>\n   Submission:    29 April 2011<br>\n   Notification:    30 May 2011<br>\n   Final version:   1 July 2011<br>\n   Workshop:       31 July 2011</p>\n<p>PROGRAMME COMMITTEE<br>\n   o  Michael Butler, University of Southampton, UK<br>\n   o  Ewen Denney, NASA, US<br>\n   o  Peter Hoefner, NICTA, Australia<br>\n   o  Joe Hurd, Galois, Inc., US<br>\n   o  Rajeev Joshi, NASA (JPL) , US<br>\n   o  Annabelle McIver, Macquarie University/NICTA, Australia<br>\n   o  Stephan Merz, INRIA, France<br>\n   o  Marius Portmann, University of Queensland/NICTA, Australia<br>\n   o  Georg Struth, University of Sheffield, UK<br>\n   o  Geoff Sutcliffe, University of Miami, US</p>\n<p>ORGANISERS<br>\n   Peter Hoefner, NICTA, Australia<br>\n   Annabelle McIver, Macquarie University, Australia<br>\n   Georg Struth, University of Sheffield, UK</p>\n<p>The information in this e-mail may be confidential and subject to legal professional privilege and/or copyright. National ICT Australia Limited accepts no liability for any damage caused by this email or its attachments.</p>",
        "id": 294129919,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660842453
    }
]