[
    {
        "content": "<p>From: Vitaly Shmatikov &lt;<a href=\"mailto:shmat@cs.utexas.edu\">shmat@cs.utexas.edu</a>&gt;<br>\nPlease accept our apologies if you receive this in error or more than <br>\nonce.</p>\n<p>CALL FOR PAPERS<br>\n================<br>\nFCS'09</p>\n<p>Workshop on Foundations of Computer Security<br>\n<a href=\"http://www.loria.fr/~cortier/FCS09/\">http://www.loria.fr/~cortier/FCS09/</a></p>\n<p>August 9-10, 2009, Los Angeles, California, USA<br>\nAffiliated with LICS'09.</p>\n<p>IMPORTANT DATES<br>\n================<br>\nPapers due:     April 14 (extended!), 2009<br>\nNotification of acceptance:     May 29, 2009<br>\nFinal papers:   June 30, 2009</p>\n<p>SCOPE<br>\n======<br>\nComputer security is an established field of computer science of both<br>\ntheoretical and practical significance. In recent years, there has been<br>\nincreasing interest in logic-based foundations for various methods in<br>\ncomputer security, including the formal specification, analysis and design<br>\nof security protocols and their applications, the formal definition<br>\nof various aspects of security such as access control mechanisms,<br>\nmobile code security and denial-of-service attacks, and the modeling<br>\nof information flow and its application to confidentiality policies,<br>\nsystem composition, and covert channel analysis.</p>\n<p>The aim of the workshop FCS'09 is to provide a forum for continued<br>\nactivity in different areas of computer security, bringing computer<br>\nsecurity researchers in closer contact with the LICS community and giving<br>\nLICS attendees an opportunity to talk to experts in computer security,<br>\non the one hand, and contribute to bridging the gap between logical<br>\nmethods and computer security foundations, on the other.</p>\n<p>We are interested both in new results in theories of computer security<br>\nand also in more exploratory presentations that examine open questions<br>\nand raise fundamental concerns about existing theories, as well as in<br>\nnew results on developing and applying automated reasoning techniques and<br>\ntools for the formal specification and analysis of security protocols. We<br>\nthus solicit submissions of papers both on mature work (possibly based<br>\non already published material) and on work in progress.</p>\n<p>Possible topics include, but are not limited to:</p>\n<p>Automated reasoning techniques, Composition issues, Formal specification,<br>\nFoundations of verification, Information flow analysis, Language-based<br>\nsecurity, Logic-based design, Program transformation, Security models,<br>\nStatic analysis, Statistical methods, Tools, Trust management for Access<br>\ncontrol and resource usage control, Authentication, Availability and<br>\ndenial of service, Covert channels, Confidentiality, Integrity and<br>\nprivacy, Intrusion detection, Malicious code, Mobile code, Mutual<br>\ndistrust, Privacy, Security policies, Security protocols</p>\n<p>All submissions will be peer-reviewed. Authors of accepted papers must<br>\nguarantee that their paper will be presented at the workshop.</p>\n<p>SUBMISSION <br>\n===========<br>\nSubmissions should be at most 15 pages (a4paper, 11pt), including<br>\nreferences.  The cover page should include title, names of authors,<br>\nco-ordinates of the corresponding author, an abstract, and a list<br>\nof keywords. Submissions that are clearly too long may be rejected<br>\nimmediately. Additional material intended for the referees but not<br>\nfor publication in the final version - for example details of proofs -<br>\nmay be placed in a clearly marked appendix that is not included in the<br>\npage limit.</p>\n<p>Authors are invited to submit their papers electronically, as portable<br>\ndocument format (pdf) or postscript (ps); please, do not send files<br>\nformatted for work processing packages (e.g., Microsoft Word or<br>\nWordperfect files). The only mechanism for paper submissions is via the<br>\ndedicated easychair submission web page.</p>\n<p><a href=\"http://www.easychair.org/conferences/?conf=fcs09\">http://www.easychair.org/conferences/?conf=fcs09</a></p>\n<p>PUBLICATION<br>\n============<br>\nInformal proceedings will be made available in electronic format and<br>\nthey will be distributed to all participants of the workshop.</p>\n<p>AUDIENCE<br>\n=========<br>\nParticipation to the workshop will be open to anybody willing to register.</p>\n<p>PROGRAM COMMITTEE<br>\n===================<br>\nAlessandro Armando (Universita di Genova, Italy)<br>\nMichael Backes (Saarland University and MPI-SWS, Germany)<br>\nMichele Bugliesi (Universita Ca Foscari, Italy)<br>\nStephen Chong (Harvard University, USA)<br>\nVeronique Cortier (LORIA INRIA-Lorraine, France; co-chair)<br>\nCas Cremers (ETH Zurich, Switzerland)<br>\nStephanie Delaune (CNRS - ENS de Cachan, France)<br>\nDeepak Garg (Carnegie Mellon University, USA)<br>\nDieter Gollman (Hamburg University of Technology, Germany)<br>\nJerry den Hartog  (Technical University of Eindhoven, The Netherlands)<br>\nJan Juerjens (The Open University and Microsoft Research (Cambridge), UK)<br>\nRalf Kuesters (Universitat Trier, Germany)<br>\nCatherine Meadows (Naval Research Laboratory, USA)<br>\nMark Ryan (University of Birmingham, UK)<br>\nVitaly Shmatikov (University of Texas at Austin, USA; co-chair)<br>\nLuca Vigano (Universita di Verona, Italy)</p>\n<p>ADDITIONAL INFORMATION<br>\n=======================<br>\nThe workshop is supported by the ANR-07-SESU-002 AVOTE.</p>",
        "id": 294075904,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660828868
    }
]