[
    {
        "content": "<p>From: Burkhart Wolff &lt;<a href=\"mailto:Burkhart.Wolff@lri.fr\">Burkhart.Wolff@lri.fr</a>&gt;<br>\nDear all,</p>\n<p>it is a pleasure to present two papers for the research field \"Test&amp;Proof\", <br>\naiming at novel combinations of (Isabelle)-proofs and test-generation techniques.</p>\n<p>A) Authors: A. Brucker, L. Brügger, P. Kearney and Burkhart Wolff:<br>\n  Title: Verified Firewall Policy Transformations for Test Case Generation<br>\n    Abstract: <br>\n      We present an optimization technique for model-based generation of test cases <br>\n   for firewalls. Based on a formal model for firewall policies in higher-order logic, <br>\n   we derive a collection of semantics-preserving policy transformation rules and an <br>\n   algorithm that optimizes the specification with respect of the number of test <br>\n   cases required for path coverage.  The correctness of the rules and the algorithm <br>\n   is established by formal proofs in Isabelle/HOL. Finally, we use the normalized <br>\n   policies to  generate test cases with the domain-specific firewall testing tool <br>\n   Isabelle/TestGen/FW.<br>\n    The resulting procedure is characterized by a gain in efficiency<br>\n    of two orders of magnitude and can handle configurations with<br>\n    hundreds of rules as occur in practice.<br>\n   Appeared in ICST 2010, URL: .pdf</p>\n<p>B) Authors: A. Brucker, L. Brügger, P. Kearney, and B. Wolff. <br>\n      Title: An approach to modular and testable security models of real-world health-care applications.<br>\n      Abstract: We present a generic modular policy modelling framework and instantiate it with a <br>\n       substantial case study for model- based testing of some key security mechanisms of applica- tions and services <br>\n       of the NPfIT. NPfIT, the National Pro- gramme for IT, is a very large-scale development project aiming to modernise <br>\n       the IT infrastructure of the National Health Service (NHS) in England. Consisting of heteroge- neous and distributed <br>\n       applications, it is an ideal target for model-based testing techniques of a large system exhibiting critical security features.<br>\n       We model the four information governance principles, com- prising a role-based access control model, as well as policy <br>\n       rules governing the concepts of patient consent, sealed en- velopes and legitimate relationships. The model is given in <br>\n       Higher-order Logic (HOL) and processed together with suit- able test specifications in the hol-TestGen system, that <br>\n       generates test sequences according to them. Particular em- phasis is put on the modular description of security policies <br>\n       and their generic combination and its consequences for model-based testing.</p>\n<p>To appear in SACMATR 2011, URL: <a href=\"http://www.lri.fr/~wolff/papers/conf/2011-sacmat-mbtsec-npfit.pdf\">http://www.lri.fr/~wolff/papers/conf/2011-sacmat-mbtsec-npfit.pdf</a></p>\n<p>Enjoy !</p>\n<p>bu</p>",
        "id": 294134227,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660843832
    }
]