[
    {
        "content": "<p>From: <a href=\"mailto:gottfried.barrow@gmx.com\">gottfried.barrow@gmx.com</a><br>\nThis comment falls under the \"Dude, this is awesome\" category, and no <br>\nreply is needed. I try to keep my comments to a minimum, but I make this <br>\none.</p>\n<p>Bibliographies leading to bibliographies led me to Blanchett's <br>\n\"Automatic Proofs and Refutations for Higher-Order Logic\" <br>\n&lt;<a href=\"http://www4.in.tum.de/%7Eblanchet/\">http://www4.in.tum.de/%7Eblanchet/</a>&gt;.</p>\n<p>There are developers of other provers who listen in, so this comment <br>\ncould also serve as a feature request from one user, me, for their products.</p>\n<p>I've said that I don't care about automatic proving. For my purposes, <br>\nwhatever I prove I have to understand, so automatic proving doesn't help <br>\nme unless I can be shown the automatic prover's proof, and understand <br>\nthe details, or have a general idea of what the prover did. My intended <br>\naudience, by and large, also won't be impressed by automatic proofs. <br>\nThere has to be educational content in the details of my proofs, where <br>\nthe amount of detail has to be balanced (which, of course, requires some <br>\nauto proving), but where there isn't a total absence of details.</p>\n<p>On the other hand, as to counterexamples, there's no requirement that I <br>\nunderstand anything other than that the counterexample has proven me <br>\nwrong, so I'll be keeping in mind the Isabelle tools that will look for <br>\ncounterexamples. As Blanchett says,</p>\n<p>Novices and experts alike can enter invalid formulas and find <br>\nthemselves wasting hours<br>\n     (or days) on an impossible proof; once they identify and correct <br>\nthe error, the proof is often easy.</p>\n<p>I saw in the past a little of the results of Quickcheck, but I had <br>\nforgotten about the counterexample tools.</p>\n<p>But back to automatic proving, I'm sure it'll come in handy when I have <br>\n\"The Important Promising Conjecture\", or even under less important <br>\ncircumstances. What I think I don't want, I sometimes do want.</p>\n<p>Power is whatever you need. I had a mini-debate with someone who had no <br>\nsympathy with the idea that I needed a proof assistant instead of an <br>\nautomatic prover. Power to him was automatic proving. Power to me was <br>\nbeing able to specify the proof steps. I guess both are powerful, since <br>\nboth take a massive amount of work to implement.</p>\n<p>--GB</p>",
        "id": 294160060,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660852799
    }
]