[
    {
        "content": "<p>From: Martina Seidl &lt;<a href=\"mailto:martina.seidl@jku.at\">martina.seidl@jku.at</a>&gt;<br>\nFirst Call for Papers<br>\n26th International Conference on Computer Aided Verification (CAV’14)<br>\nPart of Vienna Summer of Logic (VSL'14)<br>\n18-22 July 2014, Vienna, Austria<br>\n<a href=\"http://www.cavconference.org\">http://www.cavconference.org</a></p>\n<p>New Rules</p>\n<hr>\n<p>We will continue to have short and long papers, but<br>\nshort papers are not restricted to be tool papers anymore.</p>\n<p>Further, we particularly encourage to submit high<br>\nquality tool papers and empirical evaluations as long papers.</p>\n<p>References do not count toward the page limit.</p>\n<p>More details are explained below.</p>\n<p>Aims and Scope</p>\n<hr>\n<p>CAV 2014 is the 26th in a series dedicated to the advancement of the<br>\ntheory and practice of computer-aided formal analysis methods for<br>\nhardware and software systems. As part of the Federated Logic<br>\nConference (FloC) and the Vienna Summer of Logic (<a href=\"http://vsl2014.at\">vsl2014.at</a>), CAV14<br>\nwill be collocated with many other conferences in logic. CAV<br>\nconsiders it vital to continue spurring advances in hardware and<br>\nsoftware verification while expanding to new domains such as<br>\nbiological systems and computer security. The conference covers the<br>\nspectrum from theoretical results to concrete applications, with an<br>\nemphasis on practical verification tools and the algorithms and<br>\ntechniques that are needed for their implementation. The proceedings<br>\nof the conference will be published in the Springer-Verlag Lecture<br>\nNotes in Computer Science series. A selection of papers will be<br>\ninvited to a special issue of Formal Methods in System Design and the<br>\nJournal of the ACM.</p>\n<p>Topics of interest include but are not limited to:</p>\n<hr>\n<p>Algorithms and tools<br>\n   for verifying models and implementations</p>\n<p>Hardware verification techniques</p>\n<p>Deductive, compositional, and<br>\n   abstraction techniques for verification</p>\n<p>Program analysis and software verification</p>\n<p>Verification methods for parallel and<br>\n   concurrent hardware/software systems</p>\n<p>Testing and runtime analysis based on verification technology</p>\n<p>Applications and case studies in verification</p>\n<p>Decision procedures and solvers for verification</p>\n<p>Mathematical and logical foundations<br>\n   of practical verification tools</p>\n<p>Verification in industrial practice</p>\n<p>Algorithms and tools for system synthesis</p>\n<p>Hybrid systems and embedded systems verification</p>\n<p>Verification techniques for security</p>\n<p>Formal models and methods for biological systems</p>\n<p>Events</p>\n<hr>\n<p>FLOC will host CAV-related workshops on 17-18 July and on 23-24 July<br>\nand the first day of CAV will be dedicated to tutorials. Please see<br>\nthe conference website for further details.</p>\n<p>Paper Submission</p>\n<hr>\n<p>Submissions should contain original research, and sufficient detail<br>\nto assess the merits and relevance of the contribution. We welcome<br>\npapers on theory, case studies and reproductions and comparisons of<br>\nexisting experimental research, tool papers, as well as combinations<br>\nof new theory with experimental evaluation. In contrast to previous<br>\nyears, we have decoupled paper length from paper topic: We welcome<br>\nboth long tool papers and short papers of any kind.</p>\n<p>Tool papers should describe system and implementation aspects of a<br>\ntool with a large (potential) user base (experiments not required,<br>\nrehash of theory strongly discouraged). Papers describing tools that<br>\nhave already been presented (in any conference) will be accepted only<br>\nif significant and clear enhancements to the tool are reported and<br>\nimplemented. Submissions reporting on case studies in an industrial<br>\ncontext are strongly invited, and should describe details,<br>\nweaknesses, and strengths in sufficient depth. Papers reproducing and<br>\ncomparing existing results experimentally do not require new<br>\ntheoretical insights. Examples of contributions of such papers are<br>\nevaluations of existing results in a superior experimental setting<br>\nand comparisons of methods that have not previously been thoroughly<br>\nexperimentally compared.</p>\n<p>The authors of tool papers and papers with experimental evaluation<br>\nshould make every effort to make results reproducible by submitting<br>\nthrough EasyChair a repository including the implementation in source<br>\nand binary as well as benchmarks and logfiles. If this is not<br>\npossible, the reasons should be explained in the paper.</p>\n<p>Papers can be submitted in either a regular or a short format.</p>\n<p>Regular Papers should not exceed 15 pages in LNCS format,<br>\nnot counting references.</p>\n<p>Short Papers should not exceed 6 pages, not counting references.<br>\nShort papers are encouraged for any subject that can be described<br>\nwithin the page limit, and in particular for novel ideas without an<br>\nextensive experimental evaluation. Short papers will be accompanied<br>\nby short presentations.</p>\n<p>An appendix can provide additional material such as details on proofs<br>\nor experiments. The appendix is not guaranteed to be read or taken<br>\ninto account by the reviewers and it should not contain information<br>\nnecessary to the understanding and the evaluation of the presented<br>\nwork. Papers will be accepted or rejected in the category in which<br>\nthey were submitted, there will be no \"demotions\" from a regular to a<br>\nshort paper.</p>\n<p>Simultaneous submission to other conferences with proceedings or<br>\nsubmission of material that has already been published elsewhere is<br>\nnot allowed.</p>\n<p>The review process will include a feedback/rebuttal period where<br>\nauthors will have the option to respond to reviewer comments.</p>\n<p>Papers must be submitted in PDF format. Submission is done with<br>\nEasyChair.  Information about the submission procedure will be<br>\navailable at: <a href=\"http://www.cavconference.org\">http://www.cavconference.org</a>.</p>\n<p>Deadlines</p>\n<hr>\n<p>Abstract submission: 31 January 2014</p>\n<p>Paper submission (firm): 7 February 2014</p>\n<p>Author feedback/rebuttal period: 20-23 March 2014</p>\n<p>Notification of acceptance/rejection: 18 April 2014</p>\n<p>Final version due: 9 May 2014</p>\n<p>(all deadlines are \"anywhere on earth\")</p>\n<p>Tutorials</p>\n<hr>\n<p>Fabio Somenzi, University of Colorado at Boulder, USA will give a<br>\n   tutorial on Hardware Model Checking.</p>\n<p>David Monniaux, CNRS, Verimag, Grenoble, France<br>\n   will give a tutorial on Abstract Interpretation.</p>\n<p>Call for Nominations for the CAV Award</p>\n<hr>\n<p>Anyone can submit a nomination. The Award Committee can originate a<br>\nnomination. Anyone, with the exception of members of the Award<br>\nCommittee, is eligible to receive the Award. A nomination must state<br>\nclearly the contribution(s), explain why the contribution is<br>\nfundamental or the series of contributions is outstanding, and be<br>\naccompanied by supporting letters and other evidence of worthiness.</p>\n<p>Nominations should include a proposed citation (up to 25 words), a<br>\nsuccinct (100-250 words) description of the contribution(s), and a<br>\ndetailed statement to justify the nomination. The cited<br>\ncontribution(s) must have been made not more recently than five years<br>\nago and not over twenty years ago. In addition, the contribution(s)<br>\nshould not yet have received recognition via a major award, such as<br>\nthe ACM Turing or Kanellakis Awards. The nominee may have received<br>\nsuch an award for other contributions.</p>\n<p>The 2014 CAV Award Committee consists of</p>\n<p>Marta Kwiatkowska, Oxford University, UK, Chair</p>\n<p>Moshe Vardi, Rice University, USA</p>\n<p>Ahmed Bouajjani, University Paris Diderot, France</p>\n<p>Tom Ball, Microsoft, USA</p>\n<p>The nominations should be sent to Martha Kwiatowska<br>\n(<a href=\"mailto:Marta.Kwiatkowska@cs.ox.ac.uk\">Marta.Kwiatkowska@cs.ox.ac.uk</a>).</p>\n<p>Nominations must be received by January 15, 2014.</p>\n<p>Chairs</p>\n<hr>\n<p>Armin Biere, Johannes Kepler University Linz, Austria<br>\nRoderick Bloem, Graz University of Technology, Austria</p>\n<p>Program Committee</p>\n<hr>\n<p>Rajeev Alur, University of Pennsylvania, USA<br>\nDomagoj Babic, Google, USA<br>\nGogul Balakrishnan, NEC, USA<br>\nArmin Biere, Johannes Kepler University Linz, Austria<br>\nNikolaj Bjorner, Microsoft Research, USA<br>\nRoderick Bloem, Graz University of Technology, Austria<br>\nAhmed Bouajjani, University Paris Diderot, France<br>\nAaron Bradley, Mentor Graphics, University of Colorado at Boulder, USA<br>\nPavol Cerny, University of Colorado at Boulder, USA<br>\nKoen Claessen, Chalmers University of Technology, Sweden<br>\nByron Cook, Microsoft and University College London, UK<br>\nAzadeh Farzan, University of Toronto, Canada<br>\nBernd Finkbeiner, Saarland University, Germany<br>\nJasmin Fisher, Microsoft, UK<br>\nMike Gordon, University of Cambridge, UK<br>\nOrna Grumberg, Technion, Israel<br>\nLeopold Haller, Cadence, USA<br>\nKeijo Heljanko, Aalto University, Finland<br>\nWilliam Hung, Synopsys, USA<br>\nSomesh Jha, University of Wisconsin, USA<br>\nSusmit Jha, Intel, USA<br>\nBarbara Jobstmann, EPFL, Jasper DA, and CNRS-Verimag, France<br>\nBengt Jonsson, Uppsala University, Sweden<br>\nLaura Kovacs, Chalmers University of Technology, Sweden<br>\nDaniel Kroening, Oxford University, UK,<br>\nMarta Kwiatkowska, Oxford University, UK<br>\nKim G. Larsen, Aalborg University, Denmark<br>\nJoao Marques-Silva, University College Dublin, Ireland<br>\nKedar Namjoshi, Bell Labs, USA<br>\nCorina Pasareanu, CMU/NASA Ames Research Center, USA<br>\nDoron Peled, Bar Ilan University, Israel<br>\nPavithra Prabhakar, IMDEA Software Institute, Spain<br>\nJean-Francois Raskin, Université Libre de Bruxelles, Belgium<br>\nKoushik Sen, University of California, Berkeley, USA<br>\nNatasha Sharygina, Universita’ della Svizzera Italiana, Switzerland<br>\nNishant Sinha, IBM, India<br>\nAnna Slobodova, Centaur Technology, USA<br>\nFabio Somenzi, University of Colorado at Boulder, USA<br>\nCesare Tinelli, The University of Iowa, USA<br>\nThomas Wahl Northeastern University, USA<br>\nGeorg Weissenbacher, Vienna University of Technology, Austria<br>\nEran Yahav, Technion, Israel</p>\n<p>Workshop / Competition Chair</p>\n<hr>\n<p>Martina Seidl, Johannes Kepler University Linz, Austria</p>\n<p>Publication Chair</p>\n<hr>\n<p>Swen Jacobs, Graz University of Technology, Austria</p>\n<p>Steering Committee</p>\n<hr>\n<p>Michael Gordon, University of Cambridge, UK<br>\nOrna Grumberg, Technion, Israel<br>\nAarti Gupta, NEC, USA<br>\nKenneth McMillan, Microsoft, USA</p>",
        "id": 294255325,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660912373
    }
]