[
    {
        "content": "<p>From: \"Rozman, Mihaela\" &lt;<a href=\"mailto:mihaela.rozman@tuwien.ac.at\">mihaela.rozman@tuwien.ac.at</a>&gt;<br>\nThe Communication Technologies group of the University of Vienna is looking for a motivated student interested in pursuing a PhD on developing the foundations of the next generation of reliable networks: networks which are highly automated,  and verify and correct themselves autonomously, relying on formal methods. Communication networks have become a critical infrastructure of our society and hence come with stringent requirements on dependability. We believe that automation can improve reliability: many network outages these days are due to human errors.</p>\n<p>WHAT WE OFFER<br>\n-The research position is at the Faculty of Computer Science at the University of Vienna and is fully funded.(Employment contract)<br>\n-The candidate also has the opportunity to collaborate with Aalborg University, Denmark, and engage into longer visits, if she/he is interested: Aalborg University is a project partner.<br>\n-Additionally, the successful candidate will have the opportunity to collaborate with the doctoral program Logical Methods in Computer Science (LogiCS), run by TU Wien, TU Graz and JKU Linz, and funded by the Austrian Science Fund.<br>\n-We offer a productive research environment and excellent contacts to other universities as well as industry interested in this application domain. While our goal is to lay the theoretical foundations of such networks, we also plan to prototype our ideas and ideally make a practical contribution. For an idea on the kind of research we are doing in this area, please see the sample publications attached below.</p>\n<p>ELIGIBILITY</p>\n<p>The candidate should have a strong background in formal methods, model checking and algorithms, and be knowledgeable about communication networks, with a strong interest in this application domain.</p>\n<p>APPLICATION</p>\n<p>To apply, please send your:</p>\n<p>-Academic curriculum vitae<br>\n-motivation letter, and<br>\n-reference letters</p>\n<p>to Prof. Stefan Schmid by email, or use the online portal at <a href=\"https://univis.univie.ac.at/ausschreibungstellensuche/\">https://univis.univie.ac.at/ausschreibungstellensuche/</a></p>\n<p>Please do not hesitate to contact Stefan Schmid for any further information: ta.ca.eivinu@dimhcs_nafets</p>\n<p>Deadline: June 7, 2020</p>\n<p>Starting date: ideally as soon as possible, latest in October 2020.</p>\n<p>SAMPLE PUBLICATIONS</p>\n<p>P-Rex: Fast Verification of MPLS Networks with Multiple Link Failures<br>\nJesper Stenbjerg Jensen, Troels Beck Krogh, Jonas Sand Madsen, Stefan Schmid, Jiri Srba, and Marc Tom Thorgersen.<br>\n14th ACM International Conference on emerging Networking EXperiments and Technologies (CoNEXT), Heraklion/Crete, Greece, December 2018.<br>\n<a href=\"https://www.univie.ac.at/ct/stefan/conext18.pdf\">https://www.univie.ac.at/ct/stefan/conext18.pdf</a></p>\n<p>Polynomial-Time What-If Analysis for Prefix-Manipulating MPLS Networks<br>\nStefan Schmid and Jiri Srba.<br>\n37th IEEE Conference on Computer Communications (INFOCOM), Honolulu, Hawaii, USA, April 2018.<br>\n<a href=\"https://www.univie.ac.at/ct/stefan/infocom18prefixnet.pdf\">https://www.univie.ac.at/ct/stefan/infocom18prefixnet.pdf</a></p>\n<p>HIGHEST QUALITY OF LIFE</p>\n<p>The Austrian city of Vienna, is located close to the Alps and surrounded by beautiful nature, and provides an exceptionally high quality of life, with a vibrant cultural scene, numerous cultural events, world-famous historical sites, a large international community, varied cuisine and famous coffee houses.</p>\n<p>If you decide to be located in Vienna, the city features a vibrant and excellence-driven research landscape, with several leading research institutes (e.g., TU Wien, University of Vienna, IST, AIT, SBA) and universities continuously establishing collaborations in various fields. Finally, Vienna has been consistently ranked by Mercer over the last years the best city for quality of life worldwide.</p>",
        "id": 294829095,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661245762
    }
]