[
    {
        "content": "<p>From: \"W. Douglas Maurer\" &lt;<a href=\"mailto:maurer@gwu.edu\">maurer@gwu.edu</a>&gt;<br>\nI am using LaTeX to write handouts about Isabelle/Isar for my <br>\nstudents. This allows me to make reference, in the handouts, to <br>\nnearly all of the special characters in the Symbols window in jEdit. <br>\nMost of them have references in LaTeX which resemble those in the <br>\nSymbols window, although some do not; for example, in LaTeX, I have <br>\nto write cap instead of Inter, llbracket instead of lbrakk, and so <br>\non. My immediate problem is that there are a very few special <br>\ncharacters whose LaTeX names I have not been able to find, even in my <br>\nsecond edition of the LaTeX Companion. These include \\&lt;^bsub&gt;, <br>\n\\&lt;^esub&gt;, \\&lt;^bsup&gt;, \\&lt;^esup&gt;, \\&lt;lbrace&gt;, \\&lt;rbrace&gt;, \\&lt;Midarrow&gt;, <br>\n\\&lt;midarrow&gt;, and \\&lt;Tturnstile&gt;. I don't want to have to draw these in <br>\nby hand on my handouts. Is there any way I can get any of these to <br>\ncome out of LaTeX? Thanks! -Douglas</p>",
        "id": 294291018,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660923460
    },
    {
        "content": "<p>From: Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt;<br>\nInstead of raw LaTeX you can use the Isabelle document preparation system <br>\nwith its predefined mapping from Isabelle symbols to LaTeX macros.  See <br>\nthe \"isar-ref\" manual chapter 4, or the \"system\" manual section 3.2 for <br>\nquick-start examples.</p>\n<p>The Isabelle document antiquotation @{text \"\\&lt;symbol&gt;\"} allows to typeset <br>\nthe given symbol (or more) the way it is normally done, but without any <br>\nformal meaning of the text.  You don't have to use LaTeX macros directly.</p>\n<p>If you just want to see how Isabelle symbols are rendered in LaTeX, see <br>\n$ISABELLE_HOME/lib/textinputs/isabellesym.sty -- it corresponds to <br>\n\"isar-ref\" appendix B.</p>\n<p>Makarius</p>",
        "id": 294291046,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660923472
    }
]