[
    {
        "content": "<p>From: Manfred Kerber &lt;<a href=\"mailto:mnfrd.krbr@gmail.com\">mnfrd.krbr@gmail.com</a>&gt;<br>\nHi,</p>\n<p>I was recently confused about expressions such as value \"(1::nat)/0\"<br>\nfor which I get the result 0 :: real.</p>\n<p>I understand that the logic used in Isabelle/HOL is total. However, I<br>\nthought that usually partiality is approximated by leaving the value<br>\nof expressions such as 1/0 as unspecified. What is the reason that<br>\nthis seems not to be the case for 1/0?</p>\n<p>Kind regards<br>\nManfred</p>",
        "id": 294725886,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661186392
    },
    {
        "content": "<p>From: \"Thiemann, Rene\" &lt;<a href=\"mailto:Rene.Thiemann@uibk.ac.at\">Rene.Thiemann@uibk.ac.at</a>&gt;<br>\nDear Manfred,</p>\n<p>I did not look in the history on why it was defined like this but just make<br>\nsome comments.</p>\n<p>As you already said, Isabelle is a logic of total function, so you have to totally specify<br>\ndivision. Therefore, there also is a special constant “undefined” of each type<br>\nwhich stands for some arbitrary fixed value of that type. So, “undefined :: real” <br>\nis a real number, but we don’t know whether it is 0, 1, pi, e, or ….</p>\n<p>So in principle, you could define division as<br>\n  “x / y = (if y = 0 then undefined else THE-unique z such that y * z = x)”</p>\n<p>As a consequence, several nice equalities now get preconditions.<br>\nFor instance, the current lemma times_divide_eq_left</p>\n<p>\"b / c * a = b * a / c” </p>\n<p>with the above definition will only be provable if c is not 0.</p>\n<p>This will definitely make formal proofs more verbose, because one now<br>\nhas to keep track that all divisions are not by 0. </p>\n<p>And on the contrary, even if you define “x / y” as above, then you still will be able to prove<br>\nthat “5 / 0 = 2 / 0” since both sides simplify to the same constant “undefined”.</p>\n<p>So even “undefined” behaviour is fully specified and can be exploited for proofs.<br>\n(though you can also define “x / y = (if y = 0 then undefined x else …)” where<br>\n then “5 / 0 = 2 / 0” simplifies to “undefined 5 = undefined 2” which as far as<br>\n I know impossible to proof or to disprove; here, “undefined” is a fixed function<br>\n of type real to real.).</p>\n<p>I hope this clarifies the situation a bit,<br>\nRené</p>",
        "id": 294725890,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661186394
    },
    {
        "content": "<p>From: Lawrence Paulson &lt;<a href=\"mailto:lp15@cam.ac.uk\">lp15@cam.ac.uk</a>&gt;<br>\nA bit of history: the first logic supported within Isabelle was Martin-Löf's constructive type theory, and it is still there (CTT). And while developing arithmetic within that formalisation, I came up with a definition (necessarily primitive recursive and executable) of division. It delivered n/0 = 0. Since then a number of people have noticed that defining x/0 = 0 is convenient. This identity holds in quite a few different proof assistants now. </p>\n<p>These things are conventions, exactly the same as announcing that x^-n = 1/x^n and that x^0 = 0.</p>\n<p>Larry Paulson</p>",
        "id": 294726036,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661186437
    },
    {
        "content": "<p>From: <a href=\"mailto:Michael.Norrish@data61.csiro.au\">Michael.Norrish@data61.csiro.au</a><br>\n﻿There is a spectrum of possibilities here.  </p>\n<p>At one end you have the attitude that takes OpenTheory to leave n - m undefined on the natural numbers when m &gt; n (and pre 0 also undefined). At the other, you can try to give \"reasonable\" values to everything.</p>\n<p>Note that if you want to have things be ‘properly’ unspecified, you would definitely take René’s second approach: that consequence (5/0 = 3/0) is horrid. </p>\n<p>As with all definitions, the question is what consequences you want to be true.</p>\n<p>Michael</p>",
        "id": 294726160,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661186478
    },
    {
        "content": "<p>From: Tobias Nipkow &lt;<a href=\"mailto:nipkow@in.tum.de\">nipkow@in.tum.de</a>&gt;<br>\nProgramming languages and logics are closely related but not identical. The same <br>\noperator may have different meanings in both, although it looks the same, eg <br>\n\"/\". This just means you cannot translate operators verbatim (in both <br>\ndirections) but have to take their semantics into account. Thus \"/\" in <br>\nIsabelle/HOL is not translated into \"/\" in (for example) ML but into a modified <br>\nversion that obeys \"1/0 = 0\".</p>\n<p>Tobias<br>\n<a href=\"/user_uploads/14278/zT0-jWXtfAGFeNhilO6qEjW9/smime.p7s\">smime.p7s</a></p>",
        "id": 294728445,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661187174
    },
    {
        "content": "<p>From: Andreas Röhler &lt;<a href=\"mailto:andreas.roehler@easy-emacs.de\">andreas.roehler@easy-emacs.de</a>&gt;<br>\nHi,</p>\n<p>that makes me some headache. IMHO the freedom of model making is <br>\nlimited. The task is to represent reality. We know what happens when the <br>\nquotient goes towards zero. From there don't see any reason why to <br>\nassume zero as result. This looks like a false positive and might make <br>\nresults unreliable. There should be better ways to deal with.</p>\n<p>Best,<br>\nAndreas Röhler</p>",
        "id": 294728509,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661187196
    },
    {
        "content": "<p>From: Lawrence Paulson &lt;<a href=\"mailto:lp15@cam.ac.uk\">lp15@cam.ac.uk</a>&gt;<br>\nFormal systems reveal hidden assumptions. So one might say “1/x is always nonzero\", which is certainly true, and we can be more precise and say “1/x is nonzero for all real x\", when we may become uneasy that the quantification includes zero. When you formalise that statement in predicate logic, with the usual axioms about the real numbers, it ends up being equivalent to  \"1/0 is nonzero\". And as there are no partial functions in classical predicate logic, any model must give 1/0 some value or other. Then the statement could be true or false.</p>\n<p>If you formalise this statement in Isabelle/HOL, it turns out to be false because 1/0 = 0. Similar statements will be false in quite a few other formal systems, in many cases because 1/x cannot be shown to be well-defined. There is a formalism known as free logic that deals explicitly in the concept of a defined value, where 1/0 = 0 is false because 1/0 is undefined, and therefore we can prove 1/0 ≠ 0. But that may not look very natural either.</p>\n<p>Larry Paulson</p>",
        "id": 294728512,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661187198
    },
    {
        "content": "<p>From: Andreas Röhler &lt;<a href=\"mailto:andreas.roehler@easy-emacs.de\">andreas.roehler@easy-emacs.de</a>&gt;<br>\nHi Lawrence,</p>\n<p>thanks for your kind response.</p>\n<p>That matter seems worth digging in further and probably more fundamental.</p>\n<p>Why do we care for math and logic? Because we want to solve real problem <br>\nin the world outside, right? From there (the outer world) I guess some <br>\nguidance might be derived how the build the model:</p>\n<p>Question: Who needs to divide by zero and what does it mean, should that <br>\nneed arrive? May someone point me to such a real case?</p>\n<p>Guess a kind of non-normal state is reached when that necessity arrives. <br>\nI.e. that would mean, we can't go on with true/false or some number. <br>\nThrowing an exception then must not mean an error --at least being not <br>\nsure about that--, but trigger special treatment.</p>\n<p>Best,</p>\n<p>Andreas Röhler</p>",
        "id": 294728524,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661187204
    },
    {
        "content": "<p>From: Lawrence Paulson &lt;<a href=\"mailto:lp15@cam.ac.uk\">lp15@cam.ac.uk</a>&gt;<br>\nThe advantage of defining x/0 = 0 is that it allows a number of common identities to be used without side conditions. One example (of many) is x/z + y/z = (x+y)/z.</p>\n<p>It seems to me you are too focused on programming. You do not throw exceptions in mathematics, and division does not exist in the world outside. If you do want to reason about programming (including exceptions), then you need to formalise the semantics of your language, but that is separate from the formalisation of mathematics itself.</p>\n<p>As I mentioned in my previous message, there are a number of formalisms that allow you to reason about things being defined. But they never catch on because they are tiresome to use. Generally they force you to show things to be defined (and if you have a large expression, that means every single subexpression). Proving theorems is difficult, which is why we try to avoid introducing additional complications.</p>\n<p>Larry Paulson</p>",
        "id": 294728535,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661187210
    },
    {
        "content": "<p>From: Manfred Kerber &lt;<a href=\"mailto:mnfrd.krbr@gmail.com\">mnfrd.krbr@gmail.com</a>&gt;<br>\nDear All,</p>\n<p>Many thanks for all your answers; they are very helpful. Yes, I<br>\nunderstand the statement and agree with it that we are free in<br>\ndefining concepts and that we should do so with the properties we want<br>\nto get in mind. As somebody who is interested in the extraction of<br>\ncode, I am also concerned with the relationship of the Isabelle<br>\ndefinition and that in a programming language. Should it be a goal to<br>\nhave definitions for partial functions such as division that are close<br>\nto the ones taken in programming languages? Or can we convincingly<br>\ndefend a design decision for 1/0 = 0 to programming language people<br>\nwho could have also gone the route of defining 1/0 as 0, but had very<br>\ngood reasons not to do this and are more willing to accept a crash<br>\nthan the answer 0? Or do we have to accept that Isabelle is for such<br>\ncases different from standard programming languages and argue that we<br>\nbest avoid such expressions?</p>\n<p>Best wishes<br>\nManfred</p>",
        "id": 294729236,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661187431
    }
]