[
    {
        "content": "<p>From: Milad Niqui &lt;<a href=\"mailto:M.Niqui@cwi.nl\">M.Niqui@cwi.nl</a>&gt;<br>\nPlease distribute to those you might think are interested.</p>\n<p>========================================================================<br>\n                         1st Call for Papers</p>\n<p>PAR 2010</p>\n<p>Workshop on Partiality And Recursion in Interactive Theorem Provers<br>\n                     Edinburgh, UK, 15 July 2010<br>\n                   (satellite workshop of ITP'10)<br>\n                       a mid-FLoC 2010 workshop</p>\n<p>&lt;<a href=\"http://www.cs.st-andrews.ac.uk/~ek/PAR-10/\">http://www.cs.st-andrews.ac.uk/~ek/PAR-10/</a>&gt;</p>\n<p>========================================================================</p>\n<p>PAR'10 workshop is a venue for researchers working on new approaches<br>\nto cope with partial functions and terminating general (co)recursion<br>\nin theorem provers.</p>\n<p>Theorem provers with inductive types provide a restricted programming<br>\nlanguage together with a formal meta-theory for reasoning about the<br>\nlanguage.  When propositions are represented as types and proofs as<br>\nprograms, non-terminating proofs are disallowed for consistency and<br>\ndecidability of type checking.  As a result, there is no trivial way<br>\nto represent partial functions, and termination is syntactically<br>\nensured by imposing that the recursive calls must be made on<br>\nstructurally smaller arguments. Similar issues exist for productivity<br>\nof functions on infinite objects where syntactic methods are used to<br>\nensure an infinite flow of data. The workshop aims to address these<br>\nissues and various approaches for dealing with them.</p>\n<p>We invite submissions on all aspects of partiality and termination of<br>\ngeneral (co)recursive functions in a logical framework.</p>\n<p>The topics of this workshop include but are not limited to:</p>\n<ul>\n<li>\n<p>partial functions and functions over partial objects in theorem<br>\n  provers;</p>\n</li>\n<li>\n<p>specialised type systems for general (co)recursion;</p>\n</li>\n<li>\n<p>syntactical tests to guarantee termination of general recursive<br>\n  functions;</p>\n</li>\n<li>\n<p>syntactical tests to guarantee productivity of functions on infinite<br>\n  objects;</p>\n</li>\n<li>\n<p>methods to ensure termination of special classes of recursion<br>\n  definitions, eg nested recursion, simultaneous inductive-recursive<br>\n  data types and functions;</p>\n</li>\n<li>\n<p>semantic approaches to termination and productivity, eg based on<br>\n  domain theory and topology;</p>\n</li>\n<li>\n<p>categorical approaches to termination and productivity;</p>\n</li>\n<li>\n<p>algebra of programming with partial functions and general<br>\n  (co)recursion.</p>\n</li>\n</ul>\n<p>Description of software tools and case studies for dealing with the<br>\nissues in the scope of the workshop are welcome.</p>\n<p>Submissions</p>\n<hr>\n<p>The articles will be evaluated by the PC for publication in the<br>\nproceedings of the workshop. The final proceedings will be published<br>\nafter the workshop as a special issue of EPTCS and a preliminary<br>\nversion will be available during the workshop.</p>\n<p>The articles must contain original contributions, be clearly written,<br>\nand include appropriate reference to and comparison with related<br>\nwork. Submissions should preferably not exceed 16 pages (excluding<br>\nbibliography). Submissions must be prepared in LaTeX using the EPTCS<br>\nmacro package &lt;<a href=\"http://style.eptcs.org/\">http://style.eptcs.org/</a>&gt;.</p>\n<p>The web-based system EasyChair will be used for submission<br>\n(&lt;<a href=\"http://www.easychair.org/conferences/?conf=par10\">http://www.easychair.org/conferences/?conf=par10</a>&gt;).</p>\n<p>Important dates</p>\n<hr>\n<ul>\n<li>29 March 2010: Submission deadline</li>\n<li>29 April 2010: Notification of acceptance</li>\n<li>24 May 2010: Final version of accepted papers</li>\n<li>15 July 2010: the workshop</li>\n</ul>\n<p>Invited Speakers</p>\n<hr>\n<ul>\n<li>Conor McBride (University of Strathclyde)</li>\n<li>TBA</li>\n</ul>\n<p>Programme Committee</p>\n<hr>\n<p>Andreas Abel (Ludwig Maximilians University Munich, D)<br>\nYves Bertot (INRIA Sophia-Antipolis, FR)<br>\nAna Bove (Chalmers University of Technology, SE)<br>\nEkaterina Komendantskaya (University of St Andrews, UK)<br>\nRalph Matthes (IRIT Toulouse, FR)<br>\nMilad Niqui (CWI, NL)<br>\nAnton Setzer (Swansea University, UK)</p>\n<p>Organisers</p>\n<hr>\n<p>Ana Bove<br>\nEkaterina Komendantskaya<br>\nMilad Niqui</p>",
        "id": 294098973,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660833180
    }
]