[
    {
        "content": "<p>From: Gidon ERNST &lt;<a href=\"mailto:gidon@nii.ac.jp\">gidon@nii.ac.jp</a>&gt;</p>\n<hr>\n<p>VerifyThis Verification Competition 2018</p>\n<p>FIRST ANNOUNCEMENT AND CALL FOR PROBLEMS</p>\n<p>Competition to be held at ETAPS 2018</p>\n<p><a href=\"http://verifythis.ethz.ch\">http://verifythis.ethz.ch</a></p>\n<hr>\n<p>Get involved, even if you cannot participate in the competition: provide a challenge.</p>\n<p>IMPORTANT DATES<br>\nSubmission deadline: March 9, 2018<br>\nCompetition: April 14 and 15, 2018</p>\n<p>CALL FOR PROBLEMS<br>\nTo extend the problem pool, we are now soliciting algorithms and data structures which could contribute interesting verification challenges for the VerifyThis program verification competition (itself introduced below).</p>\n<p>We encourage suggestions at any level of detail, in particular submissions without a fully worked out verification task.</p>\n<ul>\n<li>a problem may contain an informal statement of the algorithm to be implemented (optionally with complete or partial pseudocode) and the requirement(s) to be verified</li>\n<li>a problem should be suitable for a 60-90 minute time slot</li>\n<li>submission of reference solutions is welcome but not mandatory</li>\n<li>problems with an inherent language- or tool-specific bias should be clearly identified as such</li>\n<li>problems that contain several subproblems or other means of difficulty scaling are especially welcome</li>\n<li>the organizers reserve the right (but no obligation) to use the problems in the competition, either as submitted or with modifications</li>\n<li>submissions from (potential) competition participants are allowed</li>\n</ul>\n<p>Problems from previous competitions can be seen at <a href=\"http://verifythis.ethz.ch\">http://verifythis.ethz.ch</a></p>\n<p>Submissions are to be sent by email to <a href=\"mailto:verifythis@cs.nuim.ie\">verifythis@cs.nuim.ie</a> by the date indicated above.</p>\n<p>PRIZES<br>\nThe most suitable submission for competition will receive a prize.</p>\n<p>ABOUT<br>\nVerifyThis 2018 will take place as part of the European Joint Conferences on Theory and Practice of Software (ETAPS 2018) on April 14 and 15, 2018.<br>\nIt is the 7th event in the VerifyThis competition series.<br>\nInformation on previous events and participants can be found at <a href=\"http://verifythis.ethz.ch\">http://verifythis.ethz.ch</a></p>\n<p>The aims of the competition are:</p>\n<ul>\n<li>to bring together those interested in formal verification, and to provide an engaging, hands-on, and fun opportunity for discussion</li>\n<li>to evaluate the usability of logic-based program verification tools in a controlled experiment that could be easily repeated by others.</li>\n</ul>\n<p>The competition will offer a number of challenges presented in natural language. Participants have to formalize the requirements, implement a solution, and formally verify the implementation for adherence to the specification.</p>\n<p>There are no restrictions on the programming language and verification technology used. The correctness properties posed in problems will have the input-output behaviour of programs in focus. Solutions will be judged for correctness, completeness and elegance.</p>\n<p>ORGANIZERS</p>\n<ul>\n<li>Marieke Huisman, University of Twente, the Netherlands</li>\n<li>Rosemary Monahan, Maynooth University, Ireland</li>\n<li>Peter Müller, ETH Zürich, Switzerland</li>\n<li>Andrei Paskevich, Paris-Sud University, France</li>\n<li>Gidon Ernst, National Institute of Informatics Tokyo, Japan</li>\n</ul>\n<p>CONTACT<br>\nEmail: <a href=\"mailto:verifythis@cs.nuim.ie\">verifythis@cs.nuim.ie</a><br>\nWeb: <a href=\"http://verifythis.ethz.ch\">http://verifythis.ethz.ch</a></p>",
        "id": 294728178,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661187095
    }
]