[
    {
        "content": "<p>From: Helmut Seidl &lt;<a href=\"mailto:seidl@in.tum.de\">seidl@in.tum.de</a>&gt;<br>\n=======================================================<br>\n        Associate Professorship in Theoretical Computer Science<br>\n        =======================================================</p>\n<p>The Faculty of Computer Science of the Technische Universität München<br>\ninvites applications for a tenured associate professorship (W2)<br>\nin theoretical computer science.</p>\n<p>The Faculty seeks candidates with an excellent<br>\nresearch record in formal methods for<br>\nqualitative and quantitative analysis of systems, with<br>\napplications to the safety and security of software-intensive,<br>\nembedded, web-based, or mobile systems.</p>\n<p>The Faculty is particularly interested in candidates that can<br>\ncontribute to the Graduate School (Graduiertenkolleg)<br>\n\"Program and Model Analysis\", starting in July 2008. The goal of the<br>\nSchool is the development of analysis techniques combining methods from<br>\nstatic analysis, model checking, theorem proving and abstract<br>\ninterpretation.</p>\n<p>Successful candidates will be teaching in the Bachelor and Master<br>\nprogrammes of the Faculty. Interest in interdisciplinary cooperations within<br>\nthe University is expected.</p>\n<p>Applicants should have a doctorate and a Habilitation or<br>\nequivalent qualification, and be at most 52 years old.</p>\n<p>The Technische Universität München gives priority to<br>\napplicants with disabilities in the case of equal<br>\nqualification. The University has the strategic goal of substantially<br>\nincreasing the participation of women in research and teaching, and so<br>\nfemale scientists are encouraged to apply.</p>\n<p>Applications including a CV and a list of publications<br>\nshould be sent before August 8 to the Dean of the Faculty of Computer<br>\nScience at the following address</p>\n<p>Fakultät für Informatik<br>\nTechnische Universität München<br>\nBoltzmannstr. 3<br>\n85748 Garching bei München<br>\nGermany</p>",
        "id": 294062875,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660824383
    }
]