[
    {
        "content": "<p>From: Rene Vestergaard &lt;<a href=\"mailto:renevestergaard@acm.org\">renevestergaard@acm.org</a>&gt;<br>\nI've been unable to find a venue that's prepared to take on the task of <br>\nreviewing the work. The little feedback I've been able to obtain seems <br>\nto indicate that the desk/chief editors were unwilling to go ahead with <br>\nwork that does not fit within their prior experiences. Of course, this <br>\nleaves no room for multi- and antedisciplinary[*] efforts like Proofs of <br>\nLife. My suggestions of an editor group have been roundly ignored.</p>\n<p>Does anyone know of places with a proven record for mixed work?</p>\n<p>Outside-the-box thoughts?</p>\n<p>[The arXiv version is up to v3. The changes have mostly been about <br>\nbackground and, in particular, about translating axiomatic reasoning and <br>\nits meta-theory-carried implications into the languages of the other <br>\nnaturally-involved subjects. The manuscript is slightly too big for most <br>\nwide-audience venues as it stands.]</p>\n<p>Cheers,<br>\nRene</p>\n<p>[*] Sean R. Eddy. “Antedisciplinary” science. PLoS Computational <br>\nBiology, 1(1), 2005.</p>\n<hr>\n<p>ABSTRACT<br>\nWe axiomatize the molecular-biology reasoning style, show compliance of <br>\nthe standard reference: Ptashne, A Genetic Switch, and present <br>\nproof-theory-induced technologies to help infer phenotypes and to <br>\npredict life cycles from genotypes. The key is to note that <br>\n`reductionist discipline' entails constructive reasoning: any proof of a <br>\ncompound property can be decomposed to proofs of constituent properties. <br>\nProof theory makes explicit the inner structure of the axiomatized <br>\nreasoning style and allows the permissible dynamics to be presented as a <br>\nmode of computation that can be executed and analyzed. Constructivity <br>\nand execution guarantee simulation when working over domain-specific <br>\nlanguages. Here, we exhibit phenotype properties for genotype reasons: a <br>\nmolecular-biology argument is an open-system concurrent computation that <br>\nresults in compartment changes and is performed among processes of <br>\nphysiology change as determined from the molecular programming of given <br>\nDNA. Life cycles are the possible sequentializations of the processes. A <br>\nmain implication of our construction is that formal correctness provides <br>\na complementary perspective on science that is as fundamental there as <br>\nfor pure mathematics. The bulk of the presented work has been verified <br>\nformally correct by computer.</p>",
        "id": 294752981,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661196169
    }
]