[
    {
        "content": "<p>From: \"Dr. Brendan Patrick Mahony\" &lt;<a href=\"mailto:brendan.mahony@dsto.defence.gov.au\">brendan.mahony@dsto.defence.gov.au</a>&gt;<br>\nI am trying to do some theorems about inducing lattice structure on  <br>\nsubsets of partial orders.</p>\n<p>I have a theorem, sub_po, that the order relation forms a partial  <br>\norder when restricted to the subset. I would like resolve sub_po  <br>\nagainst various theorems in the partial_order locale, in particular  <br>\ntheorems from parent locales. If I make an interpretation using  <br>\nsub_po, all these become available, but all my partial_order notation  <br>\nbecome ambiguous (copies for parent order and sub-order).</p>\n<p>Is there any way to make an interpretation without bringing in the  <br>\nnotation?</p>\n<p>Does the mysterious \"structure\" mechanism have any use here? (Is it  <br>\nexplained anywhere?)</p>\n<p>If I don't make an interpretation, how can I get at parent locale  <br>\ntheorems without restating and reproving the parent locale results?</p>\n<hr>\n<p>Dr Brendan Mahony<br>\nC3I Division                                    ph +61 8 8259 6046<br>\nDefence Science and Technology Organisation     fx +61 8 8259 5589<br>\nEdinburgh, South Australia      <a href=\"mailto:Brendan.Mahony@dsto.defence.gov.au\">Brendan.Mahony@dsto.defence.gov.au</a></p>\n<p>Important: This document remains the property of the Australian<br>\nGovernment Department of Defence and is subject to the jurisdiction<br>\nof the Crimes Act section 70. If you have received this document in<br>\nerror, you are requested to contact the sender and delete the document.</p>\n<p>IMPORTANT: This email remains the property of the Australian Defence Organisation and is subject to the jurisdiction of section 70 of the CRIMES ACT 1914.  If you have received this email in error, you are requested to contact the sender and delete the email.</p>",
        "id": 294082112,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660831016
    }
]