[
    {
        "content": "<p>From: Gottfried Barrow &lt;<a href=\"mailto:igbi@gmx.com\">igbi@gmx.com</a>&gt;<br>\nLee,</p>\n<p>I assume you're working in Isabelle/HOL, with an entry point of<br>\nimporting Complex_Main, and not extending HOL with any axioms of your own.</p>\n<p>SHORT ANSWER PART 1: HOL is a logic, with a defined set of axioms (all<br>\nof which are not clearly made known to users in the Isabelle<br>\nliterature), and as with mathematics in general, you are free to define<br>\nalgebraic operations, but what you can or cannot prove is dependent on<br>\nyour definitions, and on the HOL axioms.</p>\n<p>SHORT ANSWER PART 2 (the global law of spheres of mathematical influence) :</p>\n<p>a) In general, our proofs about math that are of interest to us, are of<br>\nno interest to others, and</p>\n<p>b) if the math we're interested in is of no great, practical value, not<br>\nonly are others not interested in any proofs about such math, they're<br>\nmost likely not interested in the math.</p>\n<p>SHORT ANSWER PART 3: Back to part 1, and with part 2 in mind, it's up to<br>\nyou to show what can or cannot be done in Isabelle/HOL, for what hasn't<br>\nbeen done in Isabelle/HOL, for what you're interested in.</p>\n<p>SHORT ANSWER PART 4: The above explains my approach, based on my past<br>\nobservations of the culture of mathematics. But even big time players,<br>\nin all cultures, have a hard time getting people interested in what<br>\nthey're doing. Google, with millions of dollars in funding, couldn't get<br>\npeople very much interested in Google+, and as people got bored with<br>\nMyspace, they will most likely get bored with Facebook.</p>\n<p>That's the short answer.</p>\n<p>I'll leave off the long answer, involving my opinions about marketing,<br>\nand how marketing is generally necessary to draw people into what we are<br>\ndoing, and what we are interested in.</p>\n<p>Personally, what I have in mind is dance, trance, and disco, where the<br>\ndisco will hopefully be kept to a minimum, especially the display of<br>\ngold chains, by means of leaving unbuttoned the top three buttons of a<br>\nyellow, polyester shirt.</p>\n<p>But even trance can be risky. It's not that my professional reputation<br>\ncan be tarnished, since I have no professional reputation. It's that if<br>\none has heard 4 measures of trance, one has heard 4 hours of trance,<br>\nwhich we could rephrase as the Law of Trance, \"If one has heard 4<br>\nmeasures of trance, one has heard 4 hours of trance.\"</p>\n<p>Regards,<br>\nGB</p>",
        "id": 294306331,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660924419
    }
]