[
    {
        "content": "<p>From: Matthew Fernandez &lt;<a href=\"mailto:matthew.fernandez@nicta.com.au\">matthew.fernandez@nicta.com.au</a>&gt;<br>\nHello all,</p>\n<p>When working in Isabelle/jEdit with parallel proofs set to 2, \"by\" does not impede progress through<br>\nthe theory. By which I mean a \"by\" step can remain purple and being processed while the rest of the<br>\ntheory proceeds. The same does not seem to be true of a proof with many \"apply\" steps followed by a<br>\n\"done.\" Is there a fundamental reason this doesn't happen or is this just a design decision? It<br>\nseems to me that processing could proceed past the proof as soon as the lemma statement itself has<br>\nbeen parsed.</p>\n<p>This isn't a complaint as I realise there are several potential work arounds for this like using an<br>\nIsar proof or enabling skip proofs. I was just curious why this doesn't happen.</p>\n<p>Thanks,<br>\nMatt</p>\n<hr>\n<p>The information in this e-mail may be confidential and subject to legal professional privilege and/or copyright. National ICT Australia Limited accepts no liability for any damage caused by this email or its attachments.</p>",
        "id": 294323521,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660927752
    },
    {
        "content": "<p>From: Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt;<br>\nThat is a long-standing omission in PIDE document processing: the prover <br>\nmerely walks down the sequential arrangement of commands and does only <br>\nlocal forks of diagnistic and 'by' commands.  Conceptually, whole proofs <br>\ncould be forked recursively, both Isar proof outlines and apply scripts, <br>\nas is done in batch mode.</p>\n<p>There are various practical reasons why the parallel batch mode and the <br>\nPIDE interaction mode did not yet converge in that respect, but it will <br>\nhappen at some point.</p>\n<p>By bringing up this issue, its priority in the pipeline is increased once <br>\nagain.</p>\n<p>Makarius</p>\n<hr>\n<p><a href=\"http://stop-ttip.org\">http://stop-ttip.org</a>  1,143,292 people so far</p>\n<hr>",
        "id": 294323627,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660927790
    }
]