[
    {
        "content": "<p>From: Daniel Le Métayer &lt;<a href=\"mailto:Daniel.Le-Metayer@inrialpes.fr\">Daniel.Le-Metayer@inrialpes.fr</a>&gt;<br>\nPOSTDOC POSITION</p>\n<p>Compliance with contractual, legal and business rules<br>\nFormal approach and application to privacy and security</p>\n<p>INRIA  Grenoble  France</p>\n<p>KEYWORDS<br>\nformal specification, privacy, security, legal rule, contract, <br>\ncompliance, model, monitoring,<br>\naccountability, traceability, liability, audit, organization, <br>\nenterprise, business</p>\n<p>CONTEXT AND OBJECTIVES<br>\nCompliance with legal, contractual, business or organizational rules is <br>\nbecoming a serious<br>\nconcern for companies because regulatory requirements are increasingly <br>\ncomplex and<br>\nnumerous. Companies have to adapt their internal organization to ensure <br>\nthat they<br>\ncomply with a variety of rules related to privacy, accountability, <br>\nsecurity, duty of information,<br>\nquality, etc.  They may be subject to independent audits and, in some <br>\ncases, executive or<br>\nemployees may be liable for breaches of the rules. Software tools can be <br>\ndevised to<br>\nhelp companies minimizing the risks of breaches but several challenges <br>\nneed to be met in<br>\norder to provide solutions that are effectively usable: first, the rules <br>\n(which are originally<br>\nexpressed in natural or legal language) have to be defined precisely; <br>\nthe system to<br>\nimplement them must be user-friendly and self-explanatory because <br>\ntypical users<br>\ndon't necessarily have specific legal background; appropriate mechanisms <br>\nshould<br>\nbe put in place to ensure accountability; last but not least, the system <br>\nmust be flexible<br>\nand consistent with the internal organization of the company (business <br>\nprocess, share of<br>\nroles and responsibilities, etc.).<br>\nThe first phase of the  postdoc project is the specification of legal <br>\nand contractual<br>\nrules as well as organizational constraints using formal and semi-formal <br>\nmethods.<br>\nDepending on the results of the first phase, a compliance enforcement <br>\nand monitoring<br>\nsystem may be proposed in a second phase, based on the formal and <br>\nsemi-formal<br>\nspecifications. Emphasis will be put on the enforcement of privacy and <br>\nsecurity rules.<br>\nThis project is part of a larger multidisciplinary initiative launched <br>\nin 2008 to foster interactions<br>\nbetween computer scientists and lawyers. In this context, the postdoc <br>\nresearcher will have the<br>\nopportunity to interact with a variety of partners involving, in <br>\naddition to computer scientists,<br>\nactors of the security industry and lawyers.</p>\n<p>DURATION<br>\nAt least one year (to start as soon as possible)</p>\n<p>REQUIRED SKILLS:<br>\nMinimal knowledge and motivation for formal and semi-formal methods in <br>\nthe general sense<br>\n(formal specification, verification, software design, model design, <br>\netc.) and their application to<br>\nconcrete problems. Some knowledge in privacy or security would also be <br>\nappreciated but is not<br>\na pre-requisite for the position.</p>\n<p>LOCATION:<br>\nGrenoble, capital of the French Alps, and one of the most active areas <br>\nin Europe for research<br>\nin Information and Communication Technologies. Inria is the French <br>\nNational Institute for<br>\nResearch in Computer Science and Control. Created in December 1992, the <br>\nInria Rhône-Alpes<br>\nresearch unit hosts about 600 people, including about 150 researchers <br>\nand the same number of<br>\nPhD students.</p>\n<p>STATUS AND BENEFITS:<br>\n<a href=\"http://www.inria.fr/travailler/metiers/recherche/docpostdoc/doctorant_post_doc.en.html\">http://www.inria.fr/travailler/metiers/recherche/docpostdoc/doctorant_post_doc.en.html</a> </p>\n<p>CONTACT:<br>\nCandidates should send a resume to: Daniel dot Le-Metayer at inrialpes <br>\ndot fr<br>\n<a href=\"http://www.inrialpes.fr/pop-art/people/lemetayer/Welcome.html\">http://www.inrialpes.fr/pop-art/people/lemetayer/Welcome.html</a></p>",
        "id": 294071955,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660827499
    }
]