[
    {
        "content": "<p>From: Wan Fokkink &lt;<a href=\"mailto:wanf@cs.vu.nl\">wanf@cs.vu.nl</a>&gt;<br>\nPHD POSITION: FORMAL VERIFICATION OF EPIDEMIC PROTOCOLS AND DISTRIBUTED VERIFICATION METHODS<br>\n============================================================================================</p>\n<p>The Theoretical Computer Science Group at the Vrije Universiteit (VU) in Amsterdam<br>\nseeks a PhD student for four years on a research project devoted to</p>\n<p>Formal Verification of Epidemic Protocols and Distributed Verification Methods</p>\n<p>Starting date of this PhD position: as soon as possible.</p>\n<p>The project</p>\n<hr>\n<p>The aim of the project is to develop techniques and tools for distributed verification,<br>\nand to apply formal verification techniques in the design and analysis of epidemic<br>\nprotocols.</p>\n<p>The distributed verification track will focus on parallel algorithms for minimizing<br>\nstate spaces modulo some behavioral equivalence, and model checking. The DAS-3<br>\nsupercomputer, which will become operational this Summer, will serve as an<br>\nexperimentation platform.</p>\n<p>Epidemic protocols multicast data in a peer-to-peer network similar to the way<br>\na disease spreads. The analysis of epidemic protocols should (1) provide further<br>\nexperience with applying formal verification methods to communication protocols,<br>\nand with applying such methods in the design process, (2) result in improved<br>\nversions of epidemic protocols, (3) lead to a systematic approach to analyze epidemic<br>\nprotocols, and (4) provide case studies for the distributed verification track.</p>\n<p>For more detailed information on the project, see</p>\n<p><a href=\"http://www.cs.vu.nl/~wanf/epidis.txt\">http://www.cs.vu.nl/~wanf/epidis.txt</a></p>\n<p>This project is a collaboration between three research groups at the VU:<br>\nTheoretical Computer Science (Wan Fokkink, Jan-Willem Klop), Distributed Systems<br>\n(Maarten van Steen, Andy Tanenbaum), and Parallel Computing (Henri Bal).</p>\n<p>For more information on the involved research groups, see</p>\n<p><a href=\"http://www.cs.vu.nl/~tcs\">http://www.cs.vu.nl/~tcs</a><br>\n<a href=\"http://www.cs.vu.nl/cs/index-en.html\">http://www.cs.vu.nl/cs/index-en.html</a></p>\n<p>Qualifications</p>\n<hr>\n<p>Candidates should have completed their studies in computer science or a closely<br>\nrelated area. Experience with distributed systems, a good theoretical background<br>\n(algorithmics, formal methods), and an open attitude to applications are<br>\nconsidered advantages. You should enjoy working in an internationally oriented<br>\nresearch environment. Communicative skills and the ability to work in a team<br>\nare important.</p>\n<p>Information and application</p>\n<hr>\n<p>For further information about this position please contact:</p>\n<p>Prof.dr. Wan Fokkink, <a href=\"mailto:wanf@cs.vu.nl\">wanf@cs.vu.nl</a>, tel. +31 (0)20 5987735</p>\n<p>You are invited to send an application by email to the above email address no<br>\nlater than June 29, 2006. Your application should consist of a cover letter,<br>\na curriculum vitae (including detailed information regarding your academic degree,<br>\nand possibly a list of publications), and the names and addresses of two references.</p>",
        "id": 293911191,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660747455
    }
]