[
    {
        "content": "<p>From: Nicolas Magaud &lt;<a href=\"mailto:magaud@dpt-info.u-strasbg.fr\">magaud@dpt-info.u-strasbg.fr</a>&gt;<br>\nA three-year PhD-student position is open at LSIIT <br>\n(<a href=\"http://lsiit.u-strasbg.fr\">http://lsiit.u-strasbg.fr</a> )<br>\nin the field of formal proofs in geometry. This proposal fits in the <br>\nGALAPAGOS<br>\nresearch project which has been accepted by the french research agency <br>\n(ANR) in 2007.</p>\n<p>This thesis will be supervised by Professor Jean-François Dufourd and <br>\nco-advised<br>\nby Nicolas Magaud (<a href=\"http://http://dpt-info.u-strasbg.fr/~jfd/\">http://http://dpt-info.u-strasbg.fr/~jfd/</a> .</p>\n<p>We would like it to start as soon as possible (at the end of 2007 at the <br>\nlatest).</p>\n<p>Context :</p>\n<hr>\n<p>In the GALAPAGOS project, we wish to apply computerized theorem proving <br>\ntools to two aspects<br>\nof geometry. The first aspect concerns computational geometry, the <br>\nsecond step concerns verifying<br>\ngeometric reasoning steps in usual constructions, such as constructions <br>\nwith ruler and compass.</p>\n<p>Thesis proposal : Building reliable programs in computational geometry <br>\nand certifying them</p>\n<hr>\n<p>This thesis aims at improving software quality and at designing new <br>\nalgorithms in the field<br>\nof computational geometry. To achieve this goal, we shall use <br>\ncombinatorial maps as our<br>\ntopological model and use formal methods to specify, interactively prove <br>\nand automatically<br>\nextract programs from their proofs of correctness.<br>\nThis work will be carried out in the Calculus of Inductive Constructions <br>\nand implemented<br>\nvia the Coq proof assistant. From a specification and a constructive <br>\nproof, its enables us<br>\nto extract an Ocaml program via the proofs-as-programs paradigm. This, <br>\nthe program is<br>\ncertified, meaning that it always terminates and that it satisfies its <br>\nspecification.<br>\nGeometric objects we shall consider are plane subdivisions, modeled by <br>\nembedded combinatorial<br>\nmaps. Embeddings will be linear and most combinatorial maps involved <br>\nwill be planar.<br>\nThis thesis will make us revisit classic problems in computational <br>\ngeometry, among them,<br>\nhandling plane subdivisions, computing convex hulls, performing point <br>\nlocation, co-refining<br>\nmaps, computing Delaunay and Voronoï diagrams. This should be sufficient <br>\nto show our methodology<br>\nbenefits, especially proof techniques for structural and/or noetherian <br>\ninduction on subdivisions.<br>\nThis will allow us to deal with more complex algorithms such as those <br>\nrequired in 3D.</p>\n<p>Contact Information :</p>\n<hr>\n<p>For further information about this position, please contact either:</p>\n<p>Jean-François Dufourd     <a href=\"mailto:dufourd@dpt-info.u-strasbg.fr\">dufourd@dpt-info.u-strasbg.fr</a><br>\n Nicolas Magaud            <a href=\"mailto:magaud@dpt-info.u-strasbg.fr\">magaud@dpt-info.u-strasbg.fr</a></p>\n<p>Applications should be directed to <br>\n{dufourd,magaud}@dpt-info.u-strasbg.fr . Your application<br>\nshould contain a resume and a cover letter as well as references (e.g. <br>\nyour Master's thesis advisor).</p>",
        "id": 294051426,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660819650
    }
]