[
    {
        "content": "<p>From: Andreas Lochbihler &lt;<a href=\"mailto:andreas.lochbihler@inf.ethz.ch\">andreas.lochbihler@inf.ethz.ch</a>&gt;<br>\nPh.D. Research Project at ETH Zurich on<br>\nFormal Methods for Federated Identity Management<br>\nProf. David Basin, ETH Zurich</p>\n<p>The Information Security Group carries out research on methods and tools<br>\nfor the analysis and construction of safe and secure systems. This<br>\nincludes methods for specifying systems, developing systems in<br>\ncorrectness-preserving ways, and verifying or testing existing systems<br>\nand infrastructures. Our goal is not only to build and analyze novel<br>\nsystems and security solutions, but also to develop better methods and<br>\ntools for system engineering and quality assurance activities.</p>\n<p>We have an open Ph.D. research position on \"Formal Methods for Federated<br>\nIdentity Management\". We seek to hire a researcher who will carry out<br>\nresearch on the formal analysis of federated identity management<br>\nsystems, like SAML and OAuth 2.0.  The project's main objectives<br>\nare to distill requirements and designs for \"next generation federated<br>\nidentity management\" and to bring current verification tools, in<br>\nparticular our Tamarin prover, up to the level where such protocols can<br>\nbe automatically analyzed on a realistic scale with respect to both<br>\nsecurity and privacy properties.</p>\n<p>The project, which will be carried out together with partners at Zurich<br>\nKantonal Bank (ZKB), will run for approximately 3 years and provide the<br>\npossibility of carrying out a Ph.D. during this period. As part of this<br>\nproject, the researcher will spend time with ZKB learning about the<br>\nsystems under consideration and state-of-the-art approaches to their<br>\ndesign and analysis.</p>\n<p>The ideal candidate for this position is an enthusiastic, outstanding<br>\nresearcher with a strong background and interest in one or more of<br>\nthe following areas:</p>\n<ul>\n<li>formal methods or mathematical logic,</li>\n<li>information security or cryptography,</li>\n<li>automated security protocol verification tools.</li>\n</ul>\n<p>Candidates with a strong theoretical background in related areas are<br>\nalso encouraged to apply. ETH Zurich regulations require PhD candidates<br>\nto hold a Master's or equivalent degree (e.g. Diplom).  The project,<br>\nwhich is funded by the Zurich Information Security Center, and will be<br>\nsupervised by Prof. David Basin together with Dr. Ralf Sasse.</p>\n<p>The Ph.D. student will be a paid employee of ETH Zurich. Salary and<br>\nemployment conditions are attractive. ETH Zurich regulations require<br>\ndoctoral students to hold a Master's or equivalent degree (e.g. Diplom).</p>\n<p>Zurich is a diverse and multicultural city, which is consistently rated<br>\namong the best cities in the world in which to live. We favor the same<br>\nsort of diversity that defines Zurich's cultural makeup and encourage<br>\nanyone matching the profile above to apply, regardless of where you are<br>\nfrom.</p>\n<p>Applications should include a curriculum vitae, a brief description of<br>\nresearch interests, transcripts of grades, 2-3 letters of recommendation<br>\nfrom teachers or employers, and, if possible, the Master's or<br>\nBachelor's thesis and publications. Applications and informal<br>\ninquiries should be sent to Ralf Sasse at the following email address:</p>\n<p><a href=\"mailto:infsec.positions@inf.ethz.ch\">infsec.positions@inf.ethz.ch</a></p>\n<p>ETH Zurich specifically encourages women to apply with a view towards<br>\nincreasing the proportion of female researchers.</p>",
        "id": 294683211,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661177407
    }
]