[
    {
        "content": "<p>From: Andreas Lochbihler &lt;<a href=\"mailto:andreas.lochbihler@inf.ethz.ch\">andreas.lochbihler@inf.ethz.ch</a>&gt;<br>\nThe Institute of Information Security headed by Prof. David Basin at<br>\nETH Zurich has multiple open positions for PhD students on research<br>\nprojects in the area of formal methods for information security.</p>\n<p>We are looking for enthusiastic outstanding Computer Science or<br>\nMathematics students with a strong background in at least two of the<br>\nfollowing topics</p>\n<ul>\n<li>formal methods or mathematical logic,</li>\n<li>probability theory and statistics,</li>\n<li>cryptography, and</li>\n<li>information security.</li>\n</ul>\n<p>Additionally, experience in the following specialized areas would be<br>\nadvantageous:</p>\n<ul>\n<li>formal software development by refinement,</li>\n<li>experience with an interactive theorem prover, or</li>\n<li>security protocols.</li>\n</ul>\n<p>ETH Zurich regulations require PhD students to hold a Masters or<br>\nequivalent degree (e.g., Diplom). All candidates matching the profile<br>\nabove are encouraged to apply as soon as possible. We will process<br>\napplications until all positions are filled. Successful candidates are<br>\nexpected to start soon after acceptance, but the starting date is<br>\nnegotiable.</p>\n<p>Applications should include:</p>\n<ul>\n<li>a curriculum vitae,</li>\n<li>a brief description of research interests,</li>\n<li>transcripts of grades,</li>\n<li>letters of recommendation from teachers or employers, and,</li>\n<li>if possible, the Master's or Bachelor's thesis and publications.</li>\n</ul>\n<p>Applications and inquiries should be sent to Sasa Radomirovic at the<br>\nfollowing email address.</p>\n<p><a href=\"mailto:infsec.positions@inf.ethz.ch\">infsec.positions@inf.ethz.ch</a></p>\n<p>PhD students are paid employees of ETH Zurich. Salary and employment<br>\nconditions are attractive. Zurich is a diverse and multicultural city<br>\nwhich is consistently rated among the best cities in the world in<br>\nwhich to live.</p>",
        "id": 294660868,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661169849
    }
]