[
    {
        "content": "<p>From: Lawrence Paulson &lt;<a href=\"mailto:lp15@cam.ac.uk\">lp15@cam.ac.uk</a>&gt;<br>\nSpecial Issue—Journal of Automated Reasoning</p>\n<p>NONLINEAR REASONING</p>\n<p>A variety of mature techniques for analyzing systems of linear inequalities have been imported to the domain of automated reasoning. In contrast, techniques for nonlinear functions are still being developed and examined. Nonlinear functions may include polynomials, transcendental functions, solutions to differential equations, and many other classes of functions. Symbolic and numerical methods, and combinations of the two, have been considered.</p>\n<p>The goal of this special issue is to provide a snapshot of the state of the subject today and the most promising research directions. We welcome submissions that break new ground, as well as those that clarify and explain the central challenges. Examples of suitable topics:</p>\n<p>• refinements of classical nonlinear decision methods: cylindrical algebraic decomposition, virtual term substitution, Groebner bases, Wu's method<br>\n    • decision procedures for both extensions and fragments of the theory of real closed fields<br>\n    • applications of nonlinear reasoning techniques in mathematics and formal verification<br>\n    • numeric methods, such as interval constraint propagation and homotopy continuation<br>\n    • symbolic-numeric methods<br>\n    • heuristic reasoning methods<br>\n    • integration of nonlinear methods with resolution theorem provers, interactive theorem provers, SMT solvers<br>\nPapers (no longer than 30 pages) should be submitted via easychair.</p>\n<p>Special issue editors: Jeremy Avigad (<a href=\"mailto:avigad@cmu.edu\">avigad@cmu.edu</a>) and Lawrence C. Paulson (<a href=\"mailto:lp15@cam.ac.uk\">lp15@cam.ac.uk</a>)</p>\n<p>Deadline for submissions: 1 March 2014</p>\n<p><a href=\"http://www.andrew.cmu.edu/user/avigad/JAR_nonlinear.html\">http://www.andrew.cmu.edu/user/avigad/JAR_nonlinear.html</a><br>\n<a href=\"https://www.easychair.org/account/signin.cgi?conf=jarnonlinear\">https://www.easychair.org/account/signin.cgi?conf=jarnonlinear</a></p>",
        "id": 294254109,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660911925
    }
]