[
    {
        "content": "<p>From: <a href=\"mailto:serge.autexier@dfki.de\">serge.autexier@dfki.de</a><br>\nCall for Contributions<br>\n      work-in-progress - posters - demos - tutorials - doctoral programme<br>\n              11th Conference on Intelligent Computer Mathematics</p>\n<p>- CICM 2018 - <br>\n                               August 13-17, 2018<br>\n                            RISC, Hagenberg, Austria<br>\n<a href=\"http://www.cicm-conference.org/2018\">http://www.cicm-conference.org/2018</a></p>\n<hr>\n<p>CICM   focuses  on   theoretical  and   practical  solutions   for  mathematical<br>\napplications such  as computation,  deduction, knowledge  management, libraries,<br>\nand user interfaces.</p>\n<p>CICM 2018 will feature 3 invited speakers:</p>\n<ul>\n<li>Akiko Aizawa, National Institute of Informatics, University of Tokyo</li>\n<li>\n<p>Bruno Buchberger, Research Institute for Symbolic Computation, Johannes Kepler<br>\n  University</p>\n</li>\n<li>\n<p>Adri Olde Daalhuis, University of Edinburgh</p>\n</li>\n</ul>\n<p>and 6 affiliated workshops:</p>\n<ul>\n<li>Computer Algebra in the age of Types</li>\n<li>Computer Mathematics in Education - Enlightenment or Incantation</li>\n<li>Formal Mathematics for Mathematicians</li>\n<li>Formal Verification of Physical Systems</li>\n<li>Mathematical Models and Mathematical Software as Research Data</li>\n<li>OpenMath Workshop</li>\n</ul>\n<p>In  addition to  the  above  and the  formally  reviewed  program, CICM  invites<br>\ncontributions of various forms:</p>\n<p>1) Work-in-progress papers (any length up  to 15 pages) will be lightly reviewed<br>\n   and, if  accepted, presented at the  conference and published in  a volume of<br>\n   CEUR-WS.</p>\n<p>2) Demos and  posters (submitted  as a  summary of  a few  paragraphs) will  be<br>\n   presented  during a  dedicated  session.<br>\n   Submission is  open to any topic  interesting to the CICM  audience.  We also<br>\n   encourage authors of accepted papers to  supplement their talk with a demo or<br>\n   poster.</p>\n<p>3) Tutorials (up to 60 minutes, submitted as a summary of a few paragraphs) will<br>\n   take place in individual rooms during a dedicated session.</p>\n<p>4) Doctoral  program submissions (2  page abstract +  CV) will be  presented and<br>\n   discussed during  a dedicated session  focusing on mentoring.<br>\n   Submission is open to any doctoral student in the CICM area.  Student authors<br>\n   of  accepted papers  are strongly  encouraged to  additionally submit  to the<br>\n   doctoral program.</p>\n<p>Financial support for doctoral program participants is available.</p>\n<p>All submissions should be made via easychair at</p>\n<p><a href=\"https://easychair.org/conferences/?conf=cicm2018\">https://easychair.org/conferences/?conf=cicm2018</a></p>\n<p>Notifications are sent on a rolling basis.</p>\n<p>The last day to submit is July 15.</p>",
        "id": 294733940,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661189107
    }
]