[
    {
        "content": "<p>From: Manuel Eberl &lt;<a href=\"mailto:eberlm@in.tum.de\">eberlm@in.tum.de</a>&gt;<br>\nI fear that there are no canonical references for any of these – at<br>\nleast not that I know of.</p>\n<p>You can cite Isabelle as a whole, or you can try to specifically cite<br>\ne.g. the generated HTML [1] or the proof document [2]. For HOL-Analysis,<br>\nthere is also a manual [3] (which only contains the most important bits).</p>\n<p>There was an idea in the past to publish some kind of overview of<br>\nHOL-Analysis but this will require a lot more cleaning up first.</p>\n<p>The filter paper that you gave as a reference fo the standard library<br>\nonly covers a very small part of the standard library, of course, namely<br>\nfilters. I always give that reference whenever I talk about limits or<br>\ntopological concepts (which inevitably involve filters in Isabelle), but<br>\nfor anything else, it hardly makes sense to cite that.</p>\n<p>The measure theory paper should be cited when talking about measure<br>\ntheory, probability theory, and Lebesgue integration.</p>\n<p>Sorry for the following rambly bit:</p>\n<p>It's generally a bit of a problem that working on the standard library<br>\nis a somewhat thankless task. It's hard to get any publications out of<br>\nit (which are the bread and butter in academia) because all you're doing<br>\nis formalising routine stuff – often not even very difficult stuff, just<br>\na lot of it. And there's not anything interesting to be said about it in<br>\na paper. You can write tens of thousands of lines of library material<br>\nwithout the people deciding whether or not to give you a grant or tenure<br>\nor whatever taking notice of it. The best one can usually hope for is to<br>\nmention it in a paper on some more interesting application.</p>\n<p>The situation is of course even worse for library maintenance and – as<br>\nMakarius reminds us occasionally – infrastructure tasks. There's no<br>\nglory in keeping the machine running – but if it stops, people show up<br>\nat your door and complain.</p>\n<p>Well, I personally am doing all right I think; I've struck a good<br>\nbalance between library work and publishable things, but I still think<br>\nit's a problem in general.</p>\n<p>Cheers,</p>\n<p>Manuel</p>\n<p>[1]: <a href=\"https://isabelle.in.tum.de/library/HOL/HOL-Analysis/index.html\">https://isabelle.in.tum.de/library/HOL/HOL-Analysis/index.html</a><br>\n[2]: <a href=\"https://isabelle.in.tum.de/library/HOL/HOL-Analysis/document.pdf\">https://isabelle.in.tum.de/library/HOL/HOL-Analysis/document.pdf</a><br>\n[3]: <a href=\"https://isabelle.in.tum.de/library/HOL/HOL-Analysis/manual.pdf\">https://isabelle.in.tum.de/library/HOL/HOL-Analysis/manual.pdf</a></p>",
        "id": 294830856,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661246559
    },
    {
        "content": "<p>From: Mikhail Chekhov &lt;<a href=\"mailto:mikhail.chekhov.w@gmail.com\">mikhail.chekhov.w@gmail.com</a>&gt;<br>\nDear Manuel Eberl/All,</p>\n<p>Thank you for your reply.</p>\n<p>On 22/07/2020 08:47, Manuel Eberl wrote:</p>\n<blockquote>\n<p>You can cite Isabelle as a whole, or you can try to specifically cite<br>\ne.g. the generated HTML [1] or the proof document [2]. For HOL-Analysis,<br>\nthere is also a manual [3] (which only contains the most important bits).</p>\n<p>Indeed, it looks like it makes sense to cite the generated HTML files. I<br>\nwonder, however, how would one order the list of the authors for such<br>\ncitations.</p>\n</blockquote>\n<blockquote>\n<p>The filter paper that you gave as a reference for the standard library<br>\nonly covers a very small part of the standard library, of course, namely<br>\nfilters.</p>\n<p>The reason why I mentioned this paper is that it provides an overview of a<br>\nsignificant part of the standard library. However, I found it slightly<br>\ndifficult to tell from the paper how significant was the contribution of<br>\nthe authors to the part of the library that they mention. From the<br>\n'summary' section: \"starting with topological spaces, over metric spaces to<br>\nEuclidean spaces\". It appears that this list also implicitly includes some<br>\nmaterial on vector spaces. The type classes that they mention seem to<br>\ncorrespond to a significant part of the standard library that I need to<br>\ndiscuss in my own development. In any case, this is merely an explanation<br>\nfor why I thought that it may be an appropriate reference for a significant<br>\npart of the standard library that I needed to cite. However, as you have<br>\nstated, it may best to cite the generated HTML files.</p>\n</blockquote>\n<blockquote>\n<p>It's generally a bit of a problem that working on the standard library<br>\nis a somewhat thankless task. It's hard to get any publications out of<br>\nit (which are the bread and butter in academia) because all you're doing<br>\nis formalising routine stuff – often not even very difficult stuff, just<br>\na lot of it. And there's not anything interesting to be said about it in<br>\na paper. You can write tens of thousands of lines of library material<br>\nwithout the people deciding whether or not to give you a grant or tenure<br>\nor whatever taking notice of it. The best one can usually hope for is to<br>\nmention it in a paper on some more interesting application.</p>\n<p>Thank you for mentioning this. It is useful to know the general attitude to<br>\nlibrary development/maintenance in the community.</p>\n</blockquote>\n<p>Luckily for me, however, your comments are hardly applicable to my own<br>\nsituation. I need to cite the various libraries that are available in the<br>\nmain distribution of Isabelle in my work on Types-to-Sets. In essence, as<br>\npart of this work, I demonstrate how one can synthesize something similar<br>\nto (a small part of) HOL-Algebra from the type classes in the standard<br>\nlibrary in a semi-automated manner. Moreover, I use the elements of both<br>\nlibraries in certain explanations/examples. Thus, this work hardly falls<br>\ninto the category of library development/maintenance.</p>\n<p>Kind Regards,<br>\nMikhail Chekhov</p>",
        "id": 294830871,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661246565
    },
    {
        "content": "<p>From: \"Chun Tian (binghe)\" &lt;<a href=\"mailto:binghe.lisp@gmail.com\">binghe.lisp@gmail.com</a>&gt;<br>\nHi Manuel,</p>\n<p>I thought the biggest contribution of formalizing math theorems was<br>\nsupposed to verify the correctness of their informal proofs, where<br>\nmathematicians sometimes may overlook some subtle details which may<br>\neventually turn the whole proof into false statements.</p>\n<p>Of course, mistakes in the proofs of classical results (which must be old<br>\nand fundamental enough to be able to be covered) must be very rare. But if<br>\nanything of this kind is discovered by a proof engineer, the work should be<br>\npublicable (to mathematicians), isn't it?  Or let's take one step back, if<br>\nthe theorem statements are correct but the proof in textbooks are wrong,<br>\nand the proof engineer gives a correct one, this should also be something<br>\nnotable, right?</p>\n<p>Regards,</p>\n<p>Chun Tian</p>",
        "id": 294830882,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661246571
    },
    {
        "content": "<p>From: Richard Waldinger &lt;<a href=\"mailto:waldinger@AI.SRI.COM\">waldinger@AI.SRI.COM</a>&gt;<br>\ni’ve heard it said that Shankar found holes in Gödel’s proof of his incompleteness theorem. Shakar’s thesis involved a machine-check (via one of the boyer-moore theorem provers) of that proof.  Don’t worry, the theorem is still true.</p>",
        "id": 294830899,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661246581
    },
    {
        "content": "<p>From: Manuel Eberl &lt;<a href=\"mailto:eberlm@in.tum.de\">eberlm@in.tum.de</a>&gt;</p>\n<blockquote>\n<p>Of course, mistakes in the proofs of classical results (which must be<br>\nold and fundamental enough to be able to be covered) must be very rare.</p>\n</blockquote>\n<p>I cannot remember any problem like that ever arising with textbook<br>\nmaths. These things are usually hundreds of years old and extremely well<br>\nunderstood. Sure, there might be a problem with the proof in one<br>\nparticular textbook, but then there are a hundred other textbooks with<br>\ndifferent proofs.</p>\n<p>Even if you do find a mistake in something like that, I don't think many<br>\npeople would find it very significant if there are other books that<br>\ndon't have that mistake.</p>\n<blockquote>\n<p>But if anything of this kind is discovered by a proof engineer, the work<br>\nshould be publicable (to mathematicians), isn't it?</p>\n</blockquote>\n<p>Yes, indeed such things have happened. I recall Sébastian Gouëzel<br>\nfinding a mistake in a published maths proof that was nontrivial to fix,<br>\nand he then published a paper with the original author of that proof in<br>\norder to fix it. However, this was hardly \"standard library material\".</p>\n<blockquote>\n<p>Or let's take one<br>\nstep back, if the theorem statements are correct but the proof in<br>\ntextbooks are wrong, and the proof engineer gives a correct one, this<br>\nshould also be something notable, right?</p>\n</blockquote>\n<p>That depends on whom you ask. \"Proof engineers\" like us tend to be<br>\nextremely pedantic about what constitutes a correct proof.<br>\nMathematicians are more flexible; usually, if the \"proof\" conveys the<br>\nright idea to the reader, it is considered a correct proof. Even if<br>\nthere are some (fixable) arithmetic mistakes in it, or maybe a few cases<br>\nwere missed, or there are some gaps that you have to think about for a<br>\nbit as a reader.</p>\n<p>The majority of the \"mistakes\" that one finds with formalisation are of<br>\nthis nature because there are so many of them. I think I haven't done a<br>\nformalisation of any big-ish result that hasn't turned up at least one<br>\nsuch issue. \"Genuine\" mistakes are much rarer especially in \"standard<br>\nlibrary material\", but I expect they are more prevalent in cutting-edge<br>\nmathematical research.</p>\n<p>By the way, there is an overview thread on Mathoverflow about mistakes<br>\nfound using ITPs:</p>\n<p><a href=\"https://mathoverflow.net/questions/291158/proofs-shown-to-be-wrong-after-formalization-with-proof-assistant\">https://mathoverflow.net/questions/291158/proofs-shown-to-be-wrong-after-formalization-with-proof-assistant</a></p>\n<p>Cheers,</p>\n<p>Manuel</p>",
        "id": 294830908,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661246584
    },
    {
        "content": "<p>From: Manuel Eberl &lt;<a href=\"mailto:eberlm@in.tum.de\">eberlm@in.tum.de</a>&gt;<br>\nWell I would hardly consider Gödel's incompleteness theorems<br>\nstandard-library material, nor is their formalization a routine task.</p>\n<p>\"Standard library material\", to me, is things like undergraduate-level<br>\nalgebra, analysis, and number theory. Basic group and ring theory,<br>\nL'Hospital's theorem, greatest common divisor, that sort of stuff.<br>\nNobody doubts that it can be done and many such things have been done<br>\nbefore and there is nothing to be learnt from doing them.</p>\n<p>30 years ago, formalising such results was perhaps a great achievement<br>\nworthy of publication, but these days not so much. Especially if it was<br>\nalready done in another system – even though a Coq library doesn't help<br>\nIsabelle users much, someone still /has/ to do it in Isabelle.</p>\n<p>(Just to be clear: I'm not saying such routine things /should/ be<br>\npublishable, at least not in the same venues as \"novel\" formalisations.<br>\nI'm just saying it's a pity because such unglamorous things also need to<br>\nbe done and there is currently no mechanism to reward it.)</p>\n<p>Manuel</p>",
        "id": 294830938,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661246596
    },
    {
        "content": "<p>From: Manuel Eberl &lt;<a href=\"mailto:eberlm@in.tum.de\">eberlm@in.tum.de</a>&gt;<br>\nYou can try looking at the author lists of the files in question (at the<br>\nvery beginning of each file). These typically list the people who first<br>\nworked on these topics, although perhaps not everyone who contributed<br>\nmaterial and maintained the libraries since. I at least only add my name<br>\nto the list if I make same very significant additions to a file.</p>\n<p>Much of our analysis was also (at least initially) ported from HOL<br>\nLight, so the authors of HOL Light's analysis library (probably mostly<br>\nJohn Harrison?) also deserve a lot of credit for Isabelle's library.</p>\n<p>By the way, as I see it, the main reason why this filter paper was<br>\nworthy of publication is that it (to my knowledge) introduced<br>\nfilter-based topology into the ITP world, which makes so many things<br>\nmuch more convenient and is /not/ simply a routine formalization of some<br>\nwell-known maths. Filters are known in mathematics, but mathematicians<br>\ndo not use them in undergraduate textbooks on analysis. And there's the<br>\ndescription of the type class hierarchy, which is also an ITP issue that<br>\ngoes a bit beyond routine formalisation of maths and has more of a<br>\n\"software engineering\" flavour.</p>\n<p>It is always good if one can include such aspects in formalisations.<br>\nClemens Ballarin also recently had a paper on formalising standard group<br>\ntheory that focused heavily on what a convenient idiomatic<br>\nrepresentation in \"modern\" Isabelle/HOL could look like.</p>\n<p>Manuel</p>",
        "id": 294830958,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661246602
    },
    {
        "content": "<p>From: Lawrence Paulson &lt;<a href=\"mailto:lp15@cam.ac.uk\">lp15@cam.ac.uk</a>&gt;<br>\nThis brings up the interesting point of the gauge integral. It has its fans and John Harrison was clearly convinced. But I’ve since gotten the impression that for mainstream mathematicians, the Lebesgue integral is the only integral. (E.g. it’s the foundation of measure theory and everything built upon that.) So now we have two theories of integration and unfortunately many developments use both sorts of integrals. Transitioning to a 100% Lebesgue integral library will require a huge amount of absolutely thankless work.</p>\n<p>Larry</p>",
        "id": 294830981,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661246614
    },
    {
        "content": "<p>From: Manuel Eberl &lt;<a href=\"mailto:eberlm@in.tum.de\">eberlm@in.tum.de</a>&gt;<br>\nIt certainly has its advantages. The multivariate change of variables as<br>\nported from HOL Light has a very nice, general, and simple form for the<br>\nGauge integral:</p>\n<p>theorem has_absolute_integral_change_of_variables:<br>\n  fixes f :: \"real^'m::{finite,wellorder} ⇒ real^'n\" and g ::<br>\n\"real^'m::_ ⇒ real^'m::_\"<br>\n  assumes S: \"S ∈ sets lebesgue\"<br>\n    and der_g: \"⋀x. x ∈ S ⟹ (g has_derivative g' x) (at x within S)\"<br>\n    and inj: \"inj_on g S\"<br>\n  shows \"(λx. ¦det (matrix (g' x))¦ *⇩R f(g x)) absolutely_integrable_on S ∧<br>\n           integral S (λx. ¦det (matrix (g' x))¦ *⇩R f(g x)) = b<br>\n     ⟷ f absolutely_integrable_on (g <code> S) ∧ integral (g </code> S) f = b\"</p>\n<p>It demands measurability of the integration domain and injectivity and<br>\ndifferentiability of the variable change. You don't even need g to be C1<br>\nor g^-1 to be differentiable.</p>\n<p>For the Lebesgue integral, the situation is a lot worse. There are<br>\nvarious different forms of change of variables, and all of them (except<br>\nthe linear one) are univariate and have various additional side<br>\nconditions like monotonicity. I've done several proofs where the only<br>\nrecourse seemed to be to convert Lebesgue to Gauge, apply COV there, and<br>\nconvert back.</p>\n<p>I'm not entirely sure whether that is inherently so or simply because no<br>\none has sat down and proved a sufficiently general version of change of<br>\nvariables for the Lebesgue integral. But I think when I last discussed<br>\nthis with someone, they (perhaps Fabian Immler?) said that that you<br>\nprobably need at least some additional preconditions for Lebesgue…</p>\n<p>By the way, to make matters worse, there are also things like the<br>\nintegral of sin(x)/x from -∞ to ∞, which are Gauge-integrable but not<br>\nLebesgue-integrable and which /do/ come up in mathematics.<br>\nMathematicians will then simply call these \"improper integrals\" and<br>\nimplicitly take the limit of the integral from -a to a for a → ∞. And<br>\nthen there's the Cauchy Principal Value, which (as Wenda pointed out to<br>\nme) is not subsumed by the Gauge integral but apparently an entirely<br>\ndifferent generalisation of Lebesgue integrals…</p>\n<p>Manuel</p>",
        "id": 294831017,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661246633
    },
    {
        "content": "<p>From: Manuel Eberl &lt;<a href=\"mailto:eberlm@in.tum.de\">eberlm@in.tum.de</a>&gt;<br>\nJohn Harrison kindly pointed out something that I should have spotted<br>\nmyself: the version of change of variables that we have in Isabelle and<br>\nHOL Light is technically about the Gauge integral, but it demands<br>\nabsolute integrability. Absolute Gauge-integrability is equivalent to<br>\nLebesgue-integrability, so at the end of the day, it really is a theorem<br>\nabout change of variables for Lebesgue integration. He also said that to<br>\nthe best of his knowledge, the proof does not use any Gauge-specific things.</p>\n<p>His version is considerably sharper than that found in most textbooks.<br>\nThe only one that is essentially equivalent to his knowledge is the one<br>\nfrom Fremlin's \"Measure Theory\" volume 2, theorem 263D, p312.</p>\n<p>By the way, another issue with COV that we should resolve eventually is<br>\nthat our current version works on \"real ^ 'n\" like in HOL Light, whereas<br>\nthe more idiomatic thing to do would be \"'a :: euclidean_space\". This<br>\ncan either be done by generalising the existing proof or trying to lift<br>\nthe result using types-to-sets.</p>\n<p>Cheers,</p>\n<p>Manuel</p>",
        "id": 294831451,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661246810
    }
]