[
    {
        "content": "<p>From: Yarden Katz &lt;<a href=\"mailto:yarden@umd.edu\">yarden@umd.edu</a>&gt;<br>\nHi all,</p>\n<p>Let me preface my by declaring that I'm completely new to Isabelle.   <br>\nI am interested in nonmonotonic logics, and I would like to formally  <br>\nverify metatheorems in these systems -- in particular, for default  <br>\nlogic.  Gerwin Klein suggested that it is in principle possible to do  <br>\nthis by defining a proof system for these logics within an existing  <br>\ninstantiation of Isabelle (e.g. Isabelle/HOL).  My first thought is  <br>\nto try doing this with one of the sequent calculi for default logic  <br>\n(see [1] for skeptical variant of default logic).  Does anyone have  <br>\nany other hints on this -- especially how feasible it is within  <br>\nIsabelle -- or pointers to existing work that is relevant?</p>\n<p>Thanks a lot,<br>\n   --Yarden</p>\n<p>[1] Bonatti, P. A. and Olivetti, N. 1997. A Sequent Calculus for  <br>\nSkeptical Default Logic. In Proceedings of the international  <br>\nConference on Automated Reasoning with Analytic Tableaux and Related  <br>\nMethods (May 13 - 16, 1997). D. Galmiche, Ed. Lecture Notes In  <br>\nComputer Science, vol. 1227. Springer-Verlag, London, 107-121.</p>",
        "id": 293911746,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660747607
    },
    {
        "content": "<p>From: Tom Ridge &lt;<a href=\"mailto:Thomas.J.Ridge@cl.cam.ac.uk\">Thomas.J.Ridge@cl.cam.ac.uk</a>&gt;<br>\nThere is a formalisation of Craig's Interpolation Theorem for a sequent <br>\nstyle system available at</p>\n<p><a href=\"http://www.cl.cam.ac.uk/users/tjr22/doc.html\">http://www.cl.cam.ac.uk/users/tjr22/doc.html</a></p>\n<p>This might give some indication of how sequent style systems can be <br>\nformalised. My belief is that such proofs are feasible, regardless of <br>\nthe representation of binding used. However, learning to use a theorem <br>\nprover in the first place is not routine.</p>\n<p>Tom</p>\n<p>Yarden Katz wrote:</p>",
        "id": 293911761,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660747611
    }
]