[
    {
        "content": "<p>From: Mark Wassell &lt;<a href=\"mailto:mpwassell@gmail.com\">mpwassell@gmail.com</a>&gt;<br>\nHello,</p>\n<p>I have a lemma that I prove using induction that results in a large number<br>\nof cases. A handful of these cases I need to solve explicitly (by this I<br>\nmean with their own case block) but the rest can be discharged in the final<br>\nqed line using a proof method ie</p>\n<p>qed (metis blah)+</p>\n<p>I have made a change that results in this qed line failing. I suspect that<br>\nthis is because one or more of my cases now need to be proved explicitly or<br>\nthe qed line needs modifying.</p>\n<p>I could go through each of the cases, make a 'case' block for it, and see<br>\nif I can prove the case but I am looking for an easier method.</p>\n<p>What I would like to do is, at the qed line, go into 'prove' mode so that I<br>\ncan then experiment with apply style lines to see which one my cases<br>\nrequires an explicit proof or what I would need to the qed line. I see that<br>\nat the qed line that I am in state mode and have a set of subgoals to<br>\nprove. Is there a simple command that puts me in 'prove' mode from here.<br>\nNothing jumps out when scanning the Isar ref manual. With have/show I need<br>\nto specify a goal which isn't what I want.</p>\n<p>Is something like this possible?</p>\n<p>Cheers</p>\n<p>Mark</p>",
        "id": 294762850,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661200480
    },
    {
        "content": "<p>From: Andreas Lochbihler &lt;<a href=\"mailto:mail@andreas-lochbihler.de\">mail@andreas-lochbihler.de</a>&gt;<br>\nHi Mark,</p>\n<p>You can use the command \"apply_end\" right before the \"qed\" line. apply_end works like <br>\napply except that you can use it inside an Isar proof. Of course, this is mainly for <br>\nexploratory purposes; in the end, you want your Isar document to be free of apply_end.</p>\n<p>Best,<br>\nAndreas</p>",
        "id": 294762860,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661200487
    }
]