[
    {
        "content": "<p>From: \"Jared C. Davis\" &lt;<a href=\"mailto:jared@cs.utexas.edu\">jared@cs.utexas.edu</a>&gt;<br>\nACL2 2013<br>\n           International Workshop on the ACL2 Theorem Prover<br>\n                         and its Applications</p>\n<p>May 30-31, 2013 in Laramie, WY, USA</p>\n<p><a href=\"http://www.cs.uwyo.edu/~ruben/acl2-13\">http://www.cs.uwyo.edu/~ruben/acl2-13</a></p>\n<p>IMPORTANT DATES</p>\n<p>(Early) Registration Deadline:     May  6, 2013<br>\n          Hotel Deadline:                    May 15, 2013</p>\n<p>WORKSHOP</p>\n<p>ACL2 2013 is the major technical forum for users of the ACL2 theorem<br>\n  proving system to present research related to the ACL2 theorem<br>\n  prover and its applications.  ACL2 2013 is the eleventh in the<br>\n  series of ACL2 workshops, which occur approximately every 18 months.</p>\n<p>ACL2 is an industrial-strength automated reasoning system, the<br>\n  latest in the Boyer-Moore family of theorem provers.  The 2005 ACM<br>\n  Software System Award was awarded to Boyer, Kaufmann, and Moore for<br>\n  their work in ACL2 and the other theorem provers in the Boyer-Moore<br>\n  family.</p>\n<p>This year's workshop features an exciting collection of<br>\n  presentations on a wide variety of topics, such as new modeling<br>\n  features and reasoning improvements, new user interfaces, better<br>\n  automation for reusing proofs, new approaches to partial functions,<br>\n  and applications of ACL2 to verify hardware (including new areas<br>\n  such as asynchronous and quantum circuits) and GPU algorithms.</p>\n<p>The workshop will also include panel discussions on the ACL2<br>\n  community books and ACL2 version fragmentation.</p>\n<p>PRESENTATIONS</p>\n<p>Shilpi Goel, Warren A Hunt, Jr. and Matt Kaufmann.  Abstract Stobjs<br>\n  and Their Application to ISA Modeling.</p>\n<p>A David Greve and Konrad Slind.  Step-Indexing Approach to Partial<br>\n  Functions.</p>\n<p>Jared Davis and Sol Swords.  Verified AIG Algorithms in ACL2.</p>\n<p>Bernard van Gastel and Julien Schmaltz.  A formalisation of XMAS.</p>\n<p>Sebastiaan J. C. Joosten, Bernard van Gastel and Julien Schmaltz.  A<br>\n  Macro for Reusing Abstract Functions and Theorems.</p>\n<p>Lucas Helms and Ruben Gamboa.  An Interpreter for Quantum Circuits.</p>\n<p>David S. Hardin and Samuel S. Hardin.  ACL2 Meets the GPU:<br>\n  Formalizing a CUDA-based Parallelizable All-Pairs Shortest Path<br>\n  Algorithm in ACL2.</p>\n<p>Freek Verbeek and Julien Schmaltz.  Verification of Building Blocks<br>\n  for Asynchronous Circuits.</p>\n<p>Caleb Eggensperger.  Proof Pad: A New Development Environment for<br>\n  ACL2.</p>\n<p>Jared Davis.  Embedding ACL2 Models in End-User Applications.</p>\n<p>Matt Kaufmann and J Strother Moore.  Enhancements to ACL2 in<br>\n  Versions 5.0, 6.0, and 6.1.</p>\n<p>PROCEEDINGS</p>\n<p>Workshop proceedings are freely available electronically as EPTCS<br>\n  Volume 114. Printed proceedings will be distributed at the workshop,<br>\n  and will also be available for purchase through <a href=\"http://lulu.com\">lulu.com</a>.</p>\n<p>ORGANIZATION</p>\n<p>Program Chairs<br>\n  Ruben Gamboa, University of Wyoming, USA<br>\n  Jared Davis, Centaur, USA</p>\n<p>Program Committee<br>\n  Carl Eastlund, Northeastern University, USA<br>\n  David Greve, Rockwell Collins, USA<br>\n  Warren Hunt, University of Texas, USA<br>\n  Matt Kaufmann, University of Texas, USA<br>\n  Hanbing Liu, AMD, USA<br>\n  Panagiotis Manolios, Northeastern University, USA<br>\n  Magnus Myreen, University of Cambridge, UK<br>\n  David Rager, Battelle Memorial Institute, USA<br>\n  Sandip Ray, Intel, USA<br>\n  Jose Luis Ruiz Reina, University of Seville, Spain<br>\n  David Russinoff, Intel, USA<br>\n  Jun Sawada, IBM, USA<br>\n  Julien Schmaltz, Open University of the Netherlands, The Netherlands<br>\n  Konrad Slind, Rockwell Collins, USA<br>\n  Sol Swords, Centaur, USA<br>\n  Laurent Thery, INRIA, France</p>",
        "id": 294238950,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660906109
    }
]