[
    {
        "content": "<p>From: Peter Sewell &lt;<a href=\"mailto:Peter.Sewell@cl.cam.ac.uk\">Peter.Sewell@cl.cam.ac.uk</a>&gt;<br>\nPiP 2014: Principles in Practice</p>\n<p>Co-located with POPL 2014<br>\nSaturday 25 January, 2014. San Diego, California, USA<br>\n<a href=\"http://www.cl.cam.ac.uk/~pes20/pip2014.html\">http://www.cl.cam.ac.uk/~pes20/pip2014.html</a></p>\n<p>Recent years have seen a number research projects applying rigorous<br>\nsemantics to the analysis or design of industrially significant<br>\nreal-world languages and systems, in various contexts. Principles in<br>\nPractice (PiP) is an informal workshop bringing together researchers<br>\nto discuss the issues involved in engaging with the various industrial<br>\ncommunities, in developing and using semantics at scale, in handling<br>\npre-existing systems complexity, and in the wide range of testing,<br>\nanalysis, and proof-based techniques that can be applied. There will<br>\nbe a programme of invited talks, with no proceedings.</p>\n<p>Speakers</p>\n<ul>\n<li>\n<p>Peter Sewell, Introduction and REMS project (10 minutes)</p>\n</li>\n<li>\n<p>Andrew Kennedy / Nick Benton, Formalizing .EXEs, .DLLs, and all that</p>\n</li>\n<li>\n<p>Benjamin Pierce, Verification and random testing of the SAFE architecture</p>\n</li>\n<li>\n<p>Daniel Kroening, Automated test-suite generation for automotive applications</p>\n</li>\n<li>\n<p>Gang Tan / Greg Morrisett, Reusable tools for formal modeling of machine code</p>\n</li>\n<li>\n<p>Konrad Slind (Rockwell Collins), Industrial verification considered<br>\nas a helix of semi-precious stones</p>\n</li>\n<li>\n<p>Michael Norrish, Ad hoc C: reflections on pragmatic semantics</p>\n</li>\n<li>\n<p>Sergio Maffeis, Formal, executable semantics of web languages:<br>\nJavaScript and PHP</p>\n</li>\n<li>\n<p>Shriram Krishnamurthi, Programming Language Semantics as Natural<br>\nScience: The Peculiar, Evolving, and Barely Consummated Relationship<br>\nBetween Semantics and Scripting Languages</p>\n</li>\n<li>\n<p>Xavier Leroy, How much is a mechanized proof worth, certification-wise?</p>\n</li>\n<li>\n<p>Zhong Shao, Advanced Development of Certified OS Kernels</p>\n</li>\n</ul>\n<p>Registration is via the POPL 2014 registration page. PiP 2014 is not<br>\nan ACM-sponsored meeting, so if you plan to attend, please register<br>\nspecifically for PiP. Breakfast and breaks will be included, but not<br>\nlunch.</p>\n<p>Organisers</p>\n<p>Peter Sewell, University of Cambridge, UK<br>\n    Steve Zdancewic, University of Pennsylvania, USA</p>\n<p>Sponsors</p>\n<p>PiP 2014 is sponsored by the EPSRC REMS project: Rigorous Engineering<br>\nfor Mainstream Systems.</p>",
        "id": 294256825,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660912897
    }
]