[
    {
        "content": "<p>From: David Pichardie &lt;<a href=\"mailto:david.pichardie@irisa.fr\">david.pichardie@irisa.fr</a>&gt;</p>\n<hr>\n<p>AVoCS 2018 Call for Papers<br>\n   18th International Workshop on Automated Verification of Critical Systems<br>\n              Oxford University, UK, July 18-19, 2018<br>\n                 Website: <a href=\"http://avocs18.irisa.fr\">http://avocs18.irisa.fr</a></p>\n<hr>\n<p>Deadline extended to April 20th, 2018</p>\n<hr>\n<p>OVERVIEW<br>\nThe aim of the AVoCS workshop series is to contribute to the<br>\ninteraction and exchange of ideas among members of the international<br>\nresearch community on tools and techniques for the verification of<br>\ncritical systems. In particular, AVoCS 2018 aims to bring together<br>\nscientists and engineers that are active in the area of formal<br>\nmethods, develop tools and techniques for the automated verification<br>\nof critical systems, and are interested in exchanging their<br>\nexperiences in the industrial usage of these methods and tools.</p>\n<p>SCOPE<br>\nThe subject is to be interpreted broadly and inclusively. It covers<br>\nall aspects of automated verification, including model checking,<br>\ntheorem proving, SAT/SMT constraint solving, abstract interpretation,<br>\nand refinement pertaining to various types of critical systems which<br>\nneed to meet stringent dependability requirements (safety-critical,<br>\nbusiness-critical, performance-critical, etc.). Contributions that<br>\ndescribe different techniques or industrial case studies are<br>\nencouraged.</p>\n<p>The technical programme will consist of invited and contributed talks<br>\nand also allow for short presentations of research ideas. The workshop<br>\nwill be relatively informal, with an emphasis on discussion where<br>\nspecial discussion sessions will be organised around the research<br>\nideas presentations. Topics include (but are not limited to):</p>\n<p>- Model Checking<br>\n    - Automatic and Interactive Theorem Proving<br>\n    - SAT, SMT or Constraint Solving for Verification<br>\n    - Abstract Interpretation<br>\n    - Specification and Refinement<br>\n    - Requirements Capture and Analysis<br>\n    - Verification of Software and Hardware<br>\n    - Specification and Verification of Fault Tolerance and Resilience<br>\n    - Probabilistic and Real-Time Systems<br>\n    - Dependable Systems<br>\n    - Verified System Development<br>\n    - Industrial Applications</p>\n<p>INVITED SPEAKERS<br>\nWe are please to announce the following invited talks:</p>\n<p>- Michael Emmi, SRI International, USA<br>\n   - Antoine Miné, Sorbonne Université, LIP6, France</p>\n<p>VENUE<br>\nThe event will at the Department of Computer Science, University of<br>\nOxford. AVoCS is an affiliated event of FM 2018 and it will be hosted <br>\nwithin FLoC 2018 (<a href=\"http://www.floc2018.org\">http://www.floc2018.org</a>). FLoC is a federated <br>\nconference of several international conferences related with<br>\nmathematical logics and computer science, for example CAV, FSCD,<br>\nICLP, IJCAR, ITP and SAT.</p>\n<p>SUBMISSION DETAILS<br>\nSubmissions of full papers to the workshop must not have been<br>\npublished or be concurrently considered for publication elsewhere. All<br>\nsubmissions will be peer-reviewed and judged on the basis of<br>\noriginality, contribution to the field, technical and presentation<br>\nquality, and relevance to the workshop. Submissions are handled via<br>\nEasychair:</p>\n<p><a href=\"https://easychair.org/conferences/?conf=avocs2018\">https://easychair.org/conferences/?conf=avocs2018</a></p>\n<p>The papers must be written in English and should not exceed 15 pages, <br>\nnot counting references and appendices, in Springer LNCS format.</p>\n<p>AVoCS also encourages the submissions of research ideas in order to<br>\nstimulate discussions at the workshop. Reports on ongoing work or<br>\nsurveys on work published elsewhere are welcome. The Programme<br>\nCommittee will select research ideas on the basis of submitted<br>\nabstracts according to significance and general interest. Research<br>\nideas must be written in English and not exceed 2 pages using the<br>\nSpringer LNCS format. The presentation of these ideas will be organised<br>\naround discussions, where the presenter should also prepare a set of<br>\nquestions in which the audience will discuss.</p>\n<p>IMPORTANT DATES<br>\nPaper submission: April 20th, 2018 <br>\nNotification: May 15th, 2018 <br>\nFinal version of papers due: May 31st, 2018 <br>\nAVoCS Conference: July 18-19th, 2018 <br>\nFLoC Conference: July 6-19th, 2018 </p>\n<p>PROCEEDINGS<br>\nAt the workshop, pre-proceedings will be available in the form of a<br>\nFLoC 2018 pre-proceedings; this report will also<br>\ninclude the research ideas.  After the workshop, the authors of<br>\naccepted full papers will have about one month in order to revise<br>\ntheir papers for publication in the workshop post-proceedings<br>\nwhich will appear in the Electronic Communications of the EASST<br>\nOpen Access Journal. Research ideas will not be part of the<br>\nproceedings in the Open Access Journal.</p>\n<p>SPECIAL SCP JOURNAL ISSUE<br>\nAuthors of a selection of the best papers presented at the workshop<br>\nwill be invited to submit extended versions of their work for<br>\npublication in a special issue of Elsevier's journal Science of<br>\nComputer Programming.</p>\n<p>PROGRAM COMMITTEE<br>\nJean-Christophe Filliatre, CNRS, France<br>\nStefania Gnesi, ISTI-CNR, Pisa, Italy<br>\nGregor Goessler, INRIA, France<br>\nMarieke Huisman, University of Twente, Netherlands<br>\nBart Jacobs, KU Leuven, Belgium<br>\nThierry Lecomte, ClearSy, France<br>\nMichael Leuschel, University of Düsseldorf, Germany<br>\nStephan Merz, Inria Nancy/LORIA, France<br>\nDavid Pichardie (co-chair), IRISA/ENS Rennes/Inria, France<br>\nAndrew Reynolds, University of Iowa, USA<br>\nMarkus Roggenbach, Swansea University, UK<br>\nMihaela Sighireanu (co-chair), University Paris Diderot, France<br>\nBernhard Steffen, University of Dortmund, Germany<br>\nJun Sun, Singapore University of Technology and Design, Singapore<br>\nMaurice Ter Beek, ISTI-CNR, Pisa, Italy<br>\nCaterina Urban, ETH Zurich, Switzerland<br>\nLaurent Voisin, Systerel, France<br>\nFlorian Zuleger, Vienna University of Technology, Austria</p>\n<p>STEERING COMMITTEE<br>\nMichael Goldsmith, University of Oxford, UK<br>\nStephan Merz, INRIA Nancy &amp; LORIA, France<br>\nMarkus Roggenbach, Swansea University, UK</p>\n<p>CONTACT<br>\nAll questions about submissions should be emailed to AVOCS'18 chairs.</p>",
        "id": 294730579,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661187862
    }
]