[
    {
        "content": "<p>From: Andrew Gacek &lt;<a href=\"mailto:andrew.gacek@gmail.com\">andrew.gacek@gmail.com</a>&gt;<br>\nIs HOL in Isabelle/HOL based on full semantics or Henkin semantics [1]?</p>\n<p>If it is full semantics, are there any automated theorem provers based<br>\non Henkin semantics for higher-order or secord-order logic?</p>\n<p>Thanks,<br>\nAndrew</p>\n<p>[1] <a href=\"http://en.wikipedia.org/wiki/Higher-order_logic\">http://en.wikipedia.org/wiki/Higher-order_logic</a></p>",
        "id": 294646325,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661164215
    },
    {
        "content": "<p>From: Larry Paulson &lt;<a href=\"mailto:lp15@cam.ac.uk\">lp15@cam.ac.uk</a>&gt;<br>\nThis is not my area of expertise, but my impression is that Henkin semantics gives you a completeness theorem for the standard formal system. In other words, there is no formal system specific to Henkin semantics and therefore also no theorem provers specifically for it.</p>\n<p>Larry Paulson</p>",
        "id": 294646330,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661164218
    },
    {
        "content": "<p>From: Konrad Slind &lt;<a href=\"mailto:konrad.slind@gmail.com\">konrad.slind@gmail.com</a>&gt;<br>\nI thought that some of the type theory automated provers<br>\nwere based on formulas with Henkin semantics. E.g.:</p>\n<p><a href=\"https://www.ps.uni-saarland.de/Publications/documents/Brown2012a.pdf\">https://www.ps.uni-saarland.de/Publications/documents/Brown2012a.pdf</a></p>\n<p>I have always been puzzled about Standard vs. Henkin as well. So many<br>\narticles say something to the effect that \"Second Order Logic is not a<br>\nlogic\"!</p>\n<p>Konrad</p>",
        "id": 294646349,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661164227
    },
    {
        "content": "<p>From: Andrei Popescu &lt;<a href=\"mailto:a.popescu@mdx.ac.uk\">a.popescu@mdx.ac.uk</a>&gt;<br>\nHi Andrew,</p>\n<blockquote>\n<blockquote>\n<p>Is HOL in Isabelle/HOL based on full semantics or Henkin semantics [1]?</p>\n</blockquote>\n</blockquote>\n<p>I would say that the HOL-based provers, including Isabelle/HOL, can be seen as \"based on Henkin semantics\" because of what Larry pointed out: <br>\nthat HOL deduction is sound and complete w.r.t. (a proper notion of) Henkin semantics. The deduction is of course sound for the full-frame semantics. </p>\n<p>Another note: As far as I see, what the theorem proving community calls \"the HOL logic\" is something quite specific, introduced in Mike Gordon's seminal HOL system: classic higher order logic with infinity, choice, rank-1 polymorphism, constant definitions and a \"typedef\" mechanism for introducing new types by carving out non-empty subsets of existing types. Isabelle/HOL additionally includes overloaded  constant definitions (with possible delay and recursion in the overloading process), which form the basis of type classes.  A proper notion of Henkin semantics needs to account for all these.  </p>\n<p>Best, <br>\n   Andrei </p>\n<hr>\n<p>Please note that Middlesex University's preferred way of receiving all correspondence is via email in line with our Environmental Policy. All incoming post to Middlesex University is opened and scanned by our digital document handler, CDS, and then emailed to the recipient.</p>\n<p>If you do not want your correspondence to Middlesex University processed in this way please email the recipient directly. Parcels, couriered items and recorded delivery items will not be opened or scanned by CDS.  There are items which are \"exceptions\" which will be opened by CDS but will not be scanned a full list of these can be obtained by contacting the University.</p>",
        "id": 294646356,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661164230
    },
    {
        "content": "<p>From: Larry Paulson &lt;<a href=\"mailto:lp15@cam.ac.uk\">lp15@cam.ac.uk</a>&gt;<br>\nThe remarks in that paper concerning completeness for Henkin models don’t imply that the calculus is different from one that we would use. Proving completeness for standard inference systems is the point of Henkin models.</p>\n<p>Larry Paulson</p>",
        "id": 294646366,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661164236
    }
]