[
    {
        "content": "<p>From: Shan Lin &lt;<a href=\"mailto:shan.x.lin@stonybrook.edu\">shan.x.lin@stonybrook.edu</a>&gt;<br>\nSeeking a Postdoc on recently funded NSF CPS grant on Closed-Loop<br>\nVerification of Medical Devices.  The postdoc will perform research on<br>\ncomputational modeling, formal verification and control of 2-d and 3-d<br>\ncardiac tissue along with cardiac medical devices, especially for newly<br>\ndeveloped therapies such as Low-Energy Antifibrillation Protocol (LEAP).<br>\nPlease also see the CyberCardia project web page at<br>\n<a href=\"http://cybercardia.cs.stonybrook.edu/\">http://cybercardia.cs.stonybrook.edu/</a>.  The postdoc should have programming<br>\nexperience with Matlab, Java and C, and be able to write papers, develop<br>\nmodels of complex dynamical systems, and apply formal verification<br>\ntechniques to the same.  Finally, the postdoc will be involved in<br>\nco-advising graduate students working on the project.  The project is a<br>\ncollaborative effort involving multiple PIs across several universities.<br>\nThe postdoc will be supervised by Scott Smolka (<a href=\"mailto:sas@cs.stonybrook.edu\">sas@cs.stonybrook.edu</a>),<br>\nProfessor of Computer Science, and Shan Lin (<a href=\"mailto:shan.x.lin@stonybrook.edu\">shan.x.lin@stonybrook.edu</a>),<br>\nAssistant Professor of Electrical and Computer Engineering, at Stony Brook<br>\nUniversity.</p>\n<p>Interested candidates should apply using the following link:</p>\n<p><a href=\"https://stonybrooku.taleo.net/careersection/2/jobdetail.ftl?job=1502574\">https://stonybrooku.taleo.net/careersection/2/jobdetail.ftl?job=1502574</a></p>\n<p>The positions are open immediately and the initial appointment will be for<br>\ntwo years, with a possible extension beyond that. Applications will be<br>\naccepted until this position is filled. The anticipated/preferred start<br>\ndate for the postdoc position is approximately Spring 2016, so we urge<br>\ncandidates to apply in a timely manner.</p>",
        "id": 294661363,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661170024
    }
]