[
    {
        "content": "<p>From: Gerwin Klein &lt;<a href=\"mailto:gerwin.klein@nicta.com.au\">gerwin.klein@nicta.com.au</a>&gt;<br>\nI am currently updating a very large theory from Isabelle2009-1 to Isabelle2009-2. So far this update was less painful than previous one, but I seem to be stuck now:</p>\n<p>I am getting various versions of insufficient memory exceptions from polyml-5.3 after the theory has been fully processed at the point (I presume) where polyml is writing the image to disk, possibly while it is doing garbage collection.</p>\n<p>A sample output of the log file is (the log file is btw gzipped and the error code is success, but the image is never written):</p>\n<p>lemma ... [last lemma of thy]  <br>\nval it = () : unit<br>\nval it = () : unit<br>\nML&gt; Exception- Fail \"Insufficient memory\" raised<br>\nML&gt; </p>\n<p>The platform is polyml-5.3.0_x86-linux<br>\nwith<br>\nISABELLE_USEDIR_OPTIONS=\"-M 1 -p 0 -q 0 -v true\"<br>\nand unchanged standard ML settings. </p>\n<p>The machine has 8G of RAM and otherwise works fine for other big developments.</p>\n<p>On polyml-5.3.0_x86-darwin, I am getting the same with the same settings. With -M 2, I am getting a C level exception in polyml at the same point with the message to set a breakpoint in a malloc function on stdour/err (but the same exception in the log). </p>\n<p>On polyml-5.3.0_x86_64-darwin, I am getting with -M 1 the same log, and this message on std out:</p>\n<p>Building CKERNEL ...<br>\npoly(5949,0xa0a3e500) malloc: *** mmap(size=134217728) failed (error code=12)<br>\n*** error: can't allocate region<br>\n*** set a breakpoint in malloc_error_break to debug<br>\nFinished CKERNEL (0:32:51 elapsed time, 0:32:47 cpu time, factor 0.99)</p>\n<p>(possibly the same as the 32bit version, but I've lost the previous output. Can reproduce if needed)</p>\n<p>With -M 3 and -M 2, on 64bit Darwin, I am instead getting exceptions about not being able to start another thread (at the same point). Again, the machine has 8GB of RAM and is otherwise rock solid.</p>\n<p>The same image builds easily under 32bit and 64bit polyml 5.3.0 (same version) on machines with less than 4GB of memory in Isabelle2009-1. </p>\n<p>Any ideas? </p>\n<p>I've tried playing around with -H and --mutable/--immutable settings, without success, but I don't have a good guideline what to try. </p>\n<p>Cheers,<br>\nGerwin</p>",
        "id": 294112911,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660837411
    },
    {
        "content": "<p>From: Gerwin Klein &lt;<a href=\"mailto:gerwin.klein@nicta.com.au\">gerwin.klein@nicta.com.au</a>&gt;<br>\nOne more bit of information: <br>\nTracing memory consumption in an interactive session for the same theory claims memory usage of 1.3GB \"real\" memory and 2.3GB of used virtual memory (on 32bit poly on MacOS X). </p>\n<p>This would be consistent with the theory working fine on much smaller machines before.</p>\n<p>Now I have even less of an idea where the error messages are coming from, though.</p>\n<p>Cheers,<br>\nGerwin</p>",
        "id": 294112925,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660837416
    }
]