[
    {
        "content": "<p>From: Richard Bubel &lt;<a href=\"mailto:bubel@cs.tu-darmstadt.de\">bubel@cs.tu-darmstadt.de</a>&gt;<br>\n[Please accept our apologies for duplicates]</p>\n<p>TU Darmstadt in Germany is offering multiple Ph.D. positions in the<br>\nSoftware Factory 4.0 project coordinated by Prof. Dr. Heiko Mantel.</p>\n<p>The Project</p>\n<hr>\n<p>You will be working on the LOEWE project \"Software-Factory 4.0\" (SF4.0),<br>\nfunded by the German State of Hesse.</p>\n<p>The goal of \"Software-Factory 4.0\" is to enable legacy software systems <br>\n(as used for high performance computing and cyber-physical production<br>\nsystems) to keep up with the rapid technological advances made in the <br>\ndevelopment of new hardware and middleware platforms. Existing software <br>\nmust be retrofitted to fully exploit the potential provided by technological <br>\nprogress. Complete re-development of the existing stock of production<br>\nsoftware is infeasible. At the same time, superficially adapted legacy<br>\nsoftware prevents optimal hardware usage. This is known as the<br>\n\"software gap\".</p>\n<p>SF4.0 aims to create methods and tools that enable continuous and largely<br>\nautomated re-engineering of software to meet changed requirements and<br>\ntechnological constraints. Re-engineering keeps software development costs<br>\nmanageable and allows one to preserve expert domain knowledge inherent to<br>\nlegacy software. In SF4.0, special emphasis will be put on the reliability<br>\nof the resulting software. Formal methods and semantics will be applied<br>\nfor this purpose.</p>\n<p>The two main application areas to be explored in SF4.0 are \"High<br>\nPerformance Computing\" (HPC) and \"Industrie 4.0\". In the former, <br>\nparallelization of existing software is the main driving force, while the latter <br>\nfocuses on the variability aspects of cyber-physical production systems and<br>\nthe development of digital twins.</p>\n<p>SF4.0 consists of eight part projects, each of which offers 1-2 Ph.D.<br>\npositions in the areas of computer science and mechanical engineering. A<br>\nselection of the specific areas includes: concurrency semantics, cyber-physical<br>\nproductioncsystems, formal methods, parallel and distributed computing,<br>\nsoftware-aided construction, software engineering, and static program analysis.</p>\n<p>Your Profile</p>\n<hr>\n<p>You are enthusiastic about applied and/or theoretical research and you<br>\nhave a strong background and demonstrable interest in one or more of the areas<br>\nmentioned above.</p>\n<p>We are looking for researchers with an independent mind who are willing to<br>\ncooperate in our international team. We expect good communicative and social<br>\nskills. Candidates should be prepared to prove their English language skills.</p>\n<p>As a research outcome we expect publications, software tools,<br>\nand a Ph.D. thesis.</p>\n<p>What We Offer</p>\n<hr>\n<ul>\n<li>starting date of the position: from January 2018</li>\n<li>a highly stimulating, dynamic, international scientific environment</li>\n<li>\n<p>the chance to participate in a highly visible, economically relevant research <br>\nproject</p>\n</li>\n<li>\n<p>full status as an employee at TU Darmstadt, including pension and health care<br>\nbenefits</p>\n</li>\n<li>\n<p>excellent facilities for professional and personal development</p>\n</li>\n</ul>\n<p>Further Information and How to Apply:</p>\n<hr>\n<p>Applications should arrive before December 6, 2017. The application<br>\nprocess will be available until all positions are filled.</p>\n<p>An electronic application form and a description of the different part<br>\nprojects is available at the SF4.0 application portal:<br>\n<a href=\"https://www.softwarefactory40.tu-darmstadt.de\">https://www.softwarefactory40.tu-darmstadt.de</a></p>\n<p>Further information on the project, open positions and the application<br>\nprocess can be found at the<br>\nfollowing webpages:<br>\n<a href=\"http://www.mais.informatik.tu-darmstadt.de/sf40.html\">http://www.mais.informatik.tu-darmstadt.de/sf40.html</a> (coordinator webpage)<br>\n<a href=\"http://www.software-factory-4-0.de/\">http://www.software-factory-4-0.de/</a> (project webpage)</p>",
        "id": 294723739,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661185730
    }
]