[
    {
        "content": "<p>From: Elizabeth Leonard &lt;<a href=\"mailto:elizabeth.leonard@nrl.navy.mil\">elizabeth.leonard@nrl.navy.mil</a>&gt;<br>\nGraduate and Undergraduate Internships<br>\n(U.S. Citizens only)<br>\nNaval Research Laboratory<br>\nCenter for High Assurance Computer Systems<br>\nWashington, DC 20375</p>\n<p>The Software Engineering Section of NRL’s Center for High Assurance <br>\nComputer Systems is offering paid student internships for Summer 2018. <br>\nSeveral ongoing projects within the section, all in the general area of <br>\nformal methods for critical systems, have internships available for both <br>\ngraduate and undergraduate students.</p>\n<p>The objective of the section’s research program is to develop formal, <br>\nmathematically based methods, models, algorithms, theories, and tools <br>\nsupporting both the construction and analysis of software at different <br>\nlevels of abstraction, from requirements through code. Such methods and <br>\ntools provide vital support for the development of high assurance <br>\nsoftware for systems, such as autonomous systems, security systems and <br>\ndevices, and control software, that must satisfy critical system <br>\nproperties such as safety, timing, fault tolerance, and security. Many <br>\nof the formal-methods-based techniques and tools produced in the <br>\nSection’s past research have been applied to real Navy systems.</p>\n<p>We are interested in applicants with expertise in any of the following:</p>\n<p>·formal modeling/specification of software and systems</p>\n<p>·verification techniques and tools: decision procedures, SMT solvers, <br>\nmodel checkers, theorem provers</p>\n<p>·integration of analysis tools</p>\n<p>·simulation of physical dynamics, ROS, Gazebo, cosimulation of software <br>\nand physical/mechanical processes</p>\n<p>·compositional model-based techniques for software construction and analysis</p>\n<p>·construction and analysis of continuous &amp; discrete timed models of <br>\ncyber-physical systems</p>\n<p>·automatic generation of code assertions and procedure contracts</p>\n<p>·incremental parsing</p>\n<p>·incremental/regression verification</p>\n<p>·programming in: C, Java, Python</p>\n<p>·parser generation using Antlr</p>\n<p>·MySQL database development</p>\n<p>Current research in the section includes:</p>\n<p>Application-Specific Security of Source Code: This project is developing <br>\ntheory, methods, and tools for analyzing source code for <br>\napplication-specific security properties such as data separation, <br>\nabsence of undesirable information flows, nonbypassability of critical <br>\ncode, and proper memory sanitization. The research combines <br>\ntemplate-based specification of security properties with automatic <br>\ngeneration and checking of assertions to verify that code satisfies the <br>\nspecified properties and to detect violations of those properties.</p>\n<p>High Assurance Cyber-Physical Systems:This project is developing new <br>\ntheory, methods, and tools for model-based development of cyber-physical <br>\nsystems.All methods and tools developed in the project will be <br>\ndemonstrated on real systems, which may include unmanned vehicles and <br>\nrobots.</p>\n<p>Applications of Formal Methods in Developing Real Critical Systems:</p>\n<p>(1) Robotics: Formal-methods-based modeling and analysis techniques and <br>\ntools are being applied to critical software components of a robot <br>\ndesigned to service satellites in space. In addition to applying <br>\nwell-established formal analysis methods and tools, new analysis <br>\ntechniques and tools are being developed to provide assurance that the <br>\nrobot behaves safely and functions correctly.</p>\n<p>(2) Secure Systems: Formal analysis methods and tools are being <br>\ndeveloped and applied to critical aspects of a framework for <br>\nself-securing systems.</p>\n<hr>\n<p>Program Information and Application Process</p>\n<hr>\n<p>U.S. citizenship is required.</p>\n<p>Interested candidates should send a resume to Dr. Elizabeth Leonard <br>\n(<a href=\"mailto:elizabeth.leonard@nrl.navy.mil\">elizabeth.leonard@nrl.navy.mil</a>). Please indicate in your email that you <br>\nare applying for an internship position.</p>",
        "id": 294726283,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661186517
    }
]