[
    {
        "content": "<p>From: Ken Kubota &lt;<a href=\"mailto:mail@kenkubota.de\">mail@kenkubota.de</a>&gt;<br>\nDear Andrei Popescu, dear Ramana Kumar,<br>\ndear Members of the Research Community,</p>\n<p>As a matter of fairness, I have to correct one of my earlier statements.</p>\n<p>Andrei Popescu correctly pointed out at<br>\n<a href=\"https://lists.cam.ac.uk/pipermail/cl-isabelle-users/2015-December/msg00059.html\">https://lists.cam.ac.uk/pipermail/cl-isabelle-users/2015-December/msg00059.html</a><br>\nthat neither \"being based on a meta-logic\" (i.e., a logical framework) nor <br>\n\"featuring a natural deduction system\" creates a problem.<br>\nThere has been a misunderstanding on my part.<br>\nHowever, I have to say that Paulson's definition of the turnstile as a symbol <br>\nfor the predicate \"hfthm\" in<br>\n\"inductive hfthm :: \"fm set =&gt; fm =&gt; bool\" (infixl \"⊢\" 55)\"<br>\n<a href=\"https://www.isa-afp.org/browser_info/current/AFP/Incompleteness/SyntaxN.html\">https://www.isa-afp.org/browser_info/current/AFP/Incompleteness/SyntaxN.html</a><br>\nsomewhere hidden in the proof files without being prominently announced in his <br>\narticles is strongly misleading and inevitably creates misinterpretations. <br>\nUsually (such as in [Andrews, 2002]), the turnstile is used to indicate the <br>\nprovability of a theorem of the logic in which the proof is undertaken, not the <br>\nprovability of theorems of the embedded logic. Also, for the predicate of <br>\nprovability of theorems of the embedded (represented, formalized) logic, a <br>\nlabel is usually used, not a symbolic notation (e.g., Goedel uses \"Bew\" - for <br>\n\"beweisbare Formel\", the German expression for \"provable formula\" -, and <br>\nO'Connor in Coq uses \"SysPrf\"). Moreover, without some short introduction to <br>\nthe notation and the type system it is nearly impossible to analyze the proof <br>\nin detail unless one has advanced experience with the Isabelle proof assistant, <br>\nleaving aside that with a logical framework there are not only three, but four <br>\nlanguage levels involved, all of which one would ideally need to understand in <br>\norder to verify the proof.</p>\n<p>The result of the formal proof<br>\n    ~Bew(g) /\\ ~Bew(not g)<br>\ncan be interpreted in the sense that it is possible to construe a formula with <br>\nthe form of a sentence (i.e., a boolean-valued well-formed formula with no free <br>\nvariables) neither provable nor refutable.<br>\nNevertheless, the claim of \"incompleteness\" depends on a philosophical <br>\nassumption.<br>\nOne who shares the semantic view (model theory) will conclude that there is a <br>\nmeaningful (and true) sentence that is neither provable nor refutable, and will <br>\ncall the discrepancy between syntax and semantics \"incompleteness\".<br>\nBut one who shares the syntactic view will conclude that it is possible to <br>\ncreate a meaningless formula which has the form of a syntactically correct <br>\nsentence (similar, in natural language, to a grammatically correct but <br>\nmeaningless statement like \"mathematics is liquid\").</p>\n<p>Concerning the two objections of Ramana Kumar at<br>\n<a href=\"https://lists.cam.ac.uk/pipermail/cl-isabelle-users/2015-December/msg00061.html\">https://lists.cam.ac.uk/pipermail/cl-isabelle-users/2015-December/msg00061.html</a><br>\nthe first one was a misunderstanding clarified at<br>\n<a href=\"https://lists.cam.ac.uk/pipermail/cl-isabelle-users/2016-January/msg00029.html\">https://lists.cam.ac.uk/pipermail/cl-isabelle-users/2016-January/msg00029.html</a><br>\nBut the second, Ramana Kumar's claim that type \"tm\" can be defined like type <br>\n\"nat\", is not correct. Andrews' logic Q0, being an improved variant of Church's <br>\noriginal simple type theory, only allows the types iota (i) and omicron (o), <br>\nand combinations of them.<br>\nAndrews' type \"nat\" is such a combination ( nat := (o(oi)) ). On the contrary, <br>\nPaulson's type \"tm\" is an inductively defined type, which is not possible in Q0:<br>\n\"nominal_datatype tm = Zero | Var name | Eats tm tm\"<br>\n<a href=\"https://www.isa-afp.org/browser_info/current/AFP/Incompleteness/SyntaxN.html\">https://www.isa-afp.org/browser_info/current/AFP/Incompleteness/SyntaxN.html</a><br>\nIn an e-mail, Paulson basically argued that there should be ways to introduce <br>\nfurther types (instead of restricting oneself to combinations of 'i' and 'o'). <br>\nThis is, of course, correct, but doesn't justify the specific mode of type <br>\nintroduction used here, namely the Backus-Naur form (BNF). The BNF was designed <br>\nto specify formal grammars in computer science, but (mathematical) types are <br>\nobjects that must have certain logical properties, such as being non-empty. <br>\nThus the introduction of additional mathematical types should be subject to <br>\nproof, and not a matter of mere declaration via the BNF.</p>\n<p>With some more knowledge about the concept of the current proof assistants, I <br>\ncan answer Ramana Kumar's question at<br>\n<a href=\"https://lists.cam.ac.uk/pipermail/cl-isabelle-users/2015-July/msg00149.html\">https://lists.cam.ac.uk/pipermail/cl-isabelle-users/2015-July/msg00149.html</a><br>\nconcerning the motivation of my project announcement at<br>\n<a href=\"https://lists.cam.ac.uk/pipermail/cl-isabelle-users/2015-July/msg00147.html\">https://lists.cam.ac.uk/pipermail/cl-isabelle-users/2015-July/msg00147.html</a><br>\nfrom his perspective now.<br>\nCurrent proof assistants seem to follow the semantic approach, in which the <br>\ntheory is distinguished from a specific linguistic (formal) formulation, or use <br>\nof model theoretic notions like satisfiability is made. For example, in <br>\nIsabelle there are implementations of both axiomatic set theory (Isabelle/ZF) <br>\nand type theory (Isabelle/HOL), but neither one is explicitly preferred, and <br>\nthe question of which is more adequate for representing mathematics is not even <br>\nraised. (Although, unlike in informal mathematics, in formalized proofs type <br>\ntheory seems to prevail, e.g., within Isabelle the logic Isabelle/HOL, a <br>\npolymorphic version of Church's simple type theory.)<br>\nIf one follows the syntactic approach, then there is a desire for something <br>\nlike the ideal formulation or the natural language of formal logic and <br>\nmathematics. The main criterion is expressiveness [cf. Andrews, 2002, p. 205], <br>\nor, vice versa, the reducibility of mathematics to a minimal set of primitive <br>\nrules and symbols. If we leave away for a moment the restrictions of Q0 of <br>\nstill being a formulation of simple type theory (i.e., without type variables <br>\nand dependent types), all of formal logic and mathematics can be expressed on <br>\nthe basis of only a \"single rule of inference (substitution, from which the <br>\nrule of modus ponens is derived)\" and \"only two basic types (individuals and <br>\ntruth values) and only two basic constants (identity/equality and its <br>\ncounterpart, description)\"<br>\n<a href=\"https://lists.cam.ac.uk/pipermail/cl-isabelle-users/2015-July/msg00147.html\">https://lists.cam.ac.uk/pipermail/cl-isabelle-users/2015-July/msg00147.html</a><br>\nPaulson argued that natural deduction is far superior to Hilbert-style systems <br>\nfor automated proof. This is, of course, correct, since Hilbert-style <br>\nmetatheorems become symbolically representable in natural deduction as regular <br>\ntheorems (and not just metatheorems), but this only reflects the engineer's <br>\nperspective with the pragmatic aim of quickly obtaining proofs. For the <br>\nphilosopher it is not proof automation but expressiveness that is the main <br>\ncriterion, such that the method with the least amount of rules of inferences, <br>\ni.e., a Hilbert-style system, is preferred, and all other rules become derived <br>\nrules.<br>\nHence, from the perspective of the syntactic view, Andrews' elegant logic Q0 is <br>\nthe natural point to start with. Overcoming its restrictions by extending it to <br>\na polymorphic (with type variables) and dependent type theory (with dependent <br>\ntypes) is the motivation of my logic R0, which I hope to be able to publish <br>\nsoon. A preliminary excerpt with some definitions and a sample proof is <br>\navailable online at<br>\n<a href=\"http://www.kenkubota.de/files/R0_draft_excerpt_with_definitions_and_groups.pdf\">http://www.kenkubota.de/files/R0_draft_excerpt_with_definitions_and_groups.pdf</a></p>\n<p>Kind regards,</p>\n<p>Ken Kubota</p>\n<hr>\n<p>Ken Kubota<br>\ndoi: 10.4444/100<br>\n<a href=\"http://dx.doi.org/10.4444/100\">http://dx.doi.org/10.4444/100</a></p>",
        "id": 294678598,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661175858
    },
    {
        "content": "<p>From: Gottfried Barrow &lt;<a href=\"mailto:igbi@gmx.com\">igbi@gmx.com</a>&gt;<br>\nIn particular, there is this sentence of yours: \"...this only reflects <br>\nthe engineer's perspective with the pragmatic aim of quickly obtaining <br>\nproofs. For the philosopher it is not proof automation but <br>\nexpressiveness that is the main criterion...\"</p>\n<p>I completely understand the issue of low status vs. high status, and the <br>\nimportance of trying to assert one's status, by bandying about labels, <br>\nwith the hopes that labels will stick.</p>\n<p>I myself, at one time, aspired to be a philosopher, and mind you, no <br>\nmere philosopher, but the mother-of-all-philosophers, as this would give <br>\nme the ability to bandy about the mother-of-all-condensations, along <br>\nwith, certainly, the mother-of-all-condescensions.</p>\n<p>Having aspired, I steeled myself, and struck the philosopher's pose, <br>\nafter which, my arm fell asleep. Surely, if I could have endured even 5 <br>\nmore minutes, the answer would have come, \"42\", and therefore, the <br>\nprize. It was not to be.</p>\n<p>Reevaluating my aspirations, I lowered them, and aspired to be an <br>\nengineer, so that I could at least condescend to technicians.</p>\n<p>Being a man of action, I went out and bought a little train set, and <br>\nspent hours and hours painting the little cars, in intricate detail.</p>\n<p>But one day, when I was engineering my little train set, saying, \"choo, <br>\nchoo, choo\" to the little train cars, the little kids next door heard <br>\nme, because the window was open, and they started laughing at me.</p>\n<p>Do you know how bad it hurts to have little kids laugh at you, when <br>\nyou're saying, \"choo, choo, choo\"?</p>\n<p>So in one massive swoop, I destroyed my little train set, to show those <br>\nlittle kids what a bad martial artist I was, MMA style.</p>\n<p>They just kept laughing.</p>\n<p>It was no great loss. I was actually only aspiring to be a bad martial <br>\nartist, MMA style.</p>\n<p>--<br>\nGZ<br>\n--</p>",
        "id": 294678678,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661175896
    },
    {
        "content": "<p>From: Andreas Röhler &lt;<a href=\"mailto:andreas.roehler@easy-emacs.de\">andreas.roehler@easy-emacs.de</a>&gt;<br>\nThe difference seems that between \"What\" and \"How\" rather.</p>",
        "id": 294678823,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661175921
    },
    {
        "content": "<p>From: Gottfried Barrow &lt;<a href=\"mailto:igbi@gmx.com\">igbi@gmx.com</a>&gt;<br>\nNo serious discussion what supposed to ensue, and it's not supposed to <br>\nstart with my reply here. Your short sentence tells me that maybe you <br>\ndidn't focus on my jokes.</p>\n<p>Any seriousness was supposed to get swamped by my attempt at creative <br>\nwriting. The attempt at creativity was for the purposes of ridiculing an <br>\nidea. There was actually no need for a defense to be made. Writing <br>\nnothing would have been better, maybe.</p>\n<p>Ken wants to compare his raw ideas, valid or not (I wouldn't know), with <br>\nLarry Paulson's work, which is the foundation for what has ended up <br>\nbeing more than 30 years work, founded on Robin Milner's ML, drawing <br>\nfrom Mike Gordon's work, propelled further by Tobias Nipkow et al.</p>\n<p>I'm nobody's friend here, but I gotta figure that Isabelle, its logic <br>\nincluded, simply represents what Larry Paulson decided to commit to as a <br>\npublic work, that its not the totality of his mind.</p>\n<p>As to \"what\", \"how\", and \"why\", it's not like he hasn't been exposed to <br>\na full gamut of ideas, including that which is pure and impractical.</p>\n<p>People want to attack the purity of Isabelle/Pure, but without providing <br>\na serious alternative. Maybe it's the \"30 years work thing\", that a <br>\nserious work takes.</p>\n<p>GZ</p>",
        "id": 294679037,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661176017
    },
    {
        "content": "<p>From: Andreas Röhler &lt;<a href=\"mailto:andreas.roehler@easy-emacs.de\">andreas.roehler@easy-emacs.de</a>&gt;<br>\nOn 12.07.2016 02:19, Gottfried Barrow wrote:</p>\n<blockquote>\n<p>On 7/11/2016 2:57 AM, Andreas Röhler wrote:</p>\n<blockquote>\n<p>On 09.07.2016 05:05, Gottfried Barrow wrote:</p>\n<p>On 7/7/2016 11:26 AM, Ken Kubota wrote:</p>\n<blockquote>\n<blockquote>\n<p>Paulson argued that natural deduction is far superior to <br>\nHilbert-style systems<br>\nfor automated proof. This is, of course, correct, since Hilbert-style<br>\nmetatheorems become symbolically representable in natural deduction <br>\nas regular<br>\ntheorems (and not just metatheorems), but this only reflects the <br>\nengineer's<br>\nperspective with the pragmatic aim of quickly obtaining proofs. For <br>\nthe<br>\nphilosopher it is not proof automation but expressiveness that is <br>\nthe main<br>\ncriterion, such that the method with the least amount of rules of <br>\ninferences,<br>\ni.e., a Hilbert-style system, is preferred, and all other rules <br>\nbecome derived<br>\nrules.</p>\n</blockquote>\n<p>In particular, there is this sentence of yours: \"...this only <br>\nreflects the engineer's perspective with the pragmatic aim of <br>\nquickly obtaining proofs. For the philosopher it is not proof <br>\nautomation but expressiveness that is the main criterion...\"</p>\n<p>I completely understand the issue of low status vs. high status [ ... ]</p>\n</blockquote>\n<p>The difference seems that between \"What\" and \"How\" rather.<br>\n</p>\n</blockquote>\n<p>No serious discussion what supposed to ensue, and it's not supposed to <br>\nstart with my reply here. Your short sentence tells me that maybe you <br>\ndidn't focus on my jokes.<br>\n</p>\n</blockquote>\n<p>Indeed.</p>\n<blockquote>\n<p>Any seriousness was supposed to get swamped by my attempt at creative <br>\nwriting. The attempt at creativity was for the purposes of ridiculing <br>\nan idea. There was actually no need for a defense to be made. Writing <br>\nnothing would have been better, maybe.</p>\n<p>Ken wants to compare his raw ideas, valid or not (I wouldn't know), <br>\nwith Larry Paulson's work, which is the foundation for what has ended <br>\nup being more than 30 years work, founded on Robin Milner's ML, <br>\ndrawing from Mike Gordon's work, propelled further by Tobias Nipkow et <br>\nal.</p>\n</blockquote>\n<p>Well, \"valid or not\" is indeed the question, nothing else.</p>",
        "id": 294679107,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661176045
    }
]