[
    {
        "content": "<p>From: Philipp Ruemmer &lt;<a href=\"mailto:philipp.ruemmer@it.uu.se\">philipp.ruemmer@it.uu.se</a>&gt;<br>\n[Apologies for multiple copies. Please forward to interested students.]</p>\n<p>The department of Information Technology, Uppsala University, announces</p>\n<ul>\n<li>1 Post-doctoral position (2 years, including at most 20% teaching)</li>\n<li>1 fully-paid PhD position (5 years, including 20% teaching)</li>\n</ul>\n<p>on Program Analysis and Code Optimisation using Machine Learning.</p>\n<p>The subject of the post-doc position is to develop more powerful<br>\ntechniques for code optimization or code analysis, by applying machine<br>\nlearning techniques (e.g., deep learning) in new ways to extract<br>\nfeatures from program code. The project will use the result of<br>\nlearning in several possible ways, such as code optimisation that<br>\ncannot be achieved by applying standard compile-time optimizations, or<br>\nthe automatic verification of correctness properties.</p>\n<p>The goal of the PhD position is to find new ways of using machine<br>\nlearning (in particular, methods based on deep neural networks) to<br>\nimprove, extend or replace classical program analyses. Two focus areas<br>\nare model checking (algorithms that can automatically prove the<br>\nabsence of bugs in programs) and defect prediction (methods that can<br>\npredict the likelihood of defects in given code segments). The PhD<br>\nwork will be carried out in the context of a collaboration between<br>\nUppsala University and Microsoft Research Cambridge. The position is<br>\npartly funded through a Microsoft Research PhD scholarship, and<br>\nincludes benefits such as summer schools organised by Microsoft<br>\nResearch Cambridge.</p>\n<p>Application deadline: April 30 2018</p>\n<p>For more details and instructions on how to apply see<br>\nPost-doc: <a href=\"http://uu.se/en/about-uu/join-us/details/?positionId=196265\">http://uu.se/en/about-uu/join-us/details/?positionId=196265</a><br>\nPhD:      <a href=\"http://uu.se/en/about-uu/join-us/details/?positionId=198134\">http://uu.se/en/about-uu/join-us/details/?positionId=198134</a></p>\n<p>For more information on what support you can expect see<br>\n<a href=\"http://www.uu.se/en/about-uu/join-us/plan-your-stay/\">http://www.uu.se/en/about-uu/join-us/plan-your-stay/</a><br>\n<a href=\"/user_uploads/14278/Zi62CnqGjzc8eg0sQPpAS69J/signature.asc\">signature.asc</a></p>",
        "id": 294728415,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661187163
    }
]