[
    {
        "content": "<p>From: Marco Gaboardi &lt;<a href=\"mailto:gaboardi@cs.unibo.it\">gaboardi@cs.unibo.it</a>&gt;<br>\nOne PhD position for EU students available at the University of Dundee, Scotland.</p>\n<p>Contact<br>\n———————————<br>\nMarco Gaboardi - <a href=\"mailto:m.gaboardi@dundee.ac.uk\">m.gaboardi@dundee.ac.uk</a></p>\n<p>Profile<br>\n———————————<br>\nThe subject of the studentship is programming language semantics and implementation. The specific topic for the studentship will depend on the interests and expertise of the potential candidate. Possible topics are: language-based privacy and security, type systems, probabilistic programming, interactive theorem proving, logics and applications, program analysis tools.</p>\n<p>Conditions<br>\n———————————<br>\nThe studentship covers 3 years with a standard stipend of about £13-14k a year plus some eligible travel and consumables.</p>\n<p>Requirements<br>\n———————————<br>\nThe position is only for EU students. The ideal candidate must show a solid mathematical background and interest in theoretical and/or practical works.<br>\nPrevious experience in one or more of the areas described in the profile will be considered a plus.</p>\n<p>How to apply<br>\n———————————<br>\nThe position is available immediately. Candidates must contact Marco Gaboardi - <a href=\"mailto:m.gaboardi@dundee.ac.uk\">m.gaboardi@dundee.ac.uk</a></p>\n<p>Dundee and the university<br>\n———————————<br>\nDundee is the fourth-largest city in Scotland and it is well connected with Edinburgh, Glasgow and Aberdeen. Dundee is promoted as 'One City, Many Discoveries' in honor of Dundee's history of scientific activities and of the RRS Discovery exploration vessel, which is berthed in the city harbor. Biomedical, technological and video game industries have been important for the development of the city in the last 20 years.<br>\nThe University of Dundee counts about 18.000 students and is situated in the city center. The university is ranked in the World's Top 250 Universities and has been voted one of the best universities in the UK for student experience. <br>\n<a href=\"http://en.wikipedia.org/wiki/Dundee\">http://en.wikipedia.org/wiki/Dundee</a><br>\n<a href=\"http://www.dundee.ac.uk\">http://www.dundee.ac.uk</a></p>\n<p>The Theory of Computation group<br>\n———————————<br>\nThe Theory of Computation group focuses on research into different areas covering functional programming, program analysis, computational logic, machine learning, constraint programming, graph theory, algorithms and applications like privacy, security, complexity, optimisation, and artificial intelligence.</p>",
        "id": 294271722,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660917441
    }
]