[
    {
        "content": "<p>From: Andrei Popescu &lt;<a href=\"mailto:a.popescu@mdx.ac.uk\">a.popescu@mdx.ac.uk</a>&gt;<br>\nHi Makarius, </p>\n<p>First, I thank you very much for looking into this. I have a conference tutorial to prepare for this Sunday, and this is why I will be rather brief in my reply. Next week I'll address <br>\nthe points you are raising in much greater detail. </p>\n<p>Second, if you can, please ignore that reference to the technical report -- it is indeed a lingering reference, which we unfortunately forgot to remove. At the preparation of the camera-ready, we managed to <br>\ninclude sufficient technical details in the paper, especially since we received an extra page. So now the paper essentially includes that report. I am here to offer any missing technical details, should you <br>\nrequest any -- but if you read the paper in good faith, it is likely you will not even need additional explanations.  </p>\n<p>Third, I kindly ask you that, during our discussion about this, you respect my different opinion here, which can be summarized as follows: </p>\n<p>BEGIN opinion </p>\n<p>Even though Isabelle/HOL is implemented on top of a logical framework, we can conceptually speak about its structure as: </p>\n<p>(A) a logic L, consisting of axioms and rules of deduction</p>\n<p>(B) the logic L augmented with a definitional mechanism (namely, type and constant definitions) -- let me call it L_D</p>\n<p>The current situation with Isabelle/HOL is the following: Even though L is consistent (in that it cannot prove False), L_D is inconsistent (in that it can prove False).</p>\n<p>END opinion </p>\n<p>Even though, as the developer of the Isabelle <em>software</em> , you believe the situation is much more complex, I kindly ask you to make an effort and understand this point of view. <br>\nThe purpose of any logical framework (including Isabelle/Pure and Edinburgh LF) is to facilitate the implementation of a logic, not to intrude with the logic. I am sure that the implementation of <br>\nIsabelle/HOL inside Isabelle/Pure does a good job at achieving this. I am saying this as a fairly experienced user of Isabelle/HOL.  </p>\n<p>The development from our paper works with the logics L and L_D assumed above. Again, if you read the paper in good faith, you will be able to understand what is being proved there and perhaps <br>\nconvince yourself that the proposed change to the system will at least achieve the following goal: prevent certain ways of proving False which is particularly disturbing to many many users. </p>\n<p>Finally, I have a possibly strange request: Please do not trust your judgement <em>alone</em>, because you (like anybody else) may be wrong, and may not realize it because of the way you look at things. <br>\nThere must be someone (at least one person) on this mailing list whose judgement you trust. Please ask that person for a second opinion about: (1) the actual problem discussed here and (2) the solution we propose in the paper. <br>\nIf possible, please also make the name of that person public.  </p>\n<p>All the best and talk to you again soon, <br>\n   Andrei </p>\n<hr>\n<p>Please note that Middlesex University's preferred way of receiving all correspondence is via email in line with our Environmental Policy. All incoming post to Middlesex University is opened and scanned by our digital document handler, CDS, and then emailed to the recipient.</p>\n<p>If you do not want your correspondence to Middlesex University processed in this way please email the recipient directly. Parcels, couriered items and recorded delivery items will not be opened or scanned by CDS.  There are items which are \"exceptions\" which will be opened by CDS but will not be scanned a full list of these can be obtained by contacting the University.</p>",
        "id": 294652759,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661166783
    },
    {
        "content": "<p>From: Andrei Popescu &lt;<a href=\"mailto:A.Popescu@mdx.ac.uk\">A.Popescu@mdx.ac.uk</a>&gt;<br>\nSorry, a couple of further brief notes: </p>\n<blockquote>\n<blockquote>\n<p>This proper distinction also explains, why typedefs were not treated in the past, because it is hard to understand them in generic Isabelle/Pure, without an unfriendly takeover of the framework by HOL troups.</p>\n</blockquote>\n</blockquote>\n<p>It is of course impossible. We have to let the HOL troops in at this point, there is no way around this.  </p>\n<blockquote>\n<blockquote>\n<p>A few more notes on the paper: I actually liked the \"Inconsistency Club\" versus \"Consistency Club\", although it is hard to define that boundary. Just a single Boolean value to measure the reliability and robustness of a <br>\nproof assistant in black or white is a bit lacking. Apart from shades of grey, such a measure desparately needs more than one dimension.</p>\n</blockquote>\n</blockquote>\n<p>\"Consistency Club\" here does not refer to bullet-proof systems, but to formal efforts of partly ensuring consistency (whatever that means :-)  ). In particular, this club does not contain theorem provers, but formal developments.  </p>\n<p>All the best, <br>\n  Andrei</p>\n<hr>\n<p>Please note that Middlesex University's preferred way of receiving all correspondence is via email in line with our Environmental Policy. All incoming post to Middlesex University is opened and scanned by our digital document handler, CDS, and then emailed to the recipient.</p>\n<p>If you do not want your correspondence to Middlesex University processed in this way please email the recipient directly. Parcels, couriered items and recorded delivery items will not be opened or scanned by CDS.  There are items which are \"exceptions\" which will be opened by CDS but will not be scanned a full list of these can be obtained by contacting the University.</p>",
        "id": 294652771,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661166787
    },
    {
        "content": "<p>From: Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt;<br>\nI joined this thread with the intention of a serious discussion, and I <br>\nstill mean that.</p>\n<p>Makarius</p>",
        "id": 294652884,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661166836
    },
    {
        "content": "<p>From: Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt;<br>\nOK, so I take the pulished paper as is, taken from <br>\n<a href=\"http://www4.in.tum.de/~kuncar/documents/kuncar-popescu-itp2015.pdf\">http://www4.in.tum.de/~kuncar/documents/kuncar-popescu-itp2015.pdf</a></p>\n<p>In the third round of looking at it, I have now started to read the <br>\ntechnical part and have already learned many interesting things.  I will <br>\ncomment (and criticize) more later, when the big picture has evolved a bit <br>\nfurther.</p>\n<p>I need to appeal again to the professional routine of the Isabelle <br>\ndevelopment and release process.  Users will have true reasons to get <br>\nworried, when non-trivial changes to core system components and their very <br>\nfoundations can be pushed-in just by making a lot of noise in public.</p>\n<p>I've not been at the ITP talk, but I can imagine how it went, just by <br>\nextrapolating the style and manner of some paragraphs in the paper.</p>\n<p>You may remember yourself that the initial idea of BNF (co)datatypes was <br>\nexpected to be implemented in one year, or so.  Ultimately it required <br>\nmany years, and several wizards to finish the job.  Behind the scenes we <br>\neven had to get David Matthews involved, to extend the playground of the <br>\nML platform.  I also had to make \"dangerous experiments\" again -- as you <br>\ncall it in the paper -- in order to have it all go through smoothly.</p>\n<p>Adapting the ideas presented in the presented paper in the proper way for <br>\nIsabelle will not take as long as BNF datatypes, but it is not immediate.</p>\n<p>It could have been finished already, if we did not have serious <br>\nmeta-problems that are still ignored by most participants of the debate. <br>\nThis is why I spend so much time here, instead of looking through ML <br>\nsources.</p>\n<p>Makarius</p>",
        "id": 294652961,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661166861
    },
    {
        "content": "<p>From: Larry Paulson &lt;<a href=\"mailto:lp15@cam.ac.uk\">lp15@cam.ac.uk</a>&gt;<br>\nOn 20 Sep 2015, at 14:12, Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt; wrote:</p>\n<blockquote>\n<p>Users will have true reasons to get worried, when non-trivial changes to core system components and their very foundations can be pushed-in just by making a lot of noise in public.</p>\n</blockquote>\n<p>Quite true. However, we took the decision a long time ago to detect and reject cyclic constant definitions. In this example, a cycle evades detection because it involves a typedef. Closing this loophole would not represent any change in policy.</p>",
        "id": 294653016,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661166885
    },
    {
        "content": "<p>From: Andrei Popescu &lt;<a href=\"mailto:A.Popescu@mdx.ac.uk\">A.Popescu@mdx.ac.uk</a>&gt;<br>\nHi Makarius, </p>\n<p>I propose splitting this thread in two (as other people also implicitly suggested):</p>\n<p>(1) Should cyclicity checks through typedefs be introduced, to prevent situations such as Example 2?</p>\n<p>I have to say that this paragraph from your postings has made my day:</p>\n<p>You wrote: </p>\n<blockquote>\n<blockquote>\n<p>The proposed changes of the present paper are genuine feature additions<br>\nthat go beyond the known and documented model of Isabelle/HOL.  This is<br>\nwhy I reduced the priority to a reasonable level. And in fact, we are<br>\ntalking here about a few months latency of TODO-list pipeline -- things<br>\nroutinely take much longer than that.  Isabelle is not a research<br>\nprototype that can be changed arbitrarily at a high rate. </p>\n</blockquote>\n</blockquote>\n<p>If I read it correctly, your answer to the question is \"Yes, but let's do it properly.\" <br>\nI don't think anybody can argue with the fact that you are the person to do it properly. <br>\nBut emphasizing the \"Yes\" part, and perhaps placing it at the beginning of your first answer <br>\non this thread would have helped immensely.   </p>\n<p>(2) Should typedef really be axiomatic, or should it be made definitional in Isabelle/HOL?</p>\n<p>Here, you also seem to not be completely satisfied with the current status: </p>\n<blockquote>\n<blockquote>\n<p>Of course, one could argue if it is a good idea to treat typedef like<br>\nthat. This would lead to the very start of a serious discussion -- one<br>\nwithout rumors and unnecessary confusion caused by worrying about<br>\npublicity or \"bad press\"</p>\n</blockquote>\n</blockquote>\n<p>Here, I have many things to add. In fact, I would like to argue strongly for having typedef definitional in Isabelle/HOL, and would like <br>\nto invoke the results from our paper as a justification for the possibility of enforcing <em>and claiming</em> definitionality. <br>\nI know there will be a long discussion here, because our notions of definitionality differ and because our notions <br>\nof logical framework differ. I am sure that at the end of this discussion I will convince you that I have a point, and probably  <br>\nyou will show me that my point needs to be refined in order to be applicable to the real Isabelle/HOL.  <br>\nBut I am looking forward to have this discussion in a relaxed manner,^[*] outside of the issue (1).</p>\n<blockquote>\n<blockquote>\n<p>You may remember yourself that the initial idea of BNF (co)datatypes was<br>\nexpected to be implemented in one year, or so.  Ultimately it required<br>\nmany years, and several wizards to finish the job.  Behind the scenes we<br>\neven had to get David Matthews involved, to extend the playground of the<br>\nML platform.  I also had to make \"dangerous experiments\" again -- as you<br>\ncall it in the paper -- in order to have it all go through smoothly.</p>\n</blockquote>\n</blockquote>\n<p>Interesting -- I did not know about the required extension of the infrastructure. And of course <br>\nI appreciate the support you offered with the BNF package; I also hope you find it to be a useful addition to the system. </p>\n<p>All the best, <br>\n   Andrei  </p>\n<p>[*] We had such a (very fruitful and pleasant) discussion the first time I showed you the plan for the BNF package.<br>\nBtw, that package is designed with the assumption that typedef is/can-be definitional. If we truly thought of typedef as (hopelessly) <br>\naxiomatic, I and my coauthors would not have gone to the trouble to reduce a sophisticated (co)datatype universe all the way down to typedef. <br>\nAnd this is also true about the previous datatype package by Stefan.  </p>\n<hr>\n<p>Please note that Middlesex University's preferred way of receiving all correspondence is via email in line with our Environmental Policy. All incoming post to Middlesex University is opened and scanned by our digital document handler, CDS, and then emailed to the recipient.</p>\n<p>If you do not want your correspondence to Middlesex University processed in this way please email the recipient directly. Parcels, couriered items and recorded delivery items will not be opened or scanned by CDS.  There are items which are \"exceptions\" which will be opened by CDS but will not be scanned a full list of these can be obtained by contacting the University.</p>",
        "id": 294653093,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661166922
    }
]