[
    {
        "content": "<p>From: Ian Hayes &lt;<a href=\"mailto:Ian.Hayes@uq.edu.au\">Ian.Hayes@uq.edu.au</a>&gt;<br>\nThe position is part of a new initiative in verified software supported <br>\nby generous funding from Oracle. Initially, this will involve playing a <br>\nleading role in research on verifying optimization passes of compilers. <br>\nFor the first three years, the position will have half the standard <br>\nteaching duties allowing a greater focus on research and support for two <br>\nPhD student scholarships and travel for research collaboration.</p>\n<p>The primary purpose of this positions is to engage in teaching and <br>\nresearch activities in Software Engineering, and play a pivotal role in <br>\ndeveloping software verification technology in the context of <br>\nprogramming language implementation and to contribute to teaching, in <br>\nSoftware Engineering and other related areas, course coordination and <br>\nstudent supervision.</p>\n<p>This position is located at our picturesque St Lucia campus, renowned as <br>\none of Australia’s most attractive university campuses, and located just <br>\n7km from Brisbane’s city centre. Bounded by the Brisbane River on three <br>\nsides, and with outstanding public transport connections, our <br>\n114-hectare site provides a perfect work environment – you can enjoy the <br>\nbest of both worlds: a vibrant campus with the tradition of an <br>\nestablished university.</p>\n<p><em>Our Ideal Candidate</em></p>\n<p>You should possess a PhD in Computer Science or Software Engineering, or <br>\na related field. You should have significant experience and a successful <br>\nrecord of research achievements in areas including compilers, in <br>\nparticular, their optimization techniques, program analysis, semantics <br>\nof programming languages, formal verification methods in programming, <br>\nand the semantics of programming languages.</p>\n<p>You should also possess a demonstrable capacity for teaching at both the <br>\nundergraduate and postgraduate level, experience in postgraduate <br>\nsupervision and experience liaising with industry and external partners.</p>\n<p>We value diversity and inclusion, and actively encourage applications <br>\nfrom those who bring diversity to the University. Our Diversity and <br>\nInclusion webpage <br>\n&lt;<a href=\"https://staff.uq.edu.au/information-and-services/human-resources/diversity\">https://staff.uq.edu.au/information-and-services/human-resources/diversity</a>&gt; contains <br>\nfurther information if you require additional support. Accessibility <br>\nrequirements and/or adjustments can be directed to <a href=\"mailto:recruitment@uq.edu.au\">recruitment@uq.edu.au</a> <br>\n&lt;mailto:<a href=\"mailto:recruitment@uq.edu.au\">recruitment@uq.edu.au</a>&gt;.</p>\n<p><em>What We Can Offer</em></p>\n<p>This is a full-time continuing position at Academic level C/D. The <br>\nfull-time equivalent base salary will be in the range $117,319 – 135,276 <br>\nfor Level C and $141,261 – 155,627 for Level D plus super of up to 17%.</p>\n<p>For further information see the following link <br>\n&lt;<a href=\"http://search.jobs.uq.edu.au/caw/en/job/508456/senior-lecturer-associate-professor-in-software-engineering\">http://search.jobs.uq.edu.au/caw/en/job/508456/senior-lecturer-associate-professor-in-software-engineering</a>&gt; <br>\n&lt;<a href=\"http://search.jobs.uq.edu.au/caw/en/job/508456/senior-lecturer-associate-professor-in-software-engineering\">http://search.jobs.uq.edu.au/caw/en/job/508456/senior-lecturer-associate-professor-in-software-engineering</a>&gt;</p>",
        "id": 294762887,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661200500
    }
]