[
    {
        "content": "<p>From: \"John F. Hughes\" &lt;<a href=\"mailto:jfh@cs.brown.edu\">jfh@cs.brown.edu</a>&gt;<br>\nTrying to do some high-school-algebra-level stuff, I used \"try\", which<br>\ninvoked csc4, and eventually the Output panel showed this:</p>\n<p>SMT: Invoking SMT solver \"cvc4\" ...<br>\nSMT: Solver:<br>\nSMT: Result:<br>\n       unknown<br>\n       (error \"Cannot get an unsat core unless immediately preceded by<br>\nUNSAT/VALID response.\")<br>\nSMT: Time (ms):<br>\n       22036</p>\n<p>Earlier, I have the following:<br>\nsledgehammer_params[minimize=true,preplay_timeout=10,timeout=60,verbose=true,<br>\n                    provers=\"<br>\n  vampire     cvc4 spass<br>\n      e        z3<br>\n\"]</p>\n<p>declare [[smt_timeout = 120]]</p>\n<p>declare [[smt_trace = true]]<br>\n======<br>\nMy question is whether the \"unknown\" response represents a bug, and if so,<br>\nhow do I report it?<br>\nIf not, can someone tell me what it might actually mean ?</p>\n<p>--John</p>",
        "id": 294821523,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661242365
    },
    {
        "content": "<p>From: Tjark Weber &lt;<a href=\"mailto:tjark.weber@it.uu.se\">tjark.weber@it.uu.se</a>&gt;<br>\nJohn,</p>\n<p>This is (generally speaking) not a bug. It means that CVC4 was unable<br>\nto find either a proof or a counterexample for your particular proof<br>\ngoal, and gave up.</p>\n<p>This can happen for different reasons. It is rarely worthwhile to<br>\ninvestigate further -- in practice it means that CVC4 didn't give a<br>\nhelpful answer, and you'll have to try something else (e.g., other<br>\nsolvers, or finding an interactive proof).</p>\n<p>Best,<br>\nTjark</p>\n<p>När du har kontakt med oss på Uppsala universitet med e-post så innebär det att vi behandlar dina personuppgifter. För att läsa mer om hur vi gör det kan du läsa här: <a href=\"http://www.uu.se/om-uu/dataskydd-personuppgifter/\">http://www.uu.se/om-uu/dataskydd-personuppgifter/</a></p>\n<p>E-mailing Uppsala University means that we will process your personal data. For more information on how this is performed, please read here: <a href=\"http://www.uu.se/en/about-uu/data-protection-policy\">http://www.uu.se/en/about-uu/data-protection-policy</a></p>",
        "id": 294821608,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661242408
    },
    {
        "content": "<p>From: \"Fernandez, Matthew\" &lt;<a href=\"mailto:matthew.fernandez@intel.com\">matthew.fernandez@intel.com</a>&gt;<br>\nHi John,</p>\n<p>No, \"unknown\" is not a bug. The SMT solver can return one of \"sat\", \"unsat\", or \"unknown\". The \"unknown\" response means the solver was not able to find a satisfying assignment for the problem it received, nor was it able to prove no such assignment exists. This can happen if some part of the problem was outside its supported feature set or if some resource (runtime, memory, ...) was exhausted.</p>\n<p>The follow on error message is directly from CVC4. Without knowledge of the internals of \"try\", I'm guessing Isabelle constructs an SMT problem that does \"(check-sat)\" followed by an unconditional \"(get-unsat-core)\" so it doesn't have to call the solver multiple times or manage an interactive session. In the case of \"unknown\", there is no unsat core so this command fails. I would say the behavior you're seeing is to be expected.</p>\n<p>Thanks,<br>\nMatt</p>",
        "id": 294821636,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661242422
    }
]