[
    {
        "content": "<p>From: <a href=\"mailto:Ian.Horrocks@comlab.ox.ac.uk\">Ian.Horrocks@comlab.ox.ac.uk</a><br>\nOXFORD UNIVERSITY COMPUTING LABORATORY</p>\n<p>Research Assistant Post (Grade 7)</p>\n<p>Project: HermiT: Reasoning with Large Ontologies</p>\n<p>The Computing Laboratory has a vacancy for a postdoctoral research assistant to work in the area of logic based knowledge representation and reasoning. The post is funded by EPSRC as part of the HermiT project, and is available immediately until May 2011. The objectives of the project are to develop reasoning services that will allow for the successful application of ontology technologies in large scale applications. More information about the project can be found at [1].</p>\n<p>The successful candidate will join an internationally renowned research group [2] working on a cutting edge research problem in an attractive and stimulating environment within one of the worlds leading universities and computer science departments [3]; they will be expected to contribute to all aspects of the group's activities, including publishing at and attending international conferences and workshops. The post is available immediately and is a fixed term appointment until May 2011. It will have a salary on the University grade 7 scale (currently 28,839 to 35,469 pa [check]); includes membership of USS; will have an annual leave entitlement of 38 days per year (inclusive of all public holidays and university closed periods).</p>\n<p>Further details of the posts, including the selection criteria and method of application are available from . Prospective candidates are also welcome to contact Dr Boris Motik (<a href=\"mailto:boris.motik@comlab.ox.ac.uk\">boris.motik@comlab.ox.ac.uk</a>) or Prof Ian Horrocks (<a href=\"mailto:ian.horrocks@comlab.ox.ac.uk\">ian.horrocks@comlab.ox.ac.uk</a>) for further information about the project and/or the post.</p>\n<p>The closing date for applications is Tuesday 20th January 2009.</p>\n<p>Oxford University is and Equal Opportunities Employer.</p>\n<p>[1] <a href=\"http://web.comlab.ox.ac.uk/projects/HermiT/index.html\">http://web.comlab.ox.ac.uk/projects/HermiT/index.html</a><br>\n[2] <a href=\"http://web.comlab.ox.ac.uk/activities/knowledge/index.html\">http://web.comlab.ox.ac.uk/activities/knowledge/index.html</a><br>\n[3] <a href=\"http://web.comlab.ox.ac.uk/\">http://web.comlab.ox.ac.uk/</a><br>\n[4] <a href=\"http://web.comlab.ox.ac.uk/news/59-full.html\">http://web.comlab.ox.ac.uk/news/59-full.html</a></p>",
        "id": 294069175,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660826573
    }
]