[
    {
        "content": "<p>From: Michael Norrish &lt;<a href=\"mailto:Michael.Norrish@nicta.com.au\">Michael.Norrish@nicta.com.au</a>&gt;<br>\n[<br>\n  NOTE: We have delayed our abstract submission dates by a few days to<br>\n  bring ourselves into line with our co-conference, APLAS.</p>\n<p>Abstract submission: Monday, 10 June<br>\n  Final submission:    Friday, 14 June</p>\n<p>Come to sunny Australia in December to escape the northern winter!<br>\n]</p>\n<p>CALL FOR PAPERS<br>\n===============</p>\n<p>3rd International Conference on Certified Programs and Proofs (CPP2013)</p>\n<hr>\n<p>December 2013, Australia (co-located with APLAS 2013)</p>\n<p>CPP is an international forum on theoretical and practical topics in all<br>\nareas, including computer science, mathematics, and education, that<br>\nconsider certification as an essential paradigm for their work.<br>\nCertification here means formal, mechanized verification of some sort,<br>\npreferably with production of independently checkable certificates. We<br>\ninvite submissions on topics that fit under this rubric.</p>\n<p>The first two CPP conferences were held in Kenting, Taiwan, and Kyoto,<br>\nJapan, in December 2011 and 2012, respectively. As with the first<br>\nmeetings, the proceedings will be published in Springer-Verlag’s Lecture<br>\nNotes in Computer Science series.</p>\n<p>Suggested, but not exclusive, specific topics of interest for<br>\nsubmissions include: certified or certifying programming, compilation,<br>\nlinking, OS kernels, runtime systems, and security monitors; program<br>\nlogics, type systems, and semantics for certified code; certified<br>\ndecision procedures, mathematical libraries, and mathematical theorems;<br>\nproof assistants and proof theory; new languages and tools for certified<br>\nprogramming; program analysis, program verification, and proof-carrying<br>\ncode; certified secure protocols and transactions; certificates for<br>\ndecision procedures, including linear algebra, polynomial systems, SAT,<br>\nSMT, and unification in algebras of interest; certificates for<br>\nsemi-decision procedures, including equality, first-order logic, and<br>\nhigher-order unification; certificates for program termination; logics<br>\nfor certifying concurrent and distributed programs; higher-order logics,<br>\nlogical systems, separation logics, and logics for security; teaching<br>\nmathematics and computer science with proof assistants; and “Proof<br>\nPearls” (elegant, concise, and instructive examples).</p>\n<p>Important Dates:<br>\n++++++++++++++++</p>\n<p>Authors are required to submit a paper title and a short abstract before<br>\nsubmitting the full paper. The submission should include when necessary<br>\na URL where to find the formal development assessing the essential<br>\naspects of the work.  All submissions will be electronic. All deadlines<br>\nare at midnight (GMT).</p>\n<p>============================    ==========================<br>\n<strong>Abstract Deadline:</strong>          Monday, June 10, 2013<br>\n<strong>Submission Deadline:</strong>        Friday, June 14, 2013<br>\n<strong>Author Notification:</strong>        Monday, August 26, 2013<br>\n<strong>Camera-ready Papers Due:</strong>    Monday, September 16, 2013<br>\n============================    ==========================</p>\n<p>Submission Instructions:<br>\n++++++++++++++++++++++++</p>\n<p>Papers should be submitted electronically online via the conference<br>\nsubmission web page at URL:</p>\n<p><a href=\"http://www.easychair.org/conferences/?conf=cpp2013\">http://www.easychair.org/conferences/?conf=cpp2013</a></p>\n<p>Acceptable formats are PostScript or PDF, viewable by Ghostview or<br>\nAcrobat Reader. Submissions should not exceed 16 pages in LNCS format,<br>\nincluding bibliography and figures.  Submitted papers will be judged on<br>\nthe basis of significance, relevance, correctness, originality, and<br>\nclarity. They should clearly identify what has been accomplished and why<br>\nit is significant. The proceedings of the symposium will be published as<br>\na volume in Springer-Verlag’s Lecture Notes in Computer Science series.<br>\nSubmission instructions including LaTeX style files are available from<br>\nthe CPP 2013 website.</p>\n<p>Each submission must be written in English and provide sufficient detail<br>\nto allow the program committee to assess the merits of the paper.  It<br>\nshould begin with a succinct statement of the issues, a summary of the<br>\nmain results, and a brief explanation of their significance and<br>\nrelevance to the conference, all phrased for the non-specialist.<br>\nTechnical and formal developments directed to the specialist should<br>\nfollow.  Whenever appropriate, the submission should come along with a<br>\nformal development, using whatever prover, e.g., Agda, Coq, Elf, HOL,<br>\nHOL-Light, Isabelle, Matita, Mizar, NQTHM, PVS, Vampire, etc. References<br>\nand comparisons with related work should be included.  *Papers not<br>\nconforming to the above requirements concerning format and length may be<br>\nrejected without further consideration.*</p>\n<p>The results must be unpublished and not submitted for publication<br>\nelsewhere, including the proceedings of other published conferences or<br>\nworkshops.  The PC chairs should be informed of closely related work<br>\nsubmitted to a conference or journal in advance of submission. Original<br>\nformal proofs of known results in mathematics or computer science are<br>\namong the targets.  One author of each accepted paper is expected to<br>\npresent it at the conference.</p>\n<p>Organisation<br>\n++++++++++++</p>\n<p>:Program Co-Chairs:<br>\n  Georges Gonthier (Microsoft Research Cambridge) &amp;<br>\n  Michael Norrish (NICTA)</p>\n<p>:General Chair:<br>\n  Peter Schachte, <em>University of Melbourne</em></p>\n<p>:Website:<br>\n<a href=\"http://cpp2013.forge.nicta.com.au\">http://cpp2013.forge.nicta.com.au</a></p>\n<p>Program Committee<br>\n^^^^^^^^^^^^^^^^^</p>\n<p>=========================   =======================================<br>\nDerek Dreyer                 MPI-SWS<br>\nWilliam Farmer               McMaster University<br>\nJean-Christophe Filliâtre    INRIA<br>\nCédric Fournet               Microsoft Research Cambridge<br>\nBenjamin Grégoire            INRIA<br>\nReiner Hähnle                Technische Universität Darmstadt<br>\nAquinas Hobor                National University of Singapore<br>\nGyesik Lee                   Hankyong National University<br>\nCesar Muñoz                  NASA Langley<br>\nToby Murray                  NICTA<br>\nGopalan Nadathur             University of Minnesota<br>\nClaudio Sacerdoti Coen       University of Bologna<br>\nPeter Sewell                 University of Cambridge<br>\nBas Spitters                 University of Nijmegen<br>\nGang Tan                     Lehigh University<br>\nAlwen Tiu                    Australian National University<br>\nYih-Kuen Tsay                National Taiwan University<br>\nLihong Zhi                   Academia Sinica<br>\n=========================   =======================================<br>\n<a href=\"/user_uploads/14278/WIqyb9hmnv81BCiF-fqhiI_S/signature.asc\">signature.asc</a></p>",
        "id": 294242761,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660907674
    }
]