[
    {
        "content": "<p>From: Ken Kubota &lt;<a href=\"mailto:mail@kenkubota.de\">mail@kenkubota.de</a>&gt;<br>\nThe following two papers might be useful:</p>\n<p>From Types to Sets in Isabelle/HOL<br>\n<a href=\"https://www21.in.tum.de/~kuncar/documents/kuncar-popescu-itp2014.pdf\">https://www21.in.tum.de/~kuncar/documents/kuncar-popescu-itp2014.pdf</a></p>\n<p>From Types to Sets by Local Type Definitions in Higher-Order Logic<br>\n<a href=\"http://andreipopescu.uk/pdf/fromTypesToSetsITP2016.pdf\">http://andreipopescu.uk/pdf/fromTypesToSetsITP2016.pdf</a></p>\n<p>In particular, page 2 of the second paper is of interest:</p>\n<p>\"On the downside, type-based theorems are less flexible, and therefore unsuitable for some developments. Indeed, when working with mathematical structures, it is often the case that they have the desired property only on a proper subset of the whole type.\"</p>\n<p>\"An additional nuance to this situation is specific to Isabelle/HOL, which allows users to annotate types with Haskell-like type-class constraints. This provides a further level of implicit reasoning.\"</p>\n<p>Independently I had developed a similar mechanism in R0 in order to overcome the inflexibility mentioned above:</p>\n<p>\"Whenever a theorem of the form p_(oα)e_α is inferred, meaning that a mathematical entity (or object, element) e of any type α has property p (which in set theory is expressed by e ∈ p) [...] the new type p is attached to the entity (e_p) [...]\".<br>\n<a href=\"http://www.owlofminerva.net/files/formulae.pdf\">http://www.owlofminerva.net/files/formulae.pdf</a> (p. 11)</p>\n<p>This provides a mechanism to introduce types from (sub)sets (of other types), and also provides the level of implicit reasoning mentioned above by coding the constraints directly within the new type (as part of the type definition).</p>\n<p>Kind regards,</p>\n<p>Ken Kubota</p>\n<hr>\n<p>Ken Kubota<br>\n<a href=\"http://doi.org/10.4444/100\">http://doi.org/10.4444/100</a></p>",
        "id": 294748989,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661194679
    }
]