[
    {
        "content": "<p>From: \"Aaron W. Hsu\" &lt;<a href=\"mailto:arcfide@sacrideo.us\">arcfide@sacrideo.us</a>&gt;<br>\nI am trying to examine the possibility of using some different fonts with  <br>\njEdit in Isabelle. My normal 5.0 version of jEdit with my Java runtime  <br>\nworks fine to give me certain fonts (FreeFont, OTF, in particular), and I  <br>\nhave checked that it has the glyphs that I care about, but for some  <br>\nreason, the Isabelle/jEdit instance is not giving me those fonts as an  <br>\noption. Is there some way to get this? Is it just that it is running with  <br>\na different JVM version, or is it something in the way jEdit is combined  <br>\nwith Isabelle, or something else entirely?</p>",
        "id": 294224752,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660899390
    },
    {
        "content": "<p>From: Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt;<br>\nThe easiest way to make OTF fonts work with the classic JVM 1.6 that is <br>\nbundled with Isabelle2012 is to use fontforge to convert to TTF, and place <br>\nthe results in ~/.fonts/ in the usual way. You should then load <br>\nIsabelle2012/etc/symbols with the UTF8-isabelle encoding to see if <br>\neverything works out.</p>\n<p>Generally, arbitrary selections of Linux packages with a substring \"jdk\" <br>\nor \"jedit\" or \"scala\" in the name won't work together by default to host <br>\nIsabelle/jEdit adequately.  OpenJDK 1.6 is not worth trying -- I gave up <br>\non it 1-2 years ago.  OpenJDK 1.7 is a bit better, but not quite there <br>\nyet, and Isabelle2012 requires 1.6 anyway.</p>\n<p>It is one of the big advantages of Isabelle/jEdit that it is not at the <br>\nmercy of accidental packages found on the user's system, unlike Proof <br>\nGeneral with its constant worries about Emacs varieties.</p>\n<p>What is your \"normal 5.0 version of jEdit\" exactly?  I've been testing <br>\n5.0pre1 myself several weeks, until I had to revert to stable 4.5.2 due to <br>\nI/O dropouts on Linux with the 5.0 testing branch.  The jEdit maintainers <br>\nseem to be lagging behind their original release plans for 5.0 for several <br>\nweeks.  Although that is not really relevant for Isabelle/jEdit, since it <br>\ncomes with its statically bundled jEdit 4.5.1 distribution, a version that <br>\nhas been tested a lot.  (It is also slightly patched to make advanced text <br>\nrendering work in the first place, see also <br>\n<a href=\"http://isabelle.in.tum.de/repos/isabelle/file/Isabelle2012/src/Tools/jEdit/patches/jedit-4.5.1\">http://isabelle.in.tum.de/repos/isabelle/file/Isabelle2012/src/Tools/jEdit/patches/jedit-4.5.1</a></p>\n<p>Makarius</p>",
        "id": 294224756,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660899394
    }
]