[
    {
        "content": "<p>From: Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt;<br>\nI am answering this on isabelle-users, because you merely want to know how <br>\nto use public Isabelle/Scala programming interfaces of in a public release <br>\n(Isabelle2013), and not argue about the ongoing development process <br>\nbetween the releases.</p>\n<p>BTW, this is a continuation of the<br>\nthread <br>\n<a href=\"https://lists.cam.ac.uk/mailman/htdig/cl-isabelle-users/2012-February/msg00067.html\">https://lists.cam.ac.uk/mailman/htdig/cl-isabelle-users/2012-February/msg00067.html</a></p>\n<p>Back to your question.  <a href=\"https://bitbucket.org/pide/pide_examples\">https://bitbucket.org/pide/pide_examples</a> version <br>\n212919b16b3a is now updated to Isabelle2013.  It was interesting to see <br>\nmyself, how certain functions to manage Isabelle sessions have evolved <br>\nsince Isabelle2012.</p>\n<p>Session.update is now the main operation to feed edits into the prover, <br>\nbut there were more changes concerning Thy_Load etc.</p>\n<p>What is notable is the isabelle.Build module of Isabelle/Scala to manage <br>\nIsabelle sessions \"offline\", without starting a prover process yet; e.g. <br>\nyou can get hold of the all-important outer syntax that is required for <br>\nediting operations.  The internal protocols for this have changed <br>\nsubstantially, but they were never public in the first place.</p>\n<p>The \"isabelle build\" shell wrapper is merely some old-fashioned bash <br>\naccess to the rich functionality of isabelle.Build.  Both are equal in <br>\nbeing user-space tools to work with Isabelle systematically -- it does not <br>\nmake sense to say bash is user-space and Scala not.  (Bash is actually <br>\nquite far removed for Isabelle users on Windows, so it will gradually be <br>\nde-emphasized in favour of Isabelle/Scala, also with some GUI wrappers.)</p>\n<p>Makarius</p>",
        "id": 294236017,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660904795
    }
]