[
    {
        "content": "<p>From: Florin Craciun &lt;<a href=\"mailto:craciunf@googlemail.com\">craciunf@googlemail.com</a>&gt;<br>\nSCHOOL OF COMPUTING<br>\n University of Teesside</p>\n<p>Fully Funded University Ph.D. Studentship (3 years)<br>\n Ref: QinFeb12</p>\n<p>Applications are invited for a Ph.D. student to work in the research area<br>\n of formal methods and software verification under the supervision of<br>\n Professor Shengchao Qin in the School of Computing in Teesside University.<br>\n Prof. Qin is affiliated with the Teesside Formal Methods and Programming<br>\n Research Group (TFMPRG) and has been supervising a number of research<br>\n associate and Ph.D students.</p>\n<p>Prospective candidates must have (or expect to have) at least a good<br>\n honours degree in Computer Science or closely related subjects at grade<br>\n 2:1 or equivalent or higher. The studentship requires good background<br>\n knowledge in most of the following areas: logic and discrete mathematics<br>\n related to computer science, compilers, program analysis and software<br>\n verification. Strong programming skills will also be essential for the<br>\n studentship.</p>\n<p>This fully funded studentship provides a tax-free living allowance at the<br>\n standard rate (£13,590 p.a. for 2011/12) and full student tuition fees for<br>\n three years. The successful candidate is expected to start on October 1<br>\n 2012.</p>\n<p>More information can be obtained by contacting Prof. Shengchao Qin at<br>\n<a href=\"mailto:s.qin@tees.ac.uk\">s.qin@tees.ac.uk</a>, or by visiting <a href=\"http://www.scm.tees.ac.uk/s.qin\">http://www.scm.tees.ac.uk/s.qin</a>.</p>\n<p>For an application form, applicants should contact<br>\n<a href=\"mailto:graduateresearchschool@tees.ac.uk\">graduateresearchschool@tees.ac.uk</a>.<br>\n Applicants are expected to return their application form plus a CV, a<br>\n research proposal, their degree certificates and academic transcripts by<br>\n the following deadline (to <a href=\"mailto:graduateresearchschool@tees.ac.uk\">graduateresearchschool@tees.ac.uk</a> and copy to<br>\n Professor Qin):</p>\n<p>Deadline for application:  8 March 2012. The selection process will start<br>\n shortly after the deadline and be completed in March.</p>",
        "id": 294152047,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660849671
    }
]