[
    {
        "content": "<p>From: \"O'Leary, John W\" &lt;<a href=\"mailto:john.w.oleary@intel.com\">john.w.oleary@intel.com</a>&gt;</p>\n<hr>\n<p>ITP2019: Interactive Theorem Proving, Tenth International Conference<br>\nSeptember 8-13 2019, Portland, OR, USA<br>\n<a href=\"http://itp19.cecs.pdx.edu\">http://itp19.cecs.pdx.edu</a><br>\n<a href=\"mailto:itp19@cecs.pdx.edu\">itp19@cecs.pdx.edu</a></p>\n<hr>\n<p>CALL FOR WORKSHOPS</p>\n<p>The ITP conference series is concerned with all topics related to<br>\ninteractive theorem proving, ranging from theoretical foundations to<br>\nimplementation aspects and applications in system verification,<br>\nsecurity, and formalization of mathematics. The tenth ITP conference,<br>\nITP 2019, will be held at Portland State University between September<br>\n8 and 13, 2019.</p>\n<p>Researchers and practitioners are invited to submit proposals for<br>\nco-located workshops on topics relating to interactive theorem<br>\nproving. Workshops can target the ITP community in general, focus on a<br>\nparticular ITP system, or highlight more specific issues or recent<br>\ndevelopments. Proposals for in-depth tutorials or tool introductions<br>\nare also welcome.</p>\n<p>Co-located events will take place on 8 September and 13 September and<br>\nwill be held on the same premises as the main conference. Conference<br>\nfacilities are offered free of charge to the organizers. Workshop-only<br>\nattendees will enjoy a significantly reduced registration fee.</p>\n<p>Detailed organizational matters such as paper submission and review<br>\nprocess, or publication of proceedings, are up to the organizers of<br>\nindividual workshops. All accepted workshops will be expected to have<br>\ntheir program ready by 22 July 2019.</p>\n<p>Proposals for workshops should contain at least the following pieces<br>\nof information:</p>\n<ul>\n<li>name and contact details of the main organizer(s)</li>\n<li>(if applicable:) names of additional organizers</li>\n<li>\n<p>title and organizational style of workshop (tutorial, public<br>\n  workshop, project workshop, etc.)</p>\n</li>\n<li>\n<p>preferred length of workshop (half day or full day)</p>\n</li>\n<li>estimated number of attendees</li>\n<li>short (up to one page) description of topic</li>\n<li>(if applicable:) pointers to previous editions of the workshop, or<br>\n  to similar events</li>\n</ul>\n<p>Proposals should be submitted by email to <a href=\"mailto:itp19@cecs.pdx.edu\">itp19@cecs.pdx.edu</a>, no later<br>\nthan 21 December 2018. Selected workshops will be notified by 23<br>\nDecember 2018. The workshop selection committee consists of the ITP<br>\nprogram chairs and organizers:</p>\n<p>John O'Leary, Intel Corporation<br>\nAndrew Tolmach, Portland State University<br>\nJohn Harrison, Amazon AWS</p>",
        "id": 294747988,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661194306
    }
]