[
    {
        "content": "<p>From: mantel &lt;<a href=\"mailto:mantel@mais.informatik.tu-darmstadt.de\">mantel@mais.informatik.tu-darmstadt.de</a>&gt;<br>\nPositions for PhD Students and PostDocs</p>\n<p>The Chair for Modeling and Analysis of Information Systems (MAIS) led<br>\nby Prof. Dr. Heiko Mantel is currently looking for PhD students and<br>\nPostDocs who are interested in software security, program analysis,<br>\nverification, or foundations of software engineering.  In particular,<br>\nthe following areas are in our current research focus:</p>\n<p>o static program analysis (type systems, verification, tools)</p>\n<p>o runtime verification (monitoring concepts for security)</p>\n<p>o foundations of information security (information flow security,<br>\n  security models, security engineering, covert channel analysis)</p>\n<p>o foundations of stepwise software development (abstraction,<br>\n  composition, refinement, model-based development, secure coding)</p>\n<p>Our activities include the advancement of theoretical foundations, the<br>\ndevelopment of methods and tools, and the application of our ideas in<br>\npractice.  Our overall goal is to contribute to making software-based<br>\nsystems more trustworthy (correct, safe, and secure) than today.</p>\n<p>The MAIS group provides a productive research environment, in which<br>\nyou could discuss ideas and collaborate with motivated colleagues who<br>\nare working on related topics.  Our international connections as well<br>\nas our involvement in interesting research projects (including the<br>\nCenter for Advanced Security Research Darmstadt) provide further<br>\nopportunities for inspiration and collaborations. For PostDocs, there<br>\nmight be a later opportunity to renew the position or to continue as<br>\nsenior researcher.</p>\n<p>All of our research projects require a solid background in mathematics<br>\n(logic and algebra) or in formal methods.  A background in information<br>\nsecurity will be helpful, but is not required.  PhD students should<br>\nhave completed a Diploma or Masters program in Computer Science or in<br>\nMathematics before starting.  PostDocs should have completed their PhD<br>\nthesis.  Prior knowledge in any of the following areas is a plus:</p>\n<p>o automated theorem proving, model checking, and SAT solving,</p>\n<p>o formal methods and logic in Computer Science,</p>\n<p>o information security, </p>\n<p>o model-based software development and tools, and</p>\n<p>o program analysis and semantics of programming languages.</p>\n<p>Payment will be according to Bundesangestelltentarifvertrag (BAT<br>\nIIa/Ib).</p>\n<p>If you are interested in a position as PhD student or PostDoc, please<br>\nsend your application (preferably on paper) including</p>\n<p>o your detailed CV (including language skills in English and German)</p>\n<p>o complete educational transcripts with grades and degrees (copies,<br>\n    no originals),</p>\n<p>o description of your background and your research interests,</p>\n<p>o and, if possible, the contact information of one or two references<br>\n    (researchers who are willing to write a reference letter for you)</p>\n<p>to </p>\n<p>Prof. Dr. Heiko Mantel<br>\n  TU Darmstadt<br>\n  Department of Computer Science<br>\n  Modeling and Analysis of Information Systems (MAIS) <br>\n  Hochschulstrasse 10<br>\n  D-64289 Darmstadt<br>\n  Germany.  </p>\n<p>If you have questions about the position, please contact us via<br>\ne-mail (<a href=\"mailto:mantel@cs.tu-darmstadt.de\">mantel@cs.tu-darmstadt.de</a>).</p>\n<p>The TU Darmstadt aims at increasing the number of female members of<br>\nstaff.  We strongly encourage qualified women to apply. Disabled<br>\ncandidates will be preferentially treated if equally qualified.</p>",
        "id": 294076468,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660829089
    }
]