[
    {
        "content": "<p>From: Kristin Yvonne Rozier &lt;<a href=\"mailto:Kristin.Y.Rozier@nasa.gov\">Kristin.Y.Rozier@nasa.gov</a>&gt;<br>\nWe apologize if you receive multiple copies of this email.<br>\nSee below on how to be removed from our mailing list.</p>\n<hr>\n<p>NASA Langley/NIA Formal Methods Team invites you to submit an abstract<br>\nand/or register to attend:</p>\n<p>The Sixth NASA Langley Formal Methods Workshop<br>\n                       LFM 2008<br>\n<a href=\"http://shemesh.larc.nasa.gov/LFM2008/LFM2008.html\">http://shemesh.larc.nasa.gov/LFM2008/LFM2008.html</a></p>\n<p>April 30 - May 2, 2008<br>\n                Newport News, Virginia</p>\n<hr>\n<p>Important Deadlines:</p>\n<hr>\n<p>Abstract Submissions for Contributed Talks: March 1, 2008<br>\nAcceptance: March 15, 2008<br>\nRegistration: April 15, 2008</p>\n<hr>\n<p>Theme of Conference:</p>\n<hr>\n<p>Safety critical systems represent an ever-increasing problem domain,<br>\nchallenging verification techniques to catch up. Within the field of<br>\naeronautics alone, we find the need for verification of algorithms for<br>\nseparation assurance, air traffic control, auto-pilot, Unmanned Aerial<br>\nVehicles (UAVs), adaptive avionics, automated decision authority, and<br>\nmuch more. Recent advances in formal methods have made verifying more of<br>\nthese problems realistic. Thus we need to continually re-assess what we<br>\ncan solve now and identify the next barriers to overcome. Only through<br>\nan exchange of ideas between theoreticians and practitioners from<br>\nacademia to industry can we extend formal methods for the verification<br>\nof ever more challenging problem domains.</p>\n<p>The goal of this workshop on formal methods for verification is to<br>\nexamine formal verification techniques, their theory, application areas,<br>\ncurrent capabilities, and limitations. This format is designed to<br>\nintroduce researchers, graduate students, and partners in industry to<br>\nthose topics that are of fundamental interest and importance, to survey<br>\ncurrent research, and to discuss major unsolved problems and directions<br>\nfor future research.</p>\n<p>The meeting will be comprised of invited talks covering the major<br>\nresearch areas, and more specialized contributed talks, including<br>\nstudent talks. Contributed talks will consist of 30-minute research<br>\nexpositions providing state-of-the-art information on recent<br>\ndevelopments related to formal methods, and a number of 15-minute talks<br>\non current research given by undergraduate and graduate students.</p>\n<hr>\n<p>Topics of Interest:</p>\n<hr>\n<p>Topics of interest include but are not limited to the following:</p>\n<p>* advances in formal verification techniques<br>\n    * formal models of distributed computing<br>\n    * planning and scheduling<br>\n    * automated air traffic management<br>\n    * fault tolerance<br>\n    * hybrid systems/hybrid automata<br>\n    * embedded systems<br>\n    * safety critical applications<br>\n    * safety cases<br>\n    * accident/safety analysis</p>\n<hr>\n<p>Invited Tutorials:</p>\n<hr>\n<p>* Gerard J. Holzmann (NASA JPL) - On Limits<br>\n    * John Rushby (SRI) - Formal Methods and Certification<br>\n    * Moshe Y. Vardi (Rice University) - From Philosophical to<br>\nIndustrial Logics</p>\n<hr>\n<p>Submissions:</p>\n<hr>\n<p>There are two categories of submissions:</p>\n<p>* Regular Talks. These talks will be 30 minutes in length, including<br>\nquestions.</p>\n<p>* Student Talks. These talks will be 15 minutes in length, including<br>\nquestions.</p>\n<p>Both categories of talks will be selected from the abstracts submitted<br>\nto the LFM 2008 web site.</p>\n<hr>\n<p>Location and Cost:</p>\n<hr>\n<p>The workshop will take place at the Marriott Hotel, City Center at<br>\nOyster Point, Newport News, Virginia, USA. Information on hotel block<br>\nreservations and travel are located on the LFM 2008 web site. Note that<br>\nhotel reservations at the special block rate must be made on or before<br>\n30 March 2008.</p>\n<p>There will be no registration fee charged to participants. All<br>\ninterested individuals, including non-US citizens, are welcome to<br>\nattend, to listen to the talks, and to participate in discussions.<br>\nHowever, all attendees must register. We especially encourage students<br>\nand other researchers possibly interested in specializing in formal<br>\nmethods to attend as this will be a good opportunity to become more<br>\nknowledgeable about this area of research.</p>\n<p>Please visit the official LFM 2008 web site for further information:<br>\n<a href=\"http://shemesh.larc.nasa.gov/LFM2008/LFM2008.html\">http://shemesh.larc.nasa.gov/LFM2008/LFM2008.html</a>.</p>\n<p>Cheers,<br>\nKristin Yvonne Rozier<br>\nLFM 2008 General Chair</p>\n<hr>\n<p>We apologize if you receive multiple copies of this email.<br>\nIf you do not want any further announcements regarding LFM 2008, please<br>\nsend a message to <a href=\"mailto:Kristin.Y.Rozier@nasa.gov\">Kristin.Y.Rozier@nasa.gov</a> with 'UNSUBSCRIBE' as the<br>\nsubject.</p>",
        "id": 294055778,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660821517
    }
]