[
    {
        "content": "<p>From: \"Aaron W. Hsu\" &lt;<a href=\"mailto:arcfide@sacrideo.us\">arcfide@sacrideo.us</a>&gt;<br>\nWhat is the best approach for verifying the correctness of C programs in <br>\nIsabelle? I see that some people have done some work on this already, but <br>\nis there a current best approach?  This is for a virtual machine/assembly <br>\nlanguage that is implemented in C and will be used as the target language <br>\nfor a compiler that will need to be verified in Isabelle as well.  I <br>\nwould like to verify the implementation of the virtual machine.</p>",
        "id": 294163032,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660853869
    },
    {
        "content": "<p>From: \"C. Diekmann\" &lt;<a href=\"mailto:diekmann@in.tum.de\">diekmann@in.tum.de</a>&gt;<br>\nMaybe this mail is helpful:</p>",
        "id": 294163304,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660854008
    },
    {
        "content": "<p>From: Gerwin Klein &lt;<a href=\"mailto:gerwin.klein@nicta.com.au\">gerwin.klein@nicta.com.au</a>&gt;<br>\nMaybe a bit more background on that:</p>\n<p>Our C-Parser at <a href=\"http://www.ertos.nicta.com.au/software/c-parser/\">http://www.ertos.nicta.com.au/software/c-parser/</a> will translate a large subset of C into the Isabelle/Simpl language,  which comes with various semantics formalisations, verification condition generator, etc.</p>\n<p>The version on the website above runs on Isabelle2009-1, we should be able to release the Isabelle2011-1 version shortly, and we're working on the Isabelle2012 update.</p>\n<p>The Simpl language is described in Norbert Schirmer's PhD thesis. The C memory model in Harvey Tuch's thesis and a few papers from our web site.</p>\n<p>Although the language subset and tool chain are quite powerful and have been applied to large verifications, it is not a very polished tool set at moment, definitely more on the research software side. We'd be happy to help with questions, though.</p>\n<p>Cheers,<br>\nGerwin</p>",
        "id": 294163321,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660854018
    }
]