[
    {
        "content": "<p>From: Lawrence Paulson &lt;<a href=\"mailto:lp15@cam.ac.uk\">lp15@cam.ac.uk</a>&gt;<br>\nAnnouncement and Call for Papers</p>\n<p>Workshop on Natural Formal Mathematics (NFM 2020)</p>\n<p>A workshop held between July 27 - 31, 2020 as part of the<br>\n13th Conference on Intelligent Computer Mathematics (CICM 2020)<br>\n(ONLINE; details to be announced on the CICM website<br>\n<a href=\"https://cicm-conference.org/2020/cicm.php\">https://cicm-conference.org/2020/cicm.php</a>)</p>\n<p>In (pure) mathematics there has always existed a strong informal sense of \"naturality\". \"Natural\" theories, notions, properties, or proofs are prefered over technical, convoluted, or counterintuitive approaches. If formal mathematics is to become part of mainstream mathematics, its formalizations and user experience have to become more \"natural\". This workshop broadly addresses the issue of naturality in formal mathematics.</p>\n<p>Topics of interest include (but are not limited to):</p>\n<p>The notion of naturality in mathematics generally<br>\n    Natural input and output languages for formal mathematics systems<br>\n    Parsing natural mathematical language<br>\n    Controlled natural languages (CNL) for mathematics<br>\n    Making formal mathematics documents readable<br>\n    Naturality of foundational theories (types, sets, HOL, ...)<br>\n    Naturality of proof methods<br>\n    Natural proof structures and granularities<br>\n    Natural structurings of formalized mathematical texts and libraries<br>\n    Mathematical type setting (LaTeX) and formal mathematics<br>\n    Examples of natural formalizations</p>\n<p>Invited speaker: tba</p>\n<p>Submissions: We call for submissions of extended abstracts and demonstration proposals presenting work related to the workshop's topics of interest. To promote Natural Formal Mathematics unfinished or exploratory work will also be welcome. Electronic submission is done through EasyChair. Extended abstracts and demonstration proposals should be 1 page, formatted in LaTeX using the style onecolceurws.</p>\n<p>Submission deadline: June 15 2020<br>\n    Notification of acceptance: July 01 2020</p>\n<p>Accepted papers and demonstrations should be presented online and live, to allow for questions and discussions. Abstracts will be made available online.</p>\n<p>Program Committee</p>\n<p>Florian Rabe, Erlangen (co-chair)<br>\n    Peter Koepke, Bonn (co-chair)<br>\n    Merlin Carl, Flensburg<br>\n    Marcos Cramer, Dresden<br>\n    Adam Grabowski, Bialystok<br>\n    Michael Junk, Konstanz<br>\n    Cezary Kaliszyk, Innsbruck<br>\n    Andrea Kohlhase, Neu-Ulm<br>\n    Aarne Ranta, Gothenburg<br>\n    Josef Urban, Prague</p>",
        "id": 294829121,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661245780
    }
]