[
    {
        "content": "<p>From: \"Thiemann, René\" &lt;<a href=\"mailto:Rene.Thiemann@uibk.ac.at\">Rene.Thiemann@uibk.ac.at</a>&gt;<br>\nDear all,</p>\n<p>there are new results in the AFP about prime counting.</p>\n<p>The Prime Number Theorem<br>\n  by Manuel Eberl and Lawrence C. Paulson</p>\n<p>This article provides a short proof of the Prime Number Theorem in several<br>\nequivalent forms, most notably π(x) ~ x/ln x where π(x) is the number of primes<br>\nno larger than x. It also defines other basic number-theoretic functions related<br>\nto primes like Chebyshev's functions ϑ and ψ and the “n-th prime number”<br>\nfunction pn. We also show various bounds and relationship between these<br>\nfunctions are shown. Lastly, we derive Mertens' First and Second Theorem, i. e.<br>\n∑p≤x ln p/p = ln x + O(1) and ∑p≤x 1/p = ln ln x + M + O(1/ln x). We also give<br>\nexplicit bounds for the remainder terms.</p>\n<p>The proof of the Prime Number Theorem builds on a library of Dirichlet series<br>\nand analytic combinatorics. We essentially follow the presentation by Newman.<br>\nThe core part of the proof is a Tauberian theorem for Dirichlet series, which is<br>\nproven using complex analysis and then used to strengthen Mertens' First Theorem<br>\nto ∑p≤x ln p/p = ln x + c + o(1).</p>\n<p>A variant of this proof has been formalised before by Harrison in HOL Light, and<br>\nformalisations of Selberg's elementary proof exist both by Avigad et <a href=\"http://al.in\">al.in</a><br>\nIsabelle and by Carneiro in Metamath. The advantage of the analytic proof is<br>\nthat, while it requires more powerful mathematical tools, it is considerably<br>\nshorter and clearer. This article attempts to provide a short and clear<br>\nformalisation of all components of that proof using the full range of<br>\nmathematical machinery available in Isabelle, staying as close as possible to<br>\nNewman's simple paper proof.</p>\n<p>For more details, have a look at:</p>\n<p><a href=\"https://www.isa-afp.org/entries/Prime_Number_Theorem.html\">https://www.isa-afp.org/entries/Prime_Number_Theorem.html</a></p>\n<p>Many thanks to Manual and Larry,<br>\nRené</p>",
        "id": 294745286,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661193192
    }
]