[
    {
        "content": "<p>From: Buday Gergely &lt;<a href=\"mailto:gbuday@karolyrobert.hu\">gbuday@karolyrobert.hu</a>&gt;<br>\nHi,</p>\n<p>I tried to find the theorem whose name is left_neutral so opened the Query dialog and wrote</p>\n<p>name: \"left_neutral\"</p>\n<p>Now the star-shaped widget beside the Apply button runs infinitely showing that the system works.</p>\n<p>Is the above query wrong? And, how could I stop this thread and start a new query?</p>\n<ul>\n<li>Gergely</li>\n</ul>",
        "id": 294325241,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660928342
    },
    {
        "content": "<p>From: Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt;<br>\nOn Tue, 20 Jan 2015, Buday Gergely wrote:</p>\n<blockquote>\n<p>I tried to find the theorem whose name is left_neutral so opened the <br>\nQuery dialog and wrote</p>\n<p>name: \"left_neutral\"</p>\n<p>Now the star-shaped widget beside the Apply button runs infinitely <br>\nshowing that the system works.</p>\n</blockquote>\n<p>This \"spinning disk\" icon can actually have various different states. <br>\nThe tooltip tells more, e.g. it could be \"Waiting for evaluation of <br>\ncontext ...\".  Sometimes there is just a user confusion about that.</p>\n<p>Nonetheless, there could be a genuine problem, e.g. a deadlock. If such a <br>\nproblem is recurrent, it usually helps to look very closely what really <br>\nhappens, and tell me about it.  People have also made informative <br>\nscreencasts, leading to successful improvements of the situation <br>\neventually.</p>\n<blockquote>\n<p>Is the above query wrong?</p>\n</blockquote>\n<p>The query is OK.  If it were somehow malformed, there should be an <br>\nexplicit error.</p>\n<blockquote>\n<p>And, how could I stop this thread and start a new query?</p>\n</blockquote>\n<p>It is unrealistic to manage threads manually -- the system mainly works <br>\nwith future tasks anyway. The Monitor panel might provide some clues what <br>\nthe system is up to, but it is also hard to interpret the situation.</p>\n<p>Makarius</p>",
        "id": 294325285,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660928354
    }
]