[
    {
        "content": "<p>From: <a href=\"mailto:anhlevn@cims.nyu.edu\">anhlevn@cims.nyu.edu</a><br>\nHi everyone,<br>\nI am Anh. In my current research, I parse and generate code in<br>\nIsabelle/Isar. I really need the language specification, especially the<br>\nsyntax of Isabelle/Isar. In the current reference manual, the syntax of<br>\nthe language is not fully described and it's really hard to get it from<br>\nseparate parts of the manual.<br>\nIt would be really helpful if someone shows me some source to get that<br>\nkind of information.<br>\nThank you very much</p>\n<p>Anh</p>",
        "id": 294129504,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660842311
    },
    {
        "content": "<p>From: Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt;<br>\nThat's tricky, since Isabelle/Isar consists of pure semantics with some <br>\naspects modeled in concrete syntax (which can be extended in user space in <br>\ncompotationally complete ways). The isar-ref manual merely provides some <br>\nreconstruction of syntactic forms that work in practice, but this cannot <br>\nbe complete by construction.</p>\n<p>So the challange is to overcome the above requirement \"I really need the <br>\nlanguage specification\".  What is your concrete application?</p>\n<p>Makarius</p>",
        "id": 294129523,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660842317
    },
    {
        "content": "<p>From: Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt;<br>\nDoes that mean you merely want to generate Isar text, without parsing it? <br>\nThe full round trip would very hard indeed, but even just generating <br>\nsources reliably is not easy.</p>\n<p>The question here is if you generate sources for the system or for the <br>\nuser, or both.  Generating sources just for the system is better avoided <br>\naltogether --- it is much more robust to add language elements to the <br>\nsystem that pull in the external DSL content into the logical environment. <br>\nThus you would benefit from the open-endedness of the Isar language, <br>\ninstead of struggling with it.</p>\n<p>BTW, the real hard part is normally not the outer Isar language, but the <br>\ninner term language.  Even Isar itself just quotes the types, terms, <br>\npropositions without looking into them.  It is up to many layers of <br>\nlogical syntax (including specifications in user theories) that make up <br>\nformal notation in Isabelle.</p>\n<p>Makarius</p>",
        "id": 294129739,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660842377
    },
    {
        "content": "<p>From: <a href=\"mailto:anhlevn@cims.nyu.edu\">anhlevn@cims.nyu.edu</a><br>\nI want to generate Isar text, and I also need to parse it. I generate code<br>\nusing AST transformation, from my DSL ASTs to Isar ASTs. I have been<br>\nworking on code generation for a while. The code is just for the system,<br>\nbut it's necessary, can not be avoided.<br>\nAnd you're right. I only have troubles with types, terms, and<br>\npropositions; not with Isar outer language. But I don't need all kinds of<br>\ntypes, terms, propositions. I just need what I want to generate. So, it<br>\ntakes more time, but is still manageable.</p>\n<p>Thank you very much<br>\nAnh</p>",
        "id": 294129781,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660842396
    }
]