[
    {
        "content": "<p>From: Christoph Sprenger &lt;<a href=\"mailto:sprenger@inf.ethz.ch\">sprenger@inf.ethz.ch</a>&gt;<br>\nSenior Postdoc / Project Coordinator position in Information Security and Program Verification at ETH Zurich</p>\n<p>The Institute of Information Security (the groups of Prof. Adrian Perrig and Prof. David Basin) and the Programming Methodology Group (Prof. Peter Müller) at ETH Zurich are hiring a Postdoc in a large research project in the area of digital trust. The goal of this project is to develop a comprehensive, formally verified security architecture for communication in the physical and digital world. In particular, the project will develop protocols to transfer physical trust relationships into the digital world and store, manage, and use them. The design will take into account human (mis-)behavior from the outset. A particular emphasis is on the formal verification of the architecture both at the design and implementation level to rule out any undesired behavior.</p>\n<p>We are looking for enthusiastic and outstanding postdoctoral researchers with a strong background in some of the following topics:</p>\n<p>formal modeling and verification,<br>\nprogram verification,<br>\ntheorem proving, model checking,<br>\ncryptographic protocols,<br>\npublic-key infrastructure, identity management, authentication,<br>\nnetworking and distributed systems, and<br>\ndesign and implementation of security architectures.<br>\nIn addition to research, the responsibilities of the position include project management, in particular, coordination among the involved research groups, lightweight reporting to the funding agency, and outreach to potential industrial users of the developed solutions. </p>\n<p>All candidates matching the profile above are encouraged to apply as soon as possible. We will process applications until all positions are filled. Successful candidates are expected to start soon after acceptance, but the starting date is negotiable.</p>\n<p>Applications should include:</p>\n<p>a curriculum vitae,<br>\na brief description of research interests, and<br>\nletters of recommendation.<br>\nApplications and inquiries should be sent to Christoph Sprenger and Sandra Schneider at the following email addresses.</p>\n<p><a href=\"mailto:infsec.positions@inf.ethz.ch\">infsec.positions@inf.ethz.ch</a> &lt;mailto:<a href=\"mailto:infsec.positions@inf.ethz.ch\">infsec.positions@inf.ethz.ch</a>&gt;, <a href=\"mailto:jobs-pm@inf.ethz.ch\">jobs-pm@inf.ethz.ch</a> &lt;mailto:<a href=\"mailto:jobs-pm@inf.ethz.ch\">jobs-pm@inf.ethz.ch</a>&gt; </p>\n<p>Postdocs are paid employees of ETH Zurich. Salary and employment conditions are attractive. Zurich is a diverse and multicultural city which is consistently rated among the best cities in the world in which to live.</p>",
        "id": 294822895,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661243025
    }
]