[
    {
        "content": "<p>From: Moa Johansson &lt;<a href=\"mailto:moa.johansson@chalmers.se\">moa.johansson@chalmers.se</a>&gt;<br>\n21th International Symposium on Practical Aspects of Declarative Languages (PADL 2019)</p>\n<p><a href=\"https://popl19.sigplan.org/track/PADL-2019\">https://popl19.sigplan.org/track/PADL-2019</a></p>\n<p>Lisbon, Portugal. 14 -15 January 2019.</p>\n<p>Co-located with ACM POPL 2019 (<a href=\"https://popl19.sigplan.org/home\">https://popl19.sigplan.org/home</a>)</p>\n<p>Declarative languages build on sound theoretical bases to provide attractive frameworks for application development. These languages have been successfully applied to many different real-world situations, ranging from data base management to active networks to software engineering to decision support systems.</p>\n<p>New developments in theory and implementation have opened up new application areas. At the same time, applications of declarative languages to novel problems raise numerous interesting research issues. Well-known questions include designing for scalability, language extensions for application deployment, and programming environments. Thus, applications drive the progress in the theory and implementation of declarative systems, and benefit from this progress as well.</p>\n<p>PADL is a well-established forum for researchers and practitioners to present original work emphasising novel applications and implementation techniques for all forms of declarative concepts, including, functional, logic, constraints, etc. Topics of interest include, but are not limited to:</p>\n<ul>\n<li>\n<p>Innovative applications of declarative languages</p>\n</li>\n<li>\n<p>Declarative domain-specific languages and applications</p>\n</li>\n<li>\n<p>Practical applications of theoretical results</p>\n</li>\n<li>\n<p>New language developments and their impact on applications</p>\n</li>\n<li>\n<p>Declarative languages and software engineering</p>\n</li>\n<li>\n<p>Evaluation of implementation techniques on practical applications</p>\n</li>\n<li>\n<p>Practical experiences and industrial applications</p>\n</li>\n<li>\n<p>Novel uses of declarative languages in the classroom</p>\n</li>\n<li>\n<p>Practical extensions such as constraint-based, probabilistic, and reactive languages.</p>\n</li>\n</ul>\n<p>PADL 2019 welcomes new ideas and approaches pertaining to applications and implementation of * declarative languages, and is not limited to the scope of the past PADL symposia. It will be co-located with the Symposium on Principles of Programming Languages (POPL 2019), in Lisbon, Portugal.</p>\n<p>Important Dates and Submission Guidelines</p>\n<p>——————————————————</p>\n<p>Abstracts due: 21 September</p>\n<p>Papers due: 28 September</p>\n<p>Notification to authors: 26 October</p>\n<p>Please see the conference website for full information about submissions, PC etc.</p>",
        "id": 294741448,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661191686
    }
]