[
    {
        "content": "<p>From: Ralf Treinen &lt;<a href=\"mailto:Ralf.Treinen@pps.jussieu.fr\">Ralf.Treinen@pps.jussieu.fr</a>&gt;<br>\nLoCoCo 2010 --  Workshop on Logics for Component Configuration<br>\n   Workshop of SAT at FLoC 2010, Edinburgh, Scotland, July 10, 2010<br>\n<a href=\"http://lococo2010.mancoosi.org/\">http://lococo2010.mancoosi.org/</a><br>\n                        First Call for Papers</p>\n<p>Scope:<br>\n======<br>\nModern software distributions are based on the notion of components, which<br>\ndenote units of independent development and deployment. Components provide<br>\nthe necessary flexibility when organizing a complex software distribution,<br>\nbut also are a challenge when it comes to selecting components from a large<br>\nrepository of possible choices, and configuring these components according<br>\nto user needs, resource constraints, and interdependencies with other<br>\ncomponents.  Representing and solving configuration problems is a hot topic<br>\nof great importance for many application domains. Some well-known examples<br>\nof complex systems of components in the world of Free and Open Source<br>\nsoftware are the different distributions for GNU/Linux, BSD, or Eclipse<br>\nplugins.</p>\n<p>Understanding and solving these questions is an attractive research<br>\ntopic since the problems to be solved are complex and interesting for<br>\nresearchers working on solving techniques, and on the other hand have<br>\nthe potential of high impact on the way the software we all use<br>\neveryday is developed and deployed. Not only adequate logical<br>\nformalisms to represent a configuration problem are required, but also<br>\nsophisticated reasoning technologies to deal with large amounts of<br>\ndata. Further relevant aspects include diagnosis of failed<br>\nconfiguration settings and an intelligent behavior dealing with user<br>\npreferences.</p>\n<p>This workshop will focus on logic-based methods for specifying and solving<br>\ncomplex configuration problems for software components.  The goal of the<br>\nworkshop is to bring together both researchers and practitioners active in<br>\nthe area of component configuration of software systems, using different<br>\nmodeling and solving techniques, such as constraint and logic programming,<br>\ndescription logics, satisfiability and its extensions. The workshop will be<br>\nan opportunity to discuss common and complementary solutions for solving<br>\ncomponent configuration.</p>\n<p>Topics:<br>\n=======<br>\nMain areas of interest include, but are not restricted to:<br>\no Configuration problems and models: knowledge representation and<br>\n  acquisition, incomplete knowledge, inconsistent knowledge, etc.<br>\no Reasoning methods for solving configuration problems: constraint<br>\n  satisfaction and optimization, SAT solving and extensions, integer <br>\n  programming, local search, symmetry breaking, etc.<br>\no Interactivity: user preferences, machine learning, distributed<br>\n  environments, etc.<br>\no Applications and tools: case studies, current challenges,<br>\n  application reports, etc.</p>\n<p>Invited Talk<br>\n============<br>\nAn invited talk will be given by Carsten Sinz (University of Karlsruhe).</p>\n<p>MISC 2010<br>\n=========<br>\nThe first Mancoosi International Solver Competition will be held in<br>\nconjunction with the LoCoCo workshop.</p>\n<p>Important Dates<br>\n===============<br>\nFriday, March 26   Submission deadline<br>\nFriday, April 23   Notification about acceptance<br>\nFriday, May 21     Final paper due<br>\nSaturday, July 10  Workshop</p>\n<p>Submission and Publication<br>\n==========================<br>\nWe welcome submissions of various types of presentations related to<br>\nthe topics of the workshop, such as</p>\n<ul>\n<li>full research papers</li>\n<li>abstracts of ongoing work</li>\n<li>tutorial overview papers</li>\n<li>summaries of research projects</li>\n<li>system descriptions, if possible including system demonstration at the<br>\n  workshop. These must provide the means to download and evaluate the<br>\n  system, with preference to distribution under an open source licence.</li>\n</ul>\n<p>Papers presented at the workshop will have to carry an open access<br>\nlicence agreement. We will attempt to publish the papers at an<br>\nopen access archive of workshop proceedings. Details will be posted<br>\nlater.</p>\n<p>Submitted papers must not exceed a limit of 10 pages, but authors may<br>\nprovide pointers to additional online resources if necessary.  Papers<br>\nmay be submitted in the formats Postscript or PDF. Details of the<br>\nexact page style to be used will be posted later.  Submissions will be<br>\nhandled through easychair at</p>\n<p><a href=\"http://www.easychair.org/conferences/?conf=lococo2010\">http://www.easychair.org/conferences/?conf=lococo2010</a>.</p>\n<p>Program Committee<br>\n=================<br>\nDaniel Le Berre (Universite d'Artois, France)<br>\nRoberto Di Cosmo (Universite Paris-Diderot, France)<br>\nGeorg Gottlob (Oxford University, UK)<br>\nPascal van Hentenryck (Brown University, USA)<br>\nMatti Jarvisalo (University of Helsinki, Finland)<br>\nInes Lynce (INESC-ID, Lisbon, Portugal), co-chair<br>\nToni Mancini (Sapienza Universita di Roma, Italy)<br>\nAlbert Oliveras (Technical University of Catalonia, Barcelona, Spain)<br>\nChristian Schulte (KTH, Stockholm, Sweden)<br>\nRalf Treinen (Universite Paris-Diderot, France), co-chair<br>\nNic Wilson (UCC, Cork, Irland)</p>",
        "id": 294098692,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660833106
    }
]