[
    {
        "content": "<p>From: Stephanie Weirich &lt;<a href=\"mailto:sweirich@cis.upenn.edu\">sweirich@cis.upenn.edu</a>&gt;<br>\n[Note: Due to several requests, the deadline for this special<br>\nissue has been extended one more week to July 6, 2009. Please<br>\ndo submit a paper. --Stephanie]</p>\n<hr>\n<p>Journal of Automated Reasoning</p>\n<p>Special issue on the POPLmark Challenge</p>\n<p>Call for Papers</p>\n<p>How close are we to a world in which mechanically verified software is<br>\ncommonplace? A world in which theorem proving technology is used<br>\nroutinely by both software developers and programming language<br>\nresearchers alike? One crucial step towards achieving these goals is<br>\nmechanized reasoning about language metatheory.  Researchers in<br>\nprogramming languages have long felt the need for tools to help<br>\nformalize and check their work. With advances in language technology<br>\ndemanding deep understanding of ever larger and more complex<br>\nlanguages, this need has become urgent.</p>\n<p>In 2005, a group of programming language researchers at Penn and<br>\nCambridge issued \"The POPLmark challenge\": a set of challenge problems<br>\naimed at the programming language and theorem proving community to<br>\ngauge progress in mechanizing programming language metatheory. The<br>\nsolutions to this challenge have been gathered at</p>\n<p><a href=\"http://plclub.org/mmm/\">http://plclub.org/mmm/</a></p>\n<p>The goal of the special issue is a retrospective on the POPLmark<br>\nchallenge, summarizing and analyzing what has been learned.</p>\n<p>Submissions are encouraged, but not limited to, the following topics:</p>\n<ul>\n<li>\n<p>Complete, polished descriptions of specific POPLmark solutions,<br>\n    including well-commented proof scripts</p>\n</li>\n<li>\n<p>Analysis and comparison of solutions to the POPLmark challenge</p>\n</li>\n<li>\n<p>Descriptions and code for proof assistant extensions/libraries<br>\n    developed explicitly for the purpose of programming language<br>\n    metatheory</p>\n</li>\n<li>\n<p>New formalization techniques, especially with respect to binding<br>\n    issues</p>\n</li>\n<li>\n<p>Proposals for new challenge problems that benchmark programming<br>\n    language work</p>\n</li>\n</ul>\n<p>Manuscripts should be unpublished works and not submitted<br>\nelsewhere. Revised and enhanced versions of papers published in<br>\nconference proceedings that have not appeared in archival journals<br>\nare eligible for submission. All submissions will be reviewed<br>\naccording to the usual standards of scholarship and originality.</p>\n<p>Submissions are due <em>July 6, 2009</em>. We will keep a tight review<br>\nschedule to enable publication of the special issue by mid<br>\n2010. Papers that do not progress through the reviewing cycle in a<br>\ntimely manner may be published in a later issue.</p>\n<p>Papers should be in pdf format following the JAR guidelines for<br>\nauthors. We encourage authors to keep their submissions below 30<br>\npages. Authors should submit their papers electronically to<br>\n<a href=\"mailto:sweirich@cis.upenn.edu\">sweirich@cis.upenn.edu</a>.</p>\n<p>For more information, see<br>\n<a href=\"http://www.seas.upenn.edu/~sweirich/jar-poplmark/\">http://www.seas.upenn.edu/~sweirich/jar-poplmark/</a></p>\n<p>Guest Editors</p>\n<p>Stephanie Weirich, University of Pennsylvania<br>\n    Benjamin Pierce,   University of Pennsylvania</p>",
        "id": 294078706,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660829928
    }
]