[
    {
        "content": "<p>From: \"John F. Hughes\" &lt;<a href=\"mailto:jfh@cs.brown.edu\">jfh@cs.brown.edu</a>&gt;<br>\nI'm not certain whether this is appropriate for this list, but here goes:</p>\n<p>I've been trying to make progress with Isabelle, but evidently need some<br>\nguidance; answers i've gotten here have been of some use, but the<br>\nturnaround is a bit slow: I'd like to dedicate a couple of solid days to<br>\nmaking progress, rather than 10 minutes, then hit a stumbling block, and<br>\nwait a day or two for an answer, which is how things have gone so far.</p>\n<p>I'd like to hire someone (a graduate student?) to answer my questions,<br>\nperhaps via email, perhaps in a couple of skype sessions, whatever works<br>\nbest, allowing for time differences, etc. (I'm on the east coast of the<br>\nUS). If anyone knows of someone who might be willing to help out, I'd sure<br>\nappreciate pointers. You could refer such a person to me directly.</p>\n<p>Typical questions may range from the mundane (\"Q: Why are there no colors<br>\nwhen I type stuff, but all the examples in the book show colored text?\"A:<br>\nBecause you named your file myTest rather than myTest.thy.\") to the more<br>\nsophisticated (\"Q: I'd like to inductively construct an infinite set (where<br>\n\"sets\" for me are being represented by types) and then prove things about<br>\nit... how on earth do I do that?\") None of my question are likely to be<br>\nabout the core ideas of Isabelle itself ('how is the current state of known<br>\nfacts represented?'), at least not initially --- they're all very much from<br>\na user's perspective.</p>\n<p>My target is proving things in mathematics, not things about programming<br>\nlanguages or programs. [I find those applications interesting too, but<br>\nthey're not what I'm after right now.] So someone with a bit of<br>\nmathematical sophistication would probably be ideal.</p>\n<p>Thanks in advance for any suggestions.<br>\n--John</p>",
        "id": 294750673,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661195315
    }
]