[
    {
        "content": "<p>From: Gergely Buday &lt;<a href=\"mailto:gbuday@karolyrobert.hu\">gbuday@karolyrobert.hu</a>&gt;<br>\nHi,</p>\n<p>this is not an Isabelle per se question, but as there are people here versed in programming language theory, and this I think relates to the function package of Isabelle, I feel this adequate here.</p>\n<p><a href=\"http://cs.stackexchange.com/questions/58076/axiomatisation-in-the-presence-of-recursion\">http://cs.stackexchange.com/questions/58076/axiomatisation-in-the-presence-of-recursion</a></p>\n<p>--</p>\n<p>He develops the Fork calculus for reasoning about concurrent functional programs, the motivation being Concurrent ML.<br>\nIn chapter 5, he writes:</p>\n<p>First, we add a recursion operator, allowing us to define processes <br>\nwith infinite behaviour. Recursion is not difficult to deal with <br>\n(thanks to the use of operational semantics), except that the <br>\naxiomatisation cannot be shown complete in presence of recursion.</p>\n<p>There is no literature reference here, so I ask you: where can I read about why recursion makes a programming language's axiomatisation cannot be proved complete, and in precisely what meaning?</p>\n<p>--<br>\nCan you clarify what you mean by the axiomatization of a programming language? I'm assuming it's because, once there is recursion, there are programs which halt for which there exist no proofs that they halt, but I can't be sure not knowing what exactly the completeness is talking about here. - jmite<br>\n--</p>\n<p>Do I understand correctly that the above remark about adding recursion to a language makes any axiomatisation incomplete is true</p>\n<p>for the same reason that makes it impossible to create a general function definition in a higher order logic of total functions, without the need to supply a termination proof in general?</p>\n<ul>\n<li>Gergely</li>\n</ul>",
        "id": 294673815,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661174242
    },
    {
        "content": "<p>From: David Cock &lt;<a href=\"mailto:david.cock@inf.ethz.ch\">david.cock@inf.ethz.ch</a>&gt;<br>\nThe question is a little loose with terminology.  I would guess that <br>\nhe's referring to the \"Axiomatisation of Strong Equivalence\" introduced <br>\non P51 i.e. the axiomatisation of the process equivalence relation.  And <br>\nif (presumably) a terminating process isn't equivalent to a <br>\nnonterminating process in his relation, then it really should be <br>\nincomplete/undecidable.  Seems that it's defined in terms of syntactic <br>\nequivalence on normal forms, which would presumably give a decision <br>\nprocedure for termination, if it were complete.</p>\n<p>David</p>",
        "id": 294673835,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661174248
    },
    {
        "content": "<p>From: Lawrence Paulson &lt;<a href=\"mailto:lp15@cam.ac.uk\">lp15@cam.ac.uk</a>&gt;<br>\nThey may simply be referring to the fact that in most cases, once you have recursion, you can define enough number theory for Gödel’s theorem to apply. The need for termination proofs is quite another matter: accepting a function definition such as f(n) = Suc(f(Suc n)) can easily lead to inconsistency.</p>\n<p>Larry</p>",
        "id": 294676711,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661175205
    }
]