[
    {
        "content": "<p>From: \"Sanan Baena David Miguel (Dr)\" &lt;<a href=\"mailto:sanan@ntu.edu.sg\">sanan@ntu.edu.sg</a>&gt;<br>\n(We apologize for multiple copies)</p>\n<p>Multiple Postdoc Positions on Verification and Security Analysis for Hypervisor and Block Chain<br>\nNanyang Technological University</p>\n<p>We have several exciting research projects on<br>\n1 Hypervisor development, formal modelling and verification,<br>\n2 Testing, verification and security analysis of block chain (Ethereum and beyond)</p>\n<p>The postdoc will work in the Cyber-Security Laboratory at Nanyang Technological University using theorem proving technologies.</p>\n<p>The position involves conducting basic research, developing tools, working as part of a large research team, travelling, and giving presentations. The working language is English.</p>\n<p>Apart from specific requirement to the topic a general candidate requirement are:</p>\n<ul>\n<li>A PhD in Computer Science or related areas is required.</li>\n<li>Strong background in logic and discrete maths.</li>\n<li>Strong programming skills.</li>\n<li>An established research record.</li>\n</ul>\n<p>The term is currently one to three years starting immediately.<br>\nThe salary is 5.5k to 7k SGD per month with up to 4 month performance bonus. (Singapore Tax is around 5%)</p>\n<p>Interested applicants should send their CV to<br>\nDr. David Sanan at sanan AT ntu.edu.sg&lt;<a href=\"http://ntu.edu.sg/\">http://ntu.edu.sg/</a>&gt;</p>\n<p>Candidates must be experienced on one or more of the following areas:</p>\n<p>- Formal methods, theorem proving.<br>\n      - Temporal logics, Higher order logic.<br>\n      - Functional programming.<br>\n      - OS development experience<br>\n        Software testing and validation，<br>\n        Smart contract and blockchain.</p>\n<hr>\n<p>CONFIDENTIALITY: This email is intended solely for the person(s) named and may be confidential and/or privileged. If you are not the intended recipient, please delete it, notify us and do not copy, use, or disclose its contents.<br>\nTowards a sustainable earth: Print only when necessary. Thank you.</p>",
        "id": 294746863,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661193842
    }
]