[
    {
        "content": "<p>From: Frédéric Blanqui &lt;<a href=\"mailto:frederic.blanqui@inria.fr\">frederic.blanqui@inria.fr</a>&gt;<br>\n==================================<br>\nICALP-LICS 2020 Call for Workshops<br>\n==================================</p>\n<p>ICALP 2020 (<a href=\"http://econcs.pku.edu.cn/icalp2020/\">http://econcs.pku.edu.cn/icalp2020/</a>) and LICS 2020 <br>\n(<a href=\"https://lics.siglog.org/lics20/\">https://lics.siglog.org/lics20/</a>) will take place in co-location from <br>\n8th till 12th of July 2020 in Beijing, China. The conferences will be <br>\npreceded by two days of joint workshops, held on July 6th and 7th. We <br>\ninvite proposals of workshops affiliated with ICALP-LICS 2020 on all <br>\ntopics covered by ICALP and LICS, as well as other areas of theoretical <br>\ncomputer science.</p>\n<p>Proposals should be submitted no later than</p>\n<p><strong>*  November 30th, 2019 </strong>*</p>\n<p>by sending an email to <a href=\"mailto:frederic.blanqui@inria.fr\">frederic.blanqui@inria.fr</a>. Due to limited space <br>\nof the venue we might not be able to accommodate all the proposed <br>\nworkshops. You should expect notification on the acceptance of your <br>\nproposal by mid December 2019.</p>\n<p>A workshop proposal submission should consist of:</p>\n<p>- workshop's name and URL (if already available)</p>\n<p>- workshop's organizers together with their email addresses and web <br>\npages;</p>\n<p>- short description of the area covered by the workshop and the <br>\nmotivation behind it;</p>\n<p>- expected number of participants (if available, please include the <br>\ndata of previous years);</p>\n<p>- planned format of the event;</p>\n<p>- date preference (July 6th or 7th).</p>\n<p>As for the format, a standard option is a one-day workshop consisting of <br>\ninvited talks by leading experts and of shorter contributed talks, <br>\neither directly invited by the organizers or selected among submissions. <br>\nDeviations from this standard are also warmly welcome, including a <br>\nshorter or a longer time span than a full day, or other elements of the <br>\nschedule like open problem sessions, discussion panels, or working <br>\nsessions.</p>\n<p>If you plan to have invited speakers, please specify their expected <br>\nnumber and, if possible, tentative names. If you plan a call for papers <br>\nor for contributed talks followed by a selection procedure, the <br>\nsubmission date should be scheduled after ICALP 2020 and LICS 2020 <br>\nnotification, while the notification should take place considerably <br>\nbefore the early registration deadline. In your submission please <br>\ninclude details, in particular the time schedule, of the planned <br>\nprocedure of selecting papers and/or contributed talks. If you plan to <br>\nhave published proceedings of your workshop, please provide the name of <br>\nthe publisher. Please be advised that ICALP-LICS 2020 is not able to <br>\nprovide any financial support for publishing workshop proceedings.</p>\n<p>We expect the workshops to be financially independent. The expenses <br>\nrelated to the participation of invited speakers, production of workshop <br>\nmaterials, etc. should be covered from independent sources. On top of <br>\nstandard ICALP/LICS registration fee there will be a moderate <br>\nregistration fee for the workshops that will cover coffee breaks. This <br>\nworkshop fee will be waived for maximum two invited speakers for each <br>\nworkshop.</p>\n<p>Workshop selection committee:<br>\n     Frédéric Blanqui<br>\n     Naoki Kobayashi<br>\n     Yuqin Kong<br>\n     Michał Pilipczuk<br>\n     Zhilin Wu<br>\n     Lijun Zhang</p>",
        "id": 294765973,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661201979
    }
]