[
    {
        "content": "<p>From: Jeremy Dawson &lt;<a href=\"mailto:Jeremy.Dawson@anu.edu.au\">Jeremy.Dawson@anu.edu.au</a>&gt;<br>\nDue to the requests from authors, the submission deadline of ICFEM 2020 <br>\nhas been extended to 24 May 2020 (AOE).</p>\n<p>Here is the revised CFP</p>\n<hr>\n<p>CALL FOR PAPERS</p>\n<hr>\n<p>22nd International Conference on Formal Engineering Methods (ICFEM <br>\n2020), 2-6 November 2020, Singapore (subject to changes, including <br>\nbackup options such as postponing the conference or hosting it online).</p>\n<p><a href=\"http://formal-analysis.com/icfem/2020/\">http://formal-analysis.com/icfem/2020/</a></p>\n<p>Extended deadlines:<br>\nFull Paper Submissions Due: 24 May 2020 (AoE)<br>\nWorkshop/Tutorial Proposals Due: 20 March 2020<br>\nAcceptance/Rejection Notification: 5 July 2020<br>\nCamera-ready Due: 17 July 2020</p>\n<p>Since 1997, ICFEM provides a forum for both researchers and <br>\npractitioners who are interested in developing practical formal methods <br>\nfor software engineering or applying existing formal techniques to <br>\nimprove software development process in practice systems. Formal Methods <br>\nfor the development of computer systems have been extensively researched <br>\nand studied. We now have good theoretical understandings of how to <br>\ndescribe what programs do, how they do it, and why they work. A range of <br>\nsemantic theories, specification languages, design techniques, <br>\nverification methods, and supporting tools have been developed and <br>\napplied to the construction of programs of moderate size that are used <br>\nin critical applications. The remaining challenge now is how to deal <br>\nwith problems in developing and maintaining large scale and complex <br>\ncomputer systems.</p>\n<p>The goal of this conference is to bring together industrial, academic, <br>\nand government experts, from a variety of user domains and software <br>\ndisciplines, to help advance state of the art. Researchers, <br>\npractitioners, tool developers and users, and technology transfer <br>\nexperts are all welcome. We are interested in work that has been <br>\nincorporated into real production systems, and in theoretical work that <br>\npromises to bring practical, tangible engineering benefits.</p>\n<p>Scope and Topics:<br>\nSubmissions related to the following principal themes are encouraged, <br>\nbut any topics relevant to the field of formal engineering methods and <br>\ntheir practical applications will also be considered:</p>\n<p>• Abstraction, refinement and evolution<br>\n• Formal specification and modelling<br>\n• Formal verification and analysis<br>\n• Model checking<br>\n• Formal approaches to software testing and inspection<br>\n• Formal methods for self-adaptive systems<br>\n• Formal methods for object-oriented systems<br>\n• Formal methods for component-based systems<br>\n• Formal methods for concurrent and real-time systems<br>\n• Formal methods for cloud computing<br>\n• Formal methods for cyber-physical systems<br>\n• Formal methods for software safety and security<br>\n• Formal methods for software reliability and dependability<br>\n• Development, integration and experiments involving verified systems<br>\n• Formal certification of products under international standards<br>\n• Formal model-based development and code generation</p>\n<p>Submission and Publication:<br>\nSubmissions to the conference must not have been published or be <br>\nconcurrently considered for publication elsewhere. All submissions will <br>\nbe judged on the basis of originality, contribution to the field, <br>\ntechnical and presentation quality, and relevance to the conference. The <br>\nproceedings will be published in the Springer Lecture Notes in Computer <br>\nScience series.</p>\n<p>Papers should be written in English and should not exceed 16 pages in <br>\nLNCS format. Submissions should be made through the ICFEM 2020 <br>\nsubmission page, handled by the EasyChair conference management system.</p>\n<p><a href=\"https://easychair.org/conferences/?conf=icfem20\">https://easychair.org/conferences/?conf=icfem20</a></p>\n<p>Workshop or tutorial proposals should be directly sent to the Workshop <br>\nChair via email. Each proposal should include (1) title, scope, and <br>\naims, (2) brief bio of the organizer or lecturer, and (3) postal and <br>\nemail addresses.</p>\n<p>Organising Committee:</p>\n<p>General Chair<br>\nJin Song Dong, National University of Singapore and Griffith University, <br>\nSingapore/Australia<br>\nJim McCarthy, Defence Science and Technology, Australia​</p>\n<p>Program Co-Chairs<br>\nShang-Wei Lin, Nanyang Technological University, Singapore<br>\nZhe Hou, Griffith University, Australia<br>\nBrendan Mahony, Defence Science and Technology, Australia​</p>\n<p>Finance Chair<br>\nYang Liu, Nanyang Technological University, Singapore<br>\nJun Sun, Singapore University of Technology and Design, Singapore</p>\n<p>Workshop Chair<br>\nHadrien Bride, Griffith University, Australia</p>\n<p>Doctoral Symposium Chair<br>\nLei Ma, Kyushu University, Japan</p>",
        "id": 294829375,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661245903
    }
]