[
    {
        "content": "<p>From: Luke Serafin &lt;<a href=\"mailto:lserafin@andrew.cmu.edu\">lserafin@andrew.cmu.edu</a>&gt;<br>\nMr. Richter,</p>\n<p>It might be helpful to look at a mathematical logic book which develops<br>\nHOL rather than set theory as the foundation of mathematics, such as Peter<br>\nAndrews' _An Introduction to Mathematical Logic and Type Theory: To Truth<br>\nTrough Proof_ (let us abbreviate this TTTP; note that type theory is<br>\nessentially another term for HOL). There we find (remark after the proof<br>\nof theorem 5402) that the primitive version of HOL which the author calls<br>\nQ0 is a conservative extension of FOL. The basic logic used in Isabelle<br>\nand HOL Light is also a conservative extension of FOL (Coq uses<br>\nconstructive logic which is more restrictive than classical logic; I don't<br>\nknow whether its basic logic is a conservative extension of constructive<br>\npredicate logic). Any stronger HOL system (e.g. Q0^\\infty from the book<br>\nmentioned above; this system is adequate for the formalization of a very<br>\nsignificant portion of mathematics), can be viewed as this basic HOL<br>\ntogether with a set of axiom schemata. Choose such a stronger HOL system,<br>\nand denote its set of axioms by H. Then a sentence A is a theorem of this<br>\nstronger system iff there exists a finite subset H0 of H such that H0 |- A<br>\n(because proofs are finite, at least in this context). Note that the<br>\nturnstile means provable from basic HOL, e.g. Q0. This is equivalent to |-<br>\nB --&gt; A, where B is the conjunction of all elements of H0. Hence any<br>\ntheorem of any (recursively axiomatized) version of HOL can be viewed as a<br>\ntheorem of a conservative extension of FOL. Furthermore, we could<br>\nintroduce type predicates and axioms about them into FOL and thereby fully<br>\nimport Q0 into FOL (this construction is elementary but tedious), which by<br>\nthe above argument means that we can effectively translate any HOL system<br>\ninto FOL. In this sense, you are right that HOL does not go beyond FOL.</p>\n<p>However, the notion of proof is completely different between FOL and HOL.<br>\nIn the second paragraph of the remark referred to above (TTTP p. 243), we<br>\nfind quoted a result of Statman that \"the minimal length of a proof in<br>\nfirst-order logic of a wff of first-order logic may be extraordinarily<br>\nlonger than the minimal length of a proof of the same (as in, translated<br>\ncanonically) wff in second-order logic.\" The paper referred to may be<br>\nfound here: &lt;<a href=\"http://deepblue.lib.umich.edu/handle/2027.42/22467\">http://deepblue.lib.umich.edu/handle/2027.42/22467</a>&gt;, I have<br>\nnot studied it carefully but do know that the function from n to the<br>\nmaximal m such that m is a minimal-length FOL proof of a HOL wff which has<br>\na proof of length n asymptotically grows at least as fast as a<br>\nhyper-exponential function. Thus, using HOL wffs and rules of inference is<br>\nof great practical advantage when doing proofs with a computer. If we<br>\ninsist on everything being done in FOL, we could change our definition of<br>\nproof to allow derived rules of inference to be used directly, and then<br>\nderive translated versions of HOL rules of inference for some translation<br>\nof HOL into FOL. However, it is practically much simpler to just think in<br>\nterms of using HOL directly.</p>\n<p>Regarding set theory, ZF is strictly stronger than Q0^\\infty, but its lack<br>\nof intrinsic types makes proof searches in ZF much more difficult than<br>\nthose in Q0^\\infty. Thus it is often advantageous to work with a typed HOL<br>\ntheory than directly with ZF. Isabelle allows the dynamic addition of new<br>\naxioms, so if we ever need to go beyond Q0^\\infty (say), we can just add<br>\nwhatever new facts we need as axioms, and perhaps prove the validity of<br>\nthese axioms in ZF if we believe that is necessary. Also, though ZF is<br>\nnormally considered to be based on FOL, there is no danger of introducing<br>\na contradiction if we conservatively extend its background logic, and so<br>\nwe can just as easily consider ZF in the context of HOL (e.g.<br>\nIsabelle/ZF). This brings with it the possibility of gaining the<br>\nadvantages of types and HOL's much shorter proofs for ZF (e.g. we can<br>\ndefine type-parameterized isomorphism predicates between types with<br>\nassociated operations and sets with associated operations, and use these<br>\nto port theorems between HOL and ZF within this unified system).</p>\n<p>Hopefully this clarifies things somewhat, let me know if you have any<br>\nquestions about what is written above.</p>\n<p>Sincerely,<br>\n   Luke Serafin</p>",
        "id": 294164051,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660854311
    }
]