[
    {
        "content": "<p>From: Andrei Sabelfeld &lt;<a href=\"mailto:andrei@cs.chalmers.se\">andrei@cs.chalmers.se</a>&gt;</p>\n<hr>\n<p><em>PhD Student Positions in Programming Language-based Security</em><br>\nDept. of Computer Science and Engineering<br>\nChalmers University of Technology, Sweden</p>\n<p>Application deadline: January 30, 2009</p>\n<p>Full version of this announcement is at:<br>\n<a href=\"http://www.chalmers.se/cse/EN/news/vacancies/positions/ph-d-positions-in\">http://www.chalmers.se/cse/EN/news/vacancies/positions/ph-d-positions-in</a></p>\n<hr>\n<p><em>The Department</em></p>\n<p>The department provides a strong, international, and dynamic research<br>\nenvironment with about 75 faculty members. For more information, see<br>\n<a href=\"http://www.chalmers.se/cse/EN/\">http://www.chalmers.se/cse/EN/</a>.</p>\n<hr>\n<p><em>PhD Project</em></p>\n<p>The PhD students will join a world-leading team of researchers on<br>\n<em>programming language-based security</em>. Language-based security<br>\nfacilitates specifying and enforcing security policies at the level of<br>\nprogramming languages early in the software design and construction<br>\nphase.</p>\n<p>Drawing on the recent progress in this area, the goal of the positions<br>\nis to pursue the following directions of work:</p>\n<ul>\n<li>\n<p>To design <em>rich security policies</em> for confidentiality and<br>\nintegrity, as demanded by practical applications (such as web<br>\napplications). These security policies should be formal: they<br>\nshould operate at the level of programming-language semantics.</p>\n</li>\n<li>\n<p>To develop <em>practical enforcement mechanisms</em> for these policies<br>\nin expressive programming languages (such as web languages). These<br>\nenforcement mechanisms may combine static (for example, type<br>\nsystem-based) and dynamic (for example, execution<br>\nmonitoring-based) techniques.</p>\n</li>\n<li>\n<p>To support the above with case studies in web-application security.</p>\n</li>\n</ul>\n<p>In pursuing these goals, there are possibilities for collaboration with<br>\nour high-profile academic and industrial partners.</p>\n<hr>\n<p><em>Details about Employment</em></p>\n<p>PhD student positions are limited to five years and will then normally<br>\ninclude 20 per cent departmental work, mostly teaching duties. Salary<br>\nfor the position is as specified in Chalmers? general agreement for<br>\nPhD student positions, currently around 23,000SEK a month before tax.</p>\n<p>The positions are intended to start in spring or fall 2009.</p>\n<hr>\n<p><em>Suitable Background</em></p>\n<p>Applicants must have a degree in Computing Science or in a related<br>\nsubject with a strong Computing Science component. They must also have<br>\na strong, documented interest in doing research. The ideal student for<br>\nthe project will have strong background in both programming languages<br>\nand security.</p>\n<p>You may even apply if you have not yet completed your degree, but<br>\nexpect to do so before the position starts.</p>\n<p>In order to improve gender balance, Chalmers welcomes in particular<br>\napplications from female candidates.</p>\n<hr>\n<p><em>How to Apply</em></p>\n<p>Application can be submitted electronically following the<br>\n\"Application details\" and \"Application procedure\" guidelines at:<br>\n<a href=\"http://www.chalmers.se/cse/EN/news/vacancies/positions/ph-d-positions-in\">http://www.chalmers.se/cse/EN/news/vacancies/positions/ph-d-positions-in</a></p>",
        "id": 294068597,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660826365
    }
]