[
    {
        "content": "<p>From: \"Berger U.\" &lt;<a href=\"mailto:u.berger@swansea.ac.uk\">u.berger@swansea.ac.uk</a>&gt;<br>\nDear Prof. Paulson,</p>\n<p>Swansea has 2 lecturships available that could be of interest to Isabelle/HOL experts in security. There are also 10 postdoctoral fellowships. Details cand be found in the announcement below. Unfortunately, the deadlines are very close.</p>\n<p>I would be very grateful if you could forward this to anybody in your community who might be interested, or point me to someone I could contact.</p>\n<p>With thanks and kind regards,</p>\n<p>Ulrich Berger</p>\n<p>Job Opportunities in Logic and Computer Science at Swansea</p>\n<p>The Department of Computer Science at Swansea University has available:</p>\n<ul>\n<li>Up to 2 permanent Lectureships in Computer Security. While the lectureships aim at Computer Security in general, this might be an opportunity for researchers working on applications of Logic in Computer Security.</li>\n</ul>\n<p><a href=\"http://www.swansea.ac.uk/compsci/\">http://www.swansea.ac.uk/compsci/</a></p>\n<p>Deadline: 22 December 2015</p>\n<ul>\n<li>10 three-years postdoctoral fellowships across a wide range of science and technology disciplines. The Theoretical Computer Science Group offers projects in Computability, Specification, Proof Theory, Complexity and Verification. See our research portfolio at </li>\n</ul>\n<p><a href=\"http://www.swansea.ac.uk/compsci/researchandimpact/researchgroups/theory/\">http://www.swansea.ac.uk/compsci/researchandimpact/researchgroups/theory/</a></p>\n<p>Please contact members of our group directly if you are interest in a particular topic. </p>\n<p>Deadline for Expression of Interest: 5 January 2016 <br>\nFull Application: 1 March 2016</p>\n<p>Further details about the fellowships, including eligibility criteria, are below.</p>\n<p>SWANSEA UNIVERSITY EXCITING FELLOWSHIP OPPORTUNITIES</p>\n<p>Strengthening International Research Capacity in Wales (SIRCIW) Fellowships hosted by Swansea University Swansea University’s, College of Science, is delighted to announce 10 SIRCIW postdoctoral fellowships across a wide range of science and technology disciplines to the highest calibre candidates.</p>\n<p>The SIRCIW fellowship scheme, part of the Chief Scientific Adviser for Wales’ strategy to increase research capacity in Wales, will enable talented ‘rising star’ researchers, with a minimum 3 to 5 years post-doctoral research experience, to:-</p>\n<ul>\n<li>Work with leading international scholars in Swansea’s, College of Science;</li>\n<li>Receive excellent research supervision;</li>\n<li>Have access to the latest facilities and resources, and involvement in world-leading joint research projects; </li>\n<li>Collaborate with commercial partner where appropriate;</li>\n<li>Spend time as an academic in Wales, linking up with extensive international networks and collaborations. </li>\n</ul>\n<p>These prestigious 3 year fellowships are jointly funded by Swansea University, the European Commission - H2020, Marie Sklodowska Curie Action COFUND award and the Welsh Government.</p>\n<p>Through SIRCIW, Swansea is seeking to attract talented experienced researchers with the potential to be research leaders of the future.  It is anticipated fellowships will start in autumn 2016.</p>\n<p>FELLOW ELIGIBILITY CRITERIA</p>\n<ul>\n<li>Researchers may be of Any Nationality </li>\n<li>Cannot have been resident in the UK for more than 12 months in the last three years </li>\n<li>Submit a Science and/ or Technology relevant joint fellowship application with Swansea University to the Chief Scientific Adviser for Wales Office. </li>\n</ul>\n<p>APPLICATION PROCESS</p>\n<p>2 stage process, to be completed in English:</p>\n<ol>\n<li>Expression of Interest, EoI, submitted to the Deapartment of Computer Science, Swansea University by Tuesday 5th January </li>\n<li>Full Application (supervisor form, ethics form, and CV) submitted to CSAW office by Tuesday 1st March 2016.  </li>\n</ol>\n<p>Interested applicants are encouraged to make early contact with a potential Department of Computer Science Supervisor.  To initiate informal discussions please forward:- </p>\n<ul>\n<li>Recent successful research proposal</li>\n<li>Current C.V. &amp; Research/ career history</li>\n<li>Proposed Research Topic Area</li>\n<li>Likely Impact</li>\n<li>Referee Details</li>\n</ul>\n<p>FURTHER INFORMATION:</p>\n<p>Department of Computer Science, Swansea University<br>\n<a href=\"http://www.swansea.ac.uk/compsci/\">http://www.swansea.ac.uk/compsci/</a> <br>\nCollege of Science, Swansea University<br>\n<a href=\"http://www.swansea.ac.uk/science/\">http://www.swansea.ac.uk/science/</a><br>\nSIRCIW fellowship scheme can be found at<br>\n<a href=\"http://expertisewales.com/support-and-funding-researchers\">http://expertisewales.com/support-and-funding-researchers</a></p>\n<hr>\n<p>Dr. Ulrich Berger<br>\nDepartment of Computer Science<br>\nSwansea University<br>\nSingleton Park, Swansea SA2 8PP, UK</p>\n<p>Office:  Room 306 (Faraday Building)<br>\nPhone    Work +44 1792 513380<br>\n        Home +44 1792 533979<br>\nFax           +44 1792 295708<br>\nEmail    <a href=\"mailto:u.berger@swansea.ac.uk\">u.berger@swansea.ac.uk</a><br>\nHomepage <a href=\"http://www.cs.swan.ac.uk/~csulrich/\">http://www.cs.swan.ac.uk/~csulrich/</a></p>\n<hr>",
        "id": 294660392,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661169696
    }
]