[
    {
        "content": "<p>From: Christoph LANGE &lt;<a href=\"mailto:math.semantic.web@gmail.com\">math.semantic.web@gmail.com</a>&gt;<br>\nDo-Form: Enabling Domain Experts to use Formalised Reasoning<br>\n<a href=\"http://cs.bham.ac.uk/research/projects/formare/events/aisb2013\">http://cs.bham.ac.uk/research/projects/formare/events/aisb2013</a></p>\n<p>CALL FOR CONTRIBUTIONS</p>\n<p>Symposium at the annual convention of the<br>\nAISB (Society for the Study of<br>\n  Artificial Intelligence and Simulation of Behaviour;<br>\n<a href=\"http://www.aisb.org.uk\">http://www.aisb.org.uk</a>)<br>\nUniversity of Exeter, UK<br>\n2-5 April 2013<br>\n<a href=\"http://emps.exeter.ac.uk/computer-science/research/aisb/\">http://emps.exeter.ac.uk/computer-science/research/aisb/</a></p>\n<p>SPECIAL SESSIONS with</p>\n<ul>\n<li>Utku Ünver (market design and matching problems)</li>\n<li>Peter Cramton (auctions)</li>\n<li>Neels Vosloo (finance markets regulation)</li>\n</ul>\n<p>SUBMISSION DEADLINE: 14 January</p>\n<p>This symposium is motivated by the long-term VISION of making information<br>\nsystems dependable.  In the past even mis-represented units of<br>\nmeasurements caused fatal ENGINEERING disasters.  In ECONOMICS, the<br>\nsubtlety of issues involved in good auction design may have led to low<br>\nrevenues in auctions of public goods such as the 3G radio spectra.<br>\nSimilarly, banks' value-at-risk (VaR) models – the leading method of<br>\nfinancial risk measurement – are too large and change too quickly to be<br>\nthoroughly vetted by hand, the current state of the art; in the London<br>\nWhale incident of 2012, JP Morgan claimed that its exposures were $67mn<br>\nunder one of its VaR models, and $129 under another one.  Verifying a<br>\nmodel's properties requires formally specifying them; for VaR models, any<br>\nwork would have to start with this most basic step, as regulators' current<br>\ndesiderata are subjective and ambiguous.</p>\n<p>We believe that these problems can be addressed by representing the<br>\nknowledge underlying such models and mechanisms in a formal, explicit,<br>\nmachine-verifiable way.  Contemporary computer science offers a wide<br>\nchoice of knowledge representation languages well supported by<br>\nverification tools.  Such tools have been successfully applied, e.g., for<br>\nverifying software that controls commuter rail or payment systems (cf. the<br>\nsymposium homepage for further background).  Still, DOMAIN EXPERTS without<br>\na strong computer science background find it challenging to choose the<br>\nright tools and to use them.  This symposium aims at investigating ways to<br>\nsupport them.  Some problems can be addressed now, others will bring new<br>\nchallenges to computer science.</p>\n<p>General TOPICS of interest include:</p>\n<p>* for DOMAIN EXPERTS: what problems in application domains could benefit<br>\n    from better verification and knowledge management facilities?<br>\n    Possible fields include:</p>\n<p>* Example 1 (economics):<br>\n      auctions, VaR, trading algorithms, market design</p>\n<p>* Example 2 (engineering):<br>\n      system interoperability, manufacturing processes, product<br>\nclassification</p>\n<p>* for COMPUTER SCIENTISTS: how to provide the right knowledge management<br>\n    and verification tools to domain experts without a computer science<br>\n    background?</p>\n<p>* wikis and blogs for informal, semantic, semiformal, and formal<br>\n      mathematical knowledge;</p>\n<p>* general techniques and tools for online collaborative mathematics;<br>\n    * tools for collaboratively producing, presenting, publishing, and<br>\n      interacting with online mathematics;</p>\n<p>* automation and computer-human interaction aspects of mathematical<br>\n      wikis;</p>\n<p>* ontologies and knowledge bases designed to support knowledge<br>\n      management and verification in application domains;</p>\n<p>* practical experiences, usability aspects, feasibility studies;<br>\n    * evaluation of existing tools and experiments;<br>\n    * requirements, user scenarios and goals.</p>\n<p>We particularly invite submissions that address the problems or that apply<br>\nthe tools presented in the papers submitted for stage 1 (see \"submission\"<br>\nbelow).</p>\n<p>THE SYMPOSIUM is designed to bring domain experts and formalisers into<br>\nclose and fruitful contact with each other: domain experts will be able to<br>\npresent their fields and problems to formalisers; formalisers will be<br>\nexposed to new and challenging problem areas. We will combine talks and<br>\nhands-on sessions to ensure close interaction among participants from both<br>\nsides.</p>\n<p>World-class economists will offer dedicated HANDS-ON SESSIONS on the<br>\nfollowing topics:</p>\n<ul>\n<li>\n<p>Market design and matching problems (Utku Ünver, Boston College): These<br>\n  include matching students to schools, interns to hospitals, and kidney<br>\n  donors to recipients.  See the documentation for the 2012 Nobel Memorial<br>\n  Prize in Economic Sciences for more background information<br>\n  (<a href=\"http://www.nobelprize.org/nobel_prizes/economics/laureates/2012/\">http://www.nobelprize.org/nobel_prizes/economics/laureates/2012/</a>).</p>\n</li>\n<li>\n<p>Auctions (Peter Cramton, University of Maryland): Peter works on<br>\n  auctions for ICANN (the ‘knock out’ domain name auctions), Ofcom UK (4G<br>\n  spectrum auction), the UK Department of the Environment and Climate<br>\n  Change, and others.</p>\n</li>\n<li>\n<p>Finance (Neels Vosloo, Financial Services Authority UK): It is currently<br>\n  impossible for regulators to properly inspect either risk management<br>\n  models, or algorithmic trading platforms.  To what extent can techniques<br>\n  from mechanised reasoning automate some of the inspection process?</p>\n</li>\n</ul>\n<p>SUBMISSIONS</p>\n<p>We solicit submissions on any of the TOPICS outlined initially but prefer<br>\nsubmissions that specifically address topics identified in the earlier<br>\nsubmission Stage 1.  In Stage 1 we had solicited</p>\n<ul>\n<li>\n<p>from DOMAIN EXPERTS descriptions of \"nails\": canonical models and<br>\n  problems in their domain that might benefit from better verification and<br>\n  knowledge management facilities.  Descriptions should focus on aspects<br>\n  of these models that domain users find particularly problematic, and<br>\n  suspect might be aided by formalisation tools</p>\n</li>\n<li>\n<p>from COMPUTER SCIENTISTS descriptions of \"hammers\": formalisation,<br>\n  verification and knowledge management tools, with an emphasis on how<br>\n  they could be applied in a concrete real-world setting, or tailored to<br>\n  such application domains.</p>\n</li>\n</ul>\n<p>Commented versions of these submissions are now online at<br>\n<a href=\"http://www.cs.bham.ac.uk/research/projects/formare/events/aisb2013/stage1.php\">http://www.cs.bham.ac.uk/research/projects/formare/events/aisb2013/stage1.php</a>.<br>\nA tool whose description is submitted to Stage 2 could, e.g., be motivated<br>\nwith a Stage 1 problem, and sketch how the tool could, or will, be applied<br>\nin this domain.  Each submission will be refereed by three PC members on<br>\naverage.  Submissions will be judged based on the PC's views of the<br>\nlikelihood of contributing to a better matching of hammers (formalisation<br>\nand verification tools) to nails (domain problems).</p>\n<p>At this stage we accept PDF submissions in any layout but count 1200 words<br>\nas one page for fair comparison.  We invite research and position papers,<br>\nas well as tool and system descriptions, from 3 to 10 pages.  Besides PDFs<br>\nwe invite the submission of formalised knowledge representations with<br>\nhuman-readable annotations.</p>\n<p>To submit a paper, please go to the Do-Form EasyChair page<br>\n(<a href=\"http://www.easychair.org/conferences/?conf=doform2013\">http://www.easychair.org/conferences/?conf=doform2013</a>) and follow the<br>\ninstructions for Stage 2 there.</p>\n<p>FINAL VERSIONS</p>\n<p>Final versions should be prepared in LaTeX according to the AISB<br>\nformatting guidelines linked from the symposium homepage.  For the final<br>\nversion, non-PDF submissions should be accompanied by a PDF abstract of 2<br>\nto 4 pages.  Electronic proceedings (with an ISBN) will be made available<br>\nto the convention delegates on a memory stick, and on the AISB website.</p>\n<p>Given a sufficient number of high-quality submissions, we will invite<br>\nauthors to submit revised and extended versions to a SPECIAL ISSUE of a<br>\nrelevant JOURNAL.  (E.g., co-chair Manfred Kerber is on the editorial<br>\nboard of Mathematics in Computer Science.)</p>\n<p>IMPORTANT DATES</p>\n<p>* Submission (Stage 2): 14 January 2013<br>\n   * Notification: 11 February 2013<br>\n   * Final versions due: 4 March 2013<br>\n   * Symposium: 2-3 April 2013 (most likely)<br>\n   * AISB Convention: 2-5 April 2013</p>\n<p>PROGRAMME COMMITTEE</p>\n<p>1. Bill Andersen, Highfleet, US<br>\n    2. Rob Arthan, Lemma 1, Reading, UK<br>\n    3. Christoph Benzmüller, Free University of Berlin, Germany<br>\n    4. Peter Cramton, University of Maryland, US<br>\n    5. James Davenport, University of Bath, UK<br>\n    6. Michael Grüninger, University of Toronto, Canada<br>\n    7. Manfred Kerber, University of Birmingham, UK (co-chair)<br>\n    8. Michael Kohlhase, Jacobs University Bremen, Germany<br>\n    9. Christoph Lange, University of Birmingham, UK (co-chair)<br>\n   10. Till Mossakowski, University of Bremen, Germany<br>\n   11. Colin Rowat, University of Birmingham, UK (co-chair)<br>\n   12. Todd Schneider, Raytheon, US<br>\n   13. Richard Steinberg, London School of Economics, UK<br>\n   14. Geoff Sutcliffe, University of Miami, US<br>\n   15. Theodore L Turocy, Centre for Behavioural and Experimental Social<br>\n       Science, University of East Anglia, UK<br>\n   16. Makarius Wenzel, University of Paris Sud, France<br>\n   17. Wolfgang Windsteiger, RISC / JKU Linz, Austria</p>\n<p>COMMENTS/QUESTIONS/ENQUIRIES to be sent to <a href=\"mailto:DoForm2013@easychair.org\">DoForm2013@easychair.org</a></p>",
        "id": 294229313,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660901622
    }
]