[
    {
        "content": "<p>From: John Harrison &lt;<a href=\"mailto:John.Harrison@cl.cam.ac.uk\">John.Harrison@cl.cam.ac.uk</a>&gt;<br>\nApologies if you've already got this, but I didn't see an announcement<br>\non the HOL or Isabelle lists, so it seemed worth repeating it. Note that<br>\none of the categories explicitly mentioned is \"automated reasoning\".</p>\n<p>John.</p>\n<p>KURT GOEDEL CENTENARY RESEARCH PRIZE FELLOWSHIPS</p>\n<p>The Kurt Goedel Society is proud to announce the commencement of the<br>\nresearch fellowship prize program in honor of the celebration of Kurt<br>\nGoedel's 100th birthday.</p>\n<p>The research fellowship prize program is sponsored by the John<br>\nTempleton Foundation and will offer:</p>\n<ul>\n<li>\n<p>two Ph.D. (pre-doctoral) fellowships of $60,000 US per annum for two years</p>\n</li>\n<li>\n<p>two post-doctoral fellowships of $80,000 US per annum for two years and</p>\n</li>\n<li>\n<p>one senior fellowship of $120,000 US per annum for one year based on an<br>\n   international open competition, resulting in the publication of research <br>\n   papers in a special issue of a premier journal in mathematical logic.</p>\n</li>\n</ul>\n<p>The following International Board of Jurors will be in charge of<br>\nevaluating the applications:</p>\n<p>Peter ACZEL, University of Manchester (GB)<br>\nLev BEKLEMISHEV, Russian Academy of Sciences (RUS)<br>\nJohn BURGESS, Princeton University (USA)<br>\nHarvey FRIEDMAN, Ohio State University (USA) CHAIR<br>\nJohn HARRISON, Intel Corporation (USA)<br>\nWilfried HODGES, Queen Mary University of London (GB)<br>\nSimon KOCHEN, Princeton University (USA)<br>\nJan KRAJICEK, Academy of Sciences of the Czech Republic (CZ)<br>\nMenachem MAGIDOR, Hebrew University (ISRAEL)<br>\nDave MARKER, University of Illinois at Chicago (USA)<br>\nMichel PARIGOT, Universite Paris 7 (FRANCE)<br>\nPavel PUDLAK, Academy of Sciences of the Czech Republic (CZ)<br>\nHilary PUTNAM, Harvard University (USA)<br>\nJeff REMMEL,University of California at San Diego (USA)<br>\nJohn STEEL, University of California at Berkley (USA)<br>\nFrank STEPHAN, National University of Singapore (SINGAPORE)<br>\nAlbert VISSER, University of Utrecht (NL)</p>\n<p>Goal and Criteria of Merit</p>\n<p>The purpose of these fellowships is to support original research in,<br>\nand areas surrounding, the foundations of mathematics. (See Scope<br>\nbelow for more details.) These fellowships are intended to carry<br>\nforward the legacy of Kurt Goedel, whose works exemplify deep insights<br>\nand breakthrough discoveries in mathematical logic, with profound<br>\nimpact on the philosophy and foundations of mathematics. In pursuit of<br>\nsimilar insights and discoveries, we adopt the following criteria of<br>\nmerit for evaluating Fellowship applications:</p>\n<p>1. Intellectual merit, scientific rigor and originality of the<br>\n   submitted paper and work plan. The paper and research plans should<br>\n   combine visionary thinking with academic and scientific excellence.</p>\n<p>2. Potential for significant contribution to basic fundamental<br>\n   issues of wide interest, and the likelihood for opening new,<br>\n   seminal lines of inquiry that bear on such issues.</p>\n<p>3. Impact of the Fellowship on the project and likelihood that the<br>\n   Fellowship will make the proposed new lines of research possible.</p>\n<p>4. The expectation that the proposed research will be successful.</p>\n<p>5. Qualifications of the applicants will be evaluated on the basis<br>\n   of all available information including CV, research paper, research<br>\n   plans, research accomplishments, and letters of recommendation<br>\n   (recommendation letters are not required for senior applications).</p>\n<p>Scope</p>\n<p>Original fellowship proposals in the areas of</p>\n<p>* model theory<br>\n    * proof theory<br>\n    * recursion theory<br>\n    * set theory<br>\n    * foundations of mathematics<br>\n    * philosophy of mathematics<br>\n    * foundations of computer science (related to logic)<br>\n    * automated reasoning (related to logic)<br>\n    * complexity (related to logic)</p>\n<p>All fellowship proposals, regardless of subject area, will be judged<br>\naccording to</p>\n<p>* the relevance and resemblance of the research (finished and<br>\n      proposed) to the great insights and originality of Kurt Goedel</p>\n<p>* its general interest and clarity of motivation<br>\n    * its rigorous scientific quality and depth.</p>\n<p>Submission Instructions</p>\n<p>The three categories of fellowships are specified as follows:</p>\n<ul>\n<li>\n<p>Ph.D.(pre-doctoral): being in the stage before finishing the thesis<br>\n   (or equivalent achievements) </p>\n</li>\n<li>\n<p>Post-doctoral: being in the stage within 10 years after finishing<br>\n   the thesis (or equivalent achievements) </p>\n</li>\n<li>\n<p>Senior: being in a later stage</p>\n</li>\n</ul>\n<p>The submission must consist of:</p>\n<ul>\n<li>\n<p>one document A in PDF format containing<br>\n  . the CV<br>\n  . the project description<br>\n  . the recommendation letters</p>\n</li>\n<li>\n<p>one document B in PDF format containing the article</p>\n</li>\n<li>one text abstract relating to B<br>\nMaximum allowed length of the abstract is 500 words.</li>\n</ul>\n<p>Document A containing the CV, the project description, and the<br>\nrecommendation letters must be prepared in the following way: -</p>\n<ul>\n<li>minimum font size: 10pt</li>\n<li>paper size: A4</li>\n<li>\n<p>maximum length of the CV: 3 pages <br>\nThe CV must contain the list of all/most important publications.<br>\nThe CV must clearly state to which category the application belongs.</p>\n</li>\n<li>\n<p>maximum length of project description: 4 pages<br>\nProject description should clearly state where and at which <br>\ninstitution the applicant intends to carry out the project.</p>\n</li>\n<li>\n<p>minimum 2(two)/maximum 3 (three) 1-page recommendation letters,<br>\nin case of applications belonging to the categories Ph.D.<br>\n(pre-doctoral) and post-doctoral fellowships.<br>\n  (The recommendation letters should be scanned and included into the <br>\nPDF document)</p>\n</li>\n</ul>\n<p>Document B containing the article to be published in Annals of Pure<br>\nand Applied Logic must be prepared according to the guidelines of the<br>\nAnnals of Pure and Applied Logic. Please see</p>\n<p><a href=\"http://www.elsevier.com/wps/find/journaldescription.cws_home/505603/authorinstructions\">http://www.elsevier.com/wps/find/journaldescription.cws_home/505603/authorinstructions</a></p>\n<p>for details. In a nutshell: Use LaTeX and elsart.cls. Maximum allowed<br>\nlength of the article is twenty-five (25) pages in the prescribed<br>\nformat.</p>\n<p>The submission must be in English.</p>\n<p>The Advisory Board and the Program Chair reserve the right<br>\n. to consider only submissions with reasonable format<br>\n. to reassign a submission to another category as applied for.<br>\nThe applicant will be informed about the reasons for such a<br>\ndecision.<br>\nThe submission software will be available online by the end of March.</p>\n<p>Timeline</p>\n<p>December 1, 2006.*                  Pre-announcement<br>\nJune 30, 2007.                      Submissions deadline<br>\nOctober 2007.                       Jury decision on the papers for publication (at most 20)<br>\nDecember 15, 2007.                  Final versions due<br>\nJanuary 2008.                       Jury decision on winners due<br>\nFebruary 2008.                      Award Ceremony<br>\nMar.-Sept.2008.                     Commencement of the Fellowships</p>\n<p>Web:<a href=\"http://kgs.logic.at/goedel-fellowship\">http://kgs.logic.at/goedel-fellowship</a></p>\n<p>E-mail contact: <a href=\"mailto:goedel-fellowship@logic.at\">goedel-fellowship@logic.at</a></p>\n<ul>\n<li>Date of the acceptance of Goedel's postdoctoral lecture qualification<br>\n  thesis in 1906.</li>\n</ul>",
        "id": 294048291,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660818242
    }
]