[
    {
        "content": "<p>From: Tobias Nipkow &lt;<a href=\"mailto:nipkow@in.tum.de\">nipkow@in.tum.de</a>&gt;<br>\nTimed Automata<br>\nSimon Wimmer</p>\n<p>Timed automata are a widely used formalism for modeling real-time systems, which <br>\nis employed in a class of successful model checkers such as UPPAAL [LPY97], <br>\nHyTech [HHWt97] or Kronos [Yov97]. This work formalizes the theory for the <br>\nsubclass of diagonal-free timed automata, which is sufficient to model many <br>\ninteresting problems. We first define the basic concepts and semantics of <br>\ndiagonal-free timed automata. Based on this, we prove two types of decidability <br>\nresults for the language emptiness problem. The first is the classic result of <br>\nAlur and Dill [AD90, AD94], which uses a finite partitioning of the state space <br>\ninto so-called <code>regions</code>. Our second result focuses on an approach based on <br>\n<code>Difference Bound Matrices (DBMs)</code>, which is practically used by model checkers. <br>\nWe prove the correctness of the basic forward analysis operations on DBMs. One <br>\nof these operations is the Floyd-Warshall algorithm for the all-pairs shortest <br>\npaths problem. To obtain a finite search space, a widening operation has to be <br>\nused for this kind of analysis. We use Patricia Bouyer's [Bou04] approach to <br>\nprove that this widening operation is correct in the sense that DBM-based <br>\nforward analysis in combination with the widening operation also decides <br>\nlanguage emptiness. The interesting property of this proof is that the first <br>\ndecidability result is reused to obtain the second one.</p>\n<p><a href=\"http://afp.sourceforge.net/entries/Timed_Automata.shtml\">http://afp.sourceforge.net/entries/Timed_Automata.shtml</a></p>\n<p>Enjoy!<br>\n<a href=\"/user_uploads/14278/GSpuGs4y9SeQsESIikuYyDFS/smime.p7s\">smime.p7s</a></p>",
        "id": 294669792,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661173059
    }
]