[
    {
        "content": "<p>From: Ken Kubota &lt;<a href=\"mailto:mail@kenkubota.de\">mail@kenkubota.de</a>&gt;<br>\nDear Members of the Research Community,</p>\n<p>In an attempt to create a genealogy of the foundations of mathematics,<br>\nthe main approaches based upon Church's Simple Theory of Types (1940),</p>\n<ul>\n<li>Gordon's HOL (including origins like Huet's and Paulson's LCF and the descendants by Konrad Slind, John Harrison, and Larry Paulson) as well as</li>\n<li>Andrews' Q0 (including Tom Melham's extension of HOL drawing on the work of Andrews)<br>\nare compared online at<p><a href=\"http://dx.doi.org/10.4444/100.111\">http://dx.doi.org/10.4444/100.111</a></p>\n</li>\n</ul>\n<p>The purpose is to make design decisions transparent in order to systematically characterize and compare logistic systems,<br>\nwhich either explicitly or implicitly try to express most or all of formal logic and mathematics.</p>\n<p>Hints, comments, corrections and critique are welcome.</p>\n<p>Other systems (e.g., Coq) shall be considered at a later time.</p>\n<p>I wasn't sure concerning the history of Cambridge LCF, as its descriptions slightly differ.<br>\nIn one version, Paulson further develops the (finished) result by Huet, in another they directly collaborate.<br>\n(\"Huet’s Franz Lisp version of LCF was further developed at Cambridge by Larry Paulson, and became known as ‘Cambridge LCF’.\",<br>\n<a href=\"http://sourceforge.net/projects/hol/files/hol/kananaskis-10/kananaskis-10-description.pdf\">http://sourceforge.net/projects/hol/files/hol/kananaskis-10/kananaskis-10-description.pdf</a>, p. 4,<br>\nvs. \"Paulson and Huet then established a collaboration and did a lot of joint development of LCF by sending each other magnetic tapes in the post.\",<br>\n<a href=\"http://www.cl.cam.ac.uk/~mjcg/papers/HolHistory.pdf\">http://www.cl.cam.ac.uk/~mjcg/papers/HolHistory.pdf</a>, p. 3.)<br>\nIn the overview, it is summarized as \"Cambridge LCF by Larry Paulson and Gérard Huet (around 1985)\",<br>\nas it seems important that both contributed, and Paulson's name later appears in the context of Isabelle, and Huet's in the context of Coq.</p>\n<p>Due to limited space, unfortunately not all people contributing to existing projects could be mentioned.<br>\nFor example, I am well aware that Michael Norrish maintains and contributes to HOL4.<br>\nI apologize for having to restrict the presentation, mentioning only the initiators or project leaders.</p>\n<p>Kind regards,</p>\n<p>Ken Kubota</p>\n<hr>\n<p>Ken Kubota<br>\ndoi: 10.4444/100<br>\n<a href=\"http://dx.doi.org/10.4444/100\">http://dx.doi.org/10.4444/100</a></p>",
        "id": 294691067,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661177794
    }
]