[
    {
        "content": "<p>From: Graeme Smith &lt;<a href=\"mailto:smith@itee.uq.edu.au\">smith@itee.uq.edu.au</a>&gt;<br>\nLIST OF ACCEPTED PAPERS and CALL FOR PARTICIPATION</p>\n<p>Fifth International Conference on Integrated Formal Methods (IFM)</p>\n<p>November 30 - December 2, 2005<br>\n               Eindhoven, The Netherlands</p>\n<p><a href=\"http://www.win.tue.nl/ifm/\">http://www.win.tue.nl/ifm/</a></p>\n<p>INVITED SPEAKERS</p>\n<p>Patrice Godefroid - Bell Labs (USA)<br>\n  David Parnas - University of Limerick (Ireland), McMaster University (Canada)<br>\n  Doron Peled - University of Warwick (UK)</p>\n<p>INVITED TUTORIAL</p>\n<p>Holger Hermanns - Saarland University (Germany)</p>\n<p>VENUE</p>\n<p>IFM2005 is hosted by the Technische Universiteit Eindhoven<br>\n(TU/e). Eindhoven is the largest city of the southern Netherlands and<br>\nthe fifth largest in the Netherlands as a whole. It is a diverse city<br>\noffering innovation and technology, as well as cultural activities<br>\n(museums, theatre and music), and leading in sports such as swimming<br>\n(Olympic champion Pieter van den Hoogenband) and soccer (PSV). In the<br>\nregion of Eindhoven, well-known companies such as Philips, ASML and<br>\nDAF, and dozens of other engineering companies are situated.</p>\n<p>Eindhoven and the TU/e campus are easily reachable by plane (Eindhoven<br>\nAirport) and train (also from Schiphol Airport).</p>\n<p>REGISTRATION</p>\n<p>At the IFM web site, the registration page can be found. The early<br>\nregistration deadline is October 2nd, 2005.</p>\n<p>The registration fee includes a copy of the proceedings, attendance of<br>\nthe tutorial and the main conference, lunches, refreshments in the<br>\ncoffee breaks, a welcome reception, an excursion and dinner banquet.</p>\n<p>PROGRAM COMMITTEE CO-CHAIRS</p>\n<p>Jaco van de Pol, CWI, The Netherlands<br>\n  Judi Romijn, Eindhoven University of Technology, The Netherlands<br>\n  Graeme Smith, University of Queensland, Australia</p>\n<p>ACCEPTED PAPERS</p>\n<p>Adaptive Techniques for Specification Matching in Embedded Systems: A<br>\n  Comparative Study<br>\n  Robi Malik and Partha S. Roop</p>\n<p>A Fixpoint Semantics of Event Systems with and without Fairness<br>\n  Assumptions<br>\n  Hector Ruiz Barradas and Didier Bert</p>\n<p>Agile Formal Method Engineering<br>\n  Richard Paige and Phil Brooke</p>\n<p>An Automated Failure Mode and Effect Analysis based on High-Level<br>\n  Design Specification with Behavior Trees<br>\n  Lars Grunske, Peter Lindsay, Nisansala Yatapanage and Kirsten Winter</p>\n<p>An Integrated Framework for Scenarios and State Machines<br>\n  Bikram Sengupta and Rance Cleaveland</p>\n<p>Chunks: component verification in CSPB<br>\n  Helen Treharne, Steve Schneider and Neil Evans</p>\n<p>Consistency Checking of Sequence Diagrams and Statechart Diagrams<br>\n  Using the pi-Calculus<br>\n  Vitus Lam and Julian Padget</p>\n<p>Consistency in UML and B multi-view specifications<br>\n  Dieu Donne Okalas Ossami, Jean-Pierre Jacquot and Jeanine Souquieres</p>\n<p>CZT Support for Z Extensions<br>\n  Tim Miller, Leo Freitas, Petra Malik and Mark Utting</p>\n<p>Development of Fault Tolerant Grid Applications Using Distributed B<br>\n  Pontus Bostrom and Marina Walden</p>\n<p>Embedding the Stable Failures Model of CSP in PVS<br>\n  Kun Wei and James Heather</p>\n<p>Enabling Security Testing from Specification to Code<br>\n  Shane Bracher and Padmanabhan Krishnan</p>\n<p>Exp.Open 2.0: A flexible tool for combining partial order,<br>\n  compositional, and on-the-fly verification methods<br>\n  Frederic Lang</p>\n<p>Formal methods meet Domain Specific Languages<br>\n  Jean-Paul Bodeveix, Mamoun Filali, Julia Lawall and Gilles Muller</p>\n<p>Formalising Interactive Voice Services with SDL<br>\n  Kenneth Turner</p>\n<p>Model-based Prototyping of an Interoperability Protocol for Mobile<br>\n  Ad-hoc Networks<br>\n  Peder Christian Norgaard, Michael Westergaard and Lars Kristensen</p>\n<p>Synthesizing B Specifications from EB3 Attribute Definitions<br>\n  Frederic Gervais, Marc Frappier and Regine Laleau</p>\n<p>State/Event Software Verification for Branching-Time Specifications<br>\n  Sagar Chaki, Edmund Clarke, Orna Grumberg, Joel Ouaknine and Natasha<br>\n  Sharygina</p>\n<p>Translating Hardware Process Algebras into Standard Process Algebras<br>\n  -- Illustration with CHP and LOTOS<br>\n  Gwen Salaun and Wendelin Serwe</p>\n<p>SPONSORS</p>\n<p>IFM2005 is sponsored by FME and BCS-FACS.</p>",
        "id": 293896349,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660742813
    }
]