[
    {
        "content": "<p>From: Ramana Kumar &lt;<a href=\"mailto:rk436@cam.ac.uk\">rk436@cam.ac.uk</a>&gt;<br>\nHi all,</p>\n<p>I am using Isabelle2015. When I run Isabelle/jEdit, I can enter fullscreen<br>\nmode (F11). If I then try to exit fullscreen mode (press F11 again), the<br>\nentire window turns grey and I cannot see anything. (The mouse cursor would<br>\nindicate that the window is still there underneath the grey, though, since<br>\nit changes from a text cursor to a pointer cursor around where the buffer<br>\nchanges to the menu.)</p>\n<p>If I switch back to fullscreen mode, it comes back, but there is no way<br>\nback to non-fullscreen mode without restarting the prover. What could be<br>\nwrong? What can I do?</p>\n<p>Thanks,<br>\nRamana</p>",
        "id": 294650221,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661165800
    },
    {
        "content": "<p>From: Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt;<br>\nThis sounds like an odd Linux/X11 window manager problem.  Java/AWT makes <br>\ncertain assumptions that don't hold for recent forks and variations on <br>\nwindow managers.  Since there is so much choice of window managers on <br>\nLinux, the solution is to choose one that works: I am using Xfce4, for <br>\nexample.</p>\n<p>Makarius</p>",
        "id": 294650248,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661165812
    },
    {
        "content": "<p>From: Ramana Kumar &lt;<a href=\"mailto:rk436@cam.ac.uk\">rk436@cam.ac.uk</a>&gt;<br>\nHmm... well, to be honest, I'm very happy with my window manager (apart<br>\nfrom this possible interaction with unrealistic assumptions in Java/AWT).</p>\n<p>It's not yet obvious to me that the window manager is really the problem.<br>\nDoes anyone have any methods by which to analyse the situation further?</p>\n<p>[Perhaps I should just use a theorem prover IDE that works. There is choice<br>\nthere too :)]</p>",
        "id": 294650290,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661165835
    },
    {
        "content": "<p>From: Ramana Kumar &lt;<a href=\"mailto:rk436@cam.ac.uk\">rk436@cam.ac.uk</a>&gt;<br>\nThanks very much, Brian!</p>\n<p>Impersonating LG3D does appear to work.</p>\n<p>I also have set the _JAVA_AWT_WM_NONREPARENTING environment variable, but<br>\nonly setting that variable didn't work.</p>\n<p>I am surprised that just setting the environment variable didn't work,<br>\nsince the version of java (1.7.0) bundled with Isabelle2015 is quite<br>\nrecent. Does Isabelle's java require some special treatment of environment<br>\nvariables?</p>",
        "id": 294650309,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661165843
    },
    {
        "content": "<p>From: Brian Campbell &lt;<a href=\"mailto:Brian.Campbell@ed.ac.uk\">Brian.Campbell@ed.ac.uk</a>&gt;<br>\nLots of Java applications suffer from these problems.  I found some <br>\nworkarounds at</p>\n<p><a href=\"http://awesome.naquadah.org/wiki/Problems_with_Java\">http://awesome.naquadah.org/wiki/Problems_with_Java</a></p>\n<p>Trying them on a machine with the xmonad window manager I can get the <br>\nfullscreen problem to go away with \"wmname LG3D\".</p>\n<p>Brian</p>",
        "id": 294650329,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661165854
    },
    {
        "content": "<p>From: Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt;<br>\nThis is an ancient argument of Window manager projects versus Java/AWT. <br>\nFunnily, Sun made both the X11 WM specifications and Java at about the <br>\nsame time many decades ago, but it seems by different teams that did not <br>\nspeak to each other. The web is full of questions and answers about that, <br>\nit is futile to repeat that here.</p>\n<p>The official Isabelle Installation website solves the problem by this <br>\nintensional specification of Requirements for Linux:</p>\n<p>* Window manager / Desktop environment that works with Java/AWT/Swing</p>\n<p>Makarius</p>",
        "id": 294650341,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661165861
    },
    {
        "content": "<p>From: Matthew Fernandez &lt;<a href=\"mailto:matthew.fernandez@nicta.com.au\">matthew.fernandez@nicta.com.au</a>&gt;<br>\nFWIW this requirement seemed necessary but not sufficient to me in the past. Modern Isabelle works fine for me, but the first few Isabelle/jEdit releases were unusable on my then window manager (a Gnome/Xmonad hybrid), despite other Java AWT/Swing programs running fine. At the time I limped along on the slowly bitrotting Emacs setup and thankfully by the time this disappeared Makarius' improvements to the jEdit setup made it play nice with my window manager.</p>\n<hr>\n<p>The information in this e-mail may be confidential and subject to legal professional privilege and/or copyright. National ICT Australia Limited accepts no liability for any damage caused by this email or its attachments.</p>",
        "id": 294650358,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661165873
    },
    {
        "content": "<p>From: Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt;<br>\nCan you pin down anything specific that changed in the jEdit setup in this <br>\nrespect?  I don't think I did anything myself there, although there might <br>\nhave been positive side-effects from other tuning.</p>\n<p>I would guess it was merely Oracle ironing out some snags once again, but <br>\nthey cannot fully finish that without changing something fundamental in <br>\ntheir X11 vs. AWT approach.</p>\n<p>Since both X11 and AWT are legacy they might just wait until both are <br>\nphased out, although I have no idea if there is a clear vision of what <br>\nwill come after it.  Maybe Wayland + JavaFX?</p>\n<p>Makarius</p>",
        "id": 294650364,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661165879
    },
    {
        "content": "<p>From: Matthew Fernandez &lt;<a href=\"mailto:matthew.fernandez@nicta.com.au\">matthew.fernandez@nicta.com.au</a>&gt;<br>\nOn 25/08/15 19:56, Makarius wrote:</p>\n<blockquote>\n<p>On Tue, 25 Aug 2015, Matthew Fernandez wrote:</p>\n<blockquote>\n<blockquote>\n<ul>\n<li>Window manager / Desktop environment that works with Java/AWT/Swing</li>\n</ul>\n</blockquote>\n<p>FWIW this requirement seemed necessary but not sufficient to me in the past. Modern Isabelle works fine for me, but<br>\nthe first few Isabelle/jEdit releases were unusable on my then window manager (a Gnome/Xmonad hybrid), despite other<br>\nJava AWT/Swing programs running fine. At the time I limped along on the slowly bitrotting Emacs setup and thankfully<br>\nby the time this disappeared Makarius' improvements to the jEdit setup made it play nice with my window manager.</p>\n</blockquote>\n<p>Can you pin down anything specific that changed in the jEdit setup in this respect?  I don't think I did anything myself<br>\nthere, although there might have been positive side-effects from other tuning.</p>\n</blockquote>\n<p>I was never really sure. I suspect it was an upgrade of the JRE bundled with Isabelle. However, I don't know why this<br>\nhelped as I tried running standalone jEdit under the same JRE at the time and it had no problems. I did not investigate<br>\nin depth at the time as I had a viable workaround (Emacs).</p>\n<blockquote>\n<p>I would guess it was merely Oracle ironing out some snags once again, but they cannot fully finish that without changing<br>\nsomething fundamental in their X11 vs. AWT approach.</p>\n<p>Since both X11 and AWT are legacy they might just wait until both are phased out, although I have no idea if there is a<br>\nclear vision of what will come after it.  Maybe Wayland + JavaFX?</p>\n<p>Makarius</p>\n</blockquote>\n<hr>\n<p>The information in this e-mail may be confidential and subject to legal professional privilege and/or copyright. National ICT Australia Limited accepts no liability for any damage caused by this email or its attachments.</p>",
        "id": 294650463,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661165910
    }
]