[
    {
        "content": "<p>From: Christoph LANGE &lt;<a href=\"mailto:math.semantic.web@gmail.com\">math.semantic.web@gmail.com</a>&gt;<br>\nDo-Form: Enabling Domain Experts to use Formalised Reasoning<br>\n<a href=\"http://cs.bham.ac.uk/research/projects/formare/events/aisb2013\">http://cs.bham.ac.uk/research/projects/formare/events/aisb2013</a></p>\n<p>CALL FOR PARTICIPATION</p>\n<p>Symposium at the annual convention of the<br>\nAISB (Society for the Study of<br>\n  Artificial Intelligence and Simulation of Behaviour;<br>\n<a href=\"http://www.aisb.org.uk\">http://www.aisb.org.uk</a>)<br>\nUniversity of Exeter, UK<br>\n3-5 April 2013<br>\n<a href=\"http://emps.exeter.ac.uk/computer-science/research/aisb/\">http://emps.exeter.ac.uk/computer-science/research/aisb/</a><br>\n(early registration deadline 5 March)</p>\n<p>HANDS-ON TUTORIAL SESSIONS (details below) with</p>\n<ul>\n<li>M. Utku Ünver (matching markets)</li>\n<li>Peter Cramton (auctions)</li>\n<li>Neels Vosloo (finance markets regulation)<br>\n(<a href=\"http://www.cs.bham.ac.uk/research/projects/formare/events/aisb2013/invited.php\">http://www.cs.bham.ac.uk/research/projects/formare/events/aisb2013/invited.php</a>)</li>\n</ul>\n<p>PAPER and DEMO PRESENTATIONS on</p>\n<ul>\n<li>environmental models</li>\n<li>controlled natural languages</li>\n<li>ontologies</li>\n<li>auction theory</li>\n<li>software verification</li>\n<li>formal specification</li>\n<li>autonomous systems</li>\n<li>self-explaining systems<br>\n(<a href=\"http://www.cs.bham.ac.uk/research/projects/formare/events/aisb2013/proceedings.php\">http://www.cs.bham.ac.uk/research/projects/formare/events/aisb2013/proceedings.php</a>)</li>\n</ul>\n<p>This symposium is motivated by the long-term VISION of making information<br>\nsystems dependable.  In the past even mis-represented units of<br>\nmeasurements caused fatal ENGINEERING disasters.  In ECONOMICS, the<br>\nsubtlety of issues involved in good auction design may have led to low<br>\nrevenues in auctions of public goods such as the 3G radio spectra.<br>\nSimilarly, banks' value-at-risk (VaR) models – the leading method of<br>\nfinancial risk measurement – are too large and change too quickly to be<br>\nthoroughly vetted by hand, the current state of the art; in the London<br>\nWhale incident of 2012, JP Morgan claimed that its exposures were $67mn<br>\nunder one of its VaR models, and $129 under another one.  Verifying a<br>\nmodel's properties requires formally specifying them; for VaR models, any<br>\nwork would have to start with this most basic step, as regulators' current<br>\ndesiderata are subjective and ambiguous.</p>\n<p>We believe that these problems can be addressed by representing the<br>\nknowledge underlying such models and mechanisms in a formal, explicit,<br>\nmachine-verifiable way.  Contemporary computer science offers a wide<br>\nchoice of knowledge representation languages well supported by<br>\nverification tools.  Such tools have been successfully applied, e.g., for<br>\nverifying software that controls commuter rail or payment systems.  Still,<br>\nDOMAIN EXPERTS without a strong computer science background find it<br>\nchallenging to choose the right tools and to use them.  This symposium<br>\naims at investigating ways to support them.  Some problems can be<br>\naddressed now, others will bring new challenges to computer science.</p>\n<p>THE SYMPOSIUM is designed to bring domain experts and formalisers into<br>\nclose and fruitful contact with each other: domain experts will be able to<br>\npresent their fields and problems to formalisers; formalisers will be<br>\nexposed to new and challenging problem areas. We will combine talks and<br>\nhands-on sessions to ensure close interaction among participants from both<br>\nsides.</p>\n<p>World-class economists will offer HANDS-ON TUTORIAL SESSIONS on the<br>\nfollowing topics:</p>\n<ul>\n<li>\n<p>MATCHING MARKETS (M. Utku Ünver, Boston College): These include matching<br>\n  students to schools, interns to hospitals, and kidney donors to<br>\n  recipients. See the documentation for the 2012 Nobel Memorial Prize in<br>\n  Economic Sciences for more background information.</p>\n</li>\n<li>\n<p>AUCTIONS (Peter Cramton, University of Maryland): Peter has been working<br>\n  on auctions for Ofcom UK (4G spectrum auction), the UK Department of the<br>\n  Environment and Climate Change, and others – and most recently on the<br>\n  “applicant auctions” for the new top-level Internet domains issued by the<br>\n  ICANN.</p>\n</li>\n<li>\n<p>FINANCE MARKETS REGULATION (Neels Vosloo, Financial Services Authority,<br>\n  UK): It is currently impossible for regulators to properly inspect risk<br>\n  management models. Test portfolios are a promising tool for identifying<br>\n  problems with risk management models. To what extent can techniques from<br>\n  mechanised reasoning automate some of the inspection process?</p>\n</li>\n</ul>\n<p>COMMENTS/QUESTIONS/ENQUIRIES to be sent to <a href=\"mailto:DoForm2013@easychair.org\">DoForm2013@easychair.org</a></p>",
        "id": 294234439,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660904133
    }
]