[
    {
        "content": "<p>From: Peter Lammich &lt;<a href=\"mailto:lammich@in.tum.de\">lammich@in.tum.de</a>&gt;<br>\nFirst experience with RC1, in the default configuration:</p>\n<p>The thing went in a greyout very quickly, on a relatively small project<br>\n(approx. 50 files), and the greyout did not recover within reasonable<br>\ntime.</p>\n<p>Essentially, it was only loading $AFP/{Show,Native_Word,Deriving},<br>\nbefore it greyed out.</p>\n<p>I'm now trying to copy some settings from Isabelle2015, always<br>\nforgetting and having to grab the mail archives to remember what the<br>\ncrucial settings are, and how they have to be applied.</p>",
        "id": 294662537,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661170468
    },
    {
        "content": "<p>From: Peter Lammich &lt;<a href=\"mailto:lammich@in.tum.de\">lammich@in.tum.de</a>&gt;<br>\nHi all,  </p>\n<p>Sorry, this was a false alarm. The thing was stuck at an error on an invalid<br>\ntheory path quite early in the dependencies. The error was displayed as a<br>\nsmall red bar in the theories panel, but I simply overlooked it ...  </p>\n<p>Is there another view that is more suitable to spot errors in big projects<br>\nwith dozens or even hundreds of theories?  </p>\n<p>Peter</p>\n<p>\\-------- Originalnachricht --------</p>",
        "id": 294662677,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661170525
    },
    {
        "content": "<p>From: Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt;<br>\nOn Thu, 21 Jan 2016, Peter Lammich wrote:</p>\n<blockquote>\n<p>Sorry, this was a false alarm. The thing was stuck at an error on an <br>\ninvalid theory path quite early in the dependencies. The error was <br>\ndisplayed as a small red bar in the theories panel, but I simply <br>\noverlooked it ...</p>\n</blockquote>\n<p>OK.</p>\n<p>Also note that the word \"grey out\" no longer makes sense in Isabelle2016, <br>\nbecause the \"greying\" is restricted to the small text overview column, so <br>\n\"out\" is not applicable: the main text view remains fully coloured.</p>\n<blockquote>\n<p>Is there another view that is more suitable to spot errors in big <br>\nprojects with dozens or even hundreds of theories?</p>\n</blockquote>\n<p>The places to look are the Theories panel and the text overview column (of <br>\nindividual text areas).  The latter now shows everything for the document <br>\nnode, thus it is a small improvement.</p>\n<p>Bigger improvements need to wait until there is a separate \"Messages\" <br>\npanel, or similar.  It was meant to come shortly after the \"State\" panel, <br>\nbut that caused so many social problems that it sucked up much more <br>\nresources than anticipated.</p>\n<p>In summary: I always need tangible and constructive problem reports; then <br>\nthings can be improved.</p>\n<p>Makarius</p>",
        "id": 294662691,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661170529
    },
    {
        "content": "<p>From: Lars Hupel &lt;<a href=\"mailto:hupel@in.tum.de\">hupel@in.tum.de</a>&gt;<br>\n(This refers to RC2.)</p>\n<p>While this is true, the behaviour described by \"greyout\" still occurs.<br>\nIn RC2 there is no way I can see when that happens; I just see \"stale\"<br>\nproof state/output/markup and have no idea what's going on.</p>\n<p>Cheers<br>\nLars</p>",
        "id": 294663454,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661170806
    },
    {
        "content": "<p>From: Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt;<br>\nDo you have an impression that it occurs less frequently?  E.g. due to <br>\nvarious measures in Isabelle2016-RC to require less heap space.</p>\n<p>The Monitor panel is now safe to keep open at all time.  Maybe you can <br>\nkeep an eye on the ML heap and tell me later about it.</p>\n<p>Makarius</p>",
        "id": 294663486,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661170812
    },
    {
        "content": "<p>From: Lars Hupel &lt;<a href=\"mailto:hupel@in.tum.de\">hupel@in.tum.de</a>&gt;</p>\n<blockquote>\n<p>Do you have an impression that it occurs less frequently?  E.g. due to<br>\nvarious measures in Isabelle2016-RC to require less heap space.</p>\n</blockquote>\n<p>Yes, this is my gut feeling, but not a firm conviction.</p>\n<blockquote>\n<p>The Monitor panel is now safe to keep open at all time.  Maybe you can<br>\nkeep an eye on the ML heap and tell me later about it.</p>\n</blockquote>\n<p>I will try to do that.</p>\n<p>Cheers<br>\nLars</p>",
        "id": 294663666,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661170886
    },
    {
        "content": "<p>From: Simon Wimmer &lt;<a href=\"mailto:wimmersimon@gmail.com\">wimmersimon@gmail.com</a>&gt;<br>\nI second that. Additionally, on RC2 I (Mac OS X) occasionally see a<br>\nspinning multi-colored circle, which might stick with me for an indefinite<br>\namount of time during which I cannot make any input. I didn't experience<br>\nthis with Isabelle 2015.</p>",
        "id": 294664221,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661171107
    },
    {
        "content": "<p>From: Manuel Eberl &lt;<a href=\"mailto:eberlm@in.tum.de\">eberlm@in.tum.de</a>&gt;<br>\nI've noticed that, too. Occasionally, especially when loading a large <br>\nnumber of theories inti Isabelle/JEdit (e.g. HOL) and going back and <br>\nforth a bit or when letting non-terminating proof methods run for more <br>\nthan a few seconds, the state output that I get does not get updated <br>\nanymore with no indication that it is \"stale\".</p>\n<p>Another recurring problem that I noticed is that sometimes, when loading <br>\ne.g. HOL, if one jumps into the middle of one of the theories to be <br>\nbuilt while the theories have not all finished building, Isabelle will <br>\nstart building /all/ of them from the beginning /again/.</p>\n<p>This behaviour is somewhat sporadic and despite some effort, I have not <br>\nbeen able to reproduce it properly, so I did not report it before. I <br>\nmust also admit that I noticed this behaviour with pre-RC Isabelle; I've <br>\nnot had enough opportunity to use Isabelle enough inbetween to see <br>\nwhether this occurs with the RC as well, but Lars' and Simon's mail seem <br>\nto indicate that it does.</p>\n<p>Cheers,</p>\n<p>Manuel</p>",
        "id": 294665715,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661171690
    },
    {
        "content": "<p>From: Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt;<br>\nThis should normally happen only when the responsibility of 'ML_file' <br>\nsources changes from prover to editor. When you click on a source file for <br>\nthe first time, overall checking recommences at that point.</p>\n<p>That is a concession to resource usage. If everything would be managed by <br>\nthe editor by default, the HOL session could no longer be edited in 8GB <br>\nmemory.</p>\n<p>Makarius</p>",
        "id": 294666266,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661171874
    },
    {
        "content": "<p>From: Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt;<br>\nThis is the \"beachball of death\" by Apple.  It means the GUI process is <br>\nsomehow irresponsive.</p>\n<p>There might be a JVM heap problem, when it approaches 100% of the given <br>\nlimit.</p>\n<p>The heap size is shown in the footline in the right corner.  If that gets <br>\ntoo high in practical work, you can try with more heap space by editing <br>\n<a href=\"http://Isabelle.app/Contents/Info.plist\">Isabelle.app/Contents/Info.plist</a> near the bottom; the default is 2560m.<br>\nThe application needs to be restarted.</p>\n<p>Makarius</p>",
        "id": 294667536,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661172285
    }
]