[
    {
        "content": "<p>From: Luís Caires &lt;<a href=\"mailto:luis.caires@di.fct.unl.pt\">luis.caires@di.fct.unl.pt</a>&gt;<br>\nThe Center of Informatics and Information Technology (CITI) at the<br>\nDepartment of Informatics of FCT/Universidade Nova de Lisboa welcomes<br>\napplications for one (1) post-doctoral scholarship position in the  <br>\nareas of<br>\nprogramming languages and logic in computer science.</p>\n<p><strong>* DEADLINE 15 JUNE 08 </strong>**</p>\n<p>The position is funded in the context of the CMU-Portugal research /<br>\neducational collaborative framework launched by the Portuguese<br>\nFoundation for Science and Technology and the Carnegie-Mellon<br>\nUniversity (<a href=\"http://www.cmuportugal.org\">www.cmuportugal.org</a>).</p>\n<p>The scholarship will start from middle 2008, and will be extensible up<br>\nto 4 years, renewable on a yearly basis.</p>\n<p>The admin rules applicable may be found in the FCT/MCTES site in<br>\n<a href=\"http://alfa.fct.mctes.pt/apoios/bolsas/\">http://alfa.fct.mctes.pt/apoios/bolsas/</a>.</p>\n<p>The successful candidate will contribute for the development of the<br>\nongoing research collaboration between CITI / DI FCT UNL and the<br>\nCarnegie Mellon Department of Computer Science on the general themes of<br>\nsoftware foundations, involving the teams of Frank Pfenning at CMU and<br>\nour team at UNL. The main objective of the project is the development<br>\nof logical techniques and tools, based on substructural logics for<br>\nconcurrency, for reasoning about general concurrent and distributed<br>\nsystems. The project is also expected to seed the integration of<br>\nstudents in the Dual Degree PhD Program in Computer Science of the<br>\nICTI/CMU-Portugal partnership.</p>\n<p>We prefer applicants with strong interest and experience in some of<br>\nthe following topics: foundations of programming languages,<br>\nprogramming language design, logics in computer science, concurrency<br>\ntheory.</p>\n<p>The hosting environment will be the Programming Languages Research<br>\nStream of the CITI, with regular visits to CMU.  More information<br>\nabout the CITI research environment and its members may be found at<br>\nthe website: <a href=\"http://citi.di.fct.unl.pt\">citi.di.fct.unl.pt</a>.</p>\n<p>Applications should include a curriculum vitae in pdf format and<br>\nshould be sent to</p>\n<p>CITI - Centro de Informatica e Tecnologias da Informação<br>\nFaculdade de Ciências e Tecnologia, Universidade Nova de Lisboa<br>\n2829-516 Caparica, Portugal</p>\n<p>E-mail: <a href=\"mailto:citi-admin@di.fct.unl.pt\">citi-admin@di.fct.unl.pt</a><br>\nTelephone: +351 212 948 536<br>\nFax: +351 212 948 541</p>\n<p>Please email me for any further questions about the position and<br>\nthe related projects,</p>\n<p>Best regards,</p>\n<p>Luis Caires</p>\n<p>=============================================<br>\nGeneral Info on CITI (<a href=\"http://citi.di.fct.unl.pt\">citi.di.fct.unl.pt</a>)</p>\n<p>The CITI (Centro de Informática e Tecnologias da Informação - Centre<br>\nfor Informatics and Information Technologies ) is a research center<br>\npartially funded by the Portuguese National Science Foundation<br>\n(Fundação para a Ciência e Tecnologia) and by the Universidade Nova de<br>\nLisboa, Faculty of Sciences and Technology (FCT/UNL), Department of<br>\nInformatics, where it is hosted since its foundation in 1997.</p>\n<p>CITI's research team is currently composed by more that 50<br>\nresearchers, with a broad coverage of classical and emergent topics<br>\nranging from theoretical foundations to applications, and is one of<br>\nthe largest research units in Computer Science and Informatics in<br>\nPortugal.</p>",
        "id": 294060878,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660823636
    }
]