[
    {
        "content": "<p>From: M A &lt;<a href=\"mailto:tesleft@hotmail.com\">tesleft@hotmail.com</a>&gt;<br>\nHi </p>\n<ol>\n<li>which libraries are needed to write lemma to find subgoal to observe some functional code?for example, can we import list and complete_lattice or lattice and write associative and distributive lemma and find some subgoals to do functional programming in haskell code for lattice ?</li>\n<li>can three lemmas write into one statement by lemma \"(A) ^ (B) V (C)\" in order to find algorithms for using 3 lemmas by observe the subgoals? <br>\nRegards,<br>\nMartin</li>\n</ol>",
        "id": 294315966,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660925487
    },
    {
        "content": "<p>From: Lawrence Paulson &lt;<a href=\"mailto:lp15@cam.ac.uk\">lp15@cam.ac.uk</a>&gt;<br>\nI’m afraid that your questions are not very clear. This is partly because of your use of English and partly because you seem to have an unusual application.</p>\n<p>I think that you will need to find a colleague who can help you express your questions more clearly.</p>\n<p>Larry Paulson</p>",
        "id": 294315993,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660925496
    },
    {
        "content": "<p>From: M A &lt;<a href=\"mailto:tesleft@hotmail.com\">tesleft@hotmail.com</a>&gt;<br>\nHi Lawrence, </p>\n<ol>\n<li>\n<p>I mean that by writing some lemmas and observe the subgoal when prove lemma for lattice, hope to see<br>\nthe function body about writing lattice application in Haskell</p>\n</li>\n<li>\n<p>can multiple lemmas write into one lemma to be proved and observe the subgoals to know the function body?</p>\n</li>\n</ol>\n<p>Regards,</p>\n<p>Martin</p>",
        "id": 294316008,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660925502
    },
    {
        "content": "<p>From: M A &lt;<a href=\"mailto:tesleft@hotmail.com\">tesleft@hotmail.com</a>&gt;<br>\nHi </p>\n<p>I means the application code for lattice such as addition of lattice, multiply of lattice and use which collection such as list for storing lattice for creating lattice in Haskell code and change meet and join definition into Haskell code </p>\n<p>Regards,</p>\n<p>Martin</p>",
        "id": 294316024,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660925508
    }
]