[
    {
        "content": "<p>From: Pascal Fontaine &lt;<a href=\"mailto:Pascal.Fontaine@loria.fr\">Pascal.Fontaine@loria.fr</a>&gt;<br>\nApologies for multiple copies</p>\n<p>FIRST CALL FOR PAPERS</p>\n<p>FroCoS 2013<br>\n   9th International Symposium on Frontiers of Combining Systems<br>\n                           Nancy, France<br>\n                       September 18-20, 2013</p>\n<p>Submission Deadlines: 15 Apr 2013 (Abs.), 22 Apr 2013 (Paper)<br>\n<a href=\"http://frocos2013.loria.fr/\">http://frocos2013.loria.fr/</a></p>\n<p>GENERAL INFORMATION<br>\n   The 9th International Symposium on Frontiers of Combining<br>\n   Systems will be held in Nancy, France, from 18-20 September<br>\n   2013. The aim of the conference is to publish and promote<br>\n   progress in research areas requiring the development of general<br>\n   techniques and methods for the combination and integration of<br>\n   special, formally defined systems, as well as for the analysis<br>\n   and modularization of complex systems.<br>\n   FroCos 2013 will be co-located with the 22nd International<br>\n   Conference on Automated Reasoning with Analytic Tableaux and<br>\n   Related Methods (TABLEAUX 2013) held 16-19 September 2013. A<br>\n   joint invited speaker and joint session is planned.</p>\n<p>SCOPE OF CONFERENCE:<br>\n   In various areas of computer science, such as logic, computation,<br>\n   program development and verification, artificial intelligence,<br>\n   knowledge representation, and automated reasoning, there is an<br>\n   obvious need for using specialized formalisms and inference<br>\n   mechanisms for special tasks. To be usable in practice, these<br>\n   specialized systems must be combined with each other, and must be<br>\n   integrated into general purpose systems. This has led in many<br>\n   research areas to the development of general techniques and<br>\n   methods for the combination and integration of special, formally<br>\n   defined systems, as well as for the analysis and modularization<br>\n   of complex systems.<br>\n   The International Symposium on Frontiers of Combining Systems<br>\n   (FroCoS) traditionally focusses on these types of research<br>\n   questions and activities. Like its predecessors, FroCoS 2013<br>\n   seeks to offer a common forum for research in the general area<br>\n   of combination, modularization and integration of systems, with<br>\n   emphasis on logic-based ones, and of their practical use.</p>\n<p>Typical topics of interest include (but are not limited to):</p>\n<p>* combinations of logics such as combined higher-order,<br>\n       first-order, temporal, modal, or other non-classical logics;</p>\n<p>* combinations and modularity in ontologies;<br>\n     * combination of decision procedures, of satisfiability<br>\n       procedures, of constraint solving techniques or of logical<br>\n       frameworks;</p>\n<p>* combination and integration methods in SAT and SMT solving;<br>\n     * combinations and modularity in term rewriting;<br>\n     * integration of equational and other theories into deductive<br>\n       systems;</p>\n<p>* combination of deduction systems and computer algebra;<br>\n     * integration of data structures into constraint logic<br>\n       programming and deduction;</p>\n<p>* hybrid methods for deduction, resolution and constraint<br>\n       propagation;</p>\n<p>* hybrid systems in knowledge representation and natural<br>\n       language semantics;</p>\n<p>* combined logics for distributed and multi-agent systems;<br>\n     * logical aspects of combining and modularizing programs and<br>\n       specifications.</p>\n<p>PUBLICATION DETAILS:<br>\n   It is planned that the proceedings of FroCoS 2013 will be published<br>\n   in the Springer LNCS/LNAI Series.</p>\n<p>PAPER SUBMISSIONS<br>\n   The program committee seeks high-quality submissions describing<br>\n   original work, written and to be presented in English, not<br>\n   substantially overlapping with published or simultaneously<br>\n   submitted work to a journal or conference with archival<br>\n   proceedings. Selection criteria include accuracy and originality<br>\n   of ideas, clarity and significance of results, and quality of<br>\n   presentation. The page limit in Springer LNCS style is 16 pages.</p>\n<p>Papers must be edited in LaTeX using the llncs style and must be<br>\n   submitted electronically as PDF files via the EasyChair system:<br>\n<a href=\"https://www.easychair.org/conferences/?conf=frocos2013\">https://www.easychair.org/conferences/?conf=frocos2013</a>.</p>\n<p>For each accepted paper, at least one author is required to<br>\n   attend the symposium to present the work. Prospective authors<br>\n   must register a title and an abstract a week before the paper<br>\n   submission deadline. Further information about paper submissions<br>\n   will be available at the conference website.</p>\n<p>IMPORTANT DATES   15 Apr 2013     Abstract submission<br>\n   22 Apr 2013     Paper submission<br>\n    6 Jun 2013     Notification of paper decisions<br>\n    4 Jul 2013     Camera-ready papers due<br>\n   18-20 Sep 2013  FroCoS Conference</p>\n<p>PROGRAM COMMITTEE<br>\n   Carlos Areces, FaMAF - Universidad Nacional de Cordoba, Argentina<br>\n   Alessandro Artale, Free University of Bolzano-Bozen, Italy<br>\n   Franz Baader, TU Dresden, Germany<br>\n   Clark Barrett, New York University, USA<br>\n   Peter Baumgartner, National ICT Australia, Canberra, Australia<br>\n   Christoph Benzmueller, Free University Berlin, Germany<br>\n   Jasmin Christian Blanchette, TU Muenchen, Germany<br>\n   Thomas Bolander, Technical University of Denmark<br>\n   Clare Dixon, University of Liverpool, UK<br>\n   Francois Fages, INRIA Rocquencourt, France<br>\n   Pascal Fontaine, LORIA, INRIA, University of Lorraine, France<br>\n   Didier Galmiche, LORIA, University of Lorraine, France<br>\n   Vijay Ganesh, University of Waterloo, Canada<br>\n   Silvio Ghilardi, Universita degli Studi di Milano, Italy<br>\n   Guido Governatori, National ICT Australia, Queensland, Australia<br>\n   Bernhard Gramlich, Technische Universitaet Wien, Austria<br>\n   Katsumi Inoue, National Institute of Informatics, Japan<br>\n   Sava Krstic, Intel, USA<br>\n   Alessio Lomuscio, Imperial College London, UK<br>\n   Till Mossakowski, DFKI &amp; University of Bremen, Germany<br>\n   Silvio Ranise, Fondazione Bruno Kessler, Italy<br>\n   Christophe Ringeissen, LORIA, INRIA, France<br>\n   Philipp Ruemmer, Uppsala University, Sweden<br>\n   Renate Schmidt, The University of Manchester, UK<br>\n   Roberto Sebastiani, DISI, University of Trento, Italy<br>\n   Viorica Sofronie-Stokkermans, University Koblenz-Landau, Germany<br>\n   Andrzej Szalas, Linkoepings Universitet, Sweden &amp; University of <br>\nWarsaw, Poland<br>\n   Rene Thiemann, University of Innsbruck, Austria<br>\n   Ashish Tiwari, SRI, USA<br>\n   Josef Urban, Radboud University, The Netherlands<br>\n   Christoph Weidenbach, Max-Planck-Institut fuer Informatik, Germany<br>\n   Frank Wolter, University of Liverpool, UK</p>\n<p>CONFERENCE CHAIR<br>\n   Christophe Ringeissen, LORIA, INRIA, France</p>\n<p>PC CHAIRS<br>\n   Pascal Fontaine, LORIA, INRIA, University of Lorraine, France<br>\n   Renate A. Schmidt, The University of Manchester, UK</p>",
        "id": 294226248,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660900130
    }
]