[
    {
        "content": "<p>From: Freek Verbeek &lt;<a href=\"mailto:freek@vt.edu\">freek@vt.edu</a>&gt;<br>\nA postdoctoral position is available with the Systems Software Research<br>\nGroup (<a href=\"http://www.ssrg.ece.vt.edu\">http://www.ssrg.ece.vt.edu</a>) at Virginia Tech (<a href=\"https://vt.edu/\">https://vt.edu/</a>) on a<br>\nproject that is investigating verification of x86 machine code. The project<br>\nvision involves formalizing x86-64 semantics, decompiling program binaries,<br>\nand investigating techniques to reason about program behaviors, all inside<br>\na theorem-prover.</p>\n<p>Recent computer science or computer engineering PhD graduates with<br>\nbackground and expertise in theorem provers such as Isabelle/HOL, Coq, or<br>\nACL2, and with an affinity for defining the formal semantics of languages<br>\nis sought. We seek candidates with a solid background in at least one of<br>\nthe following topics:</p>\n<p>Theorem proving / formal semantics<br>\nx86 architecture<br>\nConcurrency<br>\nFloating point semantics</p>\n<p>Interested candidates should send a CV and cover letter to Dr. Freek<br>\nVerbeek (<a href=\"mailto:freek@vt.edu\">freek@vt.edu</a>). Please indicate in your email that you are applying<br>\nfor a postdoc position. The position is for one year, with strong<br>\npossibilities for additional years. The start date is flexible, but we aim<br>\nto fill the position as soon as possible. Please also contact Dr. Verbeek (<br>\n<a href=\"mailto:freek@vt.edu\">freek@vt.edu</a>) for any questions.</p>",
        "id": 294728404,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661187160
    },
    {
        "content": "<p>From: Freek Verbeek &lt;<a href=\"mailto:freek@vt.edu\">freek@vt.edu</a>&gt;<br>\nA postdoctoral position is available with the Systems Software Research Group (<a href=\"http://www.ssrg.ece.vt.edu\">http://www.ssrg.ece.vt.edu</a> &lt;<a href=\"http://www.ssrg.ece.vt.edu/\">http://www.ssrg.ece.vt.edu/</a>&gt;) at Virginia Tech (<a href=\"https://vt.edu/\">https://vt.edu/</a> &lt;<a href=\"https://vt.edu/\">https://vt.edu/</a>&gt;) on a project that is investigating verification of x86 machine code. The project vision involves formalizing x86-64 semantics, decompiling program binaries, and investigating techniques to reason about program behaviors, all inside a theorem-prover.</p>\n<p>Recent computer science or computer engineering PhD graduates with background and expertise in theorem provers such as Isabelle/HOL, Coq or ACL2, and with an affinity for defining the formal semantics of languages is sought. We seek candidates with a solid background in at least one of the following topics:</p>\n<p>Theorem proving<br>\nx86 architecture<br>\nConcurrency</p>\n<p>Interested candidates should send a CV and cover letter to Dr. Freek Verbeek (<a href=\"mailto:freek@vt.edu\">freek@vt.edu</a> &lt;mailto:<a href=\"mailto:freek@vt.edu\">freek@vt.edu</a>&gt;). Please indicate in your email that you are applying for a postdoc position. The position is for one year, with strong possibilities for additional years. The start date is flexible, but we aim to fill the position as soon as possible. Please also contact Dr. Verbeek (<a href=\"mailto:freek@vt.edu\">freek@vt.edu</a> &lt;mailto:<a href=\"mailto:freek@vt.edu\">freek@vt.edu</a>&gt;) for any questions.</p>",
        "id": 294757124,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661198001
    }
]