[
    {
        "content": "<p>From: Christoph LANGE &lt;<a href=\"mailto:math.semantic.web@gmail.com\">math.semantic.web@gmail.com</a>&gt;<br>\nHi Makarius,</p>\n<p>a minor bug in Isabelle2013-1-RC1: suppose I open a README-like file in<br>\nthe documentation panel, and then switch to some other file.  When I<br>\nclick the file's documentation panel entry once more, nothing happens,<br>\nprobably because the documentation panel thinks \"the file is already<br>\nopen anyway\".  But I would expect that this action takes me back to the<br>\nfile.</p>\n<p>Cheers,</p>\n<p>Christoph</p>",
        "id": 294252795,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660911416
    },
    {
        "content": "<p>From: Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt;<br>\nAgain the meaningless \"b**\" word. (The problem with the \"bug\" and \"fix\" <br>\npair is that it gives you the false impression of a clearly isolated <br>\nproblem that gets solved once and for all afterwards, but this is hardly <br>\never the case in reality).</p>\n<p>I've noticed this slightly surprising behaviour myself, but did not manage <br>\nto improve the situation fundamentally for this release.  The existance of <br>\nthe documumentation panel is already a step forward, and we never stop <br>\nmoving forward anyway, so further refinements can be left for future <br>\nreleases.</p>\n<p>The Documentation panel is one of the many things that look trivial, but <br>\nexpose a long story of grand failure of modern operating systems: so far I <br>\ndid not find a reliable way to open PDF documents on all platforms without <br>\nany potential for surprise.  On Mac OS X, I even have to bypass the <br>\nstandard PDF viewer and \"abuse\" Safari for that job -- this will probably <br>\nchange again when we no longer support Snow Leopard.</p>\n<p>In general, jEdit has minimal control on launching the viewer and no <br>\nproper way to confirm its success.  So it only takes the first click on <br>\nthe tree view into account, fires up the viewer, and hopes for the best.<br>\nIn most practical situations, this will approximate on idempoent open <br>\noperation on the PDF.</p>\n<p>I could have made a special case for internal text files of jEdit, but <br>\nthis is in danger to cause more trouble elsewhere, with an exponential <br>\nblowup of special cases here and there.  (I actually did consider it <br>\nbriefly for that very special special case, but dismissed the idea a few <br>\ndays ago.)</p>\n<p>Makarius</p>",
        "id": 294252879,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660911459
    }
]