[
    {
        "content": "<p>From: Andrei Popescu &lt;<a href=\"mailto:uuomul@yahoo.com\">uuomul@yahoo.com</a>&gt;<br>\nI am using Isabelle2009-1 with emacs22-gtk, admittedly in a very poor environment:</p>\n<p>Ubuntu 8.10<br>\nIntel(R) Core(TM) 2 CPU T5500 @ 1.66 Ghz<br>\nMemory: 493.2 MiB</p>\n<p>Free disk space: 69 MiB<br>\n(I only use Ubuntu on a small disk partition)</p>\n<p>The problem is that occasionally Isabelle takes a very long time while performing operations such as moving to a new theory or theorem or digesting a new definition, and I don't know what she is <em>really</em> doing then. (By a long time, I mean minutes, and sometimes tens of minutes.)<br>\nThis tends to occur more often when I am trying to process whole buffers, when Isabelle takes 10-15-minute breaks from time to time.  <br>\nI also noticed that when I set AutoQuickCheck, AutoSolve and ParallelProofs off, such problems occur less often, but still do.  <br>\nAlso, the problem seems to increase with the size of the graph of theories on which the current theory depends on, but has a large degree of randomness.  I did not have these problems with the previous release.  </p>\n<p>A related problem is that trying to run a (large-enough) session takes forever.  </p>\n<p>I shall eventually get a better computer system, but until then I would really like to survive with what I have here.  (Notice also that my disk status does not really allow me to install new things.)  Help!  </p>\n<p>Best regards, <br>\n   Andrei</p>",
        "id": 294098104,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660832929
    },
    {
        "content": "<p>From: Tobias Nipkow &lt;<a href=\"mailto:nipkow@in.tum.de\">nipkow@in.tum.de</a>&gt;<br>\nAutoQuickCheck and AutoSolve only come into effect when you execute a<br>\ntheory step by step. If you load a whole theory, they are disabled.</p>\n<p>Tobias</p>\n<p>Andrei Popescu wrote:</p>",
        "id": 294098562,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660833062
    },
    {
        "content": "<p>From: Makarius &lt;<a href=\"mailto:makarius@sketis.net\">makarius@sketis.net</a>&gt;<br>\nI would say this is just a consequence the natural growth of a system over <br>\ntime, which is also known as \"bloat\".  The long delays might be due to <br>\nswapping virtual memory on hard disk.  Using \"top\" in a text terminal <br>\nshould tell you if the main fault is due to Isabelle itself (cf. the <br>\n\"poly\" process) or Proof General (cf. the \"emacs\" process).</p>\n<p>You can recover some disk space as follows:</p>\n<p>* Reduce Isabelle2009-1/contrib/polyml-5.3.0 to the bare minimum,<br>\n     keeping only the x86-linux subdirectory (saves about 70 MB).</p>\n<p>* Rebuild the HOL logic image without proof terms, or build the more<br>\n     frugal HOL-Main image instead, like this:</p>\n<p>Isabelle2009-1/build HOL</p>\n<p>or</p>\n<p>Isabelle2009-1/build HOL -m HOL-Main</p>\n<p>This should save 20-40 MB; see the Isabelle2009-1/heaps directory.<br>\n     You can also delete the Pure image after building, to save a few MBs.</p>\n<p>Makarius</p>",
        "id": 294099017,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660833191
    }
]