[
    {
        "content": "<p>From: Marco Bozzano &lt;<a href=\"mailto:bozzano@fbk.eu\">bozzano@fbk.eu</a>&gt;<br>\n[[[ Apologies for multiple copies of this message ]]]</p>\n<p>Doctoral Student Positions Available</p>\n<p>Design and Verification of Embedded Software</p>\n<p>Embedded System Research Unit<br>\n                         Fondazione Bruno Kessler<br>\n    (formerly part of IRST - Centro per la Ricerca Scientifica e <br>\nTecnologica)<br>\n                              Trento, Italy</p>\n<p>Deadlines:  May 31, 2008</p>\n<p>The Embedded System Research Unit (<a href=\"http://es.fbk.eu\">http://es.fbk.eu</a>) of the Bruno<br>\nKessler Foundation, Trento, Italy, is seeking several candidates for Ph.D<br>\npositions.</p>\n<p>The Ph.D. studies will be held at the International Doctorate School<br>\nin Information and Communication Technologies<br>\n(<a href=\"http://www.ict.unitn.it/\">http://www.ict.unitn.it/</a>) of the University of Trento, Italy.</p>\n<p>The research activity will be carried out within the Embedded Systems<br>\nUnit of the Center for Scientific and Technological Research of the<br>\nFondazione Bruno Kessler.</p>\n<p>The research activity will aim at techniques, methodologies and support<br>\ntools for the design and verification of embedded systems. In<br>\nparticular, possible topics will include:</p>\n<ul>\n<li>Embedded Software Design and Verification</li>\n<li>Formal Requirements Analysis</li>\n<li>Design and Verification of Hybrid and Timed systems</li>\n</ul>\n<p>The selected candidates will be initially enrolled in a stage and, if<br>\nthey pass the selection of the Ph.D. school, they will be enrolled as<br>\nPh.D. students. Ph.D. courses will start in Autumn 2008, and the<br>\nthesis must be completed in three or four years. People enrolled in a<br>\nstage and subsequent Ph.D. courses are expected to move to Trento, and<br>\nwill receive monetary support during both phases of their activity.</p>\n<p>Candidate Profile<br>\n=================</p>\n<p>The ideal candidate should have an MS or equivalent degree in computer<br>\nscience, mathematics or electronic engineering, and combine solid<br>\ntheoretical background and software development skills.</p>\n<p>The candidate should be able to work in a collaborative environment,<br>\nwith a strong commitment to reaching research excellence and achieving<br>\nassigned objectives.</p>\n<p>Background knowledge and/or previous experience in the following<br>\nareas, though not mandatory, will be considered favorably:</p>\n<ul>\n<li>Symbolic Model Checking,</li>\n<li>Propositional Satisfiability,</li>\n<li>Satisfiability Modulo Theory,</li>\n<li>Constraint Solving and Optimization,</li>\n<li>Formal Requirements Analysis,</li>\n<li>Software Verification,</li>\n<li>Software Synthesis,</li>\n<li>\n<p>Embedded System Design Languages (e.g. Verilog, VHDL, System C, and<br>\n     System Verilog),</p>\n</li>\n<li>\n<p>Safety Analysis (FTA, FMEA).</p>\n</li>\n</ul>\n<p>Applications and Inquiries<br>\n==========================</p>\n<p>Interested candidates should inquire for further information and/or<br>\napply by sending email to &lt;jobs[at]fbk[dot]eu&gt;.</p>\n<p>Applications should contain a statement of interest, with a Curriculum<br>\nVitae, and three reference persons. PDF format is strongly encouraged.</p>\n<p>Emails will be automatically processed and should have</p>\n<p>'RIF: ES/phd'</p>\n<p>as subject.</p>\n<p>The Embedded System Research Unit<br>\n=================================</p>\n<p>The Embedded Systems Unit consists of about 15 persons, including<br>\nresearchers, post-Doc, Ph.D. students, and programmers. The<br>\nUnit carries out research, tool development and technology transfer in<br>\nthe fields of design and verification of embedded systems.</p>\n<p>Current research directions include:</p>\n<ul>\n<li>\n<p>Satisfiability Modulo Theory, and its application to the<br>\n     verification of hardware, embedded critical software, and hybrid<br>\n     systems (Verilog, SystemC, C/C++, StateFlow/Simulink)</p>\n</li>\n<li>\n<p>Formal Requirements Analysis based on techniques for temporal logics<br>\n     (consistency checking, vacuity detection, input determinism,<br>\n     cause-effect analysis, realizability and synthesis)</p>\n</li>\n<li>\n<p>Formal Safety Analysis, based on the integration of traditional<br>\n     techniques (e.g. Fault-tree analysis, FMEA) with symbolic<br>\n     verification techniques.</p>\n</li>\n</ul>\n<p>The unit develops and maintains several tools:</p>\n<ul>\n<li>\n<p>the NuSMV symbolic model checker (<a href=\"http://nusmv.fbk.eu\">http://nusmv.fbk.eu</a>)</p>\n</li>\n<li>\n<p>the MathSAT SMT solver (<a href=\"http://mathsat.fbk.eu\">http://mathsat.fbk.eu</a>)</p>\n</li>\n<li>\n<p>the Formal Safety Analysis Platform FSAP (<a href=\"http://fsap.fbk.eu\">http://fsap.fbk.eu</a>)</p>\n</li>\n<li>\n<p>the Requirements Analysis Tool RAT (<a href=\"http://rat.fbk.eu\">http://rat.fbk.eu</a>)</p>\n</li>\n</ul>\n<p>The unit is currently involved in several research projects, funded by<br>\nthe European Union (FP VI and FP VII), the European Space Agency, the<br>\nEuropean Railway Agency, as well as in industrial technology transfer<br>\nprojects. The projects aim at applying research results to key<br>\napplication domains such as space, avionics, railways, hardware design<br>\nand mobile embedded applications.</p>\n<p>The Embedded Systems Unit is part of Fondazione Bruno Kessler,<br>\nformerly Istituto Trentino di Cultura, a public research institute of<br>\nthe Autonomous Province of Trento (Italy), founded in 1976. The<br>\ninstitute, through its center for the scientific and technological<br>\nresearch, is active in the areas of Information Technology,<br>\nMicrosystems, and Physical Chemistry of Surfaces and<br>\nInterfaces. Today, FBK is an internationally recognized research<br>\ninstitute, collaborating with industries, universities, and public and<br>\nprivate laboratories in Italy and abroad. The institute's applied and<br>\nbasic research activities aim at resolving real-world problems, driven<br>\nby the need for technological innovation in society and industry.</p>\n<p>Location<br>\n========</p>\n<p>Trento is a lively town of about 100.000 inhabitants, located 130 km<br>\nsouth of the border between Italy and Austria. It is well known for<br>\nthe beauty of its mountains and lakes, and it offers the possibility<br>\nto practice a wide range of sports. Trento enjoys a rich cultural and<br>\nhistorical heritage, and it is the ideal starting point for day trips<br>\nto famous towns such as Venice or Verona, as well as to enjoy great<br>\nnaturalistic journeys. Detailed information about Trento and its<br>\nregion can be found at <a href=\"http://www.trentino.to/home/index.html?_lang=en\">http://www.trentino.to/home/index.html?_lang=en</a>.</p>\n<p>Contact Person<br>\n==============</p>\n<ul>\n<li>Alessandro Cimatti<br>\n     mailto: &lt;cimatti[at]fbk[dot]eu&gt;<br>\n<a href=\"http://es.fbk.eu/people/cimatti\">http://es.fbk.eu/people/cimatti</a></li>\n</ul>",
        "id": 294058718,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660822675
    }
]