[
    {
        "content": "<p>From: Philipp Rümmer &lt;<a href=\"mailto:philipp.ruemmer@it.uu.se\">philipp.ruemmer@it.uu.se</a>&gt;<br>\n===================  Preliminary Call for Papers =====================</p>\n<p>Journal on Formal Methods in System Design (FMSD)<br>\nSpecial Issue on Recent Topics in Satisfiability Modulo Theories (SMT)</p>\n<p>Deadline for abstract submission (provisional): May 2nd 2016<br>\nDeadline for full paper submission (provisional): August 19th 2016</p>\n<p>======================================================================</p>\n<p>GENERAL INFORMATION</p>\n<p>Determining the satisfiability of first-order formulas modulo background<br>\ntheories, known as the Satisfiability Modulo Theories (SMT) problem, has<br>\nproved to be an enabling technology for verification, test-vector<br>\ngeneration, compiler optimization, scheduling, and other areas.</p>\n<p>The success of SMT techniques depends on the development of both<br>\ndomain-specific decision procedures for each concrete theory (e.g.,<br>\nlinear arithmetic, the theory of arrays, or the theory of bit-vectors)<br>\nand combination methods that allow one to obtain more versatile SMT<br>\ntools. These two ingredients together make SMT techniques well-suited<br>\nfor use in larger automated reasoning and formal verification efforts.</p>\n<p>(See also the SMT-LIB page <a href=\"http://www.smtlib.org/\">http://www.smtlib.org/</a>, and the page of the<br>\nannual SMT Workshop <a href=\"http://www.smt-workshop.org/\">http://www.smt-workshop.org/</a>)</p>\n<p>TOPICS</p>\n<p>The goal of the special issue is to survey recent developments in the<br>\nSMT field. Topics of interest include, but are not restricted to:</p>\n<ul>\n<li>Novel general SMT techniques</li>\n<li>New decision procedures and new theories of interest</li>\n<li>Construction of models, proofs, interpolants, etc.</li>\n<li>Techniques for handling quantifiers</li>\n<li>Combinations of decision procedures</li>\n<li>Novel implementation techniques</li>\n<li>Benchmarks and evaluation methodologies</li>\n<li>Formats for new theories, and developments in SMT-LIB</li>\n<li>Applications and case studies</li>\n<li>Theoretical results</li>\n</ul>\n<p>SUBMISSIONS</p>\n<p>This special issue welcomes original high-quality contributions that<br>\nhave been neither published in nor submitted to any journals or refereed<br>\nconferences. Extended versions of conference papers should include at<br>\nleast 30% of new material.</p>\n<p>All submissions should be written in terms understandable by general<br>\nreaders of the journal. To simplify the publication process, there will<br>\nbe a two step selection process. Authors willing to submit to this<br>\nspecial issues are asked to send an abstract (of at most 1 page)<br>\ndescribing the intended contribution. We will then select most promising<br>\nabstracts and will ask the authors to submit a full version. The full<br>\nversion of all submissions will be refereed according to FMSD standards,<br>\nas described at FMSD web page (see below). Note that acceptance of the<br>\nabstract does not guarantee acceptance of the full version. The guest<br>\neditors reserve the right to invite further relevant papers, including<br>\nextended versions of papers that appeared at recent workshops or<br>\nconferences.</p>\n<p>Abstracts should be submitted via email to the guest editors.<br>\nManuscripts should be submitted in LaTeX according to FMSD's author<br>\nguidelines. Please use Springer's LaTeX macro package and choose the<br>\nformatting option \"smallcondensed\". Submissions should not exceed 30<br>\npages. FMSD LaTeX style file can be obtained at the journal web page<br>\n(see below).</p>\n<p>ABOUT FMSD</p>\n<p>Formal Methods in System Design reports on the latest formal methods for<br>\ndesigning, implementing, and validating the correctness of hardware<br>\n(VLSI) and software systems. Readers will find high quality, original<br>\npapers describing all aspects of research and development. Contributions<br>\nto the journal serve its goal of developing an important and highly<br>\nuseful collection of commonly applicable formal methods that will<br>\nstrongly influence future design environments and design methods. For<br>\nmore information, see the journal webpage at<br>\n<a href=\"http://link.springer.com/journal/10703\">http://link.springer.com/journal/10703</a></p>\n<p>PRELIMINARY DATES</p>\n<ul>\n<li>Abstract submission deadline: May 2nd 2016</li>\n<li>Abstract acceptance notification: May 15th 2016</li>\n<li>Full paper submission deadline: August 19th 2016</li>\n<li>Prospective publication of the issue: Spring 2017</li>\n</ul>\n<p>GUEST EDITORS</p>\n<p>Alberto Griggio, Fondazione Bruno Kessler &lt;<a href=\"mailto:griggio@fbk.eu\">griggio@fbk.eu</a>&gt;<br>\nPhilipp Ruemmer, Uppsala University &lt;<a href=\"mailto:philipp.ruemmer@it.uu.se\">philipp.ruemmer@it.uu.se</a>&gt;</p>\n<p>FURTHER INFORMATION</p>\n<p>For further information, send an email to one of the guest editors.</p>",
        "id": 294671021,
        "sender_full_name": "Email Gateway",
        "timestamp": 1661173399
    }
]