[
    {
        "content": "<p>From: Jacques Fleuriot &lt;<a href=\"mailto:jdf@inf.ed.ac.uk\">jdf@inf.ed.ac.uk</a>&gt;<br>\nCall for Papers</p>\n<p>Annals of Mathematics and Artificial Intelligence<br>\n                        Special issue on Geometric Reasoning<br>\n<a href=\"http://dream.inf.ed.ac.uk/events/amai-geom\">http://dream.inf.ed.ac.uk/events/amai-geom</a></p>\n<p>Geometry is one of most studied areas of mathematics and, though its role as a foundational <br>\nsystem has evolved over time, it remains key to our understanding of many aspects of the world. <br>\nIt is one of the first areas to which Artificial Intelligence (AI) was applied and has remained <br>\nthe focus of much work in the field, giving rise to new mathematical concepts and techniques, <br>\nheuristics, algorithms, and applications over the past fifty years. In view of the importance <br>\nof geometry and the sustained advances in the field of computer-based geometric reasoning and <br>\nits applications, the time seems ripe to take stock of the progress so far and look at some of <br>\nthe latest mathematical and AI-related advances in the field. Thus, we invite original contributions <br>\n-- ranging from theory to implementations and applications -- and insightful surveys to a special <br>\nissue of the Annals of Mathematics and Artificial Intelligence on Geometric Reasoning. </p>\n<p>Relevant topics include (but are not limited to):</p>\n<ul>\n<li>\n<p>Automated and interactive theorem proving in geometry involving algebraic, logical, <br>\n and/or probabilistic approaches.</p>\n</li>\n<li>\n<p>Symbolic and numerical methods for geometric computation and constraint solving.</p>\n</li>\n<li>The formal verification of geometric algorithms, for instance in relation to computational geometry.</li>\n<li>Reasoning and manipulation via diagrams, including approaches based on dynamic geometry.</li>\n<li>The design, implementation, and evaluation of software for geometric reasoning.</li>\n<li>Knowledge management and libraries of test problems for theorem proving in geometry.</li>\n<li>The applications to geometric modelling, CAGD/CAD, computer vision, robotics, and education.</li>\n</ul>\n<p>Submission</p>\n<p>Prospective authors should follow the instructions set out by the Annals of Mathematics and <br>\nArtificial Intelligence on its webpage (<a href=\"http://www.springer.com/computer/ai/journal/10472\">http://www.springer.com/computer/ai/journal/10472</a>) and <br>\nsubmit their articles through Springer's Editorial Manager System (at <a href=\"https://www.editorialmanager.com/amai\">https://www.editorialmanager.com/amai</a>) <br>\nby the deadline indicated below. </p>\n<p>Please note that the guest editors will first carry a quick assessment of each submission and <br>\nonly papers that are deemed relevant to the special issue and are of high enough quality will <br>\nbe forwarded to at least two referees for full, independent reviews. </p>\n<p>Important dates</p>\n<ul>\n<li>Submissions due: December 31, 2013</li>\n<li>First-round acceptance notification: March 31, 2014</li>\n<li>Revised versions due: April 30, 2014</li>\n<li>Final decision: June 30, 2014</li>\n<li>Final papers due: August 31, 2014</li>\n<li>Publication date: 2014 (To be confirmed)</li>\n</ul>\n<p>Special Issue Editors</p>\n<ul>\n<li>Jacques Fleuriot (University of Edinburgh, UK)</li>\n<li>Tetsuo Ida (University of Tsukuba, Japan)</li>\n</ul>",
        "id": 294248157,
        "sender_full_name": "Email Gateway",
        "timestamp": 1660909738
    }
]