[
    {
        "content": "<p>The ALEXANDRIA project is excited to announce the release of the SErAPIS concept-oriented search engine for the Isabelle libraries and AFP 2021.</p>\n<p>Homepage: <a href=\"https://behemoth.cl.cam.ac.uk/search/\">https://behemoth.cl.cam.ac.uk/search/</a><br>\nUser Guide: <a href=\"https://behemoth.cl.cam.ac.uk/search/SErAPIS_online_user_guide.pdf\">https://behemoth.cl.cam.ac.uk/search/SErAPIS_online_user_guide.pdf</a></p>\n<p>SErAPIS (Search Engine by the ALEXANDRIA Project for ISabelle) is an experimental search engine for Isabelle designed to allow Isabelle users to search and explore the libraries and AFP using keywords and mathematical concepts (natural language phrases that refer to mathematical objects and ideas).</p>\n<p>We invite you to try it out. For tips on how to construct effective queries, please see Section 3 of the user guide.<br>\nNote that there are 6 different methods to experiment with.</p>\n<p>SErAPIS is also a platform for conducting research in novel methods to search Isabelle collections and machine learning in Isabelle.</p>\n<p>We kindly ask that you help us with our research by providing us with feedback on the relevance of SErAPIS search results to your searches.<br>\nGiving us feedback is optional but very easy to do (see Section 4 of the user guide).</p>\n<p>Your feedback will help us:</p>\n<p>(i)   build data-sets for Isabelle search and machine learning,<br>\n(ii)  develop new search algorithms for Isabelle collections and;<br>\n(iii) develop machine learning methods for aiding the construction of proofs in Isabelle.</p>\n<p>All data collected is anonymised.</p>\n<p>Thank you,</p>\n<p>Yiannos Stathopoulos <span class=\"user-mention\" data-user-id=\"229056\">@Yiannos</span>   and Angeliki Koutsoukou-Argyraki.</p>",
        "id": 235164925,
        "sender_full_name": "Angeliki Koutsoukou-Argyraki",
        "timestamp": 1618831969
    },
    {
        "content": "<p>Maybe you want to add this to <a href=\"https://isabelle.systems\">https://isabelle.systems</a> ? You can add an entry here <a href=\"https://github.com/isabelle-prover/isabelle-prover.github.io\">https://github.com/isabelle-prover/isabelle-prover.github.io</a> :)</p>",
        "id": 235171139,
        "sender_full_name": "Kevin Kappelmann",
        "timestamp": 1618835179
    },
    {
        "content": "<p>Is it o.k. if I post this to the Lean Zulip group? I am guessing that many in the community there will be happy to experiment with this.</p>",
        "id": 235198338,
        "sender_full_name": "Jeremy Avigad",
        "timestamp": 1618845353
    },
    {
        "content": "<p>Sure, please do <span class=\"user-mention\" data-user-id=\"246149\">@Jeremy Avigad</span>  --and many thanks for the interest! We would be most grateful for user feedback-- the more feedback the better! Thank you again!</p>",
        "id": 235225891,
        "sender_full_name": "Angeliki Koutsoukou-Argyraki",
        "timestamp": 1618856598
    },
    {
        "content": "<p>I’d like to point out that:<br>\nMethods 1,2,3, 5 and 6 are concept-oriented: they use the input concepts very differently. If one method (default is method 2) is not producing good results in response to the concepts you input, another method might!</p>",
        "id": 235229472,
        "sender_full_name": "Yiannos",
        "timestamp": 1618858113
    },
    {
        "content": "<p>NB: The last indexing of the Archive of Formal Proofs was done on 23/2/2021, so AFP entries after that date are not included. We will be re-indexing every now and then so as to be as up-to-date as possible!</p>",
        "id": 235253130,
        "sender_full_name": "Angeliki Koutsoukou-Argyraki",
        "timestamp": 1618867771
    },
    {
        "content": "<p>Many thanks for the suggestion <span class=\"user-mention\" data-user-id=\"233154\">@Kevin Kappelmann</span> , I just  created a pull request--hope it looks ok!</p>",
        "id": 235255247,
        "sender_full_name": "Angeliki Koutsoukou-Argyraki",
        "timestamp": 1618868899
    },
    {
        "content": "<p>Done!</p>",
        "id": 235256093,
        "sender_full_name": "Jeremy Avigad",
        "timestamp": 1618869438
    },
    {
        "content": "<p>That's a cool project!<br>\nI would like to point out a (minor) naming collision, however: <a href=\"https://github.com/ejgallego/coq-serapi\">https://github.com/ejgallego/coq-serapi</a><br>\nI'm not sure how much of an issue it really is, since the SerAPI project is so far still fairly unknown/small (and lives in the disjoint Coq universe anyway), but I wanted to mention it.</p>",
        "id": 236136877,
        "sender_full_name": "Max Kirchmeier",
        "timestamp": 1619425314
    },
    {
        "content": "<p>Thank you for letting us know <span class=\"user-mention\" data-user-id=\"324414\">@Max Kirchmeier</span> . We weren't aware of this--luckily the names are not the same, though  very similar. Hopefully there won't be any confusion as the Coq project is not a search engine.  In our case, SErAPIS  stands for \"Search Engine  by  the Alexandria Project  for ISabelle\"   and it is an intended pun referring to the deity \"Serapis\"  (see e.g. wiki) once worshipped in Alexandria--which is the name of our ERC project--inspired by the Library of Alexandria in Egypt, since we are working with libraries  of formal proofs :)    <a href=\"https://www.cl.cam.ac.uk/~lp15/Grants/Alexandria/\">https://www.cl.cam.ac.uk/~lp15/Grants/Alexandria/</a></p>",
        "id": 237575991,
        "sender_full_name": "Angeliki Koutsoukou-Argyraki",
        "timestamp": 1620252769
    }
]