[
    {
        "content": "<p>Isabelle/HOL doesn't have type constructor variables (the <code>'b</code> in <code>'a 'b</code>), which are e.g. necessary for a monad type class. I've found several occurrences of the claim that HOL can't have such variables but I can't really find any evidence on why this holds. Could anyone here give me a hint to why we can't simply extend HOL with higher kinded type variables? </p>\n<p>The only technical limitation for Isabelle/HOL that I can think of would be that there is no corresponding ML representation in Pure. None of <code>Type</code>, <code>TFree</code> and <code>TVar</code> would really fit for this use case.</p>",
        "id": 279063369,
        "sender_full_name": "Florian Sextl",
        "timestamp": 1650014276
    },
    {
        "content": "<p>I don't know much about such things but my guess would be that it is definitely possible to do implement an Isabelle/HOL object logic that does such a thing, but you would have to build your own type system to accommodate it. In Isabelle/HOL, Isabelle/HOL types are just Isabelle/Pure types, which is nice and makes things much easier in implementation.</p>\n<p>E.g. Josh Chen's implementation built a dependently-typed system on top of Isabelle/Pure, which is possible, but requires a lot of extra plumbing.</p>\n<p>Building something like this on top of Isabelle/HOL is probably possible, but it would definitely not be as nice to use as the current HOL.</p>",
        "id": 279072595,
        "sender_full_name": "Manuel Eberl",
        "timestamp": 1650022688
    },
    {
        "content": "<p>There is also HOL Omega <a href=\"http://www.trustworthytools.com/id17.html\">http://www.trustworthytools.com/id17.html</a>.</p>",
        "id": 279074537,
        "sender_full_name": "Lukas Stevens",
        "timestamp": 1650024473
    },
    {
        "content": "<p>So it really is more of technical issue (plus the overhead of not using the Pure types). Thank you for the insights and the interesting pointers.</p>",
        "id": 279081636,
        "sender_full_name": "Florian Sextl",
        "timestamp": 1650030622
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"368701\">Florian Sextl</span> has marked this topic as resolved.</p>",
        "id": 279081639,
        "sender_full_name": "Notification Bot",
        "timestamp": 1650030624
    }
]