[
    {
        "content": "<p>As subject, is there a date planned for the Isabelle 2025 AFP fork?</p>",
        "id": 502112890,
        "sender_full_name": "Katherine Kosaian",
        "timestamp": 1740593630
    },
    {
        "content": "<p><a href=\"https://foss.heptapod.net/isa-afp/afp-2025\">https://foss.heptapod.net/isa-afp/afp-2025</a></p>",
        "id": 502116419,
        "sender_full_name": "Mathias Fleury",
        "timestamp": 1740594729
    },
    {
        "content": "<p>already done, as announced on the mailing list</p>",
        "id": 502116476,
        "sender_full_name": "Mathias Fleury",
        "timestamp": 1740594742
    },
    {
        "content": "<p>Just to make sure that I'm understanding correctly, does that mean updates are no longer allowed for the 2025 AFP?</p>",
        "id": 502133324,
        "sender_full_name": "Katherine Kosaian",
        "timestamp": 1740600034
    },
    {
        "content": "<p>hmmmmm no?</p>",
        "id": 502135362,
        "sender_full_name": "Mathias Fleury",
        "timestamp": 1740600682
    },
    {
        "content": "<p>New submissions got the 2025 AFP fork</p>",
        "id": 502135459,
        "sender_full_name": "Mathias Fleury",
        "timestamp": 1740600721
    },
    {
        "content": "<p>But kind of, if you are working on your entries, this should be done on afp-devel</p>",
        "id": 502135571,
        "sender_full_name": "Mathias Fleury",
        "timestamp": 1740600755
    },
    {
        "content": "<p>ah yeah I meant whether the deadline has been passed for making updates to existing entries to be migrated into the 2025 AFP.</p>",
        "id": 502138825,
        "sender_full_name": "Katherine Kosaian",
        "timestamp": 1740601909
    },
    {
        "content": "<p>As far as I know, the AFP version is mostly frozen and work should happen on the devel version, but an AFP editor like <span class=\"user-mention\" data-user-id=\"232736\">@Manuel Eberl</span> should confirm</p>",
        "id": 502139717,
        "sender_full_name": "Mathias Fleury",
        "timestamp": 1740602213
    },
    {
        "content": "<p>Yes. Metadata can be changed in the release version as well, but that's it. Any changes to Isabelle theories can only happen in afp-devel, and they only appear in the release version when a new release happens. For AFP-2025, the fork point has already passed, so changes made to devel now will probably not make it to AFP-2025.</p>\n<p>But if it's really important you ought to be able to convince Gerwin to still add a patch so that your changes will appear in AFP-2025 as well. Just contact him if that is the case.</p>",
        "id": 502287326,
        "sender_full_name": "Manuel Eberl",
        "timestamp": 1740663833
    },
    {
        "content": "<p>Actually, while I have you on this thread... I have been trying to change my email on the development branch of the AFP for a couple of months (I sent a couple of emails about this, but think they may have gotten lost).  Anyways I receive the message \"an error occurred editing the blob\".  Maybe I don't have the right permissions? Is there a way to receive these permissions, or something else I should do?</p>",
        "id": 504127441,
        "sender_full_name": "Katherine Kosaian",
        "timestamp": 1741362778
    },
    {
        "content": "<p>We did get those emails. There was some confusion with afp-devel vs the release and now the fork and that delayed things. But someone will do it eventually.</p>\n<p>When exactly do you get that error message? Normally, you should only have to edit the file <code>metadata/authors.toml</code>.</p>",
        "id": 504128845,
        "sender_full_name": "Manuel Eberl",
        "timestamp": 1741363202
    },
    {
        "content": "<p>(and then ideally run <code>./admin/sitegen</code> to make sure it still works)</p>",
        "id": 504128977,
        "sender_full_name": "Manuel Eberl",
        "timestamp": 1741363229
    },
    {
        "content": "<p>I get the error message when trying to commit the changes.  I only attempted to edit the metadata/authors.toml file.</p>",
        "id": 504129718,
        "sender_full_name": "Katherine Kosaian",
        "timestamp": 1741363439
    },
    {
        "content": "<p>How is your <code>hg</code> configured?</p>",
        "id": 504129927,
        "sender_full_name": "Fabian Huch",
        "timestamp": 1741363504
    },
    {
        "content": "<p>I've never seen that problem, but had a few other weird issues with heptapod in the past</p>",
        "id": 504130049,
        "sender_full_name": "Fabian Huch",
        "timestamp": 1741363543
    },
    {
        "content": "<p>I don't know what that means, so I think the answer is that it's not configured.  I was trying to edit in the heptapod UI.  Is there something I need to do to set up my computer to be able to do that?</p>",
        "id": 504130659,
        "sender_full_name": "Katherine Kosaian",
        "timestamp": 1741363734
    },
    {
        "content": "<p>Okay, that sounds like a Heptapod issue then. Perhaps that's something you'd have to report to them. The normal workflow is to clone the afp-devel repository, do the changes there, commit + push.</p>\n<p>And, as I said, ideally run the sitegen. But that would require installing the development version of Isabelle as well and registering afp-devel as a component and then installing a bunch of more components by running <code>isabelle-dev components -a</code>. So not sure if this effort is worth it just for changing an email address.</p>",
        "id": 504131374,
        "sender_full_name": "Manuel Eberl",
        "timestamp": 1741363954
    },
    {
        "content": "<p>Thank you!!</p>",
        "id": 504144692,
        "sender_full_name": "Katherine Kosaian",
        "timestamp": 1741367938
    }
]