[
    {
        "content": "<p>Is there any way to apply a given method some fixed number of times, instead of arbitrarily many times using \"+\"? I am aware of [n] and it doesn't (always) do what I want; I want something that will also apply to new subgoals, but not all of them.</p>\n<p>More specifically, I want to apply a given rule exactly n times in order to derive a term I want, and I can't use + because the rule loops. (Reformulating it is probably out of the question.)</p>",
        "id": 176944632,
        "sender_full_name": "Josh Chen",
        "timestamp": 1569858150
    },
    {
        "content": "<p>Maybe Eisbach will help in that case (note: I personally never used it)</p>",
        "id": 176946944,
        "sender_full_name": "Kevin Kappelmann",
        "timestamp": 1569859594
    },
    {
        "content": "<p>I don't think it does. About a year ago I hacked together a rough solution using Eisbach and ML, but it wasn't very nice.</p>\n<p>But I suppose [n] is working well for my uses at the moment.</p>\n<p><strong>EDIT</strong>: <del>Maybe you're right, another look at the Eisbach source brings up <code>determ</code>, which sounds promising...</del> If this lets me limit the number of  method applications, I can't figure it out.</p>",
        "id": 176947959,
        "sender_full_name": "Josh Chen",
        "timestamp": 1569860316
    },
    {
        "content": "<p>An ML solution:</p>\n<div class=\"codehilite\"><pre><span></span>lemma imp: ‹P ∧ P ⟹ P›\n  by auto\nlemma P\n  apply (tactic ‹REPEAT_DETERM_N 3 (HEADGOAL (resolve_tac @{context} @{thms imp}))›)\n</pre></div>",
        "id": 177027744,
        "sender_full_name": "Mathias Fleury",
        "timestamp": 1569911934
    },
    {
        "content": "<p>(and the Eisbach solution is probably either to lift REPEAT_DETERM_N to Eisbach -- I don't know how -- or to introduce a predicate \"repeat n = True\" and, add \"repeat n\" as assumption to the goal you want to change, repeat the rule as long as n &gt; 0 and decrease the n, and finally remove the \"repeat 0\" from the assumptions)</p>",
        "id": 177027952,
        "sender_full_name": "Mathias Fleury",
        "timestamp": 1569912221
    },
    {
        "content": "<blockquote>\n<p>An ML solution:<br>\n[...]</p>\n</blockquote>\n<p>Thanks! That's basically what I have. It would be nice if there were a way to directly pass a method instead of a tactic, though.</p>",
        "id": 177036340,
        "sender_full_name": "Josh Chen",
        "timestamp": 1569920709
    }
]