[
    {
        "content": "<p><a href=\"https://isabelle.in.tum.de/community/Course_Material\">This page</a> on course material at TUM deserves some care (broken links), and the following course material, taken from <a href=\"https://pat2023.icube.unistra.fr/\">here</a>, might be a good addition. </p>\n<blockquote>\n<p><a href=\"https://pat2023.icube.unistra.fr/\">Filip Maric (University of Belgrade)</a>: <strong><em>Experiences in teaching an introductory interactive theorem proving course to computer science undergraduates</em></strong></p>\n<p><strong>Abstract:</strong> For several years we have been offering an elective course \"Introduction to Interactive Theorem Proving\" to our computer science undergraduates. Although the course has extensive mathematical content and is not directly applicable to jobs in the IT industry, it is very popular with students. The course is based on the proof assistant Isabelle/ HOL and is divided into two parts: (1) proofs, proof languages and formalisation of mathematics and (2) functional programming and verification of algorithms and data structures. We keep the pace slow and introduce new concepts very gently, but in the end students still manage to do a project in which they formalise an IMO problem or verify a simple algorithm or data structure. In this PAT course I will give a short introduction to Isabelle/ HOL using the same didactic approach and exercises that our students use. I will also talk about our experiences in class.<br>\n<strong>Slides:</strong> <a href=\"https://pat2023.icube.unistra.fr/slides/slides-pat2023-maric.pdf\">slides-pat2023-maric.pdf</a><br>\n<strong>Examples:</strong> <a href=\"https://pat2023.icube.unistra.fr/slides/FilipMaricPAT2023.zip\">FilipMaricPAT2023.zip</a></p>\n</blockquote>\n<p>EDIT: I just found this ongoing course <a href=\"http://cl-informatik.uibk.ac.at/teaching/ss24/itpIsa/content.php?lan=en\">http://cl-informatik.uibk.ac.at/teaching/ss24/itpIsa/content.php?lan=en</a></p>",
        "id": 439330396,
        "sender_full_name": "Tobias Heindel (Heliax GmbH)",
        "timestamp": 1716013193
    },
    {
        "content": "<p>Hi Tobias, the linked page is obsolete. The new page is here :</p>\n<p><a href=\"https://isabelle.systems/courses.html\">https://isabelle.systems/courses.html</a></p>\n<p>You can update the entries by creating a pull request<br>\n<a href=\"https://github.com/isabelle-prover/isabelle-prover.github.io\">https://github.com/isabelle-prover/isabelle-prover.github.io</a></p>",
        "id": 439333077,
        "sender_full_name": "Kevin Kappelmann",
        "timestamp": 1716015885
    }
]