[
    {
        "content": "<p>I struggle with understanding the definition of topological filter provided in Filter.thy . My explaination of the problem is a little involved so in order to avoid cluttering zulip with code blocks,  I posted a stack-overflow question (it will also be easier to find by google search in the future).<br>\n<a href=\"https://stackoverflow.com/questions/75120033/topological-filters-in-isabelle\">https://stackoverflow.com/questions/75120033/topological-filters-in-isabelle</a></p>\n<p>In short, the axioms of topological filter don't match with those typically found in textbooks and it seems that the Isabelle's definition is actually not equivalent to them. Moreover, the notation is quite convoluted so maybe I understood something wrong.</p>\n<p>Is there somebody interested in enlightening me?</p>",
        "id": 321390837,
        "sender_full_name": "Aleksander Mendoza-Drosik",
        "timestamp": 1673718556
    },
    {
        "content": "<p>Unfortunately I am of no help here but I would like to thank you for this example. Now when someone asks why I prefer to formalize mathematics in Isabelle/ZF rather than Isabelle/HOL I can point to the definition of filter in this StackOverflow question and the <a href=\"https://isarmathlib.org/Topology_ZF_4.html#a_IsFilter\">one</a> in IsarMathLib.</p>",
        "id": 321403875,
        "sender_full_name": "Sławomir Kołodyńaski",
        "timestamp": 1673726483
    },
    {
        "content": "<p>You did get an answer on StackOverflow and I also commented on it. I just wanted to add that some of the confusion probably stems from the fact that filters are defined with predicates instead of with sets. I honestly have no idea why that is the case and e.g. Lean does it differently, if I recall correctly. One possibility is that filters were formalised back in the period when Isabelle/HOL didn't have a set type but rather did everything with predicates (<code>'a ⇒ bool</code>) and filters were never changed to sets.</p>",
        "id": 321474889,
        "sender_full_name": "Manuel Eberl",
        "timestamp": 1673784110
    },
    {
        "content": "<p>If you translate all the filter definitions to sets in your head, they might become more intuitive.</p>",
        "id": 321474982,
        "sender_full_name": "Manuel Eberl",
        "timestamp": 1673784142
    }
]