[
    {
        "content": "<p>Dear all,  I am writing to ask for help in defining linear functional in terms of the definitions about vector spaces in <code>HOL.Vector_Spaces</code> (and using locale in general). I am trying to formally define a linear functional in a programmatic way,  but I am encountering numerous errors.  A linear functional $p$ is a function on a vector space that satisfies the following properties:</p>\n<ol>\n<li>\n<p>It takes a vector as input and outputs a real number.</p>\n</li>\n<li>\n<p>$p(x+y)=p(x)+p(y)$ for any vectors $x$ and $y$.</p>\n</li>\n<li>\n<p>$p(kx)=k⋅p(x)$. for any scalar $k$ and vector $x$.</p>\n</li>\n</ol>\n<p>Could someone please advise me on which files or resources I should study to correctly define a linear functional?  Any guidance would be greatly appreciated.<br>\n<a href=\"/user_uploads/14278/uCJLUt1wrA0ArZ78kBv-GKC6/error.png\">error.png</a><br>\nI am currently working on formalizing the properties of the Dirac delta function,  which is an element of the space of distributions.  Since the space of distributions is the dual space of the space of test functions, it is essential to define a linear functional properly.  This is because the Dirac delta function acts as a linear functional on the space of test functions.  Could you kindly suggest which files or resources I should refer to for defining a linear functional correctly?  This would be immensely helpful for my work on elucidating the properties of the Dirac delta function as a linear functional.  Thank you very much for your assistance.</p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/14278/uCJLUt1wrA0ArZ78kBv-GKC6/error.png\" title=\"error.png\"><img data-original-content-type=\"image/png\" data-original-dimensions=\"1330x929\" src=\"/user_uploads/thumbnail/14278/uCJLUt1wrA0ArZ78kBv-GKC6/error.png/840x560.webp\"></a></div>",
        "id": 501757934,
        "sender_full_name": "IsaKim",
        "timestamp": 1740478007
    },
    {
        "content": "<p><code>('a, 'b) vec</code> comes with sort constraints, which aren't met here: it requires that <code>'a::times</code> and <code>'b::finite</code> (i.e. that <code>'a</code> has an instance of the <code>times</code> class, and <code>'b</code> of the <code>finite</code> class), which you'd need to add to your locale as sort constraints, e.g. by simply writing <code>::times</code> behind the <code>'a</code> in <code>fixes</code> to make sure the locale can satisfy these constraints.</p>\n<p>but even with that your assumption as written would not type check, because  in <code>a * p x</code> you're trying to multiply a <code>real</code> with an <code>'a</code>, which can't work. Maybe you can either change the type of <code>p</code> to <code>(real, 'b::finite) vec ⇒ real</code> or to <code>('a::times, 'b::finite) vec ⇒ 'a</code>, depending on whether you want your theory to be about vector spaces based on <code>real</code> or something more general? (if the latter, you will also need that <code>'a</code> has an instance of <code>plus</code>, so write <code>'a :: {times, plus}</code>). You might also want to read more about type classes and locales in the locales/classes tutorials (in the documentation panel)</p>",
        "id": 501835905,
        "sender_full_name": "terru",
        "timestamp": 1740497788
    },
    {
        "content": "<p>hi, I am not sure if this will help, but you may want to have a look at:</p>\n<p><a href=\"https://www.isa-afp.org/sessions/ordinary_differential_equations/#Bounded_Linear_Operator.html\">https://www.isa-afp.org/sessions/ordinary_differential_equations/#Bounded_Linear_Operator.html</a></p>\n<p>or more specifically at Bounded_Linear_Function in HOL-Analysis</p>",
        "id": 501939890,
        "sender_full_name": "Yong Kiam",
        "timestamp": 1740532202
    },
    {
        "content": "<p>It might interest you that there is another vector space library in the AFP which is pretty widely used (<a href=\"https://www.isa-afp.org/entries/VectorSpace.html\">https://www.isa-afp.org/entries/VectorSpace.html</a>).  I believe it is slightly more general, also done using locales. I used this (and the follow on libraries on vectors/matrices provided in the Jordan Normal Form entry) for past work in linear algebra personally.</p>",
        "id": 502088869,
        "sender_full_name": "Chelsea Edmonds",
        "timestamp": 1740586972
    },
    {
        "content": "<p>Re using locales generally, beyond the tutorial, Larry has written a really good blog article introducing the general approach used on several of the ALEXANDRIA project formalisations with locales: <a href=\"https://lawrencecpaulson.github.io/2022/03/23/Locales.html\">https://lawrencecpaulson.github.io/2022/03/23/Locales.html</a>. Several of my papers give other examples, and happy to recommend more resources/other good papers if you'd like!</p>",
        "id": 502090153,
        "sender_full_name": "Chelsea Edmonds",
        "timestamp": 1740587293
    }
]