[
    {
        "content": "<p>I have a Scala development environment with <code>Metals</code> and a <code>build.sbt</code>. Isabelle provides its own wrappers for Scala tools such as <code>scalac</code>, <code>scala</code>, etc. I have Isabelle added to my path so these can be accessed in the form <code>isabelle scalac</code> from the command-line and the implementations are given in this <a href=\"https://github.com/isabelle-prover/mirror-isabelle/tree/c1a13eb21fed2797b390495e11309c9295595e33/lib/Tools\">folder</a>. What do I need to add to my <code>build.sbt</code> to instruct <code>Metals</code> to use these wrappers for compilation and execution rather than the default <code>scala</code> and <code>scalac</code> tools?</p>",
        "id": 492937934,
        "sender_full_name": "Milan Tom",
        "timestamp": 1736511304
    },
    {
        "content": "<p>This is not really a question about Isabelle but to the <code>Metals</code> community. But I have the suspicion that you want to achieve something in Isabelle -- maybe you want to ask about that instead?</p>",
        "id": 492943857,
        "sender_full_name": "Fabian Huch",
        "timestamp": 1736513486
    },
    {
        "content": "<p>E.g. if you want to edit Isabelle/Scala sources in an IDE then there's a better way.</p>",
        "id": 492944123,
        "sender_full_name": "Fabian Huch",
        "timestamp": 1736513565
    },
    {
        "content": "<p>Thanks for the response <span class=\"user-mention\" data-user-id=\"348400\">@Fabian Huch</span>. Apologies for the lack of context. I am working on starting an Isabelle process and communicating with it via the official Isabelle/Scala pipeline, so I require access to the <code>isabelle</code> package in Scala. I have tried using <code>isabelle scala_project</code> with limited success. Is this the better way you are talking about?</p>",
        "id": 492986938,
        "sender_full_name": "Milan Tom",
        "timestamp": 1736527459
    },
    {
        "content": "<p>Yes. Note that:</p>\n<ul>\n<li>I tried out Metals some time ago but unfortunately it didn't work well (it crashed with my some maven/gradle projects, including Isabelle)</li>\n<li><code>sbt</code> is not a supported target for <code>scala_project</code>, but could potentially made to work</li>\n<li><code>scala_project</code> generates a standard maven or gradle projects for the Isabelle sources</li>\n<li>if you want to make changes to Isabelle sources themselves, use the <code>-L</code> options so the generated project consists of symlinks instead of copies (does not work on windows)</li>\n</ul>\n<p>The project generated via that tool works with any IDE that supports gradle or maven properly (Metals does not, sadly).</p>",
        "id": 492990642,
        "sender_full_name": "Fabian Huch",
        "timestamp": 1736528732
    },
    {
        "content": "<p>Thanks for the tips. That explains why I was having difficulties using <code>isabelle scala_project</code> (I was using Metals). I can confirm that it is working now.</p>",
        "id": 493804408,
        "sender_full_name": "Milan Tom",
        "timestamp": 1736929020
    }
]