[
    {
        "content": "<p>Hi all! <span aria-label=\"wave\" class=\"emoji emoji-1f44b\" role=\"img\" title=\"wave\">:wave:</span></p>\n<p>I'm the host of the <em>Type Theory Forall</em> podcast and website (<a href=\"https://typetheoryforall.com/\">https://typetheoryforall.com</a>), where I explore topics in type theory, PL, and formal methods through longform interviews and accessible content.</p>\n<p>I recently started <a href=\"https://store.typetheoryforall.com/\">a small merch shop</a> to help support the project and have begun selling mugs featuring the Rocq logo (with their blessing). I'd love to do something similar with the Isabelle logo—just a simple mug design with the logo on it.</p>\n<p>Before moving forward, I wanted to ask: is the Isabelle logo considered open source, or otherwise freely reusable for something like this? If there are any guidelines or restrictions I should follow, I'd be happy to comply.</p>\n<p>Thanks in advance!</p>\n<p>—Pedro</p>",
        "id": 524473554,
        "sender_full_name": "Pedro Abreu",
        "timestamp": 1750172437
    },
    {
        "content": "<p>Hi Pedro, that's a good question. In <code>lib/logo</code> there is an <code>index.html</code> which mentions the contributor of the logo, but not much else. Legally, the source code is under BSD-3 license which does not mention trademark, so I would assume that technically the IP lies at the original author, and you'd have to get permission from them (I am not a lawyer).</p>\n<p>Practically, I don't think anyone would object, but just to be safe you could ask on the isabelle-users mailing list. Perhaps <span class=\"user-mention\" data-user-id=\"232736\">@Manuel Eberl</span>  knows more about the topic?</p>",
        "id": 524478164,
        "sender_full_name": "Fabian Huch",
        "timestamp": 1750173743
    },
    {
        "content": "<p>I have no idea. I made an \"illegal\" knock-off SVG version of the logo a while ago in the hope that no one will mind (no one did so far).</p>\n<p>As far as I know, the original version of the logo was designed by Makarius Wenzel's sister, so I assume she holds the rights to it (as I recall, under German law, the author always retains the rights to their creation but can of course give other people permissions/licences to do things with it).</p>\n<p>To what extent the fact that the logo is distributed with Isabelle under BSD-3 licence affects what <em>you</em> may or may not do with it, I have no idea. I simply assumed that it was under BSD-3 licence as well and, more importantly, that no one will cause a fuss about it.</p>\n<p>Also note that the thing about it being created by Makarius' sister is something I heard from someone at some point and I vaguely recall other people confirming it, but I never actually did confirm it myself and I don't know if there is any actual evidence that this is the case. It may well just be a myth.</p>",
        "id": 524490324,
        "sender_full_name": "Manuel Eberl",
        "timestamp": 1750177804
    },
    {
        "content": "<p>Oh yeah and I do also sell Isabelle logo T-shirts on <a href=\"http://redbubble.com\">redbubble.com</a>, with similar disregard for the question of whether or not this is legal. However, I set the profit to 0%, so I don't actually make any money from this.</p>\n<p>This is in fact the main reason why I created the SVG logo. The official version simply doesn't look great when you scale it up.</p>",
        "id": 524490726,
        "sender_full_name": "Manuel Eberl",
        "timestamp": 1750177950
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"232736\">Manuel Eberl</span> <a href=\"#narrow/channel/202961-General/topic/Is.20the.20Isabelle.20Logo.20.22Open.20Source.22.3F/near/524490324\">said</a>:</p>\n<blockquote>\n<p>Also note that the thing about it being created by Makarius' sister is something I heard from someone at some point and I vaguely recall other people confirming it, but I never actually did confirm it myself and I don't know if there is any actual evidence that this is the case. It may well just be a myth.</p>\n</blockquote>\n<p><code>lib/logo/index.html</code> indeed attributes the logo to Franziska Wenzel.</p>",
        "id": 524491325,
        "sender_full_name": "Fabian Huch",
        "timestamp": 1750178203
    },
    {
        "content": "<p>Well, thanks for the pointer, I think I'll send another request to the mailing list and see if anyone can get in contact with Franziska to see if I can get the permission. Thanks! :)</p>",
        "id": 524782157,
        "sender_full_name": "Pedro Abreu",
        "timestamp": 1750279945
    }
]