[
    {
        "content": "<p>Note the <em>Query</em> feature at the bottom of the Isabelle jEdit user interface. If you mouse over the <em>Find</em> window, it tells you how to search through the library. Of course, you can also browse the html <a href=\"https://isabelle.in.tum.de/dist/library/HOL/index.html\" target=\"_blank\" title=\"https://isabelle.in.tum.de/dist/library/HOL/index.html\">files</a> of the libraries in Isabelle/HOL.</p>",
        "id": 169605005,
        "sender_full_name": "Anthony Bordg",
        "timestamp": 1562190897
    },
    {
        "content": "<p>I continue my series for newcomers.<br>\nIsabelle allows a rich syntactic sugar in your code. Just click on <em>Symbols</em> at the bottom of the user interface, and then click on one of the many categories of symbols available.</p>",
        "id": 169691687,
        "sender_full_name": "Anthony Bordg",
        "timestamp": 1562313825
    },
    {
        "content": "<p>If you need to replace a name (of a definition, lemma ...) with a new one, you can change all the occurrences at once. Just open the <em>Search</em> menu, then the <em>Find</em> menu, in the <em>Search and Replace</em> interface enter the current name in the <em>Search for</em> window, the new name in the <em>Replace with</em> window, check the <em>Whole word</em> option, and finally click on <em>Replace All</em>.</p>",
        "id": 169692767,
        "sender_full_name": "Anthony Bordg",
        "timestamp": 1562315058
    },
    {
        "content": "<p>In a file, if you mouse over  any definition, lemma, tactic or keyword used in this file, while you press the  <strong>cmd</strong> key, then you will be redirected towards its specification in the library. It's very useful when names are not completely self-explanatory.</p>",
        "id": 169693551,
        "sender_full_name": "Anthony Bordg",
        "timestamp": 1562315974
    },
    {
        "content": "<blockquote>\n<p>In a file, if you mouse over  any definition, lemma, tactic or keyword used in this file, while you press the  <strong>cmd</strong> key, then you will be redirected towards its specification in the library. It's very useful when names are not completely self-explanatory.</p>\n</blockquote>\n<p>(For newcomers:) Note that this only works if the file is available for processing; in particular, it won't work on source files of the session you're currently working in.</p>",
        "id": 169694019,
        "sender_full_name": "Josh Chen",
        "timestamp": 1562316489
    },
    {
        "content": "<p>If you want to rename all the occurrences of a bound variable in a statement, click on the variable name then press the combination <strong>cmd + shift + return</strong> (the color of the occurrences will change) and enter the new name. It's useful for instance when isabelle generates a subgoal containing a bound variable whose name clashes with a previous variable in the current context.</p>",
        "id": 169694224,
        "sender_full_name": "Anthony Bordg",
        "timestamp": 1562316741
    },
    {
        "content": "<p>I encourage everyone to share their tips.</p>",
        "id": 169694647,
        "sender_full_name": "Anthony Bordg",
        "timestamp": 1562317276
    },
    {
        "content": "<p>An additional tip: if you highlight some code before opening the <em>Search</em> menu, then the <em>Search for</em> window will be already filled with this code, so you don't even need to copy/paste.</p>",
        "id": 169738066,
        "sender_full_name": "Anthony Bordg",
        "timestamp": 1562363963
    },
    {
        "content": "<p>If you're a newcomer, you should be aware of the <strong>colours code</strong> <span aria-label=\"rainbow\" class=\"emoji emoji-1f308\" role=\"img\" title=\"rainbow\">:rainbow:</span>  displayed in Isabelle. In addition to error messages, the colours displayed give useful clues to understand errors or more generally to understand what is going on in Isabelle.<br>\nOpen the menus <em>Plugins</em>, <em>Plugin Options</em>, <em>Rendering</em> to see the colours code.<br>\nAlso, one can have a look at this stackoverflow question and the answer provided: <a href=\"https://stackoverflow.com/questions/22635300/what-do-colour-codes-mean-in-isabelle-jedit\" target=\"_blank\" title=\"https://stackoverflow.com/questions/22635300/what-do-colour-codes-mean-in-isabelle-jedit\">What do colour codes mean in Isabelle/jEdit ?</a>.</p>",
        "id": 169759805,
        "sender_full_name": "Anthony Bordg",
        "timestamp": 1562404971
    },
    {
        "content": "<p>Is there already or can I define a shortcut in jEdit that achieves the same result as performing CTRL+Click on an object?</p>",
        "id": 177723583,
        "sender_full_name": "Kevin Kappelmann",
        "timestamp": 1570634079
    }
]