[
    {
        "content": "<p>Hi everyone,</p>\n<ul>\n<li>\n<p>Is there a way to generate a link to an AFP fact or definition? I know the links are generated since I can copy them from where such a fact or definition is used (e.g. <a href=\"https://shorturl.at/XxRz2\">https://shorturl.at/XxRz2</a>). However, it would be much nicer to get them where the fact or definition are first stated.</p>\n</li>\n<li>\n<p>Would it be a good idea to include such links to concepts in papers? I.e. are there any thoughts on how persistent these links will be?</p>\n</li>\n</ul>\n<p>Best,<br>\nMohammad</p>",
        "id": 472309264,
        "sender_full_name": "Mohammad Abdulaziz",
        "timestamp": 1727118390
    },
    {
        "content": "<ul>\n<li>As a reviewer I really appreciate links, because I can easily compare the paper theorem to the formalized without spending 30min finding that theorem</li>\n<li>I do not believe in the stability so having the proper theorem name is still necessary. </li>\n<li>As a developer, the stability is something you do not really want, because it means that you cannot refactor.</li>\n</ul>",
        "id": 472312628,
        "sender_full_name": "Mathias Fleury",
        "timestamp": 1727119510
    },
    {
        "content": "<p>You can link to AFP content in two ways:</p>\n<ul>\n<li>link to the AFP webpage by clicking on the element in the sidebar, and copy the browser url, e.g. <a href=\"https://www.isa-afp.org/sessions/nrest/?theory-navbar-type=type#NREST.html#NREST.nrest|type\">nrest</a></li>\n<li>look up the underlying html presentation, and find the element id there, e.g. <a href=\"https://www.isa-afp.org/browser_info/current/AFP/NREST/NREST.html#NREST.nrest|type\">nrest</a></li>\n</ul>\n<p>None of these are stable identifiers though and might <strong>not</strong> work in the next AFP release. I do want to have stable identifiers but we're not there yet.</p>",
        "id": 472416889,
        "sender_full_name": "Fabian Huch",
        "timestamp": 1727162516
    },
    {
        "content": "<p>I see. I think stable element identifiers to the afp would be optimal. That if course needs careful design, but shoild be worth it. For now, it seems linking to zenodo is the only option</p>",
        "id": 472423248,
        "sender_full_name": "Mohammad Abdulaziz",
        "timestamp": 1727164245
    },
    {
        "content": "<p>Note that if you only want to link to AFP <em>entries</em> and no the content itself, the AFP is a dblp-indexed journal.</p>",
        "id": 472424900,
        "sender_full_name": "Fabian Huch",
        "timestamp": 1727164710
    },
    {
        "content": "<p>No, I am interested in linking to definitions and theorems</p>",
        "id": 472429364,
        "sender_full_name": "Mohammad Abdulaziz",
        "timestamp": 1727165500
    }
]