[
    {
        "content": "<p>I am looking into buying a Macbook which I would use for Isabelle temporarily. I was considering buying the M4 Macbook Air with 24 GB of RAM, but the Pro with the same chip and 16 GB costs around the same. I am worried that the thermal throttling will affect the performance of the Air too much, but I don't know if the Pro has too little RAM. Which one would be best?</p>",
        "id": 542306134,
        "sender_full_name": "Felipe Escallón",
        "timestamp": 1759245943
    },
    {
        "content": "<p>The Isabelle website guidelines (<a href=\"https://isabelle.in.tum.de/\">hardware requirements</a>) lists the main factors to consider: number of cores and memory. Personally, I observed that I want a higher number of cores to process a large stack of theories quickly. But for several consecutives calls to sledgehammer, my computer's memory becomes the bottleneck. Based on this, it depends on whether you are going to deal with a large library or you are going to work in automation.</p>",
        "id": 542474918,
        "sender_full_name": "Jonathan Julian Huerta y Munive",
        "timestamp": 1759319550
    },
    {
        "content": "<p>I’m not an expert on Isabelle by any means, nor have I worked on a larger project, but memory usage was routinely the bottleneck for my M1 Air with 16GB when sledgehammering away.</p>",
        "id": 542838505,
        "sender_full_name": "Brody Little",
        "timestamp": 1759443572
    },
    {
        "content": "<p>Even if Apple is better at memory usage than Windows, 16GB is the minimum recommended for laptops since at least 2015.I would nowadays say that 16GB is not enough for \"professional\" usage (back in 2015, IDE were not just chrome rebranded…)</p>",
        "id": 542878755,
        "sender_full_name": "Mathias Fleury",
        "timestamp": 1759474080
    },
    {
        "content": "<p>Since getting 24GB seems to be worth it, my only concern would be cooling. I was able to briefly test successive sledgehammer calls on a 13” Air with 16GB, and it did get hot but not enough to throttle as far as I could tell. Could that be an issue when working for several hours at a time?</p>",
        "id": 542885300,
        "sender_full_name": "Felipe Escallón",
        "timestamp": 1759477001
    },
    {
        "content": "<p>Let's see if a MBA user comes by and answers. Otherwise, ask on the mailing list</p>",
        "id": 542887049,
        "sender_full_name": "Mathias Fleury",
        "timestamp": 1759477666
    },
    {
        "content": "<p>although it probably depends how often you are really calling sledgehammer.</p>",
        "id": 542887158,
        "sender_full_name": "Mathias Fleury",
        "timestamp": 1759477714
    },
    {
        "content": "<p>I would say I use it frequently. I work on formalizations in projects like my bachelor’s thesis (I don’t know if that counts as a large project, but it’s the largest one I will work on in the near future)</p>",
        "id": 542889049,
        "sender_full_name": "Felipe Escallón",
        "timestamp": 1759478393
    }
]