[
    {
        "content": "<p>Dear community,</p>\n<p>I'm currently working on a project and I'm a bit lost in all the different documentation and functionality of Isabelle. I've created a Java application that uses Isabelle as one of its subcomponents. Now, I've reached a point where I would need some access to contents of theory files within the Java environment, namely I want to create a Theorem class with methods like Theorem.getProposition() and Theorem.getRequirements() or something similar. I'm not interested in altering proofs or anything like that, it would essentially be a read-only operation.</p>\n<p>There are several approaches I have thought about and I don't know which one to follow further. The \"simplest\" one would probably be to just read from .thy-files directly, without even opening them in Isabelle, but I'm not particularly fond of that. Isabelle/Scala would be the natural choice due to it being JVM-compatible, but as far as I can tell after looking through the mailing list's archives, it does not seem to be up to the task. Isabelle/ML might be better suited, but after some experimentation I have not yet been able to achieve what I want and don't really know how to go on. Isabelle/MMT might be worth a look as well, but I have not been able to build that.</p>\n<p>I know my question might be a bit broad, but I'm happy about any pointer or hint you can give me. Thanks in advance!</p>",
        "id": 230850901,
        "sender_full_name": "Fabian Richter",
        "timestamp": 1616068925
    },
    {
        "content": "<p>I think you can interface with Isabelle/ML through Isabelle/Scala. But you should ask this on the mailing list, I think Makarius is the best (perhaps the only) person who can really answer this, and I don't think he reads Zulip.</p>",
        "id": 230852148,
        "sender_full_name": "Manuel Eberl",
        "timestamp": 1616069578
    },
    {
        "content": "<p>There was the libisabelle project by Lars Hupel as well that did things like that from Scala, but I don't know what its current status is.</p>",
        "id": 230852195,
        "sender_full_name": "Manuel Eberl",
        "timestamp": 1616069614
    },
    {
        "content": "<p>More recently, there is <a href=\"https://github.com/dominique-unruh/scala-isabelle\">https://github.com/dominique-unruh/scala-isabelle</a></p>",
        "id": 230852277,
        "sender_full_name": "Lukas Stevens",
        "timestamp": 1616069656
    },
    {
        "content": "<p>Sorry for the late reply, I've been tinkering with Isabelle/ML and scala-isabelle and gotten pretty far with that. I'm now facing a slightly more specific problem. I'm able to extract objects of ML-type \"typ\" from my theories and now want to work on those by extracting their signatures. When using Isabelle/jEdit, \"typ\"-objects are displayed in a nicely readable form, similar to the way their signatures are defined (eg. 'val x =<br>\n   \"(?'a set ⇒ (?'a × ?'a) set list ⇒ ?'a set × ?'a set × ?'a set)<br>\n    ⇒ (?'a set ⇒ (?'a × ?'a) set list ⇒ ?'a set × ?'a set × ?'a set)<br>\n       ⇒ ?'a set ⇒ (?'a × ?'a) set list ⇒ ?'a set × ?'a set × ?'a set\":<br>\n   typ'). Is there a way to retrieve this representation as a string instead of a typ object using Isabelle/ML?</p>\n<p>I've been searching through Isabelle documentation and the ML sources, but only been able to retrieve different representations containing much less information about the actual signatures. Again, any pointers are very appreciated!</p>",
        "id": 234986619,
        "sender_full_name": "Fabian Richter",
        "timestamp": 1618663987
    },
    {
        "content": "<p>Your first stop should be <code>Syntax.pretty_term</code>. Then you have to convert the pretty printing type into a string.</p>",
        "id": 234988538,
        "sender_full_name": "Lukas Stevens",
        "timestamp": 1618665946
    },
    {
        "content": "<p>You might want to take a look into the <a href=\"https://nms.kcl.ac.uk/christian.urban/Cookbook/\">Isabelle/ML cookbook</a> as well. For an overview of important Isabelle resources see <a href=\"https://isabelle.systems\">https://isabelle.systems</a>.</p>",
        "id": 234988608,
        "sender_full_name": "Lukas Stevens",
        "timestamp": 1618666018
    },
    {
        "content": "<p>Hi Lukas,</p>\n<p>thanks for the reply! I've been playing around with this, and it is not working as I hoped. The following lays out my current approach and its intermediate results:</p>\n<p>fun sequential_composition :: \"'a Electoral_Module ⇒ 'a Electoral_Module ⇒<br>\n        'a Electoral_Module\" where <br>\n[...]</p>\n<p>\"x = \"(?'a set ⇒ (?'a × ?'a) set list ⇒ ?'a set × ?'a set × ?'a set)<br>\n    ⇒ (?'a set ⇒ (?'a × ?'a) set list ⇒ ?'a set × ?'a set × ?'a set)<br>\n       ⇒ ?'a set ⇒ (?'a × ?'a) set list ⇒ ?'a set × ?'a set × ?'a set\":<br>\n   typ\"</p>\n<p>val x_pretty = Syntax.pretty_typ @{context} x<br>\n ==&gt; \"(?'a set ⇒ (?'a × ?'a) set list ⇒ ?'a set × ?'a set × ?'a set)<br>\n    ⇒ (?'a set ⇒ (?'a × ?'a) set list ⇒ ?'a set × ?'a set × ?'a set)<br>\n       ⇒ ?'a set ⇒ (?'a × ?'a) set list ⇒ ?'a set × ?'a set × ?'a set\":<br>\n   Pretty.T</p>\n<p>val x_pretty_string = Pretty.string_of x_pretty<br>\n ==&gt; \"&lt;markup&gt;\": string (in Isabelle/jEdit)<br>\n ==&gt; (?'a, ?'b,<br>\n ?'c) tuple_isomorphism.tuple_isomorphism_IITN_tuple_isomorphism itself<br>\n\\&lt;Rightarrow&gt; typerep (in my Java application after going through scala-isabelle)</p>\n<p>This last string I receive is significantly different from the one I see within the Pretty.T and Isabelle/jEdit. Is this part of the markup done by Pretty.string_of, or might it even be scala-isabelle working differently than I think?</p>\n<p>Thanks again!</p>",
        "id": 234999121,
        "sender_full_name": "Fabian Richter",
        "timestamp": 1618675787
    },
    {
        "content": "<p>Hm, I played around with it a bit and I am not sure how to get the string directly without the surrounding markup. You should probably ask Makarius/the mailing list.</p>",
        "id": 235001660,
        "sender_full_name": "Lukas Stevens",
        "timestamp": 1618678157
    },
    {
        "content": "<p>It's probably also kind of dangerous to use the string representation. It should probably be encoded in YXML or something and then decoded on the Scala side again.</p>",
        "id": 235001795,
        "sender_full_name": "Lukas Stevens",
        "timestamp": 1618678278
    },
    {
        "content": "<p>I think I've \"solved\" my problem for now. I've built my own type_to_string function, preserving the tree-like structure of typs as a bracket-expression within the string.</p>\n<div class=\"codehilite\"><pre><span></span><code>fun typ_to_string (x: Basic_Term.typ): string = case x of\n    Type x =&gt; &quot;(&quot; ^ (fst x) ^ String.concat (map (typ_to_string) (snd x)) ^ &quot;)&quot;\n  |  _ =&gt; &quot;&quot;\n</code></pre></div>\n\n<p>While this does feel rather hacky, is limited to a very special case and the output is not particularly appealing to the eye, I think it fits my purposes for now, especially as I've been stuck on this for quite some time. Thanks again, and in case I come up with something better, I'll update the thread for future reference.</p>",
        "id": 235005255,
        "sender_full_name": "Fabian Richter",
        "timestamp": 1618681355
    },
    {
        "content": "<p>Okay, wow, that's a bit embarrassing. There was a bug in my Java code mismatching types and their signatures, so everything was wrong, but looked just about right enough that I wasn't suspicious. I haven't yet been able to check for sure, but I heavily suppose Syntax.pretty_typ would indeed work for me and my weird workaround is unnecessary. I'll look into using a more robust encoding in the future, but I'm pretty happy that my prototypical implementation can at least serve as a proof-of-concept for now. </p>\n<p>I'm very sorry for bothering you, but thanks anyway!</p>",
        "id": 235012580,
        "sender_full_name": "Fabian Richter",
        "timestamp": 1618688917
    }
]