[
    {
        "content": "<p>My Isabelle sometimes gives an error when the proof method <code>smt</code> is used. The error message is usually like this: <code>exception Io {cause = SysErr (\"The system cannot find the path specified.\", SOME ERROR_PATH_NOT_FOUND), function = \"BinIO.openOut\", name = \"C:\\\\Users\\\\Micha\\\\AppData\\\\Local\\\\Temp\\\\isabelle-Micha\\\\process6803350045593986926\\\\cache-io-4230284\"} raised (line 124 of \"./basis/BinIO.sml\")</code>, and I have to restart Isabelle every time this happens. Does anyone also have this problem, or is it just specific to my computer? (I actually bought a new laptop recently, but this problem happens on both my old laptop and the new one) Many thanks!</p>",
        "id": 171063081,
        "sender_full_name": "Yijun He",
        "timestamp": 1563356694
    },
    {
        "content": "<p>I have never encountered that :/ But I am using Linux it might be something Windows specific.</p>",
        "id": 171063334,
        "sender_full_name": "Hanna Lachnitt",
        "timestamp": 1563357000
    },
    {
        "content": "<p>Then that might be a system-specific error? Windows 10 often have some weird bugs.</p>",
        "id": 171063498,
        "sender_full_name": "Yijun He",
        "timestamp": 1563357125
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"228785\">@Yijun He</span>  I vaguely remember that someone (<span class=\"user-mention\" data-user-id=\"228790\">@Lawrence Paulson</span>  ?) told me there are well known problems with smt and some computers (maybe that person even mentioned that it's related to the OS used and in particular Windows). <br>\nMoreover, note that the use of smt should be avoided whenever possible (it's not forbidden though). Please see <a href=\"http://proofcraft.org/blog/isabelle-style.html\" target=\"_blank\" title=\"http://proofcraft.org/blog/isabelle-style.html\">this guide</a> (third bullet in the section <em>Good Reasons</em>).</p>",
        "id": 171065417,
        "sender_full_name": "Anthony Bordg",
        "timestamp": 1563359265
    },
    {
        "content": "<p>Got it. Then I will try to use less smt in my proofs.</p>",
        "id": 171065622,
        "sender_full_name": "Yijun He",
        "timestamp": 1563359406
    }
]