[
    {
        "content": "<p>I try to prove theorems in FSet, the finite set type theory, but my question is more general.</p>\n<p>How deep should I go unfolding definitions with <code>unfolding</code>? Also, what is a good strategy of including lemmas from a library theory when feeding them to Sledgehammer?</p>",
        "id": 391910687,
        "sender_full_name": "Gergely Buday",
        "timestamp": 1695129463
    },
    {
        "content": "<p>Self-answer:  I proved lemmas on the main functions of FSet with <code>induct</code> easily.</p>",
        "id": 391916270,
        "sender_full_name": "Gergely Buday",
        "timestamp": 1695131174
    },
    {
        "content": "<blockquote>\n<p>How deep should I go unfolding definitions with unfolding?</p>\n</blockquote>\n<p>I was taught to try and unfold as little as possible. Philosophically, you've created an abstraction by introducing a definition, and it makes sense to use properties about that abstraction instead of having to reason about the lower level logic.  Practically, logic becomes more complex and formulas become larger the more definitions get unfolded, and proofs can become more difficult.</p>\n<p>That being said, I still frequently end up with proofs that are nothing but unfolding definitions and applying <code>auto</code> / <code>simp</code>.  And where the  cutoff line should be isn't always clear. Even with a proof assistant, proving still requires creativity.</p>",
        "id": 391988813,
        "sender_full_name": "Alex Weisberger",
        "timestamp": 1695154775
    },
    {
        "content": "<p>I agree with this. In particular, I tend to not follow the abstraction approach excessively: Some properties I could prove about more abstract concepts are just so simple that I don’t introduce lemmas stating these properties, because I don’t want to annoy the reader with trivialities. Instead, whenever I need such properties, I just unfold definitions and use proof methods like <code>simp</code>. Actually, I make the defining equations of all my <code>definition</code> specifications part of the simpset, in order to be consistent with <code>primrec</code>, <code>fun</code>, etc. As a result, I don’t need much manual unfolding (but sometimes I need to <em>prevent</em> unfolding).</p>",
        "id": 391990151,
        "sender_full_name": "Wolfgang Jeltsch",
        "timestamp": 1695155384
    },
    {
        "content": "<p>I also agree with the point that writing Isabelle formalizations requires creativity. This is in particular because I’m of the opinion that Isabelle formalizations shouldn’t just be there to have some machine-checked proofs but should also be instructive to the human reader.</p>",
        "id": 391990474,
        "sender_full_name": "Wolfgang Jeltsch",
        "timestamp": 1695155510
    }
]