[
    {
        "content": "<p>Dear All,</p>\n<p>I have an Isabelle(2024) tool I want to share with you.<br>\n<a href=\"/user_uploads/14278/kVU9NwtQ65YkP7P4TDH9Y0Ms/super_sketch-1.zip\">super_sketch-1.zip</a></p>\n<p>In my project I had the problem of having to prove lemmas with<br>\nhundreds of subgoals and it was a bit cumbersome to have to<br>\ninvoke Sledgehammer on each of them one-by-one. I solved my<br>\nproblem with some ML code that extends Florian Haftmann's sketch<br>\ncommand. In the attached code, I implemented a super_sketch<br>\ncommand that outlines the proof skeleton but also invokes<br>\nsledgehammer on each subgoal and collects the proof suggestions.</p>\n<p>Since it was quite helpful to me, I attach the code. Maybe others<br>\nmight like to play with such a command as well. Super_sketch should<br>\nwork \"plug-and-play\" by just including a theory and then invoking<br>\nthe super_sketch command whenever there are many subgoals to be<br>\nsolved by sledgehammer. There is a simple theory about regular<br>\nlanguages that illustrate how super_sketch works.</p>\n<p>Note however, this code is just an experiment. The results are<br>\nnecessarily non-deterministic as super_sketch calls the external<br>\nsledgehammer provers and they might reply with proofs in any<br>\nshape or order. Also sometimes the proof suggested by super_sketch<br>\ndoes not \"reconstruct\" unlike a manual invocation of sledgehammer<br>\non the same goal. Also, when the number of subgoals goes up to <br>\nover a few hundred, the prover just grinds to a halt. <br>\nIf someone knows why and can suggest a fix, I<br>\nwould be very grateful. I am also happy to receive any feedback<br>\nhow super_sketch works and any improvements. </p>\n<p>Best wishes,<br>\nChengsong Tan</p>",
        "id": 466519290,
        "sender_full_name": "Chengsong Tan",
        "timestamp": 1725106453
    },
    {
        "content": "<p>Thanks for developing such a tool. Will surely give it a shot later on!</p>",
        "id": 466951613,
        "sender_full_name": "Wenda Li",
        "timestamp": 1725283245
    }
]