[
    {
        "content": "<p>Where is the code that does the html syntax highlighting for e.g. <a href=\"https://www.isa-afp.org/theories/zeckendorf/#Zeckendorf\">this theory file</a> in the Archive of Formal Proofs?</p>\n<p>There is another syntax highlighting engine on <a href=\"https://proofcraft.org/blog/syntax-highlighting.html\">ProofCraft Blog</a> using <a href=\"https://pygments.org/\">Pygments</a>. As I see ZulipChat also uses Pygments.</p>\n<p>I initiated a student project on adding Isabelle syntax highlighting to <a href=\"https://highlightjs.org/\">Highlight JS</a>. Is there any other effort to do this? It could be used on the Proof Assistants Stack Exchange site.</p>",
        "id": 367857947,
        "sender_full_name": "Gergely Buday",
        "timestamp": 1687253224
    },
    {
        "content": "<p>Is highlight.js used anywhere prominent? There already is rouge, which is also ruby-based and used by github - I added Isabelle there a while ago.<br>\nThe HTML highlighting on the AFP website on the other hand is generated by Isabelle (have a look at the browser_info module). This is the only proper way to get syntax highlighting as defining syntax is a user-space operation, so there is not static syntax for Isabelle. All these highlighters are mere (bad) approximations.</p>",
        "id": 367860571,
        "sender_full_name": "Fabian Huch",
        "timestamp": 1687253839
    },
    {
        "content": "<p>Yes, approximations, but even a partial solution is better than nothing. And there are many people on Proof Assistants.</p>",
        "id": 367863180,
        "sender_full_name": "Gergely Buday",
        "timestamp": 1687254408
    },
    {
        "content": "<p>By browser_info do you mean <code>src/Pure/Thy/browser_info.scala</code>?</p>",
        "id": 367864118,
        "sender_full_name": "Gergely Buday",
        "timestamp": 1687254614
    },
    {
        "content": "<p>Yes.</p>",
        "id": 367877106,
        "sender_full_name": "Fabian Huch",
        "timestamp": 1687257310
    },
    {
        "content": "<p>If you want to follow the chances of getting a syntax highlighter for Isabelle onto the Proof Assistans Stack Exchange site, follow <a href=\"https://proofassistants.meta.stackexchange.com/questions/220/syntax-highlighting-for-isabelle\">this question</a> on Proof Assistants Meta.</p>",
        "id": 367910704,
        "sender_full_name": "Gergely Buday",
        "timestamp": 1687264519
    }
]