[
    {
        "content": "<p>Hi Isabelle users! I've been trying to send this announcement to the mailing list, but it seems like my attempts aren't going through. If anyone is able to forward the message to the list (or approve mine, if it's stuck in a queue), I'd really appreciate it.</p>\n<p>Sander Dahmen, Assia Mahboubi, and I have been planning a workshop for a while at the Lorentz Center in Leiden. Pandemic planning is impossible and the workshop keeps changing shape. But we can finally be certain enough to announce: we will be hosting a virtual workshop, Machine-Checked Mathematics, March 2-4! It will happen European afternoons, in an attempt to be accessible by as many people as possible.</p>\n<p>Our workshop is organized around the idea of a “library showcase.” Proof assistant users from different communities will introduce the audience to some definition, design decision, abstraction, tool, or other feature of their library that is particularly good at serving some purpose. These showcases will be demo-style, with plenty of time for questions and discussion. We strongly encourage interacting with the presenters during these demos.</p>\n<p>The goal of these showcases is not for people to describe an entire library or present a formal paper. The formalized mathematics community is small and fragmented into even smaller communities by prover choice. We want to spur discussion of how good ideas can be adopted or adapted across community boundaries.</p>\n<p>We're still confirming and scheduling speakers. A preliminary schedule is on our website: <a href=\"https://lean-forward.github.io/lorentz-center-meeting/\">https://lean-forward.github.io/lorentz-center-meeting/</a> <br>\nThe event is officially happening through the Lorentz Center, so if you're interested, please register as soon as possible at <a href=\"https://www.lorentzcenter.nl/machine-checked-mathematics.html\">https://www.lorentzcenter.nl/machine-checked-mathematics.html</a> </p>\n<p>Hope to see many of you there!<br>\n-Rob (and Sander and Assia)</p>",
        "id": 272419410,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1645200041
    },
    {
        "content": "<p>Hi Rob, did you use <a href=\"mailto:cl-isabelle-users@lists.cam.ac.uk\">cl-isabelle-users@lists.cam.ac.uk</a> or <a href=\"mailto:isabelle-users@cl.cam.ac.uk\">isabelle-users@cl.cam.ac.uk</a> ?<br>\nCambridge uni changed their email server a while ago and since then multiple people have reported similar issues. Maybe one of the aliases broke during the migration. If that does not help either, I can forward the email.</p>",
        "id": 272459906,
        "sender_full_name": "Kevin Kappelmann",
        "timestamp": 1645219801
    },
    {
        "content": "<p>I actually tried both -- cl-isabelle-users first, and <a href=\"mailto:isabelle-users@cl.cam.ac.uk\">isabelle-users@cl.cam.ac.uk</a> earlier today when someone pointed out my first didn't go through</p>",
        "id": 272467668,
        "sender_full_name": "Rob Lewis",
        "timestamp": 1645223740
    },
    {
        "content": "<p>Okay, I just forwarded it!</p>",
        "id": 272591254,
        "sender_full_name": "Kevin Kappelmann",
        "timestamp": 1645362279
    }
]